{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Warns of Counterfeit Botox", "description": "County health officials are warning people not to buy or use products labeled as “Botox” from unverified sources after a woman may have contracted botulism.", "datePublished": "2024-04-23T15:00:56-07:00", "url": "https://www.countynewscenter.com/county-warns-of-counterfeit-botox/", "keywords": ["health", "botox", "botulism"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-04-23T15:00:56-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty health officials are warning people not to buy or use products labeled as “Botox” from unverified sources after a woman may have contracted botulism. Botulism is an illness caused by a toxin that attacks the body’s nerves.\nA 43-year-old San Diego County resident bought a product labeled Botox from an unlicensed online source and brought it to a “Botox Party” in Mexico in March, where she was injected. The following day, she developed symptoms that were consistent with botulism: headache, felt weak, had a hoarse voice and blurred vision. \nThis comes as the CDC reports 22 cases of botulism, due to counterfeit or mishandled botulinum toxin (Botox), being investigated in 11 states, including two in California. Half of those patients were hospitalized. \n“Botulism is a rare and sometimes fatal illness,” said Ankita Kadakia, M.D., County Deputy Public Health Officer. “That’s why it is vital you go to the emergency department immediately if you have symptoms, so doctors can administer an antitoxin. It is also important that if you get Botox, or one of the other similar products, you buy it from an accredited source.” \nWhat you should do if you are looking to get a botulinum toxin (Botox) treatment: \n\nAsk your provider or the setting (e.g., spa, clinic) if they have a license. \nAsk if their staff are trained to provide the injection.\nLook up their license: Search – DCA \nAsk how they got their product and if it is FDA approved. \n\nSymptoms of botulism occur within days or weeks of injecting the contaminated substance. In these cases, the CDC reports symptom onset generally around 3 days after exposure. \nSymptoms can include: \n\nWeak or drooping eyelids \nBlurred or double vision \nDry mouth \nSore throat \nSlurred speech \nTrouble swallowing \nDifficulty breathing \n\nPrompt diagnosis and treatment are critical to decreasing the severity and duration of illness. If you had an injection and feel any of these symptoms, go to the emergency department immediately. For more information on botulism, visit the Center for Disease Control and Prevention.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240423.15.00.56"}