{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Active TB Case Reported at Mission Valley YMCA", "description": "People who used the Mission Valley YMCA between March 5 and Oct. 30, 2023 may have been exposed to tuberculosis (TB), the County of San Diego Health and Human Services Agency (HHSA) announced today.", "datePublished": "2023-12-29T14:53:34-08:00", "url": "https://www.countynewscenter.com/active-tb-case-reported-at-ymca-mission-valley/", "keywords": ["health", "tb", "tuberculosis exposure", "ymcs mission valley"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-12-29T15:15:45-08:00", "articleType": "article", "articleContent": "\nPeople who used the Mission Valley YMCA between March 5 and Oct. 30, 2023 may have been exposed to tuberculosis (TB), the County of San Diego Health and Human Services Agency (HHSA) announced today. \nThe County’s Tuberculosis Program in the Public Health Services department is working with the Mission Valley YMCA location at 5505 Friars Road in San Diego to notify members and staff who were potentially exposed. \nExposures occurred almost exclusively between the hours of 9 a.m. and 11 am. Members who are believed to have had the longest cumulative duration of exposure during those time periods have been notified individually.  \nPeople with active tuberculosis, also known as TB, are often unaware they have the disease and may be contagious for several months before being diagnosed. Once the County is made aware, typically through a test result reported by a medical provider, communicable disease investigators conduct extensive interviews with the person with TB to determine the length of time they were infected and locations where exposures may have occurred.  \nThe YMCA provided critical information confirming members most likely to have had TB exposures as well as providing a broader notification to all members and staff who were potentially exposed. \nPotentially affected members and employees are advised to consult with their medical provider or contact the County TB Control Program. \nTB is an airborne disease that is transmitted from person-to-person through inhalation of the bacteria from the air. The chance of infection is higher for people with prolonged indoor exposure to a person who is sick with TB. Brief interactions with a person with contagious tuberculosis are less likely to lead to TB infection than are prolonged or repeated exposures. The YMCA and the County have identified members with the longest durations of possible exposure, and these members are being notified individually. However, the County and Mission Valley YMCA are providing this information so that other members and employees are aware and can make the best decisions for their own health. \n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with TB will become ill in the future, sometimes even years later, if their latent TB infection is not treated. Blood tests and skin tests are effective to determine whether someone has been infected.” \nPeople who test positive for TB but who don’t have symptoms of active TB should get a chest x-ray and talk to a medical provider, as they may have a latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from ever getting sick. \nIt is important for individuals with symptoms of active TB and those who are immune-compromised to see a medical provider to rule-out active tuberculosis and to discuss treatment. \nIndividuals who would like more information on this potential exposure should call the County TB Control Program at 619-692-5565. \nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 cases in 2020 and 201 people reported with active disease in 2021. In 2022, 208 people were reported with active TB disease in San Diego County. An estimated 175,000 people in San Diego County have latent TB infection and are at risk for developing active TB without preventive treatment. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231229.14.53.34"}