{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Residents Graduate from First Spanish Language Sheriff’s Academy", "description": "A group of 36 residents of San Diego County graduated Feb. 17 from the “Academia de Alguacil,” the first-of-its-kind Spanish language sheriff’s academy sponsored by the San Diego County Sheriff’s Department.", "datePublished": "2021-03-03T10:34:44-08:00", "url": "https://www.countynewscenter.com/county-residents-graduate-from-first-spanish-language-sheriffs-academy/", "keywords": ["public safety", "diversity", "equity", "inclusion", "outreach", "san diego county sheriff s department", "spanish"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-03-03T10:34:44-08:00", "articleType": "article", "articleContent": "\nA group of 36 residents of San Diego County graduated Feb. 17 from the “Academia de Alguacil,” the first-of-its-kind Spanish language sheriff’s academy sponsored by the San Diego County Sheriff’s Department.\nDelivered virtually via Zoom and entirely in Spanish, the five-week program was designed as a relationship-building program to help provide equity in educating one of the county’s most vulnerable populations about law enforcement procedures and available resources in San Diego County.\nNadia Moshirian Binderup, San Diego Sheriff’s Department Community Inclusion Director, said the program started with a coordinated effort involving the San Diego County Office of Education – Migrant Education Program. Participants were parents of children who participate in the migrant education program.\n“The migrant community is part of the diverse fabric of our region, and one’s citizenship status or language preference shouldn’t be a barrier or a reason for the community to feel like they can’t be safe or have access to public safety services,” said Binderup. “Knowing our migrant youth oftentimes serve as family spokespersons due to language barriers faced by parents, we wanted to make sure we equipped parents with helpful resources and information.”\nBinderup said in the past the Sheriff’s Department has worked with the San Diego District Attorney’s Office to offer the joint Citizens’ Academy, which helps residents understand how law enforcement and the justice system intersect. However, she said this program is different.\n“Academia de Alguacil differs in that it was designed with cultural needs at the forefront; we designed the curriculum and presentations entirely in Spanish and approached the curriculum based on reoccurring themes and needs we see and hear based on what our deputies experience in the communities,” said Binderup. “The program hosts were Hispanic deputy sheriffs from various rankings and assignments in the department to bring different expertise to the conversation.”\nAccording to Lt. Ricardo Lopez, the San Diego Sheriff’s Department Media Relations Director who served as lead facilitator for the program, some of the topics covered during the course included immigration laws, what to expect at traffic stops, domestic violence, drug addiction, human trafficking, hate crimes, gangs, and how to become a deputy sheriff.\n“There were questions and concerns on immigration enforcement every week,” said Lopez. “I believe we definitely cleared up some questions and concerns they had for what we do and more importantly what we don’t do. In the end, they left with a much better understanding of our role when it comes to immigration enforcement.”\nLopez said one of the greatest benefits of the program was allowing the Sheriff’s Department to develop a relationship that built trust and made it a comfortable environment in which to ask some very important questions. Several of the participants said they had been waiting a long time to ask specific questions and were relieved to finally be able to do so.\n“At first they were very quiet and asked a couple of questions, but by the end of our fifth week the questions they asked became the main focus and source of conversation of the presentations,” said Lopez. “They became more comfortable with us and saw us as being just like them; being able to break the barriers of communication adds a lot to having meaningful conversations.”\nLopez said those who attended the program were not only able to receive information in their native language but to also see that local law enforcement share similar family backgrounds, struggles, and values.\n“There was a participant who said that before the Spanish Academy she was afraid to call the police, but after meeting us and hearing our presentations, she said she would never be afraid to call again,” said Lopez. “That was great to hear and really what this academy is all about.”\nThe Sheriff’s Department said it hopes to offer the class at least twice a year, either virtually or in person, as future COVID-19 restrictions dictate.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210303.10.34.44"}