{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 4-5-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through April 4.", "datePublished": "2021-04-05T18:07:42-07:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-4-5-2021/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-04-05T18:07:42-07:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through April 4.\nVaccination Progress:\n\nNearly 2 million COVID-19 vaccine doses have been delivered to the region, and nearly 1.85 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, over 611,000 County residents, or 22.7% of San Diegans 16 and older, are fully immunized.\nOverall, more than 1 million County residents have received at least one shot of the two-dose vaccine. That’s 38.5% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 4.9 cases per 100,000 residents. The County is in the Red Tier.\nCurrently, the testing positivity percentage is 2.1%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 2.7% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 6.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed April 4.\nFour new community outbreaks were confirmed April 3, two in business settings, one in a restaurant/bar setting and one in a retail setting.\nOne new community outbreak was confirmed April 2 in a business setting.\nIn the past seven days (March 29 through April 4), 13 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n5,517 tests were reported to the County on April 4, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 2.2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,222.\n\nCases, Hospitalizations and ICU Admissions:\n\n127 COVID-19 cases were reported to the County on April 4. The region’s total is now 271,654.\n14,901 or 5.5% of all cases have required hospitalization.\n1,657 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported April 4. The region’s total is 3,583.\n12 new COVID-19 deaths were reported April 3.\nSeven men and five women died between Jan. 11 and March 31.\nOf the people who died, five people were 80 years of age or older, three people were in their 70s, three people were in their 60s and one person was in their 50s.\nAll had underlying medical conditions.\nThree COVID-19 deaths were reported April 2.\nTwo men and one woman died between March 11 and March 31.\nOf the people who died, two were in their 70s and one was in their 60s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210405.18.07.42"}