{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Affordable Housing Headed for Rancho Bernardo", "description": "A new mixed-use affordable housing development broke ground today in Rancho Bernardo. SkyLINE is a transit-oriented project featuring 100 new one-to-three-bedroom apartments for families and individuals right next to the Metropolitan Transit System (MTS) station on George Cooke Express Drive.", "datePublished": "2024-02-15T17:05:31-08:00", "url": "https://www.countynewscenter.com/affordable-housing-headed-for-rancho-bernardo/", "keywords": ["housing", "affordable housing", "housing blueprint", "innovative housing trust fund", "low income", "mts", "rancho bernardo", "skyline"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-02-15T17:16:48-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteA new mixed-use affordable housing development broke ground today in Rancho Bernardo. SkyLINE is a transit-oriented project that will provide 100 new one-to-three-bedroom apartments for families and individuals just a few steps away from the Metropolitan Transit System (MTS) station on George Cooke Express Drive.\nSkyLINE is the result of public and private partnerships that include the County, the City of San Diego, MTS and Affirmed Housing. The County’s Innovative Housing Trust Fund provided $2 million to help fund the development which will serve residents making 30-60 percent of the area’s average median income.\nAfter its spring 2026 opening, homes in the development will remain affordable for the next 70 years.\nThe seven-story development will include indoor and outdoor common space, play areas for children, a barbeque station, learning center, computer room and 2 laundry rooms.\nMore information about SkyLINE is available on the Affirmed website.\nSince 2017, the County has invested more than $281 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund, and over 2,000 units have opened. There are an additional 3,183 units on the way.\nWhen all the developments in the pipeline are complete, the total number of affordable units supported by the County will reach over 9,500. This is expected to provide homes to nearly 21,000 people.\nThe development plans align with the County’s Housing Blueprint, the County’s guide and ongoing response to the regional housing crisis.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240215.17.05.31"}