{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Officials Highlight Early Success of Mobile Crisis Response Team Program", "description": "County officials on Monday discussed the debut of a new County program designed to help people experiencing mental health or substance use crises by dispatching behavioral health experts to emergency calls instead of law enforcement when appropriate", "datePublished": "2021-03-08T13:59:22-08:00", "url": "https://www.countynewscenter.com/county-officials-highlight-early-success-of-mobile-crisis-response-team-program/", "keywords": ["health", "behavioral health", "behavioral health services", "emergency psychiatric response teams", "mental health", "psychiatric crisis"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-08T14:28:03-08:00", "articleType": "article", "articleContent": "\nCounty officials Monday discussed the debut of a new County program designed to help people experiencing mental health or substance use crises by dispatching behavioral health experts to emergency calls instead of law enforcement when appropriate.\nBoard of Supervisors Chair Nathan Fletcher, County District Attorney Summer Stephan, County behavioral health officials and representatives from Exodus Recovery, Inc. held a socially distanced event outside the County Administration Center to share information about the Mobile Crisis Response Team program (MCRT) that was launched in January.\nDuring the 2019-2020 fiscal year, local law enforcement agencies received more than 54,000 calls involving a psychiatric crisis.\nNow, the County’s pilot program is giving an alternative to San Diegans in North County coastal communities who need assistance with behavioral health crises that do not require law enforcement intervention.\nUsing the County’s Access and Crisis Line (888-724-7240) as the initial point of contact, a non-law enforcement MCRT is deployed to assess these types of situations and offer help.\n“Communities are demanding change,” Fletcher said, “because they understand law enforcement is not the appropriate response to deal with someone who is experiencing a mental health or substance use crisis. This new team is an alternative to dispatching law enforcement when a person is having a psychiatric crisis.”\nThe North County MCRT pilot is responding to calls in the communities of Del Mar, Carlsbad, Vista, Encinitas, Solana Beach, Oceanside and Camp Pendleton. Teams provide non-law enforcement crisis intervention, triage and assessment services in the field to connect people to additional care, when needed, to prevent acute psychiatric crises from escalating.\n“Mental health, homelessness and drug use frequently intersect with the criminal justice system and too often the outcomes fall short of helping people who face these challenges,” District Attorney Summer Stephan said. “That’s why our Blueprint for Mental Health Reform recommended (these) Mobile Crisis Response Teams — so that those suffering mental health crisis get a compassionate and effective response while at the same time keeping our region safe.\n“I often hear from mothers whose sons who have stopped taking their medication,” Stephan said, “and begin exhibiting signs of distress and are in need immediate help from professionals, but are only left with the alternative of calling police. The MCRT will give these families another option.”\nCounty Behavioral Health Services Assistant Director Cecily Thornton-Stearns emphasized that the MCRT respond to psychiatric emergencies only when they’re deemed not to involve threats of violence. She said the makeup of the teams, which consist of licensed mental health clinicians, case managers and peer support specialists, was extremely important.\n“These clinical teams can triage and link the individual to appropriate services,” Thornton-Stearns said, “and can even provide transportation if needed. If a situation evolves and requires the presence of law enforcement, team members can call for assistance, and PERT (Psychiatric Emergency Response Team), or other uniformed personnel, will be dispatched.”\nThe program operates during normal business hours through the Access and Crisis Line, with on-call capacity for after hours, and may expand based on utilization. Services are provided through an HHSA contract with Exodus Recovery, Inc., an experienced provider of crisis care.\nAdditional teams will also be ramping up throughout the county over the next year and may utilize 911 call dispatch. As services expand, the County will continue to work closely with the law enforcement community to ensure the safety of MCRT staff and residents remains a priority.\nCounty officials said providing access to care is essential to the County’s Live Well San Diego vision, which aims to improve the health and safety of all residents.\nThe County funds prevention and treatment services throughout the region. If you, or someone you care about, needs treatment, please call the Access and Crisis Line at (888) 724-7240.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210308.13.59.22"}