{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Budget Reflects Residents’ Needs, Builds Framework for Future", "description": "With a new budget that responds to voices in the community and follows a Framework for the Future that fundamentally changes our operations, the Chief Administrative Officer’s recommended budget was released today.", "datePublished": "2021-05-06T13:00:21-07:00", "url": "https://www.countynewscenter.com/county-budget-reflects-residents-needs-builds-framework-for-future/", "keywords": ["government", "2021-22", "american rescue plan act", "behavioral health", "economic opportunity", "environmental protection", "government transparency", "health equity", "homelessness", "housing accessibility and affordability", "justice system reform", "racial justice", "recommended budget", "recommended operational plan"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-05-06T13:13:55-07:00", "articleType": "article", "articleContent": "\nWith a new budget that responds to voices in the community and follows a Framework for the Future that fundamentally changes our operations, the Chief Administrative Officer’s recommended budget was released today.\nIt calls for $7.03 billion in fiscal year 2021-22 spending, an increase of 7.3% and a net increase of 660 additional staff years, excluding staff from the Air Pollution Control District which became an independent agency on March 1.\nInvestments in both funding and staff are designed to make an impact in these key areas:\nJustice System Reform\nThis budget prioritizes justice system reform, focusing on preventive over punitive measures and expanded reentry support for those who are involved in the justice system to reduce recidivism and result in more positive outcomes.\nMedical care and access to mental health services will be expanded throughout the jail system with 141 additional staff, and $10 million will expand the Mobile Crisis Response Team program used as an alternative to dispatching law enforcement for individuals in crisis.\nThe County is also investing $75 million for phase two of the new Youth Transition Campus to move away from a traditional correctional, punitive model that looks, feels, and operates like a jail to one that fosters a framework for positive youth development that is shown to support improved well-being and outcomes.\nRacial Justice\nThe newly formed Office of Equity and Racial Justice and the Human Relations Commission are working hand in hand with the community to create systemic change inside and outside of County government to ensure positive human relations and respect for everyone in the region.\nWithin the County, the goal is to create a culture of equity, belonging and racial justice. Community voices and employees will look at County operations through an equity and racial justice lens for disparities. Their feedback and the enhanced use of data analysis will help root out systemic racism.\nThe new budget will also support new projects from the Office of Equity and Racial Justice such as the initiative designed to Uplift Boys and Men of Color.\nBehavioral Health\nThe budget also prioritizes support for behavioral health, dedicating almost $813 million overall, including increases to redesign and enhance programs and services. This also includes mobile outreach for clients reluctant to engage in traditional settings, lowering staff-to-client ratios, enhancing crisis stabilization services, and helping ensure behavioral health clients are placed at the correct level of care possibly reducing emergency room use.\nThe budget also funds $3.2 million for 23 nurses supporting the San Diego County Psychiatric Hospital, which provides critical crisis stabilization and inpatient behavioral health services to some of San Diego County’s most vulnerable residents, as well as additional mental health support for adults and youth involved in the justice system.\nHealth Equity\nThe COVID-19 pandemic underscores the need for health equity. The recommended budget invests $226.9 million toward continued response to COVID-19 and includes diversely targeted outreach for hard-hit neighborhoods and other vulnerable populations, continued testing, treatment and tracing efforts, and meals to at-risk seniors. The budget also increases funding to help every person live the healthiest life possible. This includes 166 additional positions to meet increased demand for safety net services including the CalFresh and Medi-Cal programs, and provides extra staffing for Adult Protective Services, In-Home Supportive Services and Child Welfare Services.\nEconomic Opportunity\nThe new budget along with an anticipated allocation of $650 million in American Rescue Plan Act funding is focused on economic recovery. The funding will provide senior and youth services, small business stimulus funds, permit fee waivers for the events industry, expanded broadband access, infrastructure, child care subsidies, food assistance and mental health services.\nHomelessness\nThe budget calls for new ways to make progress on this critical issue, including the creation of a Department of Homeless Solutions and Equitable Communities to streamline operations that are spread across several County agencies. The budget also includes 19 new positions and a $2.5 million increase for Community Care Coordination programs to support veterans, youth and high-need individuals with housing and other assistance. Separately, the Board of Supervisors has created a framework for the approximately $650 million to be received through the American Rescue Plan Act with $85 million currently earmarked for services to support those who are homeless.\nHousing Accessibility and Affordability\nThe federal allocation of $107 million will continue offering rental assistance through the Emergency Rental Assistance Program. The budget also includes increased funding for the CalWORKs Housing Support program to help families in need find and retain permanent housing and $2.7 million to encourage development of Accessory Dwelling Units, or ADUs, by waiving permit and impact fees and offering pre-approved plans to save time and cost.\nEnvironmental Protection\nThe budget calls for $104.5 million for environmental protection and includes reducing greenhouse gas (GHG) emissions, planting trees, acquiring at least 500 acres of land for open space, protecting water quality and agriculture, and diverting waste from landfills. Funding will also broaden the Environmental Justice Element in the County’s General Plan to reduce pollution exposure and promote public facilities, food access, safe and sanitary homes, and physical activities in underserved communities.\nGovernment Transparency\nThe budget provides resources to support a new subcommittee to enhance accessibility and open government within County operations that includes engaging the public in the County budget and Board of Supervisors meetings. The subcommittee will also review and assess a Public Records Act portal, accessing archived public records and the County’s email retention policy.\nCommunity Investments\nThe budget calls for $279.6 million in capital projects to improve communities throughout the region. This includes a new Otay Mesa Fire Station, new Casa De Oro Library and Julian Library Community Room, and more than $70 million for new parks, trails and recreational areas to enjoy the outdoors and preserve open space.\nBudget Timeline and How to Comment\nThe public can watch budget presentations by several County departments to the Board of Supervisors on Wednesday, May 26 and Thursday, May 27.\nBudget hearings will begin at 9 a.m. on Monday, June 14. An evening hearing will take place at 5:30 p.m. on Wednesday, June 16.\nThe public can get more information through the online budget portal and the recommended operational plan. The public can also submit comments to the Board through e-comment. The online comments can be submitted until budget hearings close at 5 p.m. on Wednesday, June 23.\nThose who want to participate in the Board meetings remotely by speaking via teleconference must fill out the online Board of Supervisors tele-comments form and submit it before the start of the meeting. After submitting the form, you will receive instructions on how to call in to the meeting.\nFollowing the close of budget hearings, the Board will deliberate and is scheduled to adopt the budget at 2 p.m. on Tuesday, June 29.\nFor more information, visit the Clerk of the Board’s website or call 619-531-5434. To find out more about the recommended budget, visit budget.sandiego.county.gov.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210506.13.00.21"}