{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Return Your Mail Ballot to a Trusted Source", "description": "With just over a week left to vote, the Registrar’s office reports more than 40,000 voters residing in the 79th Assembly District have already cast their ballot in the April 6 Special Election. That’s over 13% of the district’s 300,000+ voters.", "datePublished": "2021-03-29T13:10:25-07:00", "url": "https://www.countynewscenter.com/return-your-mail-ballot-to-a-trusted-source/", "keywords": ["elections", "79th assembly district", "79th state assembly", "79th state assembly district special primary election", "april 6", "elections", "fgg", "mail ballot drop offs", "mail ballots"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-03-29T14:24:35-07:00", "articleType": "article", "articleContent": "\nWith just over a week left to vote, the Registrar’s office reports more than 40,000 registered voters residing in the 79th Assembly District have already cast their ballot in the April 6 Special Election. That’s over 13% of the district’s 300,000+ voters.\nThe Registrar’s office reminds you that you can make voting decisions and complete your mail ballot in the comfort and safety of your home. Remember to sign and date your envelope, seal your completed ballot inside and return it to a trusted source.\nYou can return it by mail, no postage needed, or at one of many convenient mail ballot drop-off locations around the district starting March 29. Find the closest one to you by visiting the Registrar’s online locator tool.\nBe sure to visit each location’s website for hours of operation before heading out to return your ballot. Mail ballot drop-off locations and the Registrar’s office will be closed Wednesday, March 31 in observance of Cesar Chavez Day.\nIf you are dropping off your mail ballot it must be received by 8 p.m. on Election Day, April 6. The sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you want to vote in-person that option is available, too. The Registrar of Voters office in Kearny Mesa is open for early voting from 8 a.m. to 5 p.m., Monday through Friday.\nYour assigned polling place and the Registrar’s office will be open on Election Day, April 6, from 7 a.m. to 8 p.m. Be prepared. Bring your face mask and plan to maintain social distance.\nOnly those who live in the 79th Assembly District can vote in the April 6 election. The area encompasses southeastern San Diego, the cities of La Mesa and Lemon Grove, and parts of Chula Vista, Bonita, and National City. Not sure if you live in the 79th Assembly District? You can find out here.\nTo learn more about Vote Safer San Diego and voting in the 79th State Assembly District Special Election on April 6, visit sdvote.com or call (858) 565-5800.\n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210329.13.10.25"}