{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Flu Testing Appointments Now Available at Seven County COVID-19 Test Sites", "description": "San Diegans can now get tested for influenza at seven County sites that formerly only provided COVID-19 testing and certain treatment options. ", "datePublished": "2022-12-09T16:50:10-08:00", "url": "https://www.countynewscenter.com/flu-testing-appointments-now-available-at-seven-county-covid-19-test-sites/", "keywords": ["health", "covid-19", "influenza", "testing"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2022-12-09T17:59:47-08:00", "articleType": "article", "articleContent": "\nSan Diegans can now get tested for influenza at seven County sites that formerly only provided COVID-19 testing and certain treatment options. \nThe no-cost testing appointments are being made available at COVID-19 testing locations statewide that are funded through a California Department of Public Health contract. \nAppointments are recommended for the seven locations in San Diego County, although drop-ins will be accommodated if scheduling permits. \n“This is a great resource for our families, friends and neighbors to conveniently find out if that cough, sneeze or achy feeling is the flu or COVID-19 without making a trip to urgent care or an emergency department,” said Dr. Denise Foster, County chief nursing officer. “Those who test positive for COVID can immediately see a telehealth provider to discuss treatment. Those positive with flu can contact their medical provider to discuss next steps, including treatment.” \nThe seven locations offering the no-cost testing appointments are open various hours, with at least one open every day of the week.   \n\nAssessor Recorder County Clerk Building, 200 S Magnolia Ave. El Cajon \nFormer Boys and Girls Club, 1301 Oleander Ave, Chula Vista \nFormer USD Electronics Recycling Center, 5330 Linda Vista Rd. San Diego \nHeart Revolution Church, 1920 Sweetwater Rd. National City \nImperial Beach Sports Park Recreation Center, 425 Imperial Beach Blvd. Imperial Beach \nNorth Coastal Live Well Center, 3708 Ocean Ranch Blvd. Oceanside \nNorth Inland Live Well Center, 649 W. Mission Ave. Escondido \n\nFor more information, hours of operation or to make an appointment, visit the County’s COVID-19 website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221209.16.50.10"}