{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Help Shape the County’s Budget", "description": "The County wants your input on the budget for the upcoming fiscal year, which starts on July 1.", "datePublished": "2025-03-07T16:58:16-08:00", "url": "https://www.countynewscenter.com/help-shape-the-countys-budget/", "keywords": ["government", "budget", "budget engagement survey", "fgg", "prioritization tool"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-03-07T17:21:31-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County wants your input on the budget for the upcoming fiscal year, which starts on July 1.\nThere are many ways to participate in the budget process. Start now by visiting Engage San Diego County to take a survey and to use a new tool to rank County budget priorities in order of importance to you.\nThe survey also asks how you’d like to stay informed about the budget process, by email, text or some other form of communication. The survey will be open through March 28.\nThe information from the survey will be considered along with community feedback gathered throughout the year as the County’s recommended budget is developed. Other considerations include things like program and service delivery data, available resources, the local economy and availability of state and federal funding.\nThe recommended budget for fiscal year 2025-26 will be released to the public on May 1. The County budget in the current fiscal year totals $8.53 billion.\nThe County funds many programs and services in the region, which has a large unincorporated area in addition to 18 incorporated cities and 18 federally recognized tribes.\n\nIn the unincorporated area, County government is responsible for the day-to-day things a city government would do, like law enforcement, roads, building permits, animal shelters and protection, along with parks and libraries. Some cities also contract with the County to provide these types of services.\nCounty government provides many services that support the entire region to keep people safe and healthy. These include emergency preparedness; criminal prosecution and detention facilities; delivery of federal and state social service assistance within the region, access to food and housing for vulnerable people; health programs including behavioral health services; food and restaurant inspections; elections and beach water monitoring.\nFunds from other government agencies make up about half the County’s budget and must be used as directed. The other half comes mostly from property taxes, fees for services and other sources. Some of these funds must still be used in specific ways, and the County can decide how to invest the remaining portion to support the community. Those decisions are more challenging this year due to rising costs, uncertainty at the state and federal levels and other factors.\nAfter the release of the recommended budget on May 1, people can share their thoughts online by submitting comments through June 12 on Engage San Diego County.\nYou can also share in-person at upcoming community meetings, or by attending or calling into the Board of Supervisors public budget hearings on June 3 and June 9. The Board’s budget deliberations and adoption take place on June 24.\nVisit the Clerk of the Board’s website or call 619-531-5434 for information on Board of Supervisors meetings and to request translation services.\nVisit the County’s budget website for additional details.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250307.16.58.16"}