{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Director Leads Office of Ethics, Compliance and Labor Standards", "description": "The County has named a new director for the County’s Office of Ethics, Compliance and Labor Standards. Branden Butler took over his new position on June 2.", "datePublished": "2023-06-07T14:23:12-07:00", "url": "https://www.countynewscenter.com/new-director-leads-office-of-ethics-compliance-and-labor-standards/", "keywords": ["government", "brenden butler", "compliance and labor standards", "office of ethics", "office of labor standards and enforcement"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-06-07T14:52:57-07:00", "articleType": "article", "articleContent": "\nThe County has named a new director for the County’s Office of Ethics, Compliance and Labor Standards. Branden Butler took over his new position on June 2.\nButler joined the County in February 2022 as the first deputy director of the new Office of Labor Standards and Enforcement. There, he deployed an online resource hub to serve as the central location for education and resources for employers and workers. In addition, Butler pursued additional enforcement measures to protect workers and worked collaboratively with stakeholders to explore data analysis of worker issues and helped businesses increase their understanding of employment law requirements.\nNow Butler is taking charge of the other wing of the County Office of Ethics, Compliance and Labor Standards – the Office of Ethics & Compliance (OEC). OEC is responsible for upholding and supporting ethical behavior and practices through the County’s Code of Ethics – providing training and awareness and investigating complaints on unlawful discrimination, fraud, waste and abuse.\n“I am excited to see the synergy he will build by having the Office of Ethics and Compliance under his wing,” said Assistant County Administrative Officer Michael Vu. “I know Branden will not only hold to the values of integrity and ethics as part of our culture but expand on these tenets as core to who we espouse to be as a County Team.”\n“I am honored to accept this new position,” said Butler. “As director, I hope to move the office forward while continuing to maintain its mission fulfilling the County’s commitment to the highest standards of ethics and compliance.”\nPrior to joining the County, Butler worked as the first assistant deputy director of Outreach and Education for the California Department of Fair Employment and Housing, now known as the California Civil Rights Department (CRD).\nHe implemented the first civil rights education and outreach program in the department’s 62-year history and launched its first civil rights marketing campaign. Butler co-created a Sexual Harassment Prevention Training taken by over 1 million employees and supervisors and played an instrumental role in the State’s response to the COVID-19 eviction and homelessness crisis.\nEarlier in his career, Butler was the senior attorney at the Fair Housing Center of the Legal Aid Society of San Diego, Inc., President of the San Diego Regional Alliance for Fair Housing and a housing advocate for persons with disabilities.\nButler graduated cum laude from the Thomas Jefferson School of Law and magna cum laude from California State University, Chico with a Bachelor of Arts degree.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230607.14.23.12"}