{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccination Clinic Now Open in Mountain View", "description": "Residents of Southeastern San Diego and nearby areas will now have an easier time getting vaccinated against the novel coronavirus.", "datePublished": "2021-03-30T17:00:15-07:00", "url": "https://www.countynewscenter.com/covid-19-vaccination-clinic-now-open-in-mountain-view/", "keywords": ["health", "coronavirus", "covid-19", "mountain view", "save", "southeastern san diego", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-30T17:00:15-07:00", "articleType": "article", "articleContent": "\nResidents of Southeastern San Diego and nearby areas will now have an easier time getting vaccinated against the novel coronavirus.\nCOVID-19 vaccinations are now being administered at the Educational Cultural Complex in Mountain View, 4343 Oceanview Boulevard, from 9:30 a.m. to 3:30 p.m., Tuesday through Saturday. Currently, the walk-up clinic requires appointments and has the capacity to administer 500 doses initially. It can ramp up to 1,000 each day.\nBy this weekend, no appointments will be required, with 10 percent of the shots set aside for residents of the 92113, 92102 and 92114 ZIP codes who are contacted by community health workers as part of Project SAVE (Scheduling Assistance for Vaccine Equity). Project SAVE is part of the County’s efforts to equitably distribute the COVID-19 vaccine.\nFor details on groups currently eligible for the COVID-19 vaccine and vaccination opportunities, visit www.vaccinationsuperstation.com.\nVaccination Progress:\n\nMore than 1.83 million COVID-19 vaccine doses have been delivered to the region, and nearly 1.67 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, nearly 560,000 County residents, or 20.8% of San Diegans 16 and older, are fully immunized.\nOverall, more than 921,000 County residents have received at least one shot of the two-dose vaccine. That’s 34.3% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 4.9 cases per 100,000 residents. The County is in the Red Tier.\nCurrently, the testing positivity percentage is 2.1%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 2.7% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 6.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed March 29 in a TK-12th grade school setting.\nIn the past seven days (March 23 through March 29), 15 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n8,966 tests were reported to the County on March 29, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,921.\n\nCases, Hospitalizations and ICU Admissions:\n\n227 COVID-19 cases were reported to the County on March 29. The region’s total is now 269,997.\n14,835 or 5.5% of all cases have required hospitalization.\n1,641 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nEight new COVID-19 deaths were reported March 29. The region’s total is 3,555.\nSeven men and one died between March 24 and March 29.\nOf the people who died, three were in their 70s, four were in their 60s and one was in their 40s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210330.17.00.15"}