{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Chess Makes its Move at the County’s Waterfront Park", "description": "County Board of Supervisors Chair Nathan Fletcher and dozens of young competitors unveiled the County Waterfront Park’s newest feature Saturday — permanent chess tables — with a tournament and ribbon-cutting event.", "datePublished": "2021-09-04T16:34:51-07:00", "url": "https://www.countynewscenter.com/chess-makes-its-move-at-the-countys-waterfront-park/", "keywords": ["parks and rec", "county parks", "county parks and recreation", "live well", "waterfront park"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-09-04T16:34:51-07:00", "articleType": "article", "articleContent": "\nCounty Board of Supervisors Chair Nathan Fletcher and dozens of young competitors unveiled the County Waterfront Park’s newest feature Saturday — permanent chess tables — with a tournament and ribbon-cutting event.\nThe daylong tournament was the first held at the park’s new chess area next to the playground near the corner of Pacific Highway and Ash Street at the County Administration Center downtown. The tables are part of a larger renovation for the already-popular park that opened in 2014 that will ultimately add a dog park, exercise equipment, pickleball and basketball courts, and a T-ball area.\nWhile those new amenities will focus on more traditional physical activities, Saturday’s tournament and new chess area showed that heading to the park can exercise people’s brains too — not just their muscles.\n“You may not think of this as recreation in a traditional sense,” Fletcher said, “but the benefits of playing a game that demands this type of strategic thinking can grow exponentially when you have the opportunity to play it outside, in the fresh air, and in a peaceful, social park setting.\n“By continuing to diversify offerings,” he continued, “we are bringing more recreation options to more people — meeting a variety of wants and needs in the community.”\nThe chess tables, including one that is ADA accessible, are located in a shaded area to keep players out of the direct sun. Chess pieces will be available to be checked out by the public on a first-come, first-served basis from 9 a.m. to 5 p.m. daily at the Waterfront Park office. The office is located at the south entrance of the County Administration Center building.\nSaturday’s tournament included three dozen youthful competitors broken into three age groups: “knights” aged up to 11 years old; “rooks,” comprised of 12-14 year olds; and “royals” aged 15-18 years old.\nAll participants received commemorative chess board sets. Second place finishers in each category received $25 gift cards; winners in each category received a trophy and a $50 gift card.\nThe County’s Department of Parks and Recreation hopes to open some of the other Waterfront Park improvements as early as spring 2022.\nFor more information about the County Parks go to the Department of Parks and Recreation website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210904.16.34.51"}