{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Report Highlights Efforts to Protect Businesses, Workers in San Diego County", "description": "The County’s Office of Ethics, Compliance and Labor Standards (OECLS) has a new report out highlighting its accomplishments in the 2022-23 fiscal year. ", "datePublished": "2023-11-22T10:40:23-08:00", "url": "https://www.countynewscenter.com/new-report-highlights-efforts-to-protect-businesses-workers-in-san-diego-county/", "keywords": ["government", "compliance and labor standards", "oecls", "oepa", "office of ethics", "office of labor standards and enforcement", "olse", "workplace justice fund"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2023-11-22T14:17:20-08:00", "articleType": "article", "articleContent": "\nThe County’s Office of Ethics, Compliance and Labor Standards (OECLS) has a new report out highlighting its accomplishments in the 2022-23 fiscal year.\nThe Board of Supervisors formed the Office of Labor Standards and Enforcement in May 2021 to serve as a central location for education and resources for employers and workers, undertake research and data analysis regarding worker issues and pursue additional enforcement measures to protect workers. Since that time, the Office of Labor Standards and Enforcement has merged with the County’s Office of Ethics and Compliance to form one office now known as OECLS.\n“Through community engagement, data-driven decision making, and a passion for creating a culture of high labor standards compliance in San Diego County, OECLS works to positively impact the lives of workers and businesses in San Diego County,” said Director Branden Butler.\nThe report details progress made in the last fiscal year and continuing steps the department will implement moving forward.\nYou can read the office’s full 2022/23 report here. \nSome highlights include:\n\nThe formation of the 43 community stakeholder Fair Workplace Collaborative—to develop OECLS education, outreach, and enforcement initiatives.\nPartnering with the Employee Rights Coalition (ERC) on a worker outreach campaign that provides direct assistance for workers who need help with wage and work-hour violations.\nOECLS contracted the Shaw Law Group to provide free educational seminars on employment law to nearly 2,000 small businesses in San Diego County.\nOECLS worked in partnership with ERC and the District Attorney’s Office with victims of the workplace shooting at Atkins Nursery. This partnership provided legal, food and benefits assistance, along with victim’s services counseling.\nIn May 2023, the Board approved an OECLS proposal to create the Workplace Justice Fund. The program will help all San Diego County workers with prevailing wage claims who have not yet been paid and those who are victims of retaliation following a complaint made to OECLS.\nEstablished the Good Faith Restaurant Owners Program. It notifies restaurants of their existing unpaid wages to workers and offers information on steps to correct the situation to maintain a County Retail Food Permit.\nOECLS and the County Office of Evaluation, Performance and Analytics (OEPA) built a dashboard detailing the wage theft in San Diego County. OEPA was created to use modern analytics to sift through the County’s vast collection of data in new ways; to look for patterns, trends and associations that can help leaders improve programs, services and policies.\n\nFor more information, go to the Office of Labor Standards and Enforcement’s webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231122.10.40.23"}