{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Probation to Launch New Program for Longer-Term In-Custody Youth and Young Adults", "description": "The County Board of Supervisors voted Tuesday to begin the implementation of the Youth Development Academy at the East Mesa Juvenile Detention Facility by 2023.", "datePublished": "2021-10-19T17:39:03-07:00", "url": "https://www.countynewscenter.com/county-probation-to-launch-new-program-for-longer-term-in-custody-youth-and-young-adults/", "keywords": ["public safety", "future of probation", "juvenile justice", "probation"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-10-19T17:39:03-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted Tuesday to begin the implementation of the Youth Development Academy at the East Mesa Juvenile Detention Facility by 2023.\nThe action is in response to Senate Bill 823, which transfers responsibility from the state to county probation departments for longer-term custody of youth up to age 25.\nAs part of the plan, the San Diego County Probation Department, County Behavioral Health Services, and a contractor will provide more intensive rehabilitative, longer-term services for in-custody youth who have committed the most serious and violent offenses.\n“This means our staff training, treatment, and daily programming will change for a population that is older and will spend more time in custody than we’ve previously experienced. What won’t change is our commitment to treating these young people as adolescents, not adults since adolescent brain science tells us that brains don’t finish developing until the mid-20s,” said Interim Chief Probation Officer Cesar Escuro. “We have a final, unique opportunity to support justice-involved young people by providing clinical support, education, and career development services that can help them permanently exit the justice system and thrive.”\nThe program will include career and academic support services, positive youth development programming, behavioral health treatment programming, reentry support, and support for families to participate in care. Long-term needs for post-high school academic and career development services would also be identified for the program youth. The youth will be at the East Mesa Juvenile Detention Facility in two living units, which will be renovated to be more home-like in preparation for longer use.\nCurrently, the state’s Division of Juvenile Justice takes custody of these youth in another program that is separate from the adult population and will end in 2023. The program typically has 50 to 55 youth in that program throughout a year.\nIn this decade, San Diego County Probation has transformed its approach to justice-involved youth. To do this, Probation has enhanced its prevention, early intervention, and diversion strategies by including more direct mental health and trauma services, deepening collaboration with school districts, and supporting the needs of the entire family.\nThe positive outcomes of this are a nearly 70% reduction in Probation’s juvenile detention population and a 75% reduction of those on community supervision in the last seven years.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211019.17.39.03"}