{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Eleventh San Diego Flu Death, Over 1,600 New Cases Reported", "description": "Influenza-related deaths in the region rose to 11 last week and more than 1,600 flu cases were reported, the County Health and Human Services Agency announced today.", "datePublished": "2020-01-08T12:25:39-08:00", "url": "https://www.countynewscenter.com/eleventh-san-diego-flu-death-over-1600-new-cases-reported/", "keywords": ["health", "11th flu death", "flu", "flu death", "influenza", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-08T13:53:24-08:00", "articleType": "article", "articleContent": "\nInfluenza-related deaths in the region rose to 11 last week and more than 1,600 flu cases were reported, the County Health and Human Services Agency announced today.\nThe latest flu fatality is a 51-year-old woman from North County who died from influenza A on Dec. 31, 2019. She had underlying medical conditions.\nTo date, 11 influenza deaths have been reported locally, the same number as this time last year.\nThe number of lab-confirmed flu cases jumped again last week, when 1,623 cases were reported, 260 more than the previous week when 1,363 flu cases were recorded.\n“Given the high number of cases, influenza activity in the region continues to be widespread, just like it is in other parts of the nation,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The best protection against the flu is getting vaccinated.”\nWhen to Seek Medical Help\nInfluenza-like illnesses at local emergency departments also rose to 9% last week, compared to 8% the prior week.\nPeople with influenza-like symptoms are crowding local emergency departments and taxing some hospitals.\nCounty health officials are encouraging people who are sick to first contact their health care provider by telephone or arrange an urgent appointment.  You should go to an emergency department when you have any of the following symptoms:\n\nDifficulty breathing or shortness of breath\nChest pain or abdominal pain\nSudden dizziness\nConfusion\nSevere or persistent vomiting\nFlu-like symptoms that appear to get better, but then return with a fever and worse cough\n\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Jan. 4, 2020, the report shows the following:\n\nEmergency department visits for influenza-like illness: 9% of all visits (compared to 8% the previous week)\nTotal influenza deaths to date: 11 (compared to 11 at this time last season)\nTotal lab-confirmed cases to date: 5,434 (compared to 2,133 last season)\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nFlu vaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nThe flu vaccine is available at doctors’ offices and retail pharmacies. If you don’t have medical insurance, you can go to a County public health center to get vaccinated. For a list of locations, visit www.sdiz.org or call 211 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200108.12.25.39"}