{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Schools Could Reopen Sept. 1", "description": "Given that the County’s case rate for COVID-19 has been and appears likely to remain below 100 cases per every 100,000 residents, all schools in the region, kindergarten through 12th grade, could reopen for in-person instruction beginning Sept. 1.", "datePublished": "2020-08-26T17:37:07-07:00", "url": "https://www.countynewscenter.com/san-diego-county-schools-could-reopen-sept-1/", "keywords": ["health", "coronavirus", "covid-19", "school testing", "schools open"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-27T08:02:09-07:00", "articleType": "article", "articleContent": "\nGiven that the County’s case rate for COVID-19 has been and appears likely to remain below 100 cases per every 100,000 residents, all schools in the region, kindergarten through 12th grade, could reopen for in-person instruction beginning Sept. 1.\nSchools that choose to reopen must follow the guidance for schools and school-based programs. The guidance applies to in-person learning and distance learning.\n“San Diegans have done a tremendous job in helping us to keep the local case rate below 100,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nSchools districts and charter and private schools must meet the state public health requirements and must develop and implement their own reopening plan.\n“Ever since schools made the decision in March to close campuses to prevent the spread of COVID, we have been focused on creating plans to reopen safely,” said Superintendent Paul Gothold, San Diego County Office of Education. “All of us in education miss our school communities. This year is hard for educators and families alike, and back-to-school just hasn’t been the same.”\nCOVID-19 Testing for Students, Teachers\nThe County is getting about $20 million in state funds to expand COVID-19 testing and conduct more surveillance and contact tracing.\nThe California Department of Public Health recommends periodic surveillance testing for any school employees who may have contact with students or other staff.\nTesting is available at over 20 County-coordinated sites. All are open to school personnel and youth over the age of 12. Most locations require appointments, but no appointment walk-in testing is offered at California State University San Marcos, Tubman-Chavez Community Center and the San Ysidro Border, and a drive-in site at Mar Vista High School in Imperial Beach. Specific testing information is available at 211SanDiego.org.\nThe San Diego County Office of Education is working with the County to open additional testing sites in late September that will be specifically for school staff.\n“Given the diversity of our schools and the size of our county, the specifics of testing plans, timelines, and logistics will vary,” Gothold said. “What won’t vary is our commitment to ensuring healthy environments for our students and employees.”\nCounty public health nurse administers a COVID-19 test.\nMost students and their caregivers can receive COVID-19 tests through Rady Children’s Hospital. Parents should contact their pediatrician or e-mail Rady Children’s Hospital at covidcollaborative@rchsd.org.\nStudents and caregivers who are covered by Kaiser Permanente can consult their pediatrician or physician directly for guidance on COVID-19 testing by visiting www.kp.org.\nCase Rate:\n\nThe region’s state-calculated case rate is 80.2 for Aug. 26.\nThe County will now need to report a case rate below 100 cases per 100,000 people for five more days. Then all schools, grades K-12, can reopen.\nNo other businesses can reopen until the state provides further guidance.\n\nCommunity Setting Outbreaks:\n\nOne new outbreak was identified on Aug. 25 in a business\nIn the past seven days, 20 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.    \n\nTesting:\n\n8,327 tests were reported to the County on Aug. 25 and the number of laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,607.\n\nCases:\n\n228 new cases were reported in San Diego County for a total of 37,222.\n3,022 or 8.1 % of cases have required hospitalization.\n738 or 2.0% of all cases and 24.4% of hospitalized cases had to be admitted to an intensive care unit. \n\nDeaths:\n\nThree new COVID-19 deaths were reported in San Diego County on Aug. 25 and the region’s total is now 668.\nTwo women and one man died between Aug. 15 and Aug. 24, and their ages ranged from 72 to 83 years of age.\nAll had underlying medical conditions.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200826.17.37.07"}