{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves Plan that Will Revitalize Campo Road Corridor", "description": "The County Board of Supervisors approved a plan today that will revitalize the main commercial strip and adjacent residential area along Campo Road in Casa de Oro.", "datePublished": "2023-01-11T11:28:10-08:00", "url": "https://www.countynewscenter.com/?p=210477", "keywords": ["government", "campo road", "casa de oro"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2023-01-11T12:42:12-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors approved a plan today that will revitalize the main commercial strip and adjacent residential area along Campo Road in Casa de Oro.\nThe Campo Road Corridor Revitalization Specific Plan outlines a new vision for the 60-acre area centered on Campo Road between Rogers Road and Granada Avenue. The goal of the plan is to turn the area from a drive-through commercial corridor into a drive-to destination with a “Main Street” vibe.\nThe proposed changes will allow better access by public transit, walking and bicycles and turn the corridor into a welcoming destination for area residents and visitors alike.\nThe plan includes updated traffic management options, like roundabouts and enhanced left turn lanes, wider sidewalks, on-street parking and protected bike lanes.\nIt also outlines plans to change the zoning laws to allow for additional mixed-use housing development along the corridor. Current zoning only allows for two-story mixed-use developments with commercial businesses on the ground floor and residential units above. The proposed changes would allow for mixed-use developments with an additional floor, expanding affordable housing opportunities in the area.\nGathering Community Input\nSince 2017, the County has hosted dozens of public forums, community meetings and workshops to allow the community to share their ideas for the area and establish a long-term vision for its enhancement.\n“Our new plan to completely revitalize the Campo Road corridor has been a community-driven process,” said Supervisor Nathan Fletcher. “Our community ultimately chose to reduce the number of lanes of traffic and to take things in a new direction to make their community more walkable and inviting. And the County on behalf of this community will pursue grant funding to help make some of the projects in the plan a reality; this is an example of democracy working, and I am excited to be a part of it.”\nTo achieve the vision of the plan, the County has already applied for more than $3 million dollars in grant money to fund preliminary engineering studies, plans and specifications for the roadway reconfiguration of Campo Road. Planning & Development Services (PDS) staff will continue to identify further funding opportunities to bring the plan to life.\n“The specific plan components will not only make our community safer but also provide the clear and necessary vision to turn the Campo Road corridor into a vibrant destination benefiting businesses, residents and visitors,” said Lisa Stewart, President of the Casa de Oro Alliance.\nThe plan aligns with the County’s General Plan and adds new affordable housing and commercial growth in areas with high access to public transit, services, and amenities. The effort also aligns with the County’s sustainability strategic initiative by actively addressing climate change through innovative policies and sustainable facility construction.\nAbout PDS\nPDS collaborates with communities and stakeholders to create long-range plans and policies that guide future sustainable development in the unincorporated region through a process centered around inclusion and equity.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230111.11.28.10"}