{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More San Diegans Dying Because of Meth", "description": "Record numbers of San Diegans are dying because of meth, according to new figures that show the highly addictive drug’s increasingly harmful impact on the region.", "datePublished": "2020-11-13T14:08:25-08:00", "url": "https://www.countynewscenter.com/more-san-diegans-dying-because-of-meth/", "keywords": ["health", "meth", "meth deaths", "meth report card"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-16T10:09:41-08:00", "articleType": "article", "articleContent": "\nRecord numbers of San Diegans are dying because of meth, according to new figures that show the highly addictive drug’s increasingly harmful impact on the region.\nA total of 546 San Diegans died from meth last year, 63 more than the previous record of 483 set in 2018.\nThis is the key finding in the San Diego County Methamphetamine Strike Force’s latest report, which was released today outside the County Administration Center.\nThe 2020 report card shows the leading indicators of meth problems in the region.\n“There’s no sugarcoating it: Meth is destroying lives and families at a record pace here in San Diego County,” said Supervisor Dianne Jacob, who in 1996 spearheaded the creation of the Methamphetamine Strike Force to combat meth problems in the region. “Local law enforcement and treatment services are on the front lines battling this scourge, but clearly we need to do even more as a region.”\nAccording to the Medical Examiner’s Office, the people most impacted by meth are those 45 years of age and older, which represented 319 of the total meth-related deaths. The reason is that people in this age bracket tend to have had chronic cardiovascular disease, which itself could have resulted from long-time methamphetamine abuse.\nThe 2020 Meth Report Card also shows:\n\nThere were 13,020 emergency room visits due to methamphetamines in 2018 compared to 12,926 in 2017. Data from 2019 won’t be available until 2021.\nA total of 6,591 people were admitted to County-funded treatment programs due to meth abuse last year, vs. 6,906 in 2018.\n59% of adult arrestees tested positive for meth in 2019, compared to 57% the previous year.\n11% of juvenile arrestees tested positive for meth in 2019, compared to 10% in 2018.\nMeth arrests for selling and possession of meth increased to 11,313 in 2019 vs. 10,156 the year before.\n\nMost Meth Coming from Mexico\nSan Diego County has had a long history with meth and the problems that come along with it. While the region is no longer considered the “Meth Capital of the World,” and little meth is produced locally, there is more meth available, and it is more potent and cheaper than ever.\nThe highly addictive and deadly drug is being manufactured and smuggled across the border by Mexican drug cartels. Today, most of the methamphetamine in San Diego County is coming from Mexico.\nAccording to the Drug Enforcement Administration, methamphetamine seizures at U.S.-Mexico ports of entry nearly doubled in 2019. More than 34,000 kilograms were seized in 2019 compared to more than 19,000 kilograms the year before.\nWith availability going up and prices coming down, meth is having more negative consequences in San Diego families and communities.\nTreatment is Available\nThe County funds residential and outpatient treatment programs across the region to help people recover from substance use disorders. Participation in a recovery program also improves overall health.\nPeople who want to anonymously report meth or drug activity are encouraged to call the Meth Hotline at (877) NO-2-METH or visit www.no2meth.org. Substance use treatment resources are available by calling the County’s Access and Crisis Line at (888) 724-7240 or 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201113.14.08.25"}