{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Proms, Graduations Call for COVID-19 Precautions", "description": "Given that it’s prom and graduation season, the County Health and Human Services Agency is reminding parents to make sure their children are up to date on their vaccinations and boosters and to take other preventive measures to avoid getting sick.", "datePublished": "2022-05-05T15:54:29-07:00", "url": "https://www.countynewscenter.com/?p=208456", "keywords": ["health", "coronavirus", "covid-19", "gradations", "monoclonal antibody treatment", "proms", "vaccination"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-05-05T15:54:29-07:00", "articleType": "article", "articleContent": "\nGiven that it’s prom and graduation season, the County Health and Human Services Agency is reminding parents to make sure their children are up to date on their vaccinations and boosters and to take other preventive measures to avoid getting sick.\n“When large groups of people gather indoors, the risk of getting and spreading COVID-19 increases,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Having all the recommended doses of the COVID-19 vaccine, wearing a mask indoors, washing your hands and taking other precautions is the best way to protect yourself and others.”\nKaiser added that attending large gatherings or events increases your chance of being in close contact with people outside your household and being exposed to COVID-19, especially now that the region is experiencing an increase in cases.\nPeople who feel sick should stay home and isolate themselves from others. However, if you come into close contact with someone with COVID-19, you should:\n\nWear a mask around others for 10 days, even at home\nGet tested 3-5 days after the exposure\nMonitor for symptoms and stay home if you’re ill\nIsolate and notify your close contacts if you test positive for COVID-19\n\nCOVID-19 Treatment Available in San Diego\nIf you do get COVID-19, County health officials say treatment is available. Treatment can help prevent high-risk individuals from getting sick enough to need hospital services and even from dying from COVID.\nOral medications, in the form of pills, and monoclonal antibodies, in the form of an intravenous infusion, are available at multiple locations and community pharmacies across San Diego. Antiviral medications require a doctor’s prescription and should be started within five days of developing symptoms of COVID-19. Monoclonal antibodies should be given no more than seven days after the onset of symptoms.\nTo determine which treatment is best for you, talk to your doctor or health care provider, or call 2-1-1 to find a provider. Monoclonal Antibody Regional Centers (MARCs) offer treatment with the monoclonal antibody Bebtelovimab, which is effective against the Omicron variant. You can call (619) 685-2500, seven days a week, to schedule a no-cost appointment, regardless of health insurance or immigration status. A referral or prescription is not required.\nA treatment room at the Monoclonal Antibody Regional Center in San Ysidro.\nFederal Test to Treat locations can provide testing and treatment in one location. For more information, call (800) 232-0233 or visit the Test to Treat website for locations and what treatments they carry.\n“Vaccinations are still the best protection we have to prevent serious illness, hospitalization and death from COVID-19,” Kaiser said “However, treatments reduce the risk of hospitalization and death for people who get COVID-19, whether they have been vaccinated or not. Treatment is available throughout San Diego.”\nSince the MARCs opened in February of last year, a total of 9,323 patients have been treated, thanks to the collaboration with hospitals, federally qualified health centers and local municipalities.\nVaccination Progress:\n\nReceived at least one shot: More than 2.95 million or 93.7% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.61 million or 83.1%.\nBoosters administered: 1,310,571 or 58.2% of 2,252,277 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nSeven new deaths were reported since the last report on April 27. The region’s total is 5,244.\nFour women and three men died between Jan. 21, 2022 and May 2, 2022.\nThree of the people who died were 80 years or older, two were in their 70s and two were in their 60s.\nThree of the people who died were fully vaccinated and four were not fully vaccinated.\nAll had underlying medical conditions.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n1,926 COVID-19 cases were reported to the County in the past three days (May 2-4, 2022). The region’s total is now 763,422.\n4,110 cases were reported in the past week (April 28-May 4) compared to 2,977 infections identified the previous week (April 21 through April 27).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 8.25 for people fully vaccinated and boosted, 5.30 for fully vaccinated people and 14.36 for not fully vaccinated San Diegans.\n6,594 tests were reported to the County on May 1, and the percentage of new positive cases was 5.2% (Data through May 1).\nThe 14-day rolling percentage of positive cases, among tests reported through May 1, is 3.9%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220505.15.54.29"}