{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Animal Services Blasts Off Limited Pet Adoption Special", "description": "May the fur be with you—literally. Adopt a new buddy to be your sidekick in  all your adventures. The County Department of Animal Services is offering one of the best pet adoption specials in this galaxy and it launches May 4 through 7.", "datePublished": "2023-05-02T15:17:35-07:00", "url": "https://www.countynewscenter.com/animal-services-blasts-off-limited-pet-adoption-special/", "keywords": ["animals", "adopt pets", "das", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-05-02T15:17:35-07:00", "articleType": "article", "articleContent": "\nMay the fur be with you—literally. Adopt a new buddy to be your sidekick in  all your adventures. The County Department of Animal Services is offering one of the best pet adoption specials in this galaxy and it launches May 4 through 7.\nAll pets, even those without fur, can be yours for a $4 adoption fee and they will be vaccinated, spayed or neutered, and microchipped. If it is a dog you are adopting and live in the County service area, a dog license is included too.\nIf you choose to accept this mission, the first step in finding your new best friend is to browse through the County shelters’ lovable animal inventory. You will find cats, dogs, bunnies, a tortoise, a guinea pig and  pigs available for adoption now on the  Adoptions page.  Due to the popularity of this adoption special, Animal Services staff recommend picking out a second and third choice too, just in case your first choice is alreadyadopted..\nWalk-in hours are from 1 to 4 p.m. Tuesday through Friday and from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nFill out an application online to print or pick one up at the shelter. Applications can also be submitted via email.\nThe County of San Diego Department of Animal Services covers 2.3 million acres and responds to over 6.800 calls for service annually. The department actively works to reduce the euthanasia of sheltered animals and will never euthanize due to space.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230502.15.17.35"}