{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Love is in the Air: Couples Say ‘I Do’ on Valentine’s Day", "description": "Marriage ceremonies were held throughout the County Wednesday as couples marked Valentine’s Day by exchanging vows.  ", "datePublished": "2024-02-14T17:00:23-08:00", "url": "https://www.countynewscenter.com/love-is-in-the-air-couples-say-i-do-on-valentines-day/", "keywords": ["government", "assessor/recorder/county clerk", "marriage licenses", "valentine s day", "weddings"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-02-15T11:58:06-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteMarriage ceremonies were held throughout the County Wednesday as couples marked Valentine’s Day by exchanging vows.  \nValentine’s Day is traditionally one of the most sought-after wedding days for the County Assessor/Recorder/County Clerk’s (ARCC) offices throughout the county.\nOn Wednesday, between the four ARCC locations, 129 marriage licenses were issued and 101 wedding ceremonies took place.\nThe busiest Valentine’s Day on record for the County was a decade ago. In 2014, the office issued 266 licenses and performed 242 ceremonies.\nSome couples got a special wedding day surprise this year. ARCC partnered with the Larry Himmel Neighborhood Foundation to cover the cost for the first 20 weddings at the County Administration Center. \nOn average, the office issues nearly 25,000 marriage licenses and performs more than 11,000 weddings each year. Nearly half of customers who request a marriage license also hold their wedding ceremonies at the ARCC’s office. \nFor more information on how to get a marriage license or reserve a date for a civil wedding ceremony, visit the Marriage License & Civil Ceremony website. \nBelow are some of the couples who said “I do” at the County Administration Center for Valentine’s Day. \n  Joshua and EvelenKierstyn and AaronVanessa and TrystanHipolito and RosaUriel and MelissaJasmine and RicoLisette and JoshMin and ChanjuMassiel and DianaCourtney and AaronMamie and Matthew  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240214.17.00.23"}