{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 11-09-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Nov. 8.", "datePublished": "2020-11-09T16:16:55-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-11-09-2020/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-09T17:53:16-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Nov. 8.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 7.4 per 100,000 residents and the region is in the first week of Purple Tier or Tier 1.\nShould the rate be above 7.0 cases per 100,000 residents for two weeks, restaurants, gyms, churches, theaters and other locations will need to end indoor operations under state guidance.\nThe testing positivity percentage is 3.2%, placing it in Tier 3 or the Orange Tier.\nThe state’s health equity metric looks at the testing positivity for areas with the lowest healthy conditions.\nThe County’s health equity testing positivity percentage is 5.3%. This metric does not move counties to more restrictive tiers but is required to advance.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Nov. 10.\n\nCommunity Setting Outbreaks:\n\nThree new community outbreaks were confirmed on Nov. 8: two in restaurant/bar settings and one in a business setting.\nSeven outbreaks confirmed Nov. 7: two in restaurant settings, two in business settings, one in a restaurant/bar setting, one in a retail setting and one in a grocery setting.\nSix outbreaks were confirmed Nov. 6: three in business settings, one in hair/barbershop/nail salon setting, one in a faith-based setting and one in a hotel/resort/spa setting.\nIn the past seven days (Nov. 2 through Nov. 8), 39 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n10,608 tests were reported to the County on Nov. 8, and the percentage of new laboratory-confirmed cases was 4%.\nThe 14-day rolling average percentage of positive cases is 3.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,380.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n401 new cases were confirmed among San Diego County residents on Nov. 8. The region’s total is now 60,570.\n4,062 or 6.7% of all cases have required hospitalization.\n938 or 1.5% of all cases and 23.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new deaths were reported in the County on Nov. 8. The region’s total is now 908.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201109.16.16.55"}