{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Deaths Reach 16; San Diegans Strongly Encouraged to Cover Mouth, Nose in Public", "description": "A woman in her late 90s is the 16th COVID-19 death reported in the region, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-02T17:44:19-07:00", "url": "https://www.countynewscenter.com/covid-19-deaths-reach-16-san-diegans-strongly-encouraged-to-cover-mouth-nose-in-public/", "keywords": ["health", "16 deaths", "coronavirus", "covid-19", "facial coverings"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-03T09:50:50-07:00", "articleType": "article", "articleContent": "\nA woman in her late 90s is the 16th COVID-19 death reported in the region, the County Health and Human Services Agency announced today.\nTo prevent the spread of the virus and potential future deaths, San Diegans who are out in public are strongly encouraged to cover their nose and mouth to flatten the curve, County health officials recommended. Businesses, including grocery stores, convenience stores and restaurants, are required to have employees wear face coverings.\nThe new order and guidance will go into effect at midnight, Friday, April 3.\n“We have to take more aggressive measures during the coming weeks to keep people from contracting COVID-19 and to continue flatting the pandemic curve,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We all have an essential role to play and must take these actions to slow and prevent the spread of COVID-19.”\nThe County is implementing these new guidelines to keep COVID-19 from making more people sick. They include:\n\nResidents are strongly encouraged to cover their nose and mouth when leaving home for essential activities, such as grocery shopping, getting gas, visiting convenience stores or pharmacies.\nThe cloth facial coverings don’t have to be hospital grade but should cover the nose and mouth. Homemade masks, bandanas, scarves and neck gaiters are acceptable since these items can be washed and reused. Facial coverings don’t need to be used when people are at home.\nEffective, Saturday, April 4, all employees of essential businesses must wear a facial covering at supermarkets, grocery stores, gas stations, convenience stores, restaurants and pharmacies.\nAll public parks and beaches shall close their parking lots.\nLaw enforcement agencies throughout the region will be out making sure that people who are in public are conducting essential activities and to keep people from being out in groups, especially if they are not members of the same family or household.\nPeople who disobey the essential business guideline or who are in groups in public are subject to a misdemeanor ticket. Penalties can be up to a $1,000 fine or 6 months in jail.\n\n“People should continue to practice physical distancing even when wearing facial coverings,” Wooten said. “They should also wash their hands and take other preventive measures since they can still contract the virus if they touch their eyes, nose or mouth.”\n\n\n\n\nWe're live at the County Operations Center with another update on the coronavirus. For updates, visit coronavirus-sd.com or text COSD COVID19 to 468-311.\nPosted by County of San Diego – Government on Thursday, April 2, 2020\n\nCOVID-19 Cases Jump to 966\nThrough April 2, a total of 966 COVID-19 cases have been reported in San Diego County, including 117 new cases in the last day.\nThe County is reporting case updates during the daily media briefing and then publishing them on the County’s COVID-19 website later in the afternoon.\nOf San Diego County’s cases, 53.2% (514) were men and 45.4% (439) were women. The gender of 1.3% (13) is unknown. Of the known cases, 181 (18.7%) have required hospitalization, 70 (7.2%) had to be placed in intensive care and 16 (1.7%) have died.\nCounty officials also talked about other measures and resources to deal with COVID-19. To date:\n\nMore than 13,900 San Diegans have been tested.\nThe County has distributed nearly 1.4 million personal protective equipment items to local healthcare providers, including over 581,000 N-95 respirators, more than 213,000 masks and about 550,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,585 rooms for County Public Health Services use, 116 are occupied by 120 guests.\nOf the 441 rooms assigned to the Regional Task Force on the Homeless, 170 are being occupied by 302 people who are at higher risk of developing complications from COVID-19.\n\nSan Diego County COVID-19 daily case count.\nThe County’s COVID-19 webpage now contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200402.17.44.19"}