{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Probation Students Take on Societal Issues", "description": "Six students from the Youth Transition Campus Soar Academy received strong praise from a panel of eight scholastic judges for presenting their solutions to change a global societal issue for the better.", "datePublished": "2025-04-30T17:21:15-07:00", "url": "https://www.countynewscenter.com/county-probation-students-take-on-societal-issues/", "keywords": ["government", "public safety", "aspen challenge", "probation", "soar academy", "ytc"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-04-30T17:21:15-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSix students from the Youth Transition Campus Soar Academy received strong praise from a panel of eight scholastic judges for presenting their solutions to change a global societal issue for the better.\nThe YTC academy is one of the first Juvenile Court and Community Schools asked to participate in the nationwide ASPEN Challenge, a platform that empowers youth to think big and create solutions to pressing social issues. It offers mentorship and trains them how to use critical thinking, teamwork and leadership as they put together a final competitive presentation for the panel. As part of the challenge, they were future leaders pioneering change and visionaries.\nThe issues they chose were substance abuse amongst the teen population and gang violence, which included sharing personal experiences.\n“The ASPEN Challenge not only inspired them to dream boldly but also equipped them to turn those dreams into actionable solutions, sparking a ripple effect of positive impact on their community,” said Senior Probation Officer Pamela Guzman. “For these six students, this journey is not just an experience—it’s was a transformative adventure that redefines their potential.”\nThe teens prepared for the virtual competition for four months during their Math and Science class. They worked together to find compelling visuals and heartfelt anecdotes to use and demonstrated their mastery of the subject, she said.\nThe final presentation on April 15 showcased the depth of their research, the creativity behind their intervention solutions, and their commitment to making a difference, Guzman said.\n“The judges were impressed by their teamwork, poise, and ability to articulate complex ideas with clarity,” said Guzman.\nProbation remains dedicated to fostering partnerships and working closely with the community to strengthen connections and safely reintegrate the youth. As a result of their participation, Probation has been offered additional programming opportunities at the YTC by the Bezos Foundation.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250430.17.21.15"}