{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Luck Flows Both Ways! Spin for a Discounted Adoption Fee", "description": "Consider this your lucky month if you’re looking to adopt a pet. County Animal Services is putting fate in your hands with its own Wheel o’ Fortune for pet adoptions. Give the wheel a spin to see your discounted pet adoption fee. This promotion runs through all of March.", "datePublished": "2025-03-04T12:59:30-08:00", "url": "https://www.countynewscenter.com/luck-flows-both-ways-spin-for-a-discounted-adoption-fee/", "keywords": ["animals", "adopt pets", "das", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-03-04T12:59:30-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteConsider this your lucky month if you’re looking to adopt a pet. County Animal Services is putting fate in your hands with its own Wheel o’ Fortune for pet adoptions. Give the wheel a spin to see your discounted pet adoption fee. This promotion runs through all of March.\nThe adoption fee can range from free to $17, puppies and kittens excluded, at both the South Shelter in Bonita and the North shelter in Carlsbad.\n“In our opinion, the luck flows both ways with this deal. The person and the pet both gain an enduring friend,” said Vaughn Maurice, County shelter director.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at the South Shelter, 5821 Sweetwater Road in Bonita and the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nAll adoption fees include spaying or neutering, a microchip, updated vaccinations and a one-year dog license for those in the service area.\nTo adopt, you just need a photo identification card. Adoptions are on a first-come, first-served basis.\nAdoption fees are always waived for:\n\nPets who have been at the shelter for 30+ days\nPets aged 8 years and older\nAdopters 60 years and older\n\nNot ready to commit? Try fostering a pet to see if it is a good fit, or just to give him or her a break from the shelter environment. All supplies such as food, leash, and bedding, are provided. Plus, fostering helps pets get comfortable in a home environment, increasing their chances of adoption.\nWant to help in other ways? The shelter always welcome foster families, volunteers, and pet food donations! Call (619) 767-2675 or visit the Animal Services main website to learn more.\nCome spin the wheel, find your perfect match, and let luck lead you to your new best friend.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250304.12.59.30"}