{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Number One Crop in County’s Annual Crop Report", "description": "San Diego County has a new number-one crop for the first time in 12 years, other crops racked up double-digit value increases, and agriculture remained a key industry at $1.75 billion in value in the County’s new Crop Report. However, the report also showed total crop and commodity values fell for the first time since 2018, by nearly 3.2% from $1.8 billion a year ago.", "datePublished": "2022-10-05T08:54:30-07:00", "url": "https://www.countynewscenter.com/new-number-one-crop-in-countys-annual-crop-report/", "keywords": ["agriculture", "agriculture", "crop report", "crops", "lueg", "sustainability", "sustainable communities", "weights and measures"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-10-05T08:57:15-07:00", "articleType": "article", "articleContent": "\nSan Diego County has a new number-one crop for the first time in 12 years, other crops racked up double-digit value increases, and agriculture remained a key industry at $1.75 billion in value in the County’s new Crop Report.\nHowever, the report, which covers the 2021 growing season, also showed total crop and commodity values fell for the first time from the previous year since 2018, by nearly 3.2% from $1.8 billion. And it reported a historic decrease in value for one of San Diego’s most famous crops, avocados, which fell below $100 million in value for the first time in Crop Reports dating back 25 years to 1996.\nOne of the big stories in the new report was the coronation of a new number-one crop in the county. For the past 12 years, “Ornamental Trees and Shrubs” had been number one. But it was supplanted this year by “Bedding Plants, Color & Perennials, Cacti & Succulents,” which ranked second in the previous two crop reports.\nOrnamental Trees and Shrubs dropped by 11.5% in the new report, from $432,039,762 to $382,387,500. Meanwhile, Bedding Plants, Color & Perennials, Cacti & Succulents increased 13.1% in value to $488,376,727 — the highest value ever for a top crop in San Diego County.\nThe commodity that earned the biggest increase in value in the new report was Livestock and Poultry products, which jumped by 36%, from roughly $41 million to nearly $55.4 million.\nAvocados, one of the county’s best-known crops, shrank by 46%, from roughly $153 million to $82.8 million, driven by hot, dry weather according to the report. In addition to dipping below $100 million for the first time, avocados also dropped out of top four of the Top 10 crops for the first time since 2003.\nThis year’s report stated that the impact of the COVID-19 pandemic caused values of some crops to increase and others to decrease in value during the growing season. Some growers reported labor shortages and business closures, in addition to increased labor costs, increasingly high costs of water and the extended drought. Other growers reported increased sales for certain crops due to the pandemic.\nThe County’s Department of Agriculture, Weights and Measures (AWM) compiles the Crop Report every year and posts it online. The report provides a yearly look of an industry that remains a staple of the region’s economy despite new challenges like the COVID pandemic, and longstanding ones like the region’s continuing drought, rising water costs, fires, freezes and pests.\nAWM supports the agriculture industry in numerous ways, from inspecting and intercepting invasive agricultural pests like the Mexican and Mediterranean fruit flies, light brown apple moths and Asian citrus psyllids. It also, among other actions, regulates pesticide use, verifies organic produce, inspects farmer’s markets and conducts safety training for agricultural fieldworkers.\nThe County’s Board of Supervisors have taken several actions to boost agriculture. Some of those include creating the PACE program that preserves agricultural space through easements; creating a boutique winery ordinance to promote the creation of small wineries; approving a beekeeping ordinance that allows more beekeeping while protecting the public; and streamlining agriculture-related regulations.\nThis summer, County supervisors unanimously approved an Ag Pass program that will allow farmers and ranchers access to their farms and ranches during disasters like wildfires when it is considered safe, to care for their animals or crops.\nSupervisor Jim Desmond, who brought the Ag Pass proposal to the Board along with Supervisor Joel Anderson, represents the County’s Fifth supervisorial district that is home to a lot of the County’s agricultural land.\n“Agriculture is more than important to our county, it’s an essential part of our character and needs to be supported and cultivated,” Desmond said. “I’m honored to be supervisor of District Five, which is the largest district and makes up 70% of agriculture produced in the entire County.”\nOther notable information from the report includes:\n\n“Honey & Beeswax” suffered the biggest percentage decrease in value, falling 85%, from $516,890 in 2020 to $79,023 in 2021.\n“Vegetables, Other” supplanted avocados as the number four crop in the Top 10 with $104.5 million value.\nTotal Fruit and Nut crops decreased by 31.2%, its biggest decrease since 2015.\n“Indoor Flowering & Foliage plants,” ranked third in the Top 10, increased by 15.8%, from $307,662,324 in 2020 to $356,408,291 in the 2021 report.\n\nHere is a look at the 2021 Top 10 Crops:\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221005.08.54.30"}