{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Affordable Housing Efforts Putting 3,400 Units in San Diego", "description": "Since 2017, the County has invested $175 million towards the creation of affordable housing.", "datePublished": "2022-04-27T11:26:10-07:00", "url": "https://www.countynewscenter.com/?p=208278", "keywords": ["housing", "affordable housing", "housing", "innovative housing trust fund"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-04-27T11:33:20-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors on April 26 received an update on the significant efforts underway to increase the regional supply of affordable housing.\nSince 2017, the County has invested $175 million towards the creation of affordable housing. The funds have leveraged about $1 billion in local, state and federal monies, as well as private funding, which are being used to create 3,390 affordable housing units that have housed and will become home for more than 35,000 San Diegans.\nThe wide-ranging efforts include 44 developments—10 completed, 13 under construction and 21 future projects—in 24 communities throughout the region, including eight County excess properties and four developments in unincorporated areas of the county.\nAlora is located in San Marcos and is expected to open in summer 2023\nThe affordable units will provide housing for low-income families, seniors, veterans, developmentally disabled people, transition-aged youth, people who are homeless and people experiencing homelessness and have serious mental illness.\nTo date, 10 developments have been completed, resulting in 835 affordable housing units that have become home to over 2,900 people throughout the region.\n“Completed developments presented today are just the first fruits of the affordable housing efforts we started five years ago,” said David Estrella, director of Housing and Community Development Services at the County Health and Human Services Agency. “Housing development takes time. As a result of the these affordable housing efforts, the County’s pipeline of affordable housing has grown into a robust source of ongoing housing production and positive economic impact for the San Diego region.”\nThe 13 developments under construction are expected to create over 950 affordable housing units and are expected to be completed between now and December 2024.\nFurthermore, the 44 developments could generate 3,400 construction jobs and about 1,000 permanent property management and maintenance positions.\nAbout $42 Million in Housing Funds Requested for Region\nThe Board also directed the County to apply for nearly $30 million in additional No Place Like Home funds from the state to house people experiencing homelessness and who have serious mental illness.\nThis fourth and final allocation of No Place Like Home funds will bring the total for the region to nearly $123 million.\nThe Board also opted to allocate $12 million in American Rescue Plan Act funding for permanent supportive housing units for extremely low-income households.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220427.11.26.10"}