{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "California American Boil Water Advisory Remains in Effect", "description": "The County of San Diego Emergency Operations Center remains activated and continues coordinating work between the state and California-American Water Company and affected cities. California-America Water says at this time, their boil water advisory remains in effect as they are awaiting additional testing results later in the afternoon or evening.", "datePublished": "2023-08-26T12:06:59-07:00", "url": "https://www.countynewscenter.com/california-american-boil-water-advisory-remains-in-effect/", "keywords": ["environment", "boil water", "boil water advisory", "california american water", "emergency", "lueg"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-08-26T17:51:39-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Emergency Operations Center remains activated and continues coordinating work between the state and California-American Water Company and affected cities. California-America Water says at this time, their boil water advisory remains in effect as they are awaiting additional testing results later in the afternoon or evening. The cause is still under investigation.\nUntil the boil water advisory is lifted, bottled drinking water will continue to be distributed to residents. Please check with California-American Water or your city for locations and hours.\nThe County is requesting that any businesses affected by the state boil water advisory which began on Aug. 24, 2023, complete a voluntary Boil Water Advisory Economic Impact Survey. The information collected will be used to determine if the County should attempt to seek state and/or federal assistance. The form is informational only, completing the survey form does not guarantee that you will be eligible or will receive assistance, and it is also not a substitution for submitting a claim with California-American Water Company (Cal Am) or your insurance company. The deadline for completing the survey is Sept. 15.\nIf and when it is safe to lift the advisory, Cal Am will make the first notification to its impacted customers, and that will be shared by impacted cities and agencies.\nCounty Environmental Health is working with restaurants to provide updated guidance and resources. Restaurants will receive guidance from DEHQ on what to do when the boil water advisory is lifted.  No food facility inspection or approval will be needed as part of the restaurant reopening process.\nSee the following list for frequently asked questions regarding the boil water advisory including what to do if you live or work in those areas and want to follow CDC public health guidelines to avoid illness. County Public Health continues to monitor for health-related issues and asks anyone experiencing gastrointestinal issues or any other symptoms to contact their healthcare provider.\nFrequently Asked Questions Cal-Am Boil Water Advisory of 08/24/2023\nGENERAL QUESTIONS\nWho issued the Boil Water Advisory?\nA boil water advisory due to bacteria contamination was issued by California American Water at the direction of the State Water Resources Control Board. For additional information, please contact the responsible agency, California American Water, at 1-888-237-1333 or visit https://www.amwater.com/caaw/alerts  for more information.\nWhy is there a Boil Water Advisory?\nState law requires a Boil Water Advisory for a drinking water system when there are two positive samples that indicate a contamination. The advisory alerts the public that drinking the drinking water may pose a health risk. For additional information, please contact the responsible agency, California American Water, at 1-888-237-1333 or visit https://www.amwater.com/caaw/alerts  for more information.\nWho is impacted by the Boil Water Advisory? \nAny resident, business or facility that is in the Boil Water Advisory area that uses drinking water. California American Water states the area included in the Boil Water Advisory are portions of Imperial Beach, the City of Coronado south of Fiddler’s Cove, portions of City of San Diego including Nestor and Otay Mesa West neighborhoods, and portions of Southwest Chula Vista. According to California American Water, more than 17,000 customers are affected. For additional information, please contact the responsible agency, California American Water, at 1-888-237-1333 or visit California American Water | We Keep Life Flowing (amwater.com) for more information.\nHow did the California American Water system identify the drinking water was contaminated?  \nCalifornia American Water conducts regular testing of its drinking water supply. Once bacteria contamination is confirmed through two separate tests and confirmation by the State Water Resources Control Board, it must notify its customers. The County was informed of the testing and contamination the morning of August 24, 2023. For additional information, please contact the responsible agency, California American Water, at 1-888-237-1333 or visit California American Water | We Keep Life Flowing (amwater.com) for more information.\nHow do I know if my home or business is in the affected area under the California American Water Boil Water Advisory?\nThis is a helpful tool to get more information about whether your property or business is in the affected area on the California American Water website – American Water Customer Advisory Map (amwater.com).\nAdditionally, the State Water Resources Control Board has shared the following link where you can enter your address in the upper right corner of the webpage, and it will navigate to that location and provide a pop up for the water system that serves that address. This is a helpful tool for customers or those responding to inquiries, especially for addresses that may be right on a border of a service area. System Area Boundary Layer (SABL) Look-up Tool (ca.gov)\nIf you are unsure if you are in the affected area, contact the responsible agency, California American Water, at 1-888-237-1333 or visit California American Water | We Keep Life Flowing (amwater.com) for more information.\nWhen did this happen?\nThe County was notified of the Boil Water Advisory the morning of August 24, 2023 by the State Water Resources Control Board.\nWhere can I get bottled water during this Advisory?\nLocations and supplies vary, please contact your city for details.\nAccording to California American Water, the following schools are impacted by the Boil Water Advisory:\nJuarez Lincoln Elementary School\nFinney, Myrtle S. Elementary School\nChula Vista Learning Community Charter\nSilverwing Elementary School\nHoward Pence Elementary School\nMontgomery Adult school\nMontgomery High School\nSunnyslope Elementary School\nSouthwest High School\nSouthwest Middle School\nMendoza Elementary School\nNestor Language Academy Charter School\nBerry Elementary School\nMar Vista Academy\nBayside Elementary School\nCentral Elementary School\nOneonta Elementary School\nImperial Beach Charter School\nMar Vista High School\nSilver Strand Elementary School\nSouth Bay Union School District\nWhat was the cause of the Boil Water Advisory?\nThe County does not run or manage the drinking water system and is not involved in its operations.\nPlease contact the responsible agency, California American Water, at 1-888-237-1333 or visit California American Water | We Keep Life Flowing (amwater.com) for more information.\nHow soon will the problem be fixed?\nThe County does not operate the water system. California American Water is providing updates on their website. For more information, please contact the responsible agency, California American Water, at 1-888-237-1333 or visit California American Water | We Keep Life Flowing (amwater.com).\nDid the storm have anything to do with this?\nThe cause of the contamination is still being investigated by California American Water and the State Water Resources Control Board. However, the potential for impacts to water systems during storms is one of the reasons people are advised to ensure they have a supply of drinking water on hand during major storm events.\nWhat is the County doing about this?\nThe County is working with impacted healthcare facilities and restaurants we govern to provide guidance to them and is requesting more public communication from the State Water Resources Control Board and California American Water for residents.  It has also activated its Emergency Operations Center to help coordinate the different entities and agencies involved.  The County Office of Emergency Services is asking businesses to document losses. A survey was issued to capture the information that can be used to determine if the area will qualify for state or federal financial emergency assistance funds and can be accessed at: https://engage.sandiegocounty.gov/boil-water-economic-impacts\nHow long will the Boil Water Advisory last? \nUntil the testing shows the water is safe, and the State Water Resources Control Board confirms this and approves lifting the Boil Water Advisory.\nWill I be notified when it is safe to use/drink water again/ when the Boil Water Advisory is lifted?\nYes, California American Water will communicate directly with its customers, and other jurisdictions such as the affected cities. The County of San Diego will also share the information on websites and social media and through their Emergency Operations Center updates.\nWhat do I need to do after the Cal-Am Boil Water Advisory is lifted?\nPlease contact the responsible agency, California American Water, at 1-888-237-1333 or visit California American Water | We Keep Life Flowing (amwater.com) for more information.\nHEALTH RELATED QUESTIONS\nWhat should I be worried about with respect to my health?\nThe Centers for Disease Control and Prevention recommend these steps during a Boil Water Advisory.\nTo date, no illnesses or outbreaks have been reported known to be associated with the contamination that led to the Boil Water Advisory. Do not ingest the water or use it for cooking or brushing teeth, but you may be able to use the water for other purposes.\nWhat should we do if we are in the affected area? \nWhen a Boil Water Advisory is in effect, affected customers should use bottled water or boiled tap water for drinking, brushing teeth, and to prepare and cook food. When boiling water, bring it to a full rolling boil for at least one minute, and then allow it to cool before use. You should be careful not to swallow water when bathing or showering, and to supervise young children. Consider sponge baths for infants and children.\nWhat if I’m feeling sick?\nIf you feel sick or ill, consult your primary care provider, or if severe, an urgent care or emergency room. Typical symptoms can include nausea, vomiting, diarrhea and sometimes fever. Although many illnesses can cause similar symptoms, you should let your medical provider know that you were in an area affected by the Boil Water Advisory. Your provider can make a report to public health if necessary.\nIf I drank contaminated water, how long would it take before I felt sick?\nAlthough it can take as little as one day and as long as ten to develop symptoms, potential cases of illness due to this type of bacteria occur three to four days later. However, the likelihood of you getting sick depends on many factors, such as your underlying health and how much water is ingested.\nWhat is the safe way to boil water?\nBring tap water to a full rolling boil for at least one minute, turn off the heat, and then allow it to cool before use.\nCan I take a shower or bath?\nAdults and children can still bathe, being sure to use soap. Don’t let any of the water get into your mouth and be especially watchful of young children.\nRESTAURANT/FOOD FACILITY BUSINESS QUESTIONS\nCan my restaurant stay open if I am in the area under Boil Water Advisory? \nNo. If you are a restaurant in the impacted area, immediately discontinue operations. It is unsafe to prepare food, wash dishes, or hands, in contaminated water. Do not use water from any appliance connected to your water line, such as ice and water from a refrigerator.\nCan my restaurant stay open if I am NOT in the area under Boil Water Advisory? \nYes.\nWhat does my market with open food, such as hot foods or deli items have to do?\nImmediately discontinue all food and beverage preparations. This includes coffee makers, ice machines, slushie machines, etc. You may sell 100% pre-packaged foods only and use bottled water to wash hands in the restroom.\nWhat does my pre-packaged market or pre-packaged food facility have to do?\nYou may sell 100% pre-packaged foods only and use bottled water to wash hands in the restroom.\nWhere can I get help understanding what my restaurant or food facility can do?\nThe County of San Diego, Department of Environmental Health and Quality has Duty Specialists that are available to assist you to provide guidance on how to modify your operations. Please contact Duty Specialist at (858) 505-6900 or fhdutyeh@sdcounty.ca.gov so we can help your food facility.\nWhen will my restaurant or food facility be able to resume operations again?\nYou may resume operations or open your restaurant only once the Boil Water Advisory is lifted. Please contact the responsible agency California American Water at 1-888-237-1333 or visit California American Water | We Keep Life Flowing (amwater.com) for more information.\nWhat do I need to do when closing my restaurant or food facility?\nYou must close down all operations.  Please empty, drain, or disconnect any equipment that is connected to a water line, such as soda fountains, ice machines and dish machines.\nHow can my restaurant get a modified health permit?\nRestaurants interested in obtaining a modified Health Permit should contact the County of San Diego,  Department of Environmental Health and Quality at 619-510-7546 or fhdutyeh@sdcounty.ca.gov for more information, including requirements and the application packet.\nWhat will my restaurant or food facility need to do to open back up after the advisory is lifted?\nOnce the Boil Water Advisory is lifted, you will need to flush all water lines for at least 3 minutes and clean and disinfect all surfaces and equipment with chlorine prior to the restaurant opening.  Equipment with water lines, such as soda fountains, ice machines and dish machines, shall be broken down, cleaned and disinfected to manufacturer specifications prior to reuse.  An inspection or clearance by the County of San Diego, Department of Environmental Health and Quality is not needed in order to open.\nCan public swimming pools, spas, and water features remain open during the Boil Water Advisory?\nNo. You must discontinue operations or all public swimming pools, spas or water features immediately and close access to bathers. All fill lines must be shut off to discontinue any additional contaminated water from entry into the body of water.\nWhat will my business need to do to reopen a swimming pool, spa or water feature after the Boil Water Advisory is lifted?\nOnce the Boil Water Advisory is lifted, you will need to raise the free available chlorine concentration in your body of water to 20 ppm (mg/L) and maintain the water’s pH between 7.2 – 7.5 for at least 12.75 hours. If the free chlorine residual is increased to 40 ppm, six hours is needed. The filters should be backwashed and filter material replenished as required, at the mid-point of contact time period, and again at the end of the period prior to placing the pool back into use. Remember to flush your lines.\nWhen the sanitizing-contact time period is completed, the pool can be re-opened for bathing provided excess free chlorine levels are reduced to acceptable values, the pH balanced as needed, the filter(s) recharged, and the recirculation system is operating. For more information, visit Recommended Response to Fecal Accidents in Public Swimming Pools (use procedure for Diarrhea/Loose Stool).\nWATER TESTING QUESTIONS\nIs this issue related to the County’s beach water quality sampling program?\nNo. The County’s beach water sampling and reporting program is for beach and bay recreational water, not drinking water.\nRESOURCES\nI had to close my business. Will there be funding for me due to lost income?\nThere may be state or federal resources available to impacted businesses. The County Office of Emergency Services is asking businesses to document losses. A survey was issued to capture the information that can be used to determine if the area will qualify for state or federal financial emergency assistance funds.  To participate in this survey, please visit:  engage.sandiegocounty.gov/boil-water-economic-impacts\nWhere can restaurants or food facilities get more information?\nThe County’s Department of Environmental Health and Quality is available to assist you with guidance on how to modify your operations. Please contact the Duty Specialist at (858) 505-6900 or fhdutyeh@sdcounty.ca.gov so we can help your food facility.\nWhere can residents get more information?\nPlease contact the responsible agency California American Water at 1-888-237-1333 or visit www.amwater.com for more information.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230826.12.06.59"}