{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "CalFresh Awareness Month Promotes Healthy Food Program", "description": "Each May, the State of California and County of San Diego join community partners in celebrating CalFresh Awareness Month.", "datePublished": "2024-05-02T12:56:46-07:00", "url": "https://www.countynewscenter.com/calfresh-awareness-month-promotes-healthy-food-program/", "keywords": ["health", "calfresh", "ebt card", "snap"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-05-02T12:56:46-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteEach May, the State of California and County of San Diego join community partners in celebrating CalFresh Awareness Month.\nIt is an opportunity to promote this resource to families and provide those who qualify with access to healthy, nutritious food.\nDozens of community events are scheduled throughout the month to share information about CalFresh and offer free, in-person help to eligible people and families. A full list of the free events is available online on the County’s CalFresh website.\n“Enrollment is at a record high, so we know we have great need in our community right now,” said Rick Wanne, director of County Self-Sufficiency Services. “Our priority is to make sure everyone eligible signs up to receive this nutritious benefit.”\nCalFresh is California’s federal food assistance program, the state’s version of the U.S. Department of Agriculture’s Supplemental Nutrition Assistance Program. It is designed to increase access to fresh and healthy food. The program also aligns with the County’s Live Well San Diego commitment to healthy, safe, and thriving communities.\nOver the past decade CalFresh enrollment has increased by 68 percent. As of April 1, 2024, it was serving 396,964 San Diegans.  This is up 5.6 percent from last year.\nPeople can find out if they qualify for CalFresh anytime by calling call 2-1-1 or applying online at GetCalFresh.org or BenefitsCal.\nCalFresh benefits are distributed through Electronic Benefits Transfer (EBT) cards. For a list of authorized retailers that accept the Electronic Benefits Transfer (EBT) cards, visit fns.usda.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240502.12.56.46"}