{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Ready to Open More Businesses, Activities", "description": "On their own, any of the following criteria – community outbreaks, limited intensive care unit capacity and supply of personal protective equipment  – would indicate a worsening of COVID-19 activity in the region and cause modifications to the Health Officer Order.", "datePublished": "2020-06-03T17:43:33-07:00", "url": "https://www.countynewscenter.com/county-ready-to-open-more-businesses-activities/", "keywords": ["health", "13 triggers", "coronavirus", "covid-19", "three criteria"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-05T08:41:50-07:00", "articleType": "article", "articleContent": "\nThirteen and three.\nThirteen is the number of triggers the County will be monitoring to make sure it is OK to continue a further reopening of the local economy.\nOn their own, any of the following criteria – increasing community outbreaks, limited intensive care unit capacity and a dwindling supply of personal protective equipment  – would indicate a worsening of COVID-19 activity in the region and cause modifications to the Health Officer Order.\nCombinations of the other ten triggers also can cause a modification of the Health Officer Order.\nTo help the public understand and monitor COVID-19 activity in the region, the County has launched a dashboard of all 13 triggers that would show a green or a red color depending on the current situation. Some triggers will be updated daily and others periodically, depending on the availability of data.\n“All of the triggers are now green, and this is very good news,” said Wilma Wooten, M.D., M.P.H., County public health officer. “However, people must continue to follow public health guidance to ensure these triggers stay green.”\nWooten added that given the region’s current successes in responding to COVID-19 she is comfortable with the County having the authority to set its own pace to move into Stage 3 of reopening.\n“We recognize that the community is hurting in terms of businesses being closed,” Wooten said. “Our metrics support the fact that we can open…We hope that other industries will also open up.”\nTesting in San Diego County\nCOVID-19 testing is now more widely available in the region and residents wishing to get a test can now do it, whether they have symptoms or not.\nPeople showing symptoms of COVID-19 should contact their health care provider and arrange for testing. If you don’t have a health care provider, call 2-1-1 and ask for a public health nurse who will give you a referral.\nResidents without symptoms who want testing should contact their health care provider, or can access free testing for COVID-19 at many locations throughout San Diego County. Everyone needs an appointment.\n\nFor County site appointments, call 2-1-1.\nFor state sites, make an appointment online or call 888-634-1123. State sites are in Escondido, El Cajon, Chula Vista and Southeastern San Diego.\n\nCAL FIRE and the San Diego County Fire Authority continue to schedule through 2-1-1 free testing in rural communities.\nDrive-up testing sites will be available from 9 a.m. to 2 p.m. in five communities. An appointment is necessary, and you can make one by calling 2-1-1. The sites will be on:\nJune 4:             Pauma Valley School, 33158 Cole Grade Rd., Pauma Valley, CA 92061\nJune 5:             San Diego County Library, 3407 Hwy 78, Julian, CA 92036\nJune 6:             CAL FIRE Monte Vista HQ, 2249 Jamacha Rd., El Cajon, CA 92019\nAll are diagnostic tests, which take about 5-10 minutes. Results generally come back in 3-5 days.\nIf you make an appointment for a COVID-19 test in any location, it’s important that you keep it so that the spot does not go unused.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\nA record 4,940 tests were reported to the County on June 2 and 124 or 3% were positive.\n2.9% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n124 new cases were reported for a San Diego County total of 7,798.\n1,363 or 17.5% of the total cases have required hospitalization.\n392 or 5% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nSeven new COVID-19 deaths were reported today, bringing the region’s total deaths to 283.\nFour men and three women died, and their ages ranged from 46 to 91 years.\nSix had underlying medical conditions and one did not.\n\nThe number of active outbreaks, deaths and cases are:\n\n55 active outbreaks; 43 at congregate living facilities and 12 in community settings.\n796 cases, including 78 deaths in skilled nursing facilities. One new outbreak.\n802 cases, including 60 deaths in other congregate settings. One new outbreak.\n353 cases, including five deaths in community settings. Two new outbreaks.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200603.17.43.33"}