{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Postcards Go Out to Registered Voters", "description": "The Registrar of Voters has mailed over 1.9 million postcards to registered voters in San Diego County listing voting options for the Nov. 8, 2022, Statewide General Election.", "datePublished": "2022-08-12T08:56:36-07:00", "url": "https://www.countynewscenter.com/?p=209209", "keywords": ["elections", "nov. 8 general election", "options to vote", "postcards", "registrar of voters office", "san diego county registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-08-12T09:50:07-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters has mailed over 1.9 million postcards to registered voters in San Diego County listing voting options for the Nov. 8, 2022, Statewide General Election.\nEvery active registered voter will automatically receive a ballot in the mail and will have three options for returning that ballot: by mail, to one of the Registrar’s secure ballot drop box locations, or at any vote center. Ballots begin going out in the mail on Oct. 8, giving voters nearly a month to mark their ballot and return it before Election Day.\nVoters also have the choice to vote in-person at any one of over 200 vote centers located across the county, which will be open over multiple days. Elections are no longer a one-day event, and there is no need to wait until Election Day to vote.\nThe Registrar’s office anticipates opening 132 ballot drop box locations starting Oct. 10. Over 200 vote centers will open for four days starting Nov. 5. Nearly 40 of those vote centers will open earlier, Oct. 29, giving voters 11 days to cast their ballots in-person.\nA list of ballot drop box and vote center locations will be available by Sept. 9 at sdvote.com.\nWhat do you need to do?\nBe vote ready!\n\nCheck your voter registration information. Make sure your residence address is up to date, and if you have a separate mailing address, check that too. If accurate, no further action is needed. If different, you need to fill out a new voter registration.\nHave you recently moved or changed your name? Whether you’re new to San Diego County or just moved down the street, you need to re-register to vote. You can do this by completing a new registration online at sdvote.com.\nNot registered? Register to vote – it takes less than two minutes.\n\nLearn more about voting in the general election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220812.08.56.36"}