{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registration Open for Virtual 2021 Vital Aging Conference", "description": "One of the County’s most popular events for older adults, the Vital Aging Conference, is back this year after a 2020 hiatus due to COVID-19.", "datePublished": "2021-06-18T17:03:43-07:00", "url": "https://www.countynewscenter.com/registration-open-for-virtual-2021-vital-aging-conference/", "keywords": ["health", "henry winkler", "older adults", "the fonz", "vital aging conference"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-06-21T12:00:02-07:00", "articleType": "article", "articleContent": "\nOne of the County’s most popular events for older adults, the Vital Aging Conference, is back this year after a 2020 hiatus due to COVID-19.\nThe theme of this year’s Vital Aging Conference is Resilient and Ready! The event is free and will be entirely online this coming Thursday, June 24 from 8:30 a.m. to 2:30 p.m.\nThe conference will feature demonstrations, discussions and speakers who will share resources that will help older adults live healthier and safer lives. Participants can explore what they can do to re-energize their lives so they can thrive again after spending much of the last year at home.\nSessions will focus on increasing social connections as we emerge from a time of physical distancing, making the most of the internet and other technology, and understanding the importance of intergenerational activities to improve social ties and quality of life.\n“The Vital Aging conference has long been the region’s premier go-to event for older San Diegans and caregivers, but this year it is especially important as we begin to emerge from the pandemic,” said Kim Gallo, director, San Diego County Health and Human Services Agency Aging & Independence Services. “This virtual event is a great opportunity for participants to reconnect with the community and move toward a healthy, engaged, and hopeful future.”\nThis year’s keynote speaker is Henry Winkler. Winkler is a best-selling author and Emmy Award-winning actor, director, and producer. He is best known for his role as Arthur Fonzarelli, aka “The Fonz,” on the TV show Happy Days.\nWinkler will share his thoughts and experiences about wellness and aging, resiliency during difficult times, serving the community, and more.\nThe conference will have English audio as well as options for Spanish and Arabic subtitles.\nYou can register for the virtual conference online at www.vitalagingsandiego.com or by calling 619-881-6262.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210618.17.03.43"}