{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Exercise Safety Precautions for High Fire Danger", "description": "The National Weather Services has issued a prolonged heat wave through Labor Day and that creates an elevated fire risk.", "datePublished": "2022-08-30T14:37:35-07:00", "url": "https://www.countynewscenter.com/exercise-safety-precautions-for-high-fire-danger/", "keywords": ["public safety", "emergency", "fire prevention", "fire risk"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-08-30T15:16:51-07:00", "articleType": "article", "articleContent": "\nThe National Weather Services has issued a prolonged heat wave through Labor Day and that creates an elevated fire risk.\nCounty emergency officials are offering the following tips to reduce the fire risk.\nPeople are asked to avoid using power tools to clear away brush because it can spark a fire.\nPeople interested in protecting their property from the threat of brush fires can instead do these things:\n\nRemove debris, including dried leaves, firewood stacks, or trash from around the home. This includes leaves on their roof and in gutters.\nTrim away any tree branches that overhang on your home and cut low branches on trees without using power tools.\nDried out bushes or plants should also be pruned or removed.\nAll tree or shrub clippings need to be cleaned up and disposed of in a bin.\n\nPeople can also prevent accidentally starting a brush fire by heeding these warnings:\n\nBe particularly careful with smoking materials to avoid accidentally starting a fire.\nNever pull your vehicle over in grass as it can ignite a grass fire. Make sure your vehicle is well maintained as faulty catalytic converters have been a major cause of accidental fires in San Diego County.\nAlso, if you have a trailer on your vehicle, make sure the chains don’t drag on the ground while driving and spark a fire.\n\nIn the event of a fire, people should be informed of the situation and any emergency notifications:\n\nMake sure you’re registered for AlertSanDiego, the County’s cell phone notification service. By doing that, you will receive any emergency messages that apply to your neighborhood on your cell phone.\nDownload the County’s SD Emergency app on your smart phone from the Google Play store or the Apple App Store. The app provides news updates, maps, shelter locations and includes disaster planning templates and interactive checklists. If a regional emergency, such as a wildfire, does occur, updates and other information will be posted at sdcountyemergency.com and sent out via the app.\nComplete a family disaster plan template from the app or rom ReadySanDiego.org to help your family plan for an emergency including where to meet if you are separated and cannot return home. The site has more information about safeguarding your home from wildfires and general disaster preparation.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220830.14.37.35"}