{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Youth Reap Bounty in Gardening Experience", "description": "Girls at the Youth Transition Campus in Kearny Mesa are harvesting eggplants, cherry tomatoes, banana peppers and strawberries as part of an enrichment gardening activity where they learn and work alongside volunteers from the Master Gardener’s Program.", "datePublished": "2023-07-13T16:04:16-07:00", "url": "https://www.countynewscenter.com/youth-reap-bounty-in-gardening-experience/", "keywords": ["public safety", "master gardener", "probation", "youth transition campus"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-07-13T16:04:16-07:00", "articleType": "article", "articleContent": "\nGirls at the Youth Transition Campus in Kearny Mesa are harvesting eggplants, cherry tomatoes, banana peppers and strawberries as part of an enrichment gardening activity where they learn and work alongside volunteers from the Master Gardener’s Program.\nThe San Diego County Probation Department re-established its partnership with the Master Gardener’s Program, which worked with the prior Girl’s Rehabilitation Facility in Kearny Mesa. Now with oversight by the San Diego County Office of Education, the volunteers are working with the girls at the Youth Transition Campus.\n“Involving girls in the community garden provides them with a range of benefits, including skills development, therapeutic engagement, a sense of responsibility, connection to nature, social skills development, and potential vocational opportunities,” Deputy Chief Jason Druxman of the Youth Transition Campus said.\nRecently, the program obtained a grant to purchase a storage shed and expand the garden.\nApproximately eight Master Gardener volunteers work with the girls to build out and cultivate the garden area for 90 minutes a week. The San Diego County Office of Education is working with the Master Gardeners to certify the course as a Horticultural Career Technical Education program.\nThe new Youth Transition Campus supports young people with longer stays in custody and has been designed to reflect national best practices that promote positive youth development and staff well-being. The standards are in line with the San Diego County Board of Supervisors’ commitment to providing resources that help young people succeed and thrive.\nThe San Diego County Probation Department is dedicated to providing supervision, accountability, restorative justice practices and a continuum of care to adult and juvenile clients. This strategy and compassion can help them transition to making better choices due to specialized counseling, job training and community program assistance with challenges, which helps ensure safer communities.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230713.16.04.16"}