{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Honors 12 Public Health Champions", "description": "The Health and Human Services Agency’s 2024 Live Well San Diego Public Health Champion Awards Ceremony honored 12 local people and organizations for their outstanding contributions in the prevention of disease or injury and the promotion of public health for all San Diegans.", "datePublished": "2024-04-12T09:05:05-07:00", "url": "https://www.countynewscenter.com/county-honors-12-public-health-champions/", "keywords": ["health"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-04-12T09:05:05-07:00", "articleType": "article", "articleContent": "\nReading Time:  5 minutesThe Health and Human Services Agency’s 2024 Live Well San Diego Public Health Champion Awards Ceremony was held on Friday, April 5, 2024. This event honored 12 local people and organizations for their outstanding contributions in the prevention of disease or injury and the promotion of public health for all San Diegans.\nThe annual awards ceremony is held during National Public Health Week, a time to recognize the importance of public health and improving the nation’s health overall.\nCounty Public Health Officer Wilma J. Wooten, M.D., M.P.H. hosted the event, in partnership with Interim Health and Human Services Agency Director, Eric McDonald, M.D., M.P.H., Elizabeth Hernandez, P.H.D., Public Health Director and a videotaped message from Chairwoman Nora Vargas.\nThis year’s theme for National Public Health Week is “Protecting, Connecting, and Thriving: We Are All Public Health.” The focus is how we are all interconnected by highlighting seven daily sub themes; civic engagement, healthy neighborhoods, climate change, new tools and innovations, reproductive and sexual health, emergency preparedness, and the future of public health.\nThe Public Health Champions award categories included Director’s Awards; Public Health Services Awards for individuals and organizations; and Aging and Independence Services, Medical Care Services, and Regional Awards.\nThis is the 23rd year for the Public Health Champions Awards Ceremony. The event supports the mission of the Health and Human Services Agency to make the lives of all 3.3 million San Diegans healthier, safer and self-sufficient.\nDirector’s Award\nWilma J. Wooten, M.D., M.P.H.\nDr. Wilma Wooten has been with the County since 2001, serving as the Deputy Health Officer; then promotion to Public Health Officer and Director for Public Health Services, in 2007; and continuing as Public Health Officer, in 2022. Dedicated to addressing health disparities, Dr. Wooten developed a groundbreaking Health Equity Framework for local health departments to integrate equity into their organizations.\nDr. Wooten worked tirelessly during the pandemic, leading the County’s COVID-19 response. She manages public health initiatives on Perinatal Equity, opioid use, tuberculosis, and hepatitis C to name just a few. She is past-Chair of the California Conference of Local Health Officers, the Big Cities Health Coalition, and the Board of Directors for the national Public Health Accreditation Board.\nPublic Health Services Awards\nLeticia Cázares, MPH\nLeticia Cázares has devoted her career to eliminating health and social inequities. She has served as a Board Member for the American Civil Liberties Union of San Diego and Imperial Counties and as Director of Outreach and Education for San Ysidro Health Center’s CASA program. Cázares’s advocacy work increased Latin representation on the San Diego HIV Planning Council in South Region and helped boost local funding.\nToday, she is Co-Director for the Center for Equitable and Diverse Research at San Diego State University, with a goal of transforming clinical research by increasing recruitment of diverse communities in clinical trials.\nCharles “Chuck” Matthews III, PhD, MBA, MS\nChuck Matthews is dedicated to advancing public health education by promoting strong relationships between the public health department and academic institutions to enhance education, research, and service. This model served as the foundation for the Live Well Center for Innovation and Leadership, a partnership between SDSU and the County of San Diego Health and Human Services Agency.\nMatthews has extensive experience working on border and binational health issues, is a Leaders across Borders Scholar, and a CDC National Public Health Leadership Alumni. He is currently the Interim Director of a new Doctorate Program of Public Health at San Diego State University.\nCSUSM HOPE & Wellness Center\nThe California State University San Marcos HOPE & (Health, Outreach, Promotion, Education) Center strives to provide culturally competent health promotion programs to help students develop healthy behaviors and lifestyle choices. For the past 23 years, the Center has fostered a culture of well-being on campus by engaging students and empowering the campus community.\nThe Center offers a range of services, including mental health advocacy, workshops, trainings, educational resources, one-on-one educational counseling, and community events.\nDepartment Awards\nAIS – Rosemary W. Pope\nRosemary W. Pope, Executive Director of the Fourth District Seniors Resource Center, has spent her 28-year career dedicated to older adults. She is a long-time contributor to Aging & Independence Services programs including fitness classes, educational presentations on health and safety, an elder abuse training toolkit, and coordinating a fraud awareness event focused on prevention for older adults.\nPope has also worked with Feeding San Diego to provide older adults with monthly food supplies and recently organized a local storm damage community forum to provide assistance, information, and support to affected residents and minority-owned businesses.\nMCS – Jack Dailey, Esq.\nJack Dailey, Director of Policy and Training at the Consumer Center for Health Education and Advocacy, helps consumers access healthcare coverage and services. Dailey also serves on the Health Consumer Alliance, a state-wide network of 10 health consumer advocacy programs. His work spans 58 counties, and translates the lessons learned from individual case work into local and statewide policy and systems improvement.\nDailey has served the San Diego community for nearly 20 years and been a health consumer advocate for over 15 years.\nRegional Awards\nSouth – Ana Lozano\nAna Lozano is a Senior Growth and Community Engagement Specialist with Molina HealthCare of California. She has spent more than 15 years working in healthcare where she advocates for community needs while fostering a culture of collaboration.\nLozano is an active member of the Live Well San Diego regional leadership team. Her professionalism, creativity, and energy enable her to develop, design, and find resources and services for some of the most underserved families in the area. Her bilingual and bicultural communication skills are invaluable in connecting with families, communities, and school districts. Lozano’s passion and dedication has fostered trust and lasting relationships with the community and partners.\nCentral – Depositing Empowerment Through Outreach & Urban Redevelopment (DETOUR)\nDepositing Empowerment Through Outreach & Urban Redevelopment is a mentoring program for teen girls of color to create equity and inclusion in higher education and the workforce. It uplifts, motivates, and inspires girls to become personally, academically, and professionally successful through education, empowerment, and the arts.\nDETOUR provides a series of educational workshops and activities to engage teen girls in a safe space. These workshops allow them to express themselves, ask questions surrounding their experiences, and create positive relationships with others to enhance growth and development.\nNorth Inland – Edward Becerra\nEdward Becerra is the founder of ‘Education Begins in the Home,’ a non-profit that provides free books to young people throughout San Diego County. His efforts have provided thousands of children with books, increasing literacy and learning, especially in Latino communities he serves.\nBecerra is dedicated to many North Inland programs including the Grandparents Raising Grandchildren Symposium. He provides books and resources in English and Spanish each year and volunteers because he believes every house should have a home library. Since May 2015, ‘Education Begins in the Home’ has distributed 140,000 FREE books at more than 425 events.\nNorth Coastal – Max Disposti, MS, NPML\nMax Disposti, Executive Director and Founder of the North County LGBTQ Resource Center, exemplifies compassionate leadership and community service. His most recent work focused on easing the humanitarian crisis in Oceanside where migrants were being released, starting in September 2023. Disposti’s dedication, advocacy, and tireless coordination ensured that hundreds of vulnerable people received the assistance they urgently needed.\nNorth Central – Tomasa Velediaz\nTomasa Velediaz is a long-time Bayside resident and community advocate, who has served more than 20 years as a volunteer and program participant at the Bayside Community Center. She is a graduate of Bayside’s Resident Leadership Academy, leads monthly community cleanups in the neighborhood and is on the front lines of Bayside’s food distributions and Senior Lunch Program.\nFluent in Spanish and English, Velediaz has served on numerous Linda Vista community projects, including lighting improvements in Kelly Street Park, traffic calming mechanisms near schools, a Women’s Savings group, and as an advocate for Urban Agriculture.\nEast – Afrah Abdulkader\nAfrah Abdulkader is Arab-American and emigrated to America at 30 years old. She works for the International Rescue Committee, in San Diego County, serving all refugees, asylum seekers, asylees, and immigrants. Since 2012, Abdulkader has worked to raise awareness and offer support to survivors of domestic violence, sexual assault, human trafficking, and hate crimes.\nFor the last 10 years, Abdulkader has served as a chair for the Welcome Newcomers Network, conducting training programs such as Healthy and Unhealthy Relationships, Know Your Rights and Responsibilities, and Culture Sensitivity to newcomers and collaborative partners.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240412.09.05.05"}