{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "One Million San Diegans Missing First Booster; Fourth Dose Now Available for 50 and Up", "description": "Close to 1 million San Diegans qualify now for the COVID-19 vaccine booster, yet have still not received their dose, the County Health and Human Services Agency announced today.", "datePublished": "2022-03-30T16:11:49-07:00", "url": "https://www.countynewscenter.com/?p=208088", "keywords": ["health", "coronavirus", "covid-19 fourth doses", "second booster"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-04-04T10:20:38-07:00", "articleType": "article", "articleContent": "\nClose to 1 million San Diegans qualify now for the COVID-19 vaccine booster, yet have still not received their dose, the County Health and Human Services Agency announced today.\nOf the 2,182,257 San Diegans eligible, 969,219 remain unboosted, prompting County health officials to remind them that having all the recommended vaccines can prevent getting and spreading COVID-19.\n“The COVID-19 vaccines are the best defense we have to further slow the spread of the pandemic,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Although cases are comparatively low from the January peak, the pandemic is not over. Every San Diegan should get all recommended COVID-19 vaccine doses so that we’re better protected against the virus and its likely variants.”\nFourth Doses Available for Everyone 50 and Older \nThe U.S. Food and Drug Administration, the Centers for Disease Control and Prevention and the Western States workgroup have approved an additional COVID-19 vaccine booster —Pfizer or Moderna— for people 50 and older. Eligible San Diegans in this age group can now get the second booster locally.\n“Older adults are more likely to have complications from COVID-19 and be hospitalized, especially if they have underlying health conditions,” Wooten said. “San Diegans should definitely consider getting a fourth dose if they qualify.”\nThe region has plenty of COVID-19 vaccines and booster doses. Vaccinations are available at pharmacies, medical providers, clinics, and County locations. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nReceived at least one shot: Over 2.95 million or 93.9% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Nearly 2.60 million or 82.5%.\nBoosters administered: 1,213,038 or 55.6% of 2,182,257 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n32 new deaths were reported since the last report on March 23, 2022. The region’s total is 5,178.\n17 men and 15 women died between Jan. 1, 2022 and March 22, 2022.\n17 were age 80 or older, four were in their 70s, seven were in their 60s, one was in their 50s and three were in their 40s.\n16 of the people who died were fully vaccinated and 16 were not fully vaccinated.\n31 had underlying medical conditions and one had medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n619 COVID-19 cases were reported to the County on March 29, 2022—162 cases are from yesterday and 457 are older cases from Dec. 2021. The region’s total is now 750,454.\n2,103 cases were reported in the past week (March 23 through March 29) compared to 2,774 infections identified the previous week (March 16 through March 22).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 7.2 for people fully vaccinated and boosted, 6.0 for fully vaccinated people and 16.2 for not fully vaccinated San Diegans.\n2,009 tests were reported to the County on March 27, 2022, and the percentage of new positive cases was 4.8%.\nThe 14-day rolling percentage of positive cases among tests reported through March 20, 2022 is 2.9%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published every Wednesday, with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220330.16.11.49"}