{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Ordinance Update Aids Housing Production, Affordability", "description": "The County Board of Supervisors has approved a 2023 Housing Zoning Ordinance Update that incorporates 21 state laws to help make housing more affordable and accessible for people experiencing homelessness.", "datePublished": "2023-07-19T17:14:40-07:00", "url": "https://www.countynewscenter.com/county-ordinance-update-aids-housing-production-affordability/", "keywords": ["housing", "affordable housing", "equity", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-07-20T14:01:43-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors has approved a 2023 Housing Zoning Ordinance Update that incorporates 21 state laws to help make housing more affordable and accessible for people experiencing homelessness. \nThe update will also focus on creating housing for people who have lower, moderate and middle-class incomes. \nThe update complements how the County is supporting housing production through:  \n\nInnovative neighborhood planning efforts.\n Improvements to its approval process. \n The assessment of available land. \n The infrastructure needed to support housing in unincorporated communities. \n\nThe update allows the County to continue to weave equity into housing planning by making it easier to have accessory dwelling units in more places.  \nThis combines with state laws to create more opportunities for first-time home buyers by allowing property owners to subdivide their lot to build small homes such as townhomes. Making it easier to build mid-sized multifamily housing developments of 3 to 10 units streamlines the process to provide housing options for unsheltered residents. \nSupporting Families \nUpdating the local ordinance brings state and County rules into alignment providing more clarity on the process.  \nThe Board approved going beyond state laws. New affordable housing can now be located one mile away from a major transit stop instead of a half mile. \nOther pro-housing efforts through the County’s Planning and Development Services department that go beyond state law include: \n\nMaking more housing projects “by-right”, which means removing steps from the permitting processes and reducing the time, cost, and risk to develop housing in certain locations.\nStreamlining development of senior housing by reducing permitting requirements.\nAllowing for smaller homes that are likely to be more affordable through a small lot subdivision ordinance.\nFurther streamlining the construction of accessory dwelling units.\nDeveloping an inclusionary housing policy that will produce additional affordable housing. \n\nIn May, the County also committed $14.5M to carry out actions that remove barriers to housing production by saving time and providing certainty in the development process which include:  \n\n Offering pre-approved plans for single-family homes.\n Accepting tiny homes on wheels as an approved housing option.\n Making it easier to get a building permit if you have a previously approved home design.\n Guaranteed approval timelines for the different types of housing and shelters.\n Technology changes that aid project tracking.\n More transparency, customer education, guidance tools and support.\n\nThe County continues to promote equitable access to affordable housing in all its programs and services to allow for stakeholder participation and environmental study, where required. \nThe Board’s action is the result of extensive community input and engagement through webinars and outreach events on the new state laws included in this update. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230719.17.14.40"}