{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Deliberate and Adopt Budget Tuesday", "description": "The County Board of Supervisors will begin deliberations on the revised recommended budget on Tuesday. The deliberations will start at 9 a.m. at the County Administration Center.", "datePublished": "2024-06-21T16:33:13-07:00", "url": "https://www.countynewscenter.com/county-to-deliberate-and-adopt-budget-tuesday/", "keywords": ["government", "2024-25 budget", "2024-25 operational plan", "2024-25 recommended revised budget", "budget adoption", "budget deliberations"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-06-21T16:33:13-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County Board of Supervisors will begin deliberations on the revised recommended budget on Tuesday. The deliberations will start at 9 a.m. at the County Administration Center.\nCounty Supervisors are expected to adopt a budget for Fiscal Year 2024-25 by the end of the session. The new budget will take effect on July 1.\nThe recommended budget was released May 2.\nThe budget plan included funding to address County priorities like behavioral health, homelessness, affordable housing, justice reform, sustainability, public health and public safety. The budget also reflected continued investment in core services like roads, fire protection and parks.\nCounty staff prepared the budget using community input collected throughout the year, an equity assessment to evaluate potential impacts to vulnerable populations and additional data.\nAfter the budget’s release, departments gave budget presentations to the Board on May 14 and 16, the County held two community budget meetings on May 23 and 29, and two public hearings in early June.\nA revised recommended budget was released June 13. The plan adds $46.9 million or an increase of 0.6% percent to the May plan for a total of $8.53 billion. That is an increase of $364.5 million or 4.5% from last year.\nThe revised budget also includes another 12 positions. The 0.1% increase brings the total of County employees to 20,471.25 staff years, an increase of 84 staff years.\nThe new plan includes more funding to support the D.A.’s Office, the North County Family Justice Center and another planned for the South County.\nAdditional funding will support the Migrant Transition Day Center, a safe parking lot in Grantville for those experiencing homelessness and increased construction costs for Calavo Park.\nThe revised budget also includes funding to extend the regional CalFresh ¡Mas Fresco! Plus food program; enhances drowning prevention efforts and supports no-cost transportation services for seniors; a pilot archery project at a County Park and helps the Lake Hodges, Lake Sutherland and El Capitan reservoirs remain open.\nIn addition, the new plan supports costs associated with the Battery Energy Storage System and the Workplace Justice Fund.\nYou can watch, listen and participate in the June 25 Board meeting for deliberations and adoption.\nAttend the Meeting in Person\nThe meetings will take place in room 310 at the County Administration Center located at 1600 Pacific Highway, San Diego, CA 92101.\nSpanish language translation services for public speakers are available at Board meetings.\nArabic, Chinese (Mandarin), Korean, Persian (including Farsi, Dari), Somali, Spanish, Tagalog (including Filipino), and Vietnamese translations of the overall proceedings are also available upon request at least 72 hours prior to the meeting. Contact the Clerk’s office at (619) 531-5434 or email PublicComment@sdcounty.ca.gov.\nWatch Online\nThe live stream broadcast online may be delayed by 45-seconds or more depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo  \nCounty YouTube Channel (Closed captioning available)\nFacebook Live\nTwitter\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nAT&T U-Verse Channel 19\n\nListen on the Phone\n\nCall in to (619) 531-4716 for a listen-only line to the live Board meeting while it is in session.\n\nComment by Phone\n\nTo speak during the live meeting by phone, fill out the Board of Supervisors tele-comments form and submit it before the meeting starts. After submitting the form, you will receive instructions on how to call in to the meeting.\n\nFor more information on participating in the meeting, visit the Clerk of the Board’s website or call 619-531-5434.\nLearn more about the budget at the County’s Open Budget portal.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240621.16.33.13"}