{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 12-4-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 3.", "datePublished": "2020-12-04T16:53:39-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-12-4-2020/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-04T16:53:39-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 3.\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure of case rate or testing positivity to assign tiers regarding what activities are permitted. Indoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed.\nThe County’s state-calculated, adjusted case rate is currently 15.3 cases per 100,000 residents and the region is in Purple Tier or Tier 1 for that metric.\nThe testing positivity percentage is 2.3%, placing it in Tier 3 or the Orange Tier for that metric.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 10.6% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health announces tier assignments at least once a week.\n\nCommunity Setting Outbreaks:\n\n14 new community outbreaks were confirmed on Dec. 3: six in business settings, two in food/beverage processing settings, two in distribution warehouse settings, one in an emergency services setting, one in a government setting, one in a faith-based setting and one in a healthcare setting.\n12 new community outbreaks were confirmed on Dec. 2: four in business settings, three in retail settings, one in a daycare/preschool/childcare setting, one in a TK – 12 school setting, one in an emergency services setting, one in a hotel/resort/spa and one in a college/university setting.\nIn the past seven days (Nov. 27 through Dec. 3), 93 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n25,289 tests were reported to the County on Dec. 3, and the percentage of new laboratory-confirmed cases was 8%.\nThe 14-day rolling average percentage of positive cases is 6.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,695.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\nA record 2,039 cases were confirmed among San Diego County residents on Dec. 3. The region’s total is now 88,181.\n4,806 or 5.5% of all cases have required hospitalization.\n1,061 or 1.2% of all cases and 22.1% of hospitalized cases had to be admitted to an intensive care unit.\nA COVID-19 case rate mapshows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nSeven new deaths were reported to the County on Dec. 3. The region’s total is now 1,047.\nFour women and three men died between Nov. 30 and Dec. 3, and their ages ranged from mid-20s to early 100s.\nAll had underlying medical conditions.\nFive new deaths were reported in the County on Dec. 2.\nOne woman and four men died between Nov. 30 and Dec. 2, and their ages ranged from early 70s to early 90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201204.16.53.39"}