{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Safe During Upcoming Heat Wave", "description": "Temperatures will rise and continue to build all week everywhere in San Diego County but particularly in the deserts, mountains and inland valleys. The hottest days are expected this weekend.", "datePublished": "2023-07-10T17:17:35-07:00", "url": "https://www.countynewscenter.com/stay-safe-during-upcoming-heat-wave/", "keywords": ["animals", "health", "extreme heat", "heat", "heat warning", "heatwave", "pet safety tips"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-07-10T17:30:26-07:00", "articleType": "article", "articleContent": "\nTemperatures will rise and continue to build all week everywhere in San Diego County but particularly in the deserts, mountains and inland valleys. The hottest days are expected this weekend.\nThe National Weather Service in San Diego has issued an excessive heat warning for inland mountains and deserts, that will likely extend into next week.\nKnow the signs of heat illness, so that you can recognize and address them quickly.\n“We remind people to have a plan for the heat,” said County Deputy Public Health Officer Dr. Cameron Kaiser, M.D., M.P.H. “Take it easy, stay out of the sun, and stay hydrated. Check on your family, friends or neighbors who are older adults, have infants or children, or have chronic health conditions. These folks are the groups most prone to heat stress, and if you’re one of them, we suggest you also take extra steps to avoid heat illness.”\nThe County and its partners have opened Cool Zones throughout the region to help San Diegans keep cool during heat waves. People can enter their address once they navigate to the map to see locations near them.\nResidents can call 2-1-1 to request information about Cool Zones or schedule a free ride to a Cool Zone if they lack access to transportation.\nExtreme heat is typically linked to fire danger, learn about how to prevent fires, safeguard your property and stay informed if a wildfire or other emergency is ignited.\nCounty health officials offer the following tips to stay cool:\n\nStay in an air-conditioned area during the hottest hours of the day.\nWear light, loose-fitting clothing.\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty.\nTake cool showers.\nNever leave a child, elderly person or pet unattended in a car.\nAvoid unnecessary hard work or activities outside during the hottest part of the day.\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun.\nAvoid using the oven to cook.\nAvoid being out during peak heat hours.\nEven a few hours spent in air conditioning can help your body stay cooler.\nDo not rely on electric fans for cooling if temperatures exceed 90 degrees.\n\nIf someone is showing signs of heat-related illness, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature, and continuing cooling efforts, and\nDo NOT give the victim fluids to drink\n\nKeeping Pets Safe\nHumans are not the only ones impacted by heat, animals can die in a heat wave.\nCounty Animal Control Officers often become busy during the heat responding to rescue calls ranging from animals left in yards without water and shade to those trapped in hot garages or cars.\nPet safety tips:\n\nKeep your pets indoors if the temperature is lower inside\nExercise pets in early morning hours or early evening to avoid prolonged exposure to the heat. Avoid strenuous runs or hikes\nKeep your pets’ water supply in a tip-proof container, always topped off, and be sure it stays cool (pets will not drink water that is too hot)\nConsider a misting system to keep the outdoor areas cooler\nBe sure your pet has shade ALL DAY, if they are outside. Remember, the sun’s position changes during the day\nDo not take your pets for car trips unless absolutely necessary. A car can heat up very quickly. On an 85 degree day, a car can reach 102 degrees in 10 minutes and soar upward even with the windows down an inch or two\nDon’t take your dogs for walks on the hot pavement. If it is too hot for you to walk barefooted, then don’t make your dogs do it either\nConsider adding a child’s wading pool for your dog. Many dogs will keep cool by “taking a dip”\n\nIf you see a pet that is in imminent threat of death or injury, call the DAS emergency number at (619) 236-2341. For non-emergencies, call (619) 767-2675.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230710.17.17.35"}