{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Construction Milestone For New Midway District Shelter", "description": "The primary support arch for the new Midway District Bridge Shelter was ceremonially raised and fixed in place this morning. Set to serve up to 150 San Diegans experiencing homelessness when it opens, the shelter will offer on-site behavioral health services 24-hours a day, seven days a week.", "datePublished": "2022-05-31T13:21:16-07:00", "url": "https://www.countynewscenter.com/construction-milestone-for-new-midway-district-shelter/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2022-05-31T13:21:16-07:00", "articleType": "video.other", "articleContent": "\nThe County and its partners took an important step in providing housing for those experiencing homelessness. The primary support arch for the new Midway District Bridge Shelter was ceremonially raised and fixed in place this morning. Set to serve up to 150 San Diegans experiencing homelessness when it opens, the shelter will offer on-site behavioral health services 24-hours a day, seven days a week. The project is possible due to the collaboration of the County, City of San Diego and Lucky Duck Foundation, which owns the shelter.\nAlong with behavioral health services, the shelter will provide meals, showers, restrooms, laundry, storage, mental health and addiction treatment, communicable disease screenings, medical care, housing navigation, and connections to self-sufficiency benefits like CalWORKS, CalFresh and Medi-Cal. It is expected to be open and operational this summer.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220531.13.21.16"}