{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisors Add Backcountry Water Sources for Firefighting", "description": "The Board of Supervisors today approved additional water tanks and backcountry helicopter hydrants to give firefighting helicopters more water sources during wildland firefighting.", "datePublished": "2022-09-28T08:44:31-07:00", "url": "https://www.countynewscenter.com/?p=209609", "keywords": ["government"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-09-28T10:42:42-07:00", "articleType": "article", "articleContent": "\nThe Board of Supervisors today approved additional water tanks and backcountry helicopter hydrants to give firefighting helicopters more water sources during wildland firefighting.\nCounty Fire and CAL FIRE developed a strategy to place Heli-Hydrants and HeloPods in a ring along the northern and eastern edges of the county. The strategy identified locations within unincorporated areas that would benefit from an additional water source based on wildfire risk assessments and helicopter travel times. The goal is to give firefighters additional support to contain a fire early and avoid or lessen property damage and loss of life.\n\nHeli-hydrants are 5,000-gallon, stationary water tanks connected to a municipal water source.  A firefighting helicopter crew can siphon water to refill the aircraft’s tank allowing more frequent water drops in areas that lack natural water sources.  The Heli-Hydrant will automatically refill so it is full for the next helicopter needing water.  In 2021, the region’s first Heli-Hydrant site was established in North County by the Rainbow Municipal Water District, through a partnership with CAL FIRE San Diego and the North County Fire Protection District.\n\nThis fall, County Fire will partner with the San Marcos Fire Department and the Vallecitos Water District to install a Heli-Hydrant in Santa Fe Hills in San Marcos. County Fire and CAL FIRE also proposed adding Heli-Hydrants at Gomez Canyon in the North County, San Elijo Hills in San Marcos, and a new fire station planned in Jacumba.\n\nCounty Fire and CAL FIRE are also placing large HeloPods around the County. HeloPods are portable, 5,000-gallon pools of water that need to be manually refilled by a water tender or from a municipal water source. HeloPods provide fire crews a water source to refill the helicopters water tanks closer to a wildfire. A Heli-Pod is already in use at the CAL FIRE Station in Julian and at the CAL FIRE San Diego Unit in El Cajon.  This fall, additional HeloPods will be placed at the Rainbow Fire Center in Fallbrook, and at the McCain Valley Fire Camp in Boulevard. Future HeloPods will be placed at Crouch Valley near Mt Laguna and near the Puerta La Cruz CAL FIRE Conservation Camp near Warner Springs.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220928.08.44.31"}