{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "May is CalFresh Awareness Month", "description": "The County of San Diego Health and Human Services Agency is joining the California Department of Social Services and local community partners to spread the word: May is CalFresh Awareness Month!", "datePublished": "2021-05-05T14:14:10-07:00", "url": "https://www.countynewscenter.com/may-is-calfresh-awareness-month/", "keywords": ["health", "calfresh"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-05-05T14:52:51-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is joining the California Department of Social Services and local community partners to spread the word: May is CalFresh Awareness Month! Over a year into the global COVID-19 pandemic, many individuals and families across the region are experiencing a need for supplemental nutrition assistance.\nCalFresh plays a critical role in filling that need. CalFresh is a supplemental nutrition program for families and individuals who meet certain income guidelines. The program is designed to reduce food insecurity and increase food budgets to improve participant’s access to fresh and healthy food.\nDuring the month of May, HHSA and community partners are working together to spread the message and increase awareness about CalFresh.\nResidents can apply for CalFresh online at GetCalFresh.org and MyBenefitsCalWIN.org, or by calling 2-1-1 San Diego. For more information about CalFresh, visit the County’s CalFresh page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210505.14.14.10"}