{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "79th Assembly District Election Results – When to Expect Them", "description": "On election night, we all want to know the results right away, but counting ballots takes time, even for a special election such as the 79th Assembly District Primary Election.", "datePublished": "2021-04-06T09:30:27-07:00", "url": "https://www.countynewscenter.com/79th-assembly-district-election-results-when-to-expect-them/", "keywords": ["elections", "79th state assembly district special primary election", "april 6", "certification deadline", "election results", "mail ballots", "provisional ballots"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-04-06T09:30:27-07:00", "articleType": "article", "articleContent": "\nOn election night, we all want to know the results right away, but counting ballots takes time, even for a special election such as the 79th Assembly District Primary Election.\nSo, what can you expect on election night?\nThe first set of results comes in shortly after 8 p.m. They include ballots that were mailed in, returned to mail ballot drop-off locations, or cast during early voting at the Registrar’s office prior to Election Day.\nThe Election Day precinct ballots come in after the polls close at 8 p.m. and must be driven in from 51 polling place locations across the 79th Assembly District.\nUpon arrival, the ballots are scanned, and results will be periodically updated throughout the night until all of the precinct ballots have been counted. For the latest results on election night, you can follow the Registrar’s office on Twitter.\nThe final unofficial election night results may not come in until midnight and will only cover the ballots that could be counted immediately.\nHere’s what will remain to be counted.\nMail ballots. The Registrar’s office mailed over 300,000 ballots for this election and a portion of those could be dropped off at the polls or picked up by the U.S. Postal Service on Election Day. Plus, mail ballots sent right before or on April 6 have three days to arrive if postmarked by Election Day.\nThen there are provisional ballots. People who missed the March 22 registration deadline may conditionally register and vote provisionally up to and on Election Day.\nFor each provisional ballot, election workers must make sure the voter didn’t already cast a ballot.\nHowever, the results must be certified on April 15, and the Registrar expects to use every minute of the certification period to make sure the results are accurate.\nFor more information, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210406.09.30.27"}