{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Exposure Reported at Golden Hall Shelter", "description": "The Tuberculosis Program in the Public Health Services (PHS) department of the County of San Diego Health and Human Services Agency, is working in close collaboration with Father Joe’s Villages, and the San Diego Housing Commission to notify residents, employees, contractors, and volunteers potentially exposed to tuberculosis (TB) at the Golden Hall shelter at 1101 First Ave. in San Diego.", "datePublished": "2023-11-27T16:06:36-08:00", "url": "https://www.countynewscenter.com/tuberculosis-exposure-reported-at-golden-hall-shelter/", "keywords": ["health", "golden hall", "tuberculosis", "tuberculosis exposure"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-11-27T16:06:36-08:00", "articleType": "article", "articleContent": "\nThe Tuberculosis Program in the Public Health Services (PHS) department of the County of San Diego Health and Human Services Agency, is working in close collaboration with Father Joe’s Villages, and the San Diego Housing Commission to notify residents, employees, contractors, and volunteers potentially exposed to tuberculosis (TB) at the Golden Hall shelter at 1101 First Ave. in San Diego.\nThe dates of potential exposure are from Sept. 5 to Sept. 28, 2023.\nThere is no association between this notification and a separate TB exposure that occurred at a different shelter operated by Father Joe’s Villages which was announced in April.\nTB is an airborne disease that is transmitted from person-to-person through inhalation of the bacteria from the air. The bacteria are spread when someone sick with TB coughs, speaks, sings, or breathes. People with frequent and prolonged indoor exposure to a person who is sick with TB should get tested.\nPeople experiencing homelessness are at increased risk for TB for a variety of reasons. These include a higher risk for getting infected in congregate settings, challenges regarding access to healthcare for people experiencing homelessness, and the presence of certain medical conditions that may be more common and/or severe among people experiencing homelessness.\nWhile the rate of TB is much higher among people who have experienced homelessness, among cases in San Diego County, 90% of people who are diagnosed with TB have not been recently homeless.\n“Symptoms of active TB include persistent cough, fever, night sweats, and unexplained weight loss,” said Wilma Wooten, M.D., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with tuberculosis will become ill in the future, sometimes even years later, if their latent TB infection is not treated. For people who think they may have been exposed, blood tests and skin tests are an effective way to determine an infection.”\nEffective treatments are available to cure people who are sick from active TB. It is especially important for individuals with symptoms of active TB and those who are immune compromised to see a medical provider to rule out active TB and to discuss treatment.\nIndividuals who would like more information on this potential exposure should call the County TB Control Program at (619) 692-8621.\nPeople who test positive for TB but who don’t have symptoms of an active case should get a chest x-ray and talk to a medical provider, as they most likely have a latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from getting sick.\nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 cases in 2020 and 201 people reported with active disease in 2021. In 2022, 208 people were reported with active TB disease in San Diego County. An estimated 175,000 people in San Diego County have latent TB infection and are at risk for developing active TB without preventive treatment.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231127.16.06.36"}