{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Cases Jump After Thanksgiving Gatherings", "description": "A high number of COVID-19 cases for the San Diego region was reported Dec. 2, an increase local health officials believe is the result of Thanksgiving gatherings.", "datePublished": "2021-12-03T14:48:15-08:00", "url": "https://www.countynewscenter.com/county-covid-19-cases-jump-after-thanksgiving-gatherings/", "keywords": ["health", "coronavirus", "covid-19", "omicron", "rise in cases", "thanksgiving"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-03T14:49:27-08:00", "articleType": "article", "articleContent": "\nA high number of COVID-19 cases for the San Diego region was reported Dec. 2, an increase local health officials believe is the result of Thanksgiving gatherings.\nThe County Health and Human Services Agency is reporting 1,153 COVID-19 cases, up from case numbers in the 600s on the prior two days.\nCounty health officials believe the upturn is tied to Thanksgiving gatherings and not due to the new Omicron variant, which has not yet been identified in San Diego County. The last time more than 1,150 cases were reported was Sept. 10 when 1,188 cases were identified.\n“Unfortunately, rises like these after holidays are not unexpected,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “We are vigilant for any changes in cases that Omicron might cause, but we’ve seen similar spikes like this in the past.”\nKaiser says more case increases are likely to occur during the next couple months because of other upcoming holidays.\n“County residents need to be mindful that Delta is still out there,” Kaiser said. “Indoor masking, vaccination and good hygiene are still strongly advised. People should not visit family and friends or go to work if you’re ill.”\nWith recent detections of the Omicron variant in Los Angeles and San Francisco, the County continues to work with the Centers for Disease Control and Prevention and the California Department of Public Health to review existing recommendations as more data becomes available.\nCounty health officials urge San Diegans to continue following the measures to protect against all varieties of COVID-19, including the Omicron variant. They are:\n\nGet vaccinated and get a booster if you qualify. The vaccine is available at health care providers, retail pharmacies and community clinics. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the My Turn website.\nWear a mask, especially in public indoor settings, regardless of vaccination status.\nGet tested if you have any symptoms, whether you’ve been vaccinated or not. You can make a free test appointment or find a walk-in test clinic at coronavirus-sd.com.\nWash your hands frequently and stay home if you’re sick and distance yourself from others.\n\nMore information about COVID-19, testing and vaccinations can be found at coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211203.14.48.15"}