{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Accepting Applications for Available Federal Grants", "description": "The County is accepting applications for funding from the Community Development Block Grant (CDBG), a federal program that provides annual grants to states, cities, and counties.", "datePublished": "2022-09-15T09:52:02-07:00", "url": "https://www.countynewscenter.com/?p=209517", "keywords": ["housing", "community", "development", "grants", "housing", "meetings"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-09-15T09:52:02-07:00", "articleType": "article", "articleContent": "\nDo you have an idea to improve your neighborhood?\nThe County is accepting applications for funding from the Community Development Block Grant (CDBG), a federal program that provides annual grants to states, cities, and counties. Applications are open through Nov. 4.\nFederal CDBG funds have been used to improve local youth and senior centers, parks, streets, drainage systems, accessibility issues, and fire facilities.\nCommunity members and non-profit organizations are invited to propose projects that benefit low and moderate-income residents in the county’s unincorporated area if the projects align with the County’s Consolidated Plan and:\n\nIncrease the availability of affordable, supportive, and livable housing.\nImprove the quality, safety, accessibility, and walkability of communities.\nIncrease and maintain accessible, available, and supportive homeless shelters and services.\n\nThe County Housing and Community Development Services (HCDS) is holding four informational workshops, one virtual and three in person, about the CDBG program and how to apply.\nWorkshop One: \nMonday, Sept.26, 10 a.m.- 12 p.m.\nVirtual\nPassword: CDBG\nWorkshop Two: \nTuesday, Sept. 27, 10:30 a.m.-12:30 p.m.\nLincoln Acres Community Room\n2717 Granger Ave., National City, CA 91950\n Workshop Three: \nWednesday, Sept. 28, 10:30 a.m.-12:30 p.m.\nLakeside Community Center\n9841 Vine St, Lakeside, CA 92040\nWorkshop Four: \nThursday, Sept. 29, 10 a.m.-12 p.m.\nFallbrook Library Community Room\n124 S. Mission Rd, Fallbrook, CA 92028\nMore information, including a narrated presentation, can be found on the HCDS website.\nAdditional federal funding is available via these programs:\nHOME Investment Partnerships and CDBG Affordable Housing Programs: These programs fund affordable housing opportunities, including the County’s First-Time Homebuyer Program.\nEmergency Solutions Grants: These funds improve the quality and number of emergency shelters and transitional facilities for the homeless and prevent at-risk families or individuals from becoming homeless.\nHousing Opportunities for Persons with HIV/ AIDS: The funds are for affordable housing and services for low-income households living with HIV/AIDS.\nFor more information, contact Marco De La Toba at (858) 694-8724 or Marco.DeLaToba@sdcounty.ca.gov. People who are hearing impaired may call (866) 945-2207.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220915.09.52.02"}