{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Protect your EBT Cards", "description": "As Electronic Benefit Transfer, or EBT, thefts continue to happen both locally and throughout the state, people are encouraged to take easy steps to protect their benefits. EBT cards provide monthly funds from the USDA Food and Nutrition Service for people to buy food.", "datePublished": "2023-01-12T16:58:49-08:00", "url": "https://www.countynewscenter.com/protect-your-ebt-cards/", "keywords": ["health", "calfresh", "ebt", "food stamps", "golden state advantage card", "scam", "skimming", "theft"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-01-12T17:04:16-08:00", "articleType": "article", "articleContent": "\nAs Electronic Benefit Transfer, or EBT, thefts continue to happen both locally and throughout the state, people are encouraged to take easy steps to protect their benefits. EBT cards provide monthly funds from the USDA Food and Nutrition Service for people to buy food.\nThe most common ways benefits are stolen are skimming and scamming. To help prevent those from happening, never share personal information like your social security number, bank information, EBT card or PIN number with strangers or organizations you are not familiar with.\nThe State of California and the County of San Diego will NEVER call or text asking for your card or PIN number. You can protect your PIN number by keeping it a secret, not writing it down, assuring others do not see you input your pin and changing your PIN number often.\nYou can also sign up for direct deposit if you are a part of the CalWORKs Program, so benefits go directly into your bank account instead of a card. Many banks offer free accounts if you sign up for direct deposit. You can enroll or stop direct deposit at any time. Each month you will be able to access your benefits on time through your bank account. This protects your benefits and prevents fraud.\nWhile the County is able to replace stolen benefits in most cases, this process typically takes a few days and does not guarantee you will get your money back.\nThe state is working to upgrade EBT security technology. Until that happens, and even after, the County recommends that everyone take these steps to protect their benefits.\nFor more information on how to protect your EBT card click here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230112.16.58.49"}