{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Budget Presentations Go Before County Supervisors", "description": "County departments will make budget presentations before the Board of Supervisors at public meetings on Wednesday and Thursday. The Board requested the presentations as part of the budget process for Fiscal Year 2021-22.", "datePublished": "2021-05-24T16:34:10-07:00", "url": "https://www.countynewscenter.com/budget-presentations-go-before-county-supervisors/", "keywords": ["government", "board meetings", "budget presentations", "e-comment", "fgg", "fiscal year 2021-22", "in-person participation", "san diego county board of supervisors"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-05-24T16:34:10-07:00", "articleType": "article", "articleContent": "\nCounty departments will make budget presentations before the Board of Supervisors at public meetings on Wednesday and Thursday.\nThe Board requested the presentations as part of the budget process for Fiscal Year 2021-22.\nThe meetings begin at 9 a.m. on Wednesday, May 26 and Thursday, May 27 at the County Administration Center downtown.\nPeople can attend and provide public comment in person as long as certain COVID-19 safety measures are followed. Physical distancing guidelines cap the number of public participants in the Board Chamber to 22 people at a time.\nOverflow rooms will be available, but due to limited capacity, the Clerk of the Board strongly urges the public to watch the meetings live online and make a request to speak via teleconference or submit a written eComment.\nAttend the Meeting in Person\nMembers of the public must follow the safety guidelines below to attend the Board meeting in person.\n\nWear a face covering at all times except when speaking at the podium\nFollow physical distancing rules\nUndergo a security screening, a temperature check and answer standard COVID-19 screening questions when entering the County Administration Center\nWait outside the building if the maximum capacity is reached inside the Board Chamber and overflow rooms until space becomes available\n\nWatch Online\nThere may be a 45-second or more delay when viewing the broadcast online, depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo Livestream\nYouTube\nFacebook\nTwitter\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nCurrently not available on AT&T U-Verse\n\nListen on the Phone\n\nA call-in line is also available to listen to the live Board meeting while it is in session at 619-531-4716. This is a listen-only line.\n\nComment\nMembers of the public can use the eComment service to submit comments on agenda and non-agenda items before and during the meeting.\nThose who want to participate in the meeting and speak via teleconference must fill out the online Board of Supervisors tele-comments form and submit it before the meeting starts. After submitting the form, you will receive instructions on how to call in to the meeting to provide your comments.\nLarge groups wishing to comment on a common item are encouraged to submit comments in writing or to identify one spokesperson to join the teleconference on behalf of the group.\nFor more information, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210524.16.34.10"}