{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Officials Provide Public Update on Tropical Cyclone Hilary", "description": "The County is thanking residents for taking proactive precautions as Tropical Cyclone Hilary is expected to cause flooding and damage across the region, particularly in the mountains and deserts.", "datePublished": "2023-08-20T15:29:11-07:00", "url": "https://www.countynewscenter.com/san-diego-county-officials-provide-public-update-on-tropical-cyclone-hilary/", "keywords": ["government", "county update", "storm", "tropical cyclone hilary"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-08-20T15:29:11-07:00", "articleType": "article", "articleContent": "\nThe County is thanking residents for taking proactive precautions as Tropical Cyclone Hilary is expected to cause flooding and damage across the region, particularly in the mountains and deserts.\nThe County of San Diego has been monitoring conditions and staffed the Emergency Operations Center (EOC) to prepare for the storm and will remain activated as long as needed.\nBoard of Supervisors Chairwoman Nora Vargas thanked all of the cities and organizations working together to keep residents safe. Her message to the public was simple. “Stay home. Stay informed. Stay safe,” Chairwoman Vargas said.\nThe County is coordinating with many partners to ensure residents were prepared for the storm, including outreach days in advance to vulnerable populations like those experiencing homelessness. The inclement weather program has been expanded to accommodate more people who are unsheltered. The National Weather Service also provided an update.\n“There is a flash flood warning in effect for our mountains and deserts. That means it is here and happening now,” National Weather Service Meteorologist Alex Tardy said. “The heaviest rain will occur between now and 6 p.m. for a majority of the County. North county will see heavy rain into the evening, around 8:30 p.m.”\nIf you are in an area that is known to flood, particularly in the mountains and deserts, consider leaving if it is safe to do so. “Do not wait for an official warning if you live in areas known to flood,” San Diego County Sheriff Kelly Martinez said. “Flash flooding can happen quickly and without much warning.”\nCAL FIRE is ready to respond with crews strategically placed across the county. The County and CAL FIRE provided thousands of sandbags at county fire stations to residents to redirect water away from their homes.\nDepartment of Public Works teams cleaned roadways and storm drain systems of debris, and posted road closures signs at known flooding spots ahead of the storm and are ready to respond if needed. “Please stay home if you can. This helps keep our roadways clear for emergency responses,” Department of Public Works Assistant Director Derek Gade said. “If you have to go out, look for closure signs and do not enter flooded areas either on foot or in your car, since you cannot tell how deep the water is. Please use an alternate route to ensure your safety.”\nThe EOC is coordinating support, like evacuation centers if needed. The County of San Diego proclaimed an emergency following yesterday’s state emergency proclamation by the Governor, which included the County of San Diego. If local resources are insufficient during times of disaster, the County will call upon the state for support.\nLibrary branches and most campgrounds are closed today as a precaution. Check the County’s website for the latest information.\nPlease remember, 9-1-1 is for reporting emergencies only. For storm related non-emergency information and resources in most languages call 2-1-1.\nWe also encourage you to check the websites and social media accounts of the city you live in, they will have additional information specific to your area.\nTo receive emergency notifications, updates and preparedness information for this and all disasters, we urge everyone to register for AlertSanDiego and download the SD Emergency mobile app, both available online at alertsd.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230820.15.29.11"}