{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Case Reported at Morse High School", "description": "A person at Morse High School was recently diagnosed with tuberculosis and may have exposed students and staff according to the San Diego County Health and Human Services Agency.", "datePublished": "2020-08-25T10:30:19-07:00", "url": "https://www.countynewscenter.com/tuberculosis-case-reported-at-morse-high-school/", "keywords": ["health", "morse high school", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-25T10:32:53-07:00", "articleType": "article", "articleContent": "\nA person at Morse High School was recently diagnosed with tuberculosis (TB) and may have exposed students and staff according to the San Diego County Health and Human Services Agency (HHSA).\nHHSA is working with San Diego Unified School District officials to notify those who were potentially exposed and provide TB testing. The dates of exposure are from February 28, 2020, to March 13, 2020.\nMorse High School is currently participating in social distancing protocols and onsite TB screening will not be available. Students who were identified as being potentially exposed to TB can get tested with their primary care provider. Students who do not have a medical provider should contact the HHSA TB Control Program at (619) 692-8621 to arrange to arrange an appointment for a free test. School teachers and staff will be provided testing by the San Diego Unified School District.\nTB is transmitted from person to person through indoor air during prolonged contact with an infectious person. Most people who are exposed to TB do not become infected.\n“Testing is recommended for all those exposed to make sure they are not infected, since initial infection usually has no symptoms,” said Wilma Wooten, M.D., M.P.H., County public health officer. “If a person is infected, early diagnosis and prompt treatment can prevent the infectious form of the disease.”\nSymptoms of infectious TB include persistent cough, fever, night sweats, and unexplained weight loss. People infected with TB or who are immunocompromised, may not show symptoms. That’s why it’s important that people see their medical provider to be evaluated for TB. TB can be cured with antibiotics.\nPeople who would like more information on this potential exposure should call:\n\nMorse High School at (619) 725-5519\nCounty TB Control Program at (619) 692-8621\n\nTuberculosis is not uncommon in the region but has been decreasing since the early 1990s and has stabilized in recent years.\nIn 2013, a total of 206 cases were reported in the County, the lowest number since local TB cases peaked at 469 in 1993. There were 237 cases reported in 2017 and 226 in 2018.  Last year, 265 residents were diagnosed with TB. To date, 67 cases have been reported in 2020.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200825.10.30.19"}