{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Fans Score Padre Tickets at “Vax At The Park”", "description": "Hundreds of fans turned out Saturday for the first of two Petco Park events offering San Diego Padres tickets in exchange for getting a COVID-19 vaccination. The County of San Diego and Padres are teaming up for Vax At The Park.", "datePublished": "2021-06-14T10:16:17-07:00", "url": "https://www.countynewscenter.com/fans-score-padre-tickets-at-vax-at-the-park/", "keywords": [], "author": [{"type": "@Person", "name": "Suzanne Bartole", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Suzanne", "familyName": "Bartole"}], "dateModified": "2021-06-14T10:16:17-07:00", "articleType": "video.other", "articleContent": "\nHundreds of fans turned out Saturday for the first of two Petco Park events offering San Diego Padres tickets in exchange for getting a COVID-19 vaccination. The County of San Diego and Padres are teaming up for “Vax At The Park.”\nEach person vaccinated receives a pair of tickets to an upcoming Padres game, a Padres Hero T-shirt, and entry into a drawing to win additional tickets.\nThe second event will be Saturday, June 26 from 1:30 p.m. – 8 p.m.\nThe County is offering both the one-dose Johnson & Johnson vaccine as well as the Pfizer vaccine, which is approved for youth ages 12 to 18. San Diegans who previously received a first dose of Pfizer and have reached or passed the three-week wait time for a second dose also can get vaccinated. Minors must have a parent present to receive Padres tickets and/or to enter the drawing.\nThe Petco Park vaccination events support Major League Baseball’s “MLB Vaccinate at the Plate” program taking place throughout June to increase vaccination rates.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210614.10.16.17"}