{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Virtual Celebration, Real Fun — County’s Earth Day 2021!", "description": "The celebration is virtual, but the fun is real — San Diego County’s virtual Earth Day Fair is back at the Land Use and Environment Group’s Earth Day webpage!", "datePublished": "2021-04-19T07:21:30-07:00", "url": "https://www.countynewscenter.com/virtual-celebration-real-fun-countys-earth-day-2021/", "keywords": ["environment", "earth day", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-04-19T10:56:11-07:00", "articleType": "article", "articleContent": "\nThe celebration is virtual, but the fun is real — San Diego County’s Virtual Earth Day Fair is back!\nEach week, we get closer to reopening to a new normal, getting back outside and playing. But until then the County of San Diego is ready to help everyone celebrate Earth Day 2021 virtually through the Land Use and Environment Group’s Earth Day webpage.\nThe site is filled with fun and education for kids and parents alike. You can play games, solve puzzles, take virtual hikes in our County parks, get hiking tips from a County park ranger, watch animated video stories about whales and watersheds, sing the Earth song, learn about beekeeping and invasive bugs, explore and travel around the world — even walk on Mars right in your living room!\nYou can go on an Earth Day scavenger hunt, take part in a citizen scientist contest, visit Stonehenge, learn how to protect our planet and become a better Earthling, learn how to Recycle Right, what we can all do to keep pollution out of our air and water and how to properly plant a tree.\nYou can sign up for virtual events to learn about composting and make your garden grow better, what “organic” means, and how to grow a salsa garden.\nThere are word games, backyard mysteries to solve scientifically, Earth Day art to print out and color, and fun projects to design and build.\nAnd you can listen to what Earth Day means to each of our County supervisors and learn how the County is updating its Climate Action Plan.\nIn short, you can learn more about our wonderful planet, how to protect it, and have fun doing it.\nSo, come on! Celebrate Earth Day 2021 virtually with the County of San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210419.07.21.30"}