{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "You Don’t Need to Wait Until Election Day – Vote Early!", "description": "The Registrar’s office reminds you that you can make voting decisions and complete your mail ballot in the comfort and safety of your home.", "datePublished": "2020-10-15T08:14:24-07:00", "url": "https://www.countynewscenter.com/you-dont-need-to-wait-until-election-day-vote-early/", "keywords": ["elections", "ballot", "fgg", "nov. 3 election", "nov. 3 general election", "nov. 3 presidential general election", "polling places", "super polls", "trusted sources", "vote at home", "vote early"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-10-19T10:10:23-07:00", "articleType": "article", "articleContent": "\nThe Registrar’s office reminds you that you can make voting decisions and complete your mail ballot in the comfort and safety of your home. Remember to sign and date your envelope, seal your completed ballot inside and return it to a trusted source. You can return it by mail, no postage needed, or at one of 126 mail ballot drop-off locations around the county.\n“If you know how you want to vote, mark your ballot and return it to a trusted source right away,” said Registrar Michael Vu. “The sooner we get the ballot back, the sooner we can start processing it. Your ballot can be in the first release of Election Night results if you act early.”\nHowever, if you need to vote in person that option is available too. You can do so now:\n\nAt the Registrar’s office, 8 a.m. to 5 p.m., Monday through Friday\nAt your assigned polling place or the Registrar’s office 8 a.m. to 5 p.m. Saturday, Oct. 31 through Monday, Nov. 2.\n\nAll will again be open on Election Day, Nov. 3, when the voting hours change to 7 a.m. to 8 p.m.\nThere will be fewer locations than in prior elections, so your polling place has most likely changed. Larger polling sites, called “Super Polls,” will accommodate social distancing as required by the COVID-19 guidelines. In addition, Super Polls will be open four days instead of one.\nIf you plan to vote in person, be prepared. Wear your face mask, go to your assigned polling place and maintain social distance.\nThe Registrar’s office encourages older adults and people with underlying medical conditions to avoid long lines and crowded polling places by voting early.\nTo learn more about Vote Safer San Diego and voting in the Nov. 3 election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201015.08.14.24"}