{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "3 More COVID-19 Vaccination Clinics Coming to San Diego", "description": "The County is continuing to open vaccination clinics in communities most impacted by the pandemic.", "datePublished": "2021-03-26T16:55:42-07:00", "url": "https://www.countynewscenter.com/3-more-covid-19-vaccination-clinics-coming-to-san-diego/", "keywords": ["health", "coronavirus", "covid-19", "three clinics", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-29T10:45:06-07:00", "articleType": "article", "articleContent": "\nThe County is continuing to open vaccination clinics in communities most impacted by the pandemic.\nA new clinic will be administering vaccines from 9:30 a.m. to 3:30 p.m. Tuesday through Saturday at the North Inland First United Methodist Church, 341 Kalmia Street in Escondido.\nAppointments are required for the walk-through clinic which will have the capacity to vaccinate 250 people daily.\nStarting March 30, vaccinations will be administered from 9:30 a.m. to 3:30 p.m., Tuesday through Saturday, at the Mountain View Educational Cultural Complex, 4343 Oceanview Boulevard in Southeastern San Diego. The appointment-based walk-up clinic will have the capacity to administer 500 doses initially but can ramp up to 1,000 each day. The new clinic replaces the Central Region Immunization Clinic at 3177 Ocean View Blvd., which had a capacity of 100 vaccinations each day.\nCOVID-19 vaccines will also be available on March 31, César Chávez Day, from 9:30 a.m. to 3:30 p.m., at a one-day, walk-up, no-appointment clinic at the Sherman Heights Community Center, 2258 Island Ave. A total of 300 doses will be administered that day on a first-come, first-served basis exclusively to residents of the 92102 and 92113 ZIP codes. Some proof of residence such as ID, utility bill, etc. will be required.\nVaccination Progress:\n\nMore than 1.65 million COVID-19 vaccine doses have been delivered to the region, and over 1.56 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, nearly 528,000 County residents, or 19.6% of San Diegans 16 and older, are fully immunized.\nOverall, almost 870,000 County residents have received at least one shot of the two-dose vaccine. That’s 32.3% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 5.5 cases per 100,000 residents. The County is in the Red Tier.\nCurrently, the testing positivity percentage is 2.4%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 3.4% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March 30.\n\nCommunity Setting Outbreaks:\n\nThree new community outbreaks were confirmed March 25. One in a restaurant setting, one in a daycare/preschool/childcare setting and one in a retail setting.\nIn the past seven days (March 19 through March 25), 20 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n13,376 tests were reported to the County on March 25, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,710.\n\nCases, Hospitalizations and ICU Admissions:\n\n422 COVID-19 cases were reported to the County on March 25. The region’s total is now 269,049.\n14,762 or 5.5% of all cases have required hospitalization.\n1,636 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFive new COVID-19 deaths were reported March 25. The region’s total is 3,525.\nThree men and two women died between Jan. 19 and March 24.  new COVID-19 deaths were reported March 20.\nOf the people who died, two were 80 years of age or older, one was in their 60s and two were in their 50s.\nThree had underlying medical conditions, one did not and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210326.16.55.42"}