{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Youth Learn Life Skills Through Woodworking Program", "description": "Students at the County Probation Department’s new Youth Transition Campus are preparing for a woodworking exhibition Friday, June 17. Youth will get to show off their projects built over the last year in Career and Technical Education classes at the new Kearny Mesa campus and at the East Mesa Juve...", "datePublished": "2022-06-16T10:26:45-07:00", "url": "https://www.countynewscenter.com/?p=208772", "keywords": ["government"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-06-16T11:31:18-07:00", "articleType": "article", "articleContent": "\nStudents at the County Probation Department’s new Youth Transition Campus are preparing for a woodworking exhibition Friday, June 17. Youth will get to show off their projects built over the last year in Career and Technical Education classes at the new Kearny Mesa campus and at the East Mesa Juvenile Detention Facility.\nThe students have created Adirondack chairs, an entertainment center, a baby crib, a sideboard and two tables. The projects will be presented by the youth and then each item will be sold to raise money for tools and materials to be used for future students.\nThe Career and Technical Education program started five years ago, and teacher Alex Long only accepts youth who have the best behavior into it.  The students learn construction skills and how to be professional in their actions.\n“When they are released from here, they actually have something that they can take and go get a job,” Long says. “We change the way they think, and the way they behave, and who they hang out with. And I think they get a real-world chance to go and start a different life than the path they were on before.”\nAfter successfully completing the class, students have a guaranteed job interview with a local company, Long says.\nThe items created in the woodshop are sold on the site ProjectBirdland.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220616.10.26.45"}