{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Fire Rating Reaffirmed By Insurance Office", "description": "The Independent Insurance Services Office (ISO), Verisk, has reaffirmed the strong rating of County Fire to respond to structure fires in its service area. County Fire and CAL FIRE now rank in the top 20 percent nationally in its capability to fight structure fires.", "datePublished": "2022-09-30T10:19:07-07:00", "url": "https://www.countynewscenter.com/county-fire-rating-reaffirmed-by-insurance-office/", "keywords": ["government", "board chair nathan fletcher", "cal fire", "county fire", "insurance", "iso", "professional firefighters", "public protection classification", "rating", "supervisor jim desmond", "supervisor joel anderson", "water systems"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-10-03T15:10:05-07:00", "articleType": "article", "articleContent": "\nThe Insurance Services Office (ISO), Verisk, has reaffirmed the strong rating of County Fire to respond to structure fires in its service area.\nCounty Fire and CAL FIRE now rank in the top 20 percent nationally in its capability to fight structure fires.\nVerisk assesses the capabilities of fire agencies across the country.  After a comprehensive, months-long process, the company issued County Fire a Public Protection Classification, or rating of 3/3x, on a scale of 1 to 10, with 1 representing an exemplary fire suppression program and 10 indicating the program does not meet minimum criteria.  Given the high fire danger, the vast service area and lack of accessible water sources, County Fire’s ability to maintain the 3/3x is a tremendous accomplishment.\nInsurance companies can use these ratings as a factor for setting premiums, so the better ratings could mean lower insurance rates for some property owners in the County Fire coverage area.\nThe new ISO evaluation validates the continuous commitment shown by the County and this Board of Supervisors to improve fire and emergency service levels in unincorporated areas,” said Supervisor Jim Desmond, District 5.  “This is great news not only when it comes to safety, but also lowering the insurance rates for taxpayers. I’m proud of all we have accomplished in the past four years, spending more than $6 million dollars on upgrades to fire stations and facilities throughout North County.”\nSupervisor Joel Anderson, District 2 says, “This is welcome news for many of my constituents in the back country. The ISO rating is the culmination of more than a decade of work to strengthen emergency resources.  It is an added benefit if our efforts can help residents and businesses in places like Ramona, Campo, and Mt. Laguna get a break on their insurance rates.”\nBoard Chair Nathan Fletcher recognized the tremendous amount of work that went into achieving the rating. “Since the devastating 2003 Cedar Fire, our County has invested more than $600 million. Those investments have improved fire protection and emergency medical services, added staffing, fire stations, made communication enhancements, increased training and brush management. We’ve also added more ground and air equipment.”\nCounty Fire’s service area covers more than 1,500 square miles of San Diego County.  Property owners are encouraged to contact their insurance companies to find out how the classification may affect their policy.\nCounty Fire reorganized fire services in the unincorporated areas in 2008, bringing nearly 20 largely volunteer run departments under a unified command.  Professional firefighters and emergency personnel now respond to fires, medical calls and disasters across the County with upgraded fire apparatus and Advanced Life Support Paramedic engines.\nVerisk works across the country with insurance companies, communities, fire departments, insurance regulators, and others to assess risk.  The research measures municipal fire suppression efforts, emergency communications capabilities, firefighting training levels, apparatus and equipment, and staffing, as well as community water supply.\nCounty Fire’s response ensured the ISO considered the water systems and service levels in the communities of Campo, Lake Morena, Jacumba, Yuima and Julian, allowing over 3,800 properties to improve to a level 3 classification.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220930.10.19.07"}