{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Open New COVID-19 Testing Site at Border", "description": "A new COVID-19 testing site will begin operating Wednesday at the San Ysidro Port of Entry PedEast crossing.", "datePublished": "2020-08-11T18:18:31-07:00", "url": "https://www.countynewscenter.com/county-to-open-new-covid-19-testing-site-at-border/", "keywords": ["health", "coronavirus", "covid-19", "rental assistance program", "san ysidro test site"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-12T08:38:09-07:00", "articleType": "article", "articleContent": "\nA new COVID-19 testing site will begin operating Wednesday at the San Ysidro Port of Entry PedEast crossing.\nThe free site will operate from 6:30 to 10:30 a.m. Monday through Friday and will focus on testing essential workers and American citizens who live in Tijuana, as well as residents of the area.\nNo appointments are necessary at the walk-up site, which will offer about 200 tests daily. People getting tested will not be asked their immigration status or who lives with them.\n“We know that communities in South Bay have been hit the hardest by COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The location was selected because of the increase in cases in the region and the number of people, especially essential workers who cross daily.”\nThe new location is one of ten County and state sites operating in South County and is part of the County’s ongoing efforts to address COVID-19 in the region, which has been disproportionately affected by the novel coronavirus.\nAnother no-appointment testing site opened this week at California State University San Marcos. Appointments are necessary for most County testing sites. To make an appointment, visit www.211sandiego.org or call 2-1-1.\nCounty public health nurse administers a COVID-19 test.\n“Great Plates” Program Extended Again\nAbout 2,000 older adults in the “Great Plates Delivered” program will continue to receive three free and healthy meals a day until Sep. 9.\nLaunched in mid-May, the program is a collaboration between the County and local restaurants to help older adults, who are at a higher risk of developing complications from COVID-19, avoid going out to restaurants or the grocery store to get food.\nCurrently, 31 local restaurants are delivering meals to enrolled seniors throughout San Diego County. The County is reimbursing restaurants for the cost of food, labor and incidentals, using a combination of funding provided by FEMA, the state and the County.\nThose currently receiving assistance from other state or federal nutrition assistance programs, such as CalFresh or Meals on Wheels, are not eligible for the Great Plates Delivered program. Participants must also fall within a specific income range.\nThe County is also in the process of developing “Great Plates Delivered 2.0” which will focus on serving people with disabilities. More local restaurants will be recruited for the new program which is expected to launch in a few weeks.\nFor more details on criteria, call the County Aging and Independence Services at (800) 339-4661 or visit www.aging.sandiegocounty.gov/greatplates. You can also call 2-1-1 San Diego.\nCounty Sets Emergency Rental Assistance Program \nResidents who have been economically impacted by COVID-19 and live in unincorporated areas of the region and the cities of Coronado, Del Mar, Imperial Beach, Lemon Grove, Poway and Solana Beach could qualify for rental assistance.\nHouseholds must fall under 60% Area Median Income to qualify and could receive $1,500 per month for two months. Applicants can earn up to $48,540 for a single-person household and up to $91,5000 for a household with eight people. The program will be able to assist 50 to 60 households for two months.\nEligible applicants will be selected at random and the first payments are expected to be distributed early Sept.\nApplications will be available online starting at 7:30 a.m., tomorrow, Aug. 12, and through 11:59 p.m. Aug. 13 at bit.ly/COSD-COVIDEmergencyRent. Supporting documents should be mailed to Community.Development@sdcounty.ca.gov. People with no internet access should call (858) 694-4801 and press Option 5.\nCommunity Setting Outbreaks:\n\nSix new outbreaks were identified on Aug. 10: one in a gym, two in business settings, two in government settings and one in a restaurant/bar setting.\nIn the past seven days, 29 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n5,669 tests were reported to the County on Aug. 10 and the number of laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 4.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,362.\n\nCases:\n\n182 new cases were reported in San Diego County for a total of 33,157. The last time the daily case count was under 200 was June 22 when 198 cases were reported.\n2,771 or 8.4% of cases have required hospitalization.\n694 or 2.1% of all cases and 25% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nEight new COVID-19 deaths were reported in San Diego County on Aug. 10 and the region’s total is now 602.\nSix men and two women died between Aug. 5 and Aug. 9 and their ages ranged from 63 to 85 years of age.\nAll had underlying medical conditions.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200811.18.18.31"}