{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More Meals to be Served to Unsheltered through Sheriff, Nonprofit Partnership", "description": "The San Diego County Board of Supervisors voted unanimously March 16 to execute a new three-year agreement between the County, San Diego County Sheriff’s Department, and the local nonprofit Lucky Duck Foundation to help prepare and distribute 1,000 daily meals to unsheltered residents seven days a week.", "datePublished": "2021-03-23T16:13:37-07:00", "url": "https://www.countynewscenter.com/more-meals-to-be-served-to-unsheltered-through-sheriff-nonprofit-partnership/", "keywords": ["public safety", "food", "homelessness", "san diego sheriff s department"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-03-25T10:16:50-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors voted unanimously March 16 to execute a new three-year agreement between the County, San Diego County Sheriff’s Department, and the local nonprofit Lucky Duck Foundation to help prepare and distribute more than 2,000 daily meals to unsheltered residents seven days a week.\n“The San Diego Sheriff’s Department is honored to work with The Lucky Duck Foundation in providing food for the unsheltered. Meeting our community’s basic needs supports the health and overall wellness of our community members,” Sheriff’s Commander Will Brown said.\nThe agreement expands a previous pilot program from last year between the County and Lucky Duck Foundation in which the Sheriff’s Department provided food, food preparation, and delivery service to the foundation’s two distribution locations in the county three times a week.\nDrew Moser, Executive Director of the Lucky Duck Foundation, said the Sheriff’s Department’s involvement has been key to the program’s success and expansion from feeding 400 people per day to more than 1,000 people per day. Brown said Sheriff Bill Gore agreed to expand the service because he knew his department already has the infrastructure in place to produce and package meals on a large scale and his staff have a passion and commitment to serving people\n“The Sheriff’s Department’s commercial kitchen, which already generates more than 15,000 meals a day, is a great resource that enables these meals to be made, packed, and delivered,” said Moser. “And the cost of the meals, given the County’s buying power, makes this program scalable so that philanthropy can cover the costs of all meals.”\nMoser said after the meals are prepared by the Sheriff’s Department and transported to Lucky Duck Foundation distribution sites in Miramar and Chula Vista. Volunteers at those sites sort and organize the meals for more than 30 outreach teams from 25 different social service agencies that blanket the county to deliver the meals to people living on the streets.\n“The objective is two-fold,” said Moser. “It provides nourishment and equips outreach workers with an important tool for building trust and rapport to help the homeless end their homelessness by connecting them to available resources.”\nMoser said the program also employs formerly homeless individuals, one of whom serves as a distribution site coordinator.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210323.16.13.37"}