{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Active Tuberculosis Reported in Transit Rider", "description": "Passengers using the Metropolitan Transit System Trolley system may have been exposed to tuberculosis, the County of San Diego Health and Human Services Agency announced today.", "datePublished": "2023-02-16T10:02:02-08:00", "url": "https://www.countynewscenter.com/active-tuberculosis-reported-in-transit-rider-2/", "keywords": ["health", "mts", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-02-16T10:02:02-08:00", "articleType": "article", "articleContent": "\nPassengers using the Metropolitan Transit System (MTS) Trolley system may have been exposed to tuberculosis (TB), the County of San Diego Health and Human Services Agency (HHSA) announced today.\nHHSA Public Health Services Department and MTS officials are working in close collaboration to notify riders who used the Trolley’s Blue and Orange lines between June 31, 2022 to December 31, 2022 that they were potentially exposed and are at risk for infection:\n\nTrolley Blue Line from San Ysidro to 12th & Imperial Transit Center Monday through Friday from 6 a.m. to 6:30 a.m.\nTrolley Orange Line from 12th & Imperial to El Cajon Monday through Friday from 6:30 to 7 a.m.\nTrolley Orange Line from El Cajon to 12th & Imperial Monday through Friday roughly between 5:45 p.m. and 6:15 p.m.\nTrolley Blue Line from 12th & Imperial to San Ysidro Transit Center Monday through Friday roughly between 6:15 p.m. and 7:45 p.m.\n\nPeople with active tuberculosis are often unaware they have the disease and may be contagious for several months before being diagnosed. Once the County is made aware, typically through a test result reported by a medical provider, communicable disease investigators conduct extensive interviews with the patient to determine the length of time they were infected and the locations of potential exposure. This is done to best inform people who may have been exposed and the action they should take.\nPotentially affected passengers are advised to consult with their medical provider or contact the San Diego County TB Program.\nTuberculosis is an airborne disease that is transmitted from person to person through inhalation of the bacteria from the air. The bacteria are spread when someone sick with TB coughs, speaks, sings or breathes. People with frequent and prolonged indoor exposure to a person who is sick with TB should get tested.\nTwo other MTS riders with TB were reported in August and September 2022. At this time HHSA does not have any evidence directly linking the rider most recently diagnosed with TB to the other MTS riders. Additional lab testing will be used to determine if there may be linkages between these riders.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Ankita Kadakia, M.D., County Deputy Public Health Officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with tuberculosis will become ill in the future, sometimes even years later, if their latent TB infection is not treated. Blood tests and skin tests are effective to determine whether someone has been infected.”\nEffective treatments are available to cure people who are sick from active TB. It is especially important for individuals with symptoms of active TB and those who are immune compromised to see their medical provider to rule out active tuberculosis and to discuss treatment.\nPeople who test positive for TB but who don’t have symptoms of active TB should get a chest x-ray and talk to a medical provider, as they most likely have a latent TB infection.  People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from getting sick.\nIndividuals who would like more information on this potential exposure are asked to call the County TB Control Program at (619) 692-8621.\nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 in 2020 and 201 people reported with active disease in 2021. Preliminary data shows 208 people were reported to have active TB disease in 2022.\nAn estimated 175,000 people in San Diego County have latent TB infection and are at risk for developing active TB without preventive treatment. HHSA encourages all San Diegans to know their own risk for TB infection. The County of San Diego Tuberculosis Control Program’s Risk Assessment tool is available on their website at: TB Risk Assessment (sandiegocounty.gov)\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230216.10.02.02"}