{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Encourages Mpox Vaccinations as 11 New Cases Reported", "description": "The County of San Diego is reporting 11 new cases of Mpox in the month of October, mirroring a trend happening across the state. ", "datePublished": "2023-10-26T09:19:32-07:00", "url": "https://www.countynewscenter.com/county-encourages-mpox-vaccinations-as-11-new-cases-reported/", "keywords": ["health", "jynneos", "mpox", "mpox cases", "mpox vaccinations"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-10-26T09:19:32-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is reporting 11 new cases of Mpox in the month of October, mirroring a trend happening across the state. \nAs of Oct. 21, 2023, the total number of cases in San Diego County is 492 since cases first emerged in July 2022. \nMpox, formerly known as monkeypox, is a virus that is spread through close physical contact with someone who has Mpox.  \nMpox infections usually cause rashes or sores throughout the body that can last for two to four weeks. Rashes can happen in sensitive areas and can be extremely painful. Often, but not always, people with Mpox experience flu-like symptoms before the rash or sores appear. \nDuring last summer’s global outbreak, Mpox affected mostly the LBGTQ+ community, but anyone can get Mpox.  \n“The Mpox vaccine is widely available, safe and an effective way to lower your risk of getting Mpox or lower the severity of your symptoms if you do get sick,” said County Public Health Officer Dr. Wilma Wooten, M.D., M.P.H. “It’s important that people at risk are also practicing other safety measures and notifying their partner or partners of any recent illness or rashes.” \nThe JYNNEOS vaccine is a two-dose injection that helps prevent against Mpox when given before or shortly after exposure to Mpox. It is available to anyone 16 years and older without parental consent. It is also available for people 16 years of age and younger, with parental consent. Those who have only received one dose of the vaccine should get their second dose for maximum protection 28 days later or as soon as possible if past 28 days. \nIn San Diego County nearly 16,000 people have received at least one dose of the JYNNEOS vaccine. No-cost vaccine including second doses are widely available from healthcare providers and public health clinics. People unsure of where to get a vaccine can call 2-1-1 or make an appointment on MyTurn.ca.gov.  \nIn addition, people at risk of getting sick with Mpox should consider taking the following safety precautions, especially as seasonal celebrations begin like Halloween and the upcoming holidays: \n\nLimit close contact with people who have sores or symptoms or who have been recently exposed to Mpox. \nAvoid touching items or materials that someone with Mpox has used. \nPractice good hygiene and wash your hands with soap or water. \n\nThe County is increasing its case updates to weekly at sandiegocounty.gov/mpox, and via text messages to subscribers. To sign up to receive updates as well as other helpful Mpox information, text COSD MPOX to 468-311. \nCounty Public Health also remains engaged with at-risk communities via regular telebriefings and digital advertising. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231026.09.19.32"}