{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expecting to Start Vaccinating 12-15 Year-old Youths Thursday", "description": "County officials said Wednesday they fully expect 12-to-15 year old youths to be able to start getting vaccinated Thursday with Pfizer vaccines, pending the expected approval Wednesday night by the Western States Scientific Safety Review and California Department of Public Health.", "datePublished": "2021-05-12T17:07:36-07:00", "url": "https://www.countynewscenter.com/county-expecting-to-start-vaccinating-12-15-year-old-youths-thursday/", "keywords": ["health", "coronavirus", "covid-19", "covid-19 update", "covid-19 vaccinations", "vaccines for 12-15-year-olds"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-05-12T17:08:33-07:00", "articleType": "article", "articleContent": "\nSan Diego County officials said Wednesday that they fully expect 12-to-15 year old youths to be able to start getting vaccinated Thursday with Pfizer vaccines, pending the expected approval Wednesday night by the Western States Scientific Safety Review and California Department of Public Health.\nCounty officials also reported just 94 new COVID-19 cases, the first time new cases dipped below 100 in nearly a year. It marked the lowest number of new cases since the County reported 73 cases on May 31, 2020.\nThe Advisory Committee on Immunization Practices, the advisory committee to the national Centers for Disease Control and Prevention, approved the Pfizer vaccine for 12-to-15 year old youths Wednesday afternoon, clearing the way for the Western States Scientific Safety Review to review and approve it as well.\nCounty officials said the County has access to enough Pfizer vaccine to provide vaccinations for all the 175,864 12-to-15 year olds in San Diego County.\nParents, and youth 12-15 years of age with parental approvals, can begin making appointments or walking into County clinics Thursday morning, or possibly late tonight, to receive shots. The My Turn online appointment system will not be updated until after the Western State’s working group issues its approval.  The County plans to post tonight information about how to schedule appointments and what types of documentation youths will need to get vaccinated on its COVID-19 web site (link).\nCounty officials said people should not walk into the County’s mobile clinics without first confirming the location has the Pfizer vaccine, which is the only one approved so far for 12-to-15 year old youth. Most mobile clinics feature the J&J/Janssen vaccine.\n“This is an exciting milestone in our efforts to help people get vaccinated,” said County Public Health Officer Dr. Wilma Wooten, M.D., M.P.H. “Already, nearly half of our 16 and older population in San Diego County have become fully vaccinated. This is going to allow our 12-to-15 year old population to become protected as well and let them and their families feel safer.”\nVaccination Progress:\n\nDoses delivered: Nearly 3.7 million.\nDoses administered: Nearly 3.23 million.\nReceived at least one shot: Close to 1.75 million or 65.0% of San Diegans 16 and older.\nFully vaccinated: More than 1.28 million or 47.8%.\nThe goal: fully vaccinate 75% of San Diego County residents 16 and older or 2,017,011 people.\nTo date, 86.7% of the goal population has received at least one vaccine and 63.8% are fully vaccinated. These percentages will be updated as new populations become eligible.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 3.7 cases per 100,000 residents.\nThe testing positivity percentage is 1.7%.\nThe health equity metric is 2.0%.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, May 18.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed May 11 in a grocery setting.\nIn the past seven days (May 5 through May 11), 14 community outbreaks were confirmed.\nThe community outbreaks trigger is seven or more in seven days.\n\nTesting:\n\n12,693 tests were reported to the County on May 11, and the percentage of new positive cases was 1%.\nThe 14-day rolling average percentage of positive cases is 1.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,280.\n\nCases, Hospitalizations and ICU Admissions:\n\n94 COVID-19 cases were reported to the County on May 11. This marked the first time the county has reported fewer than 100 new cases since May 31, 2020 when it reported 73 cases. The region’s total is now 278,401.\n15,333 or 5.5% of all cases have required hospitalization.\n1,691 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFour new COVID-19 deaths were reported May 11. The region’s total is 3,729.\nThree women and one man died between April 28 and May 8.\nTwo of the deceased were in their early 80s; one was in their late 70s and one was in their late 50s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210512.17.07.36"}