{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Be Safe When Driving in the Rain", "description": "Weather forecasters expect San Diego County to receive more rain and wind this week. The County Sheriff’s Department and CAL FIRE officials are offering driving tips to make travel safer this week.", "datePublished": "2024-02-04T09:59:19-08:00", "url": "https://www.countynewscenter.com/be-safe-when-driving-in-the-rain/", "keywords": ["public safety", "cal fire", "don t drown", "drive safely", "public works", "sheriff s department", "turn around"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-02-04T09:59:19-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesWeather forecasters expect San Diego County to receive more rain and wind this week. The County Sheriff’s Department and CAL FIRE officials are offering driving tips to make travel safer this week.\nCounty emergency services and public works road crews say people should stay alert and take precautions on the roads and offered the following tips.\nCareful on the Roads\nAvoid driving in heavy rain conditions but if the trip is necessary:\n\nSlow down to avoid getting into an accident. It takes longer to stop when roads are wet. Allow yourself at least an extra 15 minutes or so to arrive at your destination to adjust for slower traffic.\nTurn on your headlights to see better and make it easier for other drivers to see you. It’s the law.\nTry to drive toward the middle lanes as water tends to gather in outside lanes.\nDefog your windows for better visibility. Rain can cause windows to fog up. Along the same lines, check your windshield wipers preferably before it rains again and replace them as needed.\nAvoid driving through deep water because it can affect your brakes. If you cannot avoid it, test your brakes afterward to make sure they’ve dried out and are working properly.\nTurn around, don’t drown. In heavy rains, never drive through a flooded roadway if you cannot see the pavement. Even a few inches of water running at the right velocity can sweep a car, and even a truck, and its occupants off the roadway and downstream. You should not walk or swim across a flooded roadway either.\nGive the cars in front of you extra distance. The spray from their vehicles — particularly from larger trucks and buses — can hamper your vision. And giving extra space to the guy in front of you also gives you more time to brake or adjust if you need to do so.\nKeep calm, don’t oversteer or stomp on the brakes if you start to hydroplane or skid when your tires lose traction with the wet road. The Department of Motor Vehicles says keep the steering wheel straight and take your foot off the accelerator so your vehicle can slow down slowly.\nStay focused. Remember, it’s illegal, and dangerous, to try to text or use a hand-held cell phone when you’re driving.\nSlow down for the cone zone if you see highway or road workers ahead or to your side. Watch out for public works crews and equipment.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240204.09.59.19"}