{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Gardens Grow Veggies, Fruit, Flowers and Friendships", "description": "What was once a vacant lot in Linda Vista now blossoms with fresh produce, flowers and budding friendships. The site boasts a new community garden – just one of seven that County Aging & Independence Services (AIS) helped bring to life.", "datePublished": "2024-12-05T17:41:21-08:00", "url": "https://www.countynewscenter.com/community-gardens-grow-veggies-fruit-flowers-and-friendships/", "keywords": ["environment", "aging and independence services", "ais", "community gardens", "county parks", "hhsa", "levant street cottages"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-12-05T18:18:09-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesWhat was once a vacant lot in Linda Vista now blossoms with fresh produce, flowers and budding friendships. The site boasts a new community garden – just one of seven that County Aging & Independence Services (AIS) helped bring to life.\nAIS used state funds to buy supplies like fertilizer, shovels, trowels, garden sheds and more. In all, AIS supports more than 20 new and existing community gardens in various ways.\nThe Bayside Community Center worked with several partners to build the garden located within Linda Vista Park and celebrated its opening in June.\nThe transformed lot attracts new and long-time gardeners alike. The site also draws in people of all ages. You’ll see families with children, college students and older adults. Some live at the newly opened Levant Senior Cottages nearby.\nTwo of the residents met each other working at the garden instead of the complex where they live.\nAnd that’s where community gardens really live up to their name—they create community. They grow food but they are also places to meet people, socialize, learn new skills and forge friendships.\n“It’s so important to have a place where people can gather and make lasting connections,” said Aging & Independence Director Jennifer Bransford-Koons. “No matter what your age, community gardens allow everyone to work together side by side, as well as learn from, and about each other, in ways that foster that sense of community we all need.”\nIntergenerational gardens like these are located throughout the region, with one at the Spring Valley Community Center and another at the Lakeside Community Center. The County Library branch in Ramona also has one.\nIf you’re interested in learning about an AIS supported community garden near you, contact Intergenerational Coordinator Pam Plimpton at pam.plimpton@sdcounty.ca.gov.\nAdditional County-related gardens are located at the Sweetwater Community Garden in Bonita, the Tijuana River Valley Community Garden, Los Peñasquitos Canyon Preserve and Rancho Guajome Adobe.\nThe County also supports the Master Gardener Association of San Diego County. Visit their site to find additional garden locations, and how to start or restore a community garden.\nThese efforts reflect the County’s commitment to sustainability. It is core to the County’s mission and part of the new County vision: a just, sustainable and resilient future for all.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241205.17.41.21"}