{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Hears from Nearly 2,000 People on Impacts of Tijuana River Valley Pollution ", "description": "Nearly 2,000 people who live, work or play around the Tijuana River Valley and South San Diego County beaches have completed the federal Assessment of Chemical Exposures (ACE) survey about how the pollution has impacted their lives.  ", "datePublished": "2024-11-15T14:54:31-08:00", "url": "https://www.countynewscenter.com/county-hears-from-nearly-2000-people-on-impacts-of-tijuana-river-valley-pollution/", "keywords": ["health", "ace survey", "sewage", "south bay", "tijuana river valley"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-11-15T15:20:50-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesNearly 2,000 people who live, work or play around the Tijuana River Valley and South San Diego County beaches have completed the federal Assessment of Chemical Exposures (ACE) survey about how the pollution has impacted their lives.  \nThe County had set a goal of hearing from at least 2,000 people through the ACE survey and plans to leave the survey open through Nov.22 to encourage those who have not yet completed the survey to do so. \nThe County is particularly interested in gathering additional information about exposures children may have experienced while living, going to school or playing in the South Bay.  \n“We are delighted to reach nearly 2,000 surveys already, but we know there are so many more people impacted by the sewage crisis in the area and every one of their voices is really important,” said Dr. Ankita Kadakia, County Interim Public Health Officer. “We’re not just collecting important data, we’re hearing directly from people about how their everyday lives have changed and that’s important as we look at further steps in addressing this crisis with our partners.” \nThe Assessment of Chemical Exposures (ACE) survey is for people who work, live or have visited the areas most impacted by the sewage pollution. It asks about physical and mental health effects, health services used and medical history. Pet health is also included in the survey.  \nThe ACE survey is available online and takes about 20 minutes to complete. Parents or guardians should complete the survey for themselves and each of their children under 18 years old. For older adults and others who need assistance, call (800) 339-4661 to complete the survey over the phone. \nThe County opened the ACE survey on Oct. 21. in partnership with the Agency for Toxic Substances and Disease Registry which is a federal public health agency within the Centers for Disease Control and Prevention (CDC).  \nCounty teams have been doing outreach at community events, through social media and newsletters, and with its partners in schools, businesses, health centers and community organizations. \nThe ACE survey followed the CDC’s Community Assessment for Public Health Emergency Response or CASPER, a household survey focused on the Imperial Beach and Nestor communities that took place the weekend of Oct. 17.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241115.14.54.31"}