{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Updates Raw Milk Salmonella Case Count and Product Recall", "description": "County of San Diego health officials are reporting three additional cases of Salmonella illness linked to unpasteurized or “raw” milk from a producer in Fresno, CA.", "datePublished": "2023-10-25T17:39:38-07:00", "url": "https://www.countynewscenter.com/county-updates-raw-milk-salmonella-case-count-and-product-recall/", "keywords": ["health", "raw milk", "salmonella"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-10-26T09:25:50-07:00", "articleType": "article", "articleContent": "\nCounty of San Diego health officials are reporting three additional cases of Salmonella illness linked to unpasteurized or “raw” milk from a producer in Fresno, CA.   \nThis brings the total number of local cases to 12, including three people who were hospitalized. The cases began in late September and the most recent person became ill on Oct. 17. \nThe California Department of Public Health (CDPH) posted a recall of Raw Farm milk and heavy cream Oct. 24, and a PDF that contains the specific product identification numbers with “best by” dates between Oct. 11 and Nov. 6. Additional raw milk products were not recalled.   \nThe County of San Diego Health and Human Services Agency urges anyone who may have recently purchased Raw Farm LLC raw milk to not consume it and discard the product. \nThe illnesses have been caused by Salmonella bacteria, which is commonly found in human and animal intestines. The 12 San Diego County residents who became ill have reported consuming Raw Farm LLC raw milk the week before they became ill. Cases in other parts of the state are being tracked by CDPH and other local health departments. \nRaw or “natural” milk has not gone through the pasteurization process that heats the milk to a high temperature for a short period of time to kill harmful germs that can contaminate raw milk. These germs can include Salmonella, Listeria, E. coli and other bacteria, viruses and parasites. Pasteurization is the only effective method for eliminating most harmful germs in raw milk or milk products and it does not significantly change dairy’s nutritional value.  \nThis recall is separate from the Salmonella Thompson illnesses linked to Gills Onions Diced Onion products. California has reported 17 cases associated with this Salmonella Thompson outbreak and San Diego has two cases linked to this incident.  Both cases were ill in August and no additional cases have been identified in San Diego since then. \nThe Centers for Disease Control and Prevention recommends against the consumption of raw milk and related products. People most at risk for severe illness are adults 65 years and older, children younger than 5 years of age, and individuals with weakened immune systems.  \nPeople infected with Salmonella generally develop bloody or watery diarrhea, stomach cramps, fever, nausea, vomiting and headache approximately six hours to six days after consuming contaminated foods. \nThe illness typically lasts four to seven days. In some cases, people may develop severe illness that leads to hospitalization.   \nThe County of San Diego Health and Human Services Agency continues working closely with California Department of Public Health and the California Department of Food and Agriculture on investigating illnesses associated with raw milk and milk products. People who have or develop symptoms should reach out to their healthcare provider. More information on raw milk safety is available here. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231025.17.39.38"}