{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Housing and Community Development Services Posting Annual Plan for Public Comment", "description": "The County of San Diego’s Housing and Community Development Services (HCDS) is seeking public input on the Annual Plan draft for fiscal year 2023-2024.  ", "datePublished": "2023-03-01T13:20:58-08:00", "url": "https://www.countynewscenter.com/housing-and-community-development-services-posting-annual-plan-for-public-comment/", "keywords": ["housing", "affordable housing", "hcds", "housing"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-03-03T16:15:55-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Housing and Community Development Services (HCDS) is seeking public input on the Annual Plan draft for fiscal year 2023-2024.  \nThe Annual Plan reviews the housing climate in San Diego and the financial challenges of those served by HCDS. Additionally, the plan identifies specific projects to be funded for the upcoming year through the Community Development Block Grant (CDBG), HOME Investment Partnerships (HOME), Emergency Solutions Grant (ESG), and Housing Opportunities for Persons with HIV/AIDS (HOPWA) federal grant programs. Projects range from community development and housing-related proposals to wraparound services that prioritize the needs of San Diegans. \nThe FY 2023-24 Annual Plan will be published March 3, 2023 at SDHCD.org and in newspapers across San Diego communities. It will be available in multiple languages for review by the public ahead of a public hearing on April 4, 2023. This meeting will also provide the opportunity for additional public comment. \nThe strategy was informed by community input in a process that started in July 2022. More than 7,000 community members were consulted. \nSan Diego County HCDS helps more than 53,800 people live in safe affordable housing. The department maintains more than 6,600 affordable units in 142 developments throughout the County, with more than 14,500 people calling this housing, home. Currently, HCDS is helping fund 16 developments under construction, totaling 1,264 units. In addition, there are 24 developments on the horizon bringing the total of 2,060 units actively under construction or in the works.  \nThese and other endeavors are part of the County’s ongoing response to the region’s housing affordability crisis. Efforts are underway to create a roadmap, or Housing Blueprint, to guide our ongoing response. Community input has been vital to the County’s efforts to address the crisis to date and is encouraged to help inform final recommendations for the Blueprint’s goals and objectives and be presented to the Board of Supervisors.  \nPublic input or comments on the draft FY 23-24 Annual Plan can be submitted via email to Community.Development@sdcounty.ca.gov. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230301.13.20.58"}