{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Don’t Skip Routine Health Care Visits Amid COVID-19 Pandemic", "description": "The County of San Diego Health and Human Services Agency is urging San Diegans not to delay routine medical and dental care amid the COVID-19 pandemic.", "datePublished": "2020-11-06T11:10:10-08:00", "url": "https://www.countynewscenter.com/dont-skip-routine-health-care-visits-amid-covid-19-pandemic/", "keywords": ["health", "coronavirus", "covid-19", "dental care", "preventative care"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-11-06T11:49:14-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is urging San Diegans not to delay routine medical and dental care amid the COVID-19 pandemic.\nPhysicians and dentists across the county are reporting that fewer patients are scheduling annual medical and routine preventive dental visits. County health officials are concerned about this trend because delaying necessary care can cause more severe health issues in the future.\n“Regular visits to your primary care physician and dentist are essential self-care activities that can prevent painful procedures and costly medical bills down the line,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Detecting and treating chronic conditions is especially important during this pandemic because people with underlying conditions are at a higher risk of poor outcomes of COVID-19.”\nAt the very beginning of the pandemic, health officials urged the public to seek care only for urgent and emergency procedures due to a desire to conserve personal protective equipment for medical providers in hospitals, and because of concerns about possible transmission of SARS-CoV-2, the virus that causes COVID-19.\nSince then, the Centers for Disease Control and Prevention and American Dental Association (ADA) have developed science-based recommendations for enhanced infection control procedures for medical and dental offices.\nEnhanced Safety Procedures at Dental Offices\nLocal dentists have worked diligently to implement measures to prevent the spread of COVID-19. Dental offices have equipped staff with additional personal protective equipment and have boosted their disinfection procedures to keep patients safe during their visits.\n“Dentists have long been leaders in the area of infection control and dental providers have continuously implemented the evolving guidance from government agencies and the ADA to keep their patients safe and healthy,” said Thomas Olinger, D.D.S., County Chief Dental Officer. “Going to the dentist is safe and we strongly urge San Diegans to resume routine dental appointments.”\nCounty residents who would like to seek dental care but do not have a dentist, can call 2-1-1 San Diego for a referral or visit the 2-1-1 San Diego Health & Wellness website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201106.11.10.10"}