{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to offer Multiple Services at PRIDE Festival", "description": "The County of San Diego is joining in this weekend’s PRIDE celebration, offering services that include Mpox vaccinations, resources at cool zones, rapid HIV testing and “Check Your Mood” screenings. ", "datePublished": "2023-07-12T15:58:07-07:00", "url": "https://www.countynewscenter.com/county-to-offer-multiple-services-at-pride-festival/", "keywords": ["health", "county services", "mpox", "pride", "vaccines"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-07-13T13:28:48-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is joining in this weekend’s PRIDE celebration, offering services that include Mpox vaccinations, resources at cool zones, rapid HIV testing and “Check Your Mood” screenings. \nCounty Public Health Services will have the Live Well on Wheels (Live WoW) set up just outside PRIDE Festival grounds—on El Prado between Sixth Avenue and Balboa Drive— on Saturday, July 15 to offer vaccinations and provide educational materials. The no-cost Mpox and COVID-19 vaccines will be offered by public health nurses from 11:30 a.m. to 5 p.m. Appointments are not needed.  \nInside the festival, the County will also be offering rapid HIV testing on Saturday, July 15 from 12 to 7 p.m. and Sunday, July 16 from 11 a.m. to 6 p.m. People can also pick up information on PrEP, Mpox and Take Me Home Testing. \nThe County’s Aging and Independence Services will provide information on resources and services available for older adults at the Senior Cool Zone. It will open from 11 a.m. to 6 p.m. on Saturday and Sunday to provide a free area for older adults to cool off with fans and refreshments. \nFestivalgoers are also invited to stop by the County’s Homeless Solutions and Equitable Communities booth for interactive mental health activities including “Check Your Mood” screenings and Live Well San Diego swag bag giveaways.   \nThe JYNNEOS vaccine that helps protect against Mpox is recommended for people at risk for Mpox including men who have sex with men and transgender women. \nPeople who previously received the first dose of JYNNEOS should get a second dose of the vaccine. Two doses of the JYNNEOS vaccine increase protection against Mpox, reduce the spread of Mpox and lessen symptoms if an infection does happen.  \nThe Mpox vaccine can also be given to people after exposure to Mpox to help prevent getting the infection or reduce symptoms if infection does occur. \nAlong with being vaccinated, other steps people should take to protect themselves from getting Mpox include avoiding close, skin-to-skin contact, including intimate contact, with someone who has Mpox. \nFor more information about Mpox, including where to find the vaccine, visit sandiegocounty.gov/mpox and sign up for text updates by texting COSD MPOX to 468-311. \nIn addition, several other County departments are participating in Pride including the Office of Equity and Racial Justice, Library, Human Resources, Probation, Public Defender’s Office and Sheriff’s Department.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230712.15.58.07"}