{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Impending Heat Wave Brings Fire Danger", "description": "High temperatures often lead to high fire danger.  Not using power tools — including lawn mowers — outside during dangerous fire weather is recommended to avoid sparks igniting grass or brush fires.", "datePublished": "2023-07-10T17:28:50-07:00", "url": "https://www.countynewscenter.com/impending-heat-wave-brings-fire-danger/", "keywords": ["public safety", "fire prevention", "fire safety", "heatwave"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-07-10T17:28:50-07:00", "articleType": "article", "articleContent": "\nHigh temperatures often lead to high fire danger.  Not using power tools — including lawn mowers — outside during dangerous fire weather is recommended to avoid sparks igniting grass or brush fires.\nMaintain defensible fire-space around homes by removing dead leaves, debris and other flammable items that can be ignited from an ember.\n\nIf you do choose to cut away and remove dead and dying plants near your homes or structures, use hand tools only.\nBe particularly careful with smoking materials to avoid accidentally starting a fire.\nNever pull your vehicle over in grass as it can ignite a grass fire. Make sure your vehicle is well maintained as faulty catalytic converters have been a major cause of accidental fires in San Diego County.\n\n\nIf you have a trailer on your vehicle, make sure the chains don’t drag on the ground while driving and spark a fire.\n\nBe Emergency Ready\nCounty public health and animal officials offer various tips to keep yourself, your friends and family and pets safe from heat illnesses.\nAn important factor in being prepared is to stay informed in the event of a regional emergency.\n\nResidents can download the County’s SD Emergency app in English or Spanish from the Google Play or Apple App stores. The app provides news updates, maps, shelter locations and includes disaster planning templates and interactive checklists. If a regional emergency, such as a wildfire, does occur, updates and other information will be posted at sdcountyemergency.com  and sent out via the app.\nRegister for AlertSanDiego  or at ListoSanDiego, the County’s cell phone notification service. By doing that, you will receive any emergency messages such as evacuation warnings that apply to your neighborhood on your cell phone.\nDon’t wait until an emergency, when you’re already stressed to figure out what you need to do in the event of an evacuation. Complete a family disaster plan template from the app or from ReadySanDiego.org to help your family plan for an emergency including where to meet if you are separated and cannot return home.\nYou can also stay in touch with official emergency information by following CAL FIRE/San Diego County Fire on Twitter in the event of a fire. More weather forecast information and updates are available at the National Weather Service.\n\nTo find more information about safeguarding your home from wildfires and general disaster preparation, visit ReadySanDiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230710.17.28.50"}