{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Fire Reaches New Heights with Mt. Laguna Fire Station", "description": "County Fire, CAL FIRE and the community of Mt. Laguna on Wednesday celebrated the completion of the County’s highest elevation fire station, sitting at about 6,000 feet. “I am honored to recognize the grand opening of Mt. Laguna Fire Station #49,” shared Supervisor Joel Anderson.", "datePublished": "2022-05-05T17:50:03-07:00", "url": "https://www.countynewscenter.com/?p=208431", "keywords": ["government"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-05-09T14:58:26-07:00", "articleType": "article", "articleContent": "\nCounty Fire, CAL FIRE and the community of Mt. Laguna on Wednesday celebrated the completion of the County’s highest elevation fire station, sitting at about 6,000 feet.\n“I am honored to recognize the grand opening of Mt. Laguna Fire Station #49,” shared Supervisor Joel Anderson. “I am thankful for all the firefighters and staff that keep our County safe—and I am hopeful that this strategically placed fire station will help them do just that.”\nThe building is shared with County Department of Public Works crews, who are responsible for maintaining roads, including plowing snow or clearing debris following storms.\n\nhttps://www.countynewscenter.com/wp-content/uploads/IMG_3785-1920.mp4\nStation 49 has 5,000 feet of floor space including the area for two fire trucks.  It also includes sleeping quarters for 6 firefighters, a living area, kitchen, office space and gym. There is also a second story balcony so firefighters can enjoy the outdoor environment. The station was built using fire-resistive materials as it is in a high wildfire area.\nThe site also has very specific lighting systems to maintain the light pollution standards of the International Dark-Sky Association, so it does not impede the research performed at the Mt. Laguna Observatory near the station.\nCAL FIRE San Diego Chief Tony Mecham said, “The new fire station is the beautiful end result of working with the community and former volunteer fire department to assure the continuance of fire protection and emergency medical services on Mt Laguna.”\n\n\n\n\n\n\t\t\t\tWorkout room inside Mt. Laguna Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tCAL FIRE water tender 49 in the bay of Mt. Laguna Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tEntrance to the living quarters of Mt. Laguna Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tCAL FIRE Chief Tony Mecham speaking to community at Mt. Laguna Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tDeputies watching ribbon cutting celebration at Mt. Laguna Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tSusan Raimond, former Assistant Chief for the Mt. Laguna Volunteer Fire Department addressing the community at the opening of Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tDignitaries and community members cutting the ribbon on Mt. Laguna Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tSupervisor Joel Anderson and CAL FIRE Chief Tony Mecham\n\t\t\t\t\n\n\n\n\n\t\t\t\tPlaque outside Mt. Laguna Fire Station 49\n\t\t\t\t\n\n\n\n\n\t\t\t\tDining table with CAL FIRE seal and San Diego County Fire seal\n\t\t\t\t\n\n\n\n\n\t\t\t\tSupervisor Joel Anderson speaking to the community at the ribbon cutting of Mt. Laguna Fire Station 49\n\t\t\t\t\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220505.17.50.03"}