{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches Community-Driven Initiative to Address Inequity", "description": "The County’s Office of Equity and Racial Justice has launched a new initiative that will invest $2 million over two years into community-driven initiatives that address inequity.", "datePublished": "2023-12-11T09:47:55-08:00", "url": "https://www.countynewscenter.com/county-launches-community-driven-initiative-to-address-inequity/", "keywords": ["government", "equitable communities", "office of equity and racial justice", "systemic bias"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-12-11T11:22:00-08:00", "articleType": "article", "articleContent": "\nThe County’s Office of Equity and Racial Justice (OERJ) has launched a new initiative that will invest $2 million over two years into community-driven initiatives that address inequity. \nThe Equity Impact Grant (EIG) program will provide small, local organizations with general operating funds, tailored coaching and capacity-building support.\nOERJ was established in 2020 to strengthen the County of San Diego’s commitment to racial equity and with the intent that race no longer be a determining factor in any person’s life outcomes. This requires addressing structural racism – the ways that racism operates within and across systems, institutions and history to reinforce and maintain racial disparities.\nFollowing its creation, the office held a series of listening sessions to understand how the County could take action to meet the immediate needs of community members while helping counteract the effects of structural racism on the region’s Black, Indigenous and people of color (BIPOC) communities and other marginalized groups.\nA common point of feedback was the suggestion that ways to address the challenges that small, grassroots and minority-led organizations experience when applying for government contracts and philanthropic funding should be identified. As a result, OERJ developed this pilot program with The Nonprofit Institute at the University of San Diego (NPI) to build capacity among smaller organizations and bridge the gaps expressed by the community.\nEach year, 10 San Diego-based social impact organizations will receive a grant of $100,000 in general operating funds alongside workshops and coaching from NPI on topics like leadership, nonprofit governance, social change and innovation, fundraising, power-building, collective impact and organizational resiliency. \n“The EIG program was created to invest in community-driven efforts while complementing the strengths, expertise and cultural wisdom that many BIPOC-led and-centered organizations possess to reduce inequity across sectors and systems within the County,” said Andrew Strong, director of OERJ. “We look forward to seeing the breadth of opportunities through this program to aid in rooting out systemic racism.”\nTo make the most impact, the EIG program will target organizations with fewer than five employees and an operating budget of less than $500,000 in the San Diego region. \nThe EIG program seeks organizations that are addressing inequalities and forms of systemic marginalization in the following categories: \n\nEducation & youth empowerment (early childhood through higher/continuing education).  \nCivic engagement and movement building.  \nArts, narrative change & culture. \nHousing & community development. \nRestorative justice & alternatives to incarceration. \nHealth and healing. \nWealth building, workforce & economic development. \nFood systems and environmental justice. \n\nThe application period runs from December 11, 2023, to January 26, 2024, with award announcements scheduled for early March. There will be in-person and virtual information sessions with representatives from OERJ and NPI in January. More information is available on the Equity Impact Grant program page.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231211.09.47.55"}