{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "No Tricks, Just Pet Treats", "description": "County shelter pets are trick or treating for homes early this year and they will wear nearly anything for treats! Adoptable pets dressed up as a “harey” witch, a lettuce vampire, two wiggly jack-o-lanterns, a slobbery-kissy fairy, King Meow II, a rootin,’ tootin’ cowboy and a “dreaded” pirate.", "datePublished": "2024-10-10T10:24:08-07:00", "url": "https://www.countynewscenter.com/no-tricks-just-pet-treats/", "keywords": ["animals", "adopt pets", "das", "free pet adoptions", "halloween"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-10-10T10:24:08-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesCounty shelter pets are trick or treating for homes early this year and they will wear nearly anything for treats! Adoptable pets dressed up as a “harey” witch, a lettuce vampire, two wiggly jack-o-lanterns, a slobbery-kissy fairy, King Meow II, a rootin,’ tootin’ cowboy and a “dreaded” pirate.\nAdd “fun-kin spice” to your spooky season by adopting or fostering one or more of County shelter pets. To sweeten the deal, County Animal Services is offering a Halloween treat to all: Free pet adoptions, if you mention that you saw our costumed animal ambassadors on a County site.\nAll animals adopted from County shelters will be spayed or neutered, have vaccinations, a microchip and a one-year license for dogs in the service area.\nPlease visit County Animal Services’ Adoptions page and browse the “bootiful” animals that will make your heart pound with love. Currently, the shelters have cats, dogs, pigs, guinea pigs, roosters, along with a rabbit, a tortoise and a chinchilla available now. Animal Services staff recommend that people pick out a second and third choice too, just in case your first choice is already chosen by another person.\nIf you’re not sure, consider fostering a pet to see if it is a good fit, or just to give him or her a break from the shelter environment. Pets benefit tremendously from being in a home environment and learning how to be part of a family. All basic care supplies such as food, leash, and bedding, are included as part of the program.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nCounty Animal Services is committed to the safety and welfare of animals and the community. Through education, adoption, and compassionate care, it works to provide homes for adoptable animals while promoting responsible pet ownership.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241010.10.24.08"}