{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "CAL FIRE Eyes Camp Fox For New Fire Center", "description": "County Fire and CAL FIRE are working to turn a sixth grade camp site at the base of Palomar Mountain into a fire center to train new fire fighters. Today, a board letter from Supervisor Jim Desmond recommended the County finalize an agreement with CAL FIRE to use the Camp Fox site as a wildland fire...", "datePublished": "2022-05-24T16:48:00-07:00", "url": "https://www.countynewscenter.com/?p=208585", "keywords": ["public safety", "cal fire", "camp fox", "county fire", "firefighters", "fox fire center", "palomar mountain", "sixth grade camp", "supervisor jim desmond"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-05-24T17:00:56-07:00", "articleType": "article", "articleContent": "\nCounty Fire and CAL FIRE are working to turn a sixth-grade camp site at the base of Palomar Mountain into a fire center to train new firefighters. Today, a board letter from Supervisor Jim Desmond recommended the County finalize an agreement with CAL FIRE to use the Camp Fox site as a wildland firefighting base.  The Camp Fox property was owned by the County, but transferred to the San Diego County Office of Education in 1977.  It is now transferring back to the County.\nThe new Fox Fire Center is already being updated by CAL FIRE. When it is complete, four CAL FIRE hand crews will live at the property to help provide 24-hour wildland fire protection coverage.  The crews will train daily in wildland fire prevention, education and suppression exercises such as hose lays, brush cutting, line cutting, and tree falling. CAL FIRE Recruits will also conduct prescribed fire burning, brush clearing for defensible space and fuel reduction in surrounding communities.\n“This is an exciting win for the County and a great opportunity to further support wildland fire suppression in the back country,” said District 5 County Supervisor Jim Desmond. “I want to thank our County Fire Staff for making this possible.”\nCounty Fire Director Jeff Collins said, “It is great to see the County, CAL FIRE and the San Diego County Office of Education work together to secure this exceptional location to prepare our professional firefighters and better protect the region.”\nThe Fox Fire Center is now housing two firefighter hand crews per day.  The crews are working to clean up the site and complete general maintenance to the former sixth-grade camp.\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220524.16.48.00"}