{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Identifies Third Probable Case of hMPXV", "description": "The County of San Diego Health and Human Services Agency has identified an additional probable case of hMPXV, also known as human monkeypox, bringing the total probable case count in the region to three.", "datePublished": "2022-06-17T16:51:24-07:00", "url": "https://www.countynewscenter.com/county-identifies-third-probable-case-of-hmpxv/", "keywords": ["health", "hmpxv", "human monkeypox", "monkeypox"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-06-17T16:51:24-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency has identified an additional probable case of hMPXV, also known as human monkeypox, bringing the total probable case count in the region to three.\nAll probable cases must be verified by the Centers for Disease Control and Prevention (CDC) and that process can take several days. The two prior probable cases reported by the County on Wednesday have not been verified by the CDC yet.\nCounty health officials say this most recent case has no connection or relation to the first two probable cases, but like the other two, the individual also recently traveled internationally.\nCurrently, the individual is in isolation and although symptomatic, the patient is doing well and is not hospitalized.\n“All three individuals with probable cases of hMPXV here in the region are doing well and are managing their symptoms in home isolation,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Most individuals who become infected experience mild to moderate symptoms and the risk of contracting the virus remains very low for the general population.”\nGoing forward, the County will provide weekly updates on the hMPXV situation in the region on Fridays. The County’s hMPXV website will be updated by 5 p.m. each Friday, excluding holidays.\nAs of Friday, the CDC has confirmed 113 hMPXV cases in 20 states and the District of Columbia, with California (24), New York (21) and Illinois (15) seeing the largest number of cases.\nAbout hMPXV\nhMPXV, or human monkeypox is a viral infection that can spread through contact with body fluids, sores on the body of someone who has hMPXV, or shared items (e.g., clothing and bedding) that have been contaminated with fluids from sores of a person with hMPXV.\nThe disease can also spread between people through saliva or respiratory droplets, typically between people in a close setting. Although hMPXV is not generally considered a sexually transmitted disease, it can be transmitted during sex through skin-to-skin and other intimate contact, regardless of gender or sexual orientation.\nThe virus is not known to linger in the air and is not transmitted during short periods of shared airspace.\nCases of hMPXV have previously been identified in travelers from, or residents of, countries in western and central Africa, where the disease is considered to be endemic. Since May 2022, hMPXV cases have been reported in several non-endemic countries, including the United States. No deaths have been reported.\nhMPXV Symptoms\nSymptoms of hMPXV are similar to, but milder than, the signs and symptoms of smallpox. They include:\n\nFever\nHeadache\nMuscle aches\nBackache\nSwollen lymph nodes\nChills\nExhaustion\n\nA rash usually develops within 1 to 3 days after the appearance of fever. The rash often begins on the face and then spreads to other parts of the body.\nMost people who develop hMPXV experience symptoms 7 to 14 days (and up to 21 days) after exposure.\nThe majority of people who become infected have a mild illness that improves without treatment over 2 to 4 weeks. hMPXV is contagious and can spread to others until scabs have fallen off and a new layer of skin has formed.\nWhat People Should Do\nAnyone who thinks they may have symptoms of hMPXV, including unusual rashes or lesions, should contact a healthcare provider right away. Cover the area of the rash with clothing, wear a mask and avoid skin-to-skin or close contact with others until the symptoms are medically evaluated.\nFor more information on hMPXV, please visit https://www.sandiegocounty.gov/content/sdc/hhsa/programs/phs/community_epidemiology/dc/human-monkeypox.html\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220617.16.51.24"}