{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Protect Yourself and Others – Face Coverings Required in Public", "description": "Beginning May 1, all San Diego County residents will be required to wear cloth face coverings in public when within 6 feet of another person who is not a household contact.", "datePublished": "2020-04-30T17:31:05-07:00", "url": "https://www.countynewscenter.com/protect-yourself-and-others-face-coverings-required-in-public/", "keywords": ["health", "coronavirus", "covid-19", "face coverings"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-30T17:31:05-07:00", "articleType": "article", "articleContent": "\nBeginning May 1, all San Diego County residents will be required to wear cloth face coverings in public when within 6 feet of another person who is not a household contact.\n“When you wear a face covering, you protect those around you,” said Wilma Wooten, M.D., M.P.H., County public health officer, “When others use a face covering, they protect you.”\nThe cloth facial coverings, which will be required until further notice, don’t have to be hospital grade but should cover the nose and mouth.\nHomemade masks, bandanas, scarves and neck gaiters are acceptable, since these items can be washed and reused. Facial coverings don’t need to be used when people are at home.\nAccording to the Centers for Disease Control and Prevention, cloth face coverings should:\n\nFit snugly but comfortably against the side of the face\nBe secured with ties or ear loops\nInclude multiple layers of fabric\nAllow for breathing without restriction\nBe able to be laundered and machine dried without damage or change to shape\n\nCloth face coverings are an important safety practice for the public to follow to prevent COVID-19 droplet transmission, according to the CDC and the California Department of Public Health.\nResidents are still required to stay at home as much as possible, practice social distancing of at least 6 feet, and use other public health measures, such as frequent handwashing, sanitizing protocols and staying home when sick.\nWhere to Wear Coverings\nFace coverings must be worn in public settings, such as:\n\nWaiting in line to go inside a store\nShopping in a store\nPicking up food at a restaurant\nWaiting for or riding on public transportation\nRiding in a taxi or ride service vehicle\nSeeking health care\nGoing into facilities allowed to stay open\nWorking an essential job that interacts with the public\n\nFace coverings will be required in public until further notice.\nFace coverings will not be required:\n\nAt home\nIn the car alone or with members of the same household\nWhen advised by a medical doctor\nFor children under 2 years old due to the risk of suffocation\nWhen swimming, walking, hiking, bicycling or running provided there is social distancing\n\n“People must have a face covering readily accessible to put on in populated areas to avoid droplet spread in a six feet radius when participating in any type of active recreation,” Wooten said.\nLocal business must:\n\nRequire employees, contractors, owners and volunteers to wear a face covering at work and when working off-site\nInform customers about wearing a face covering, including posting signs and advising those in line or in the store\nRefuse service to anyone not wearing a face covering\n\nWill Citations Be Issued? \nThe primary goal of the face coverings is for San Diegans to protect each other by following public health orders. It would be unreasonable to expect law enforcement to patrol individual face covering adherence.\nHowever, people who choose not to wear face coverings may be cited and denied access to businesses, transit or recreational areas.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200430.17.31.05"}