{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Traveler to China Tested Negative for New Coronavirus", "description": "A San Diego County resident who visited Wuhan, China and developed a respiratory illness after returning home has tested negative for the novel (new) coronavirus, the County Health and Human Services Agency announced today.", "datePublished": "2020-01-30T17:24:53-08:00", "url": "https://www.countynewscenter.com/traveler-to-china-tested-negative-for-new-coronavirus/", "keywords": ["health", "coronavirus"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-31T13:37:41-08:00", "articleType": "article", "articleContent": "\nA San Diego County resident who visited Wuhan, China and developed a respiratory illness after returning home has tested negative for the novel (new) coronavirus, the County Health and Human Services Agency announced today.\nThe Centers for Disease Control and Prevention (CDC) confirmed the results today and San Diego County currently has no other patients under investigation.\nHHSA has been closely monitoring this new strain of coronavirus, currently called 2019-nCoV, which has caused an outbreak of respiratory illnesses in China.\nCounty health officials has been working with CDC, the California Department of Public Health and the local medical community to identify, isolate, and test any possible case of the respiratory illness in a traveler who meets the current CDC definition who should be investigated.\n“We are monitoring this new virus just like we would any infectious disease,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We are prepared and conducting surveillance to keep this virus from spreading locally.”\nCoronaviruses are a large family of viruses that are common in many different species of animals, including camels, cattle, cats and bats.\nRarely, animal coronaviruses can infect people and then spread between people such as with Middle East respiratory syndrome and severe acute respiratory syndrome. Many of the patients in the pneumonia outbreak caused by 2019-nCov in Wuhan, China had some link to a large seafood and live animal market, suggesting animal-to-person spread. However, a growing number of patients diagnosed with 2019-nCoV have not reported exposure to animal markets, indicating person-to-person spread is occurring.\nThere now has been person-to-person spread in the United States, and there have been several cases diagnosed in the nation to date.\nLow Risk of Infection\nLast week, HHSA issued a health alert to the local medical community asking them to be on the lookout for and report potential cases in people who have traveled to the areas where cases of this new virus (2019-nCoV) have been reported.\nWhen a potential case is identified, a specimen is collected, sent to the County Public Health Lab for packaging and then sent to CDC for testing. Currently, CDC is the only entity in the country capable of testing for this novel coronavirus.\nCurrently, the risk of infection for the general public is minimal. People who have not traveled to an area where the virus has been detected or had close contact with a patient who tested positive for this type of coronavirus have a very low risk of infection.\nWhat to Do if You’ve Traveled to an Impacted Area?\nCurrently, 20 airports across the nation —including San Diego — are monitoring returning travelers from areas impacted with this new strain of coronavirus.\nPatients with confirmed 2019-nCoV infection have reported mild to severe respiratory illness with symptoms of:\n\nfever\ncough\nshortness of breath/difficulty breathing\n\nAt this time, CDC believes that symptoms of 2019-nCoV may appear in as few as 2 days or as long as 14 days after exposure.\nWooten added that people should avoid all non-essential travel to China.\nHow to Protect Yourself from Coronaviruses\nPractice everyday preventive actions to help prevent the spread of respiratory viruses, including:\n\nWash your hands often with soap and water for at least 20 seconds. If soap and water are not available, use an alcohol-based hand sanitizer.\nAvoid touching your eyes, nose, and mouth with unwashed hands.\nAvoid close contact with people who are sick.\nStay home when you are sick.\nCover your cough or sneeze with a tissue, then throw the tissue in the trash.\nClean and disinfect frequently touched objects and surfaces.\n\n“These everyday habits can help prevent the spread of several viruses, including influenza,” Wooten said.\nFor more information about 2019-nCoV, visit the CDC website or HHSA Epidemiology Unit website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200130.17.24.53"}