{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Shelters Offer Pet Adoption Special", "description": "Looking for companionship, somebuddy who loves you to go on long walks on the beach with or just cuddle with on the couch? Wouldn’t it be great if he or she jumped up and down when you got home? Forget Tinder. People aren’t always truthful on those sites.   ", "datePublished": "2020-02-10T10:07:16-08:00", "url": "https://www.countynewscenter.com/county-shelters-offer-pet-adoption-special/", "keywords": ["animals", "pet adoptions", "valentine s day"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-02-10T10:20:55-08:00", "articleType": "article", "articleContent": "\nLooking for companionship, somebuddy who loves you to go on long walks on the beach with or just cuddle with on the couch? Wouldn’t it be great if he or she jumped up and down when you got home? Forget Tinder. People aren’t always truthful on those sites.   \nBut animals are loyal, faithful friends who always lend an ear whether you have great news to share or  are feeling blue. A dog or cat could be the best Valentine’s Day present to yourself ever.  \nThe County Department of Animal Services will be holding a Valentine’s dog and cat adoption special from Feb. 11 through Feb. 16 to help you find your new love monster. Any dog or cat, over the age of six months, can be yours for $14. \n“Chocolates are quickly eaten and roses will eventually wilt, but an adopted animal’s love for their new family will last a lifetime,” County Animal Services Director Dan DeSousa said.  \nIf you’d like to see all the animals, stop by the shelter or visit the adoptions page. If you absolutely fall in love with one, don’t delay because adoptions are on a first-come, first-served basis. Be aware that each adoption could take up to two hours.  To speed up the process, go online, download the adoption application and fill it out at home. Renters should also bring a copy of their lease to show it’s OK to have a pet at their home. \nWhen you find a pet you want to adopt, bring their ID number shown on the front of the kennel to the Greeter Desk.  \nIf you currently have another dog, you may consider bringing him or her with you to see how he or she interacts with a new dog. Families are also welcome and may get to spend time with the dog or cat to see if the adoption will be a good fit. \nCurrently, more than 51 are available at the County’s two animal care facilities located in Bonita and Carlsbad. All the adopted animals will be spayed or neutered, and microchipped before they go home. Vaccinations will also be up to date on dogs and cats. \nShelter hours are 9:30 a.m. to 5:30 p.m., but adoptions close at 4 p.m. Normal adoption fees are: kittens under the age of 6 months, $75; cats, $65; puppies under the age of 6 months, $100; dogs, $75. \nFor more information about County Animal Services, visit sddac.com or call (619) 767-2675. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200210.10.07.16"}