{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Postcards Go Out to Registered Voters", "description": "The Registrar of Voters has mailed over 1.9 million postcards to registered voters in San Diego County informing them of their voting options for the June 7, 2022 Gubernatorial Primary Election.", "datePublished": "2022-02-28T11:43:03-08:00", "url": "https://www.countynewscenter.com/postcards-go-out-to-registered-voters/", "keywords": ["elections", "2022 gubernatorial primary election", "fgg", "june 7", "more days to vote", "postcards", "registrar of voters", "voting options"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-02-28T12:24:11-08:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters has mailed over 1.9 million postcards to registered voters in San Diego County informing them of their voting options for the June 7, 2022 Gubernatorial Primary Election.\nThis will be the first countywide election conducted under the Voter’s Choice Act. Under the act, every active registered voter will automatically receive a ballot in the mail and will have three options for returning that ballot: by mail, to one of the Registrar’s secure ballot drop box locations, or at any vote center in the county. Ballots will start going out in the mail the week of May 9, giving voters nearly a month to mark their ballot and return it before Election Day.\nVoters also have the choice to vote in-person at any one of over 200 vote centers located across the county, which will be open over multiple days. Elections are no longer a one-day event, and there is no need to wait until Election Day to vote.\nThe concept won’t be entirely new to San Diego County voters. The Registrar’s office used a similar format for the November 2020 presidential general and September 2021 gubernatorial recall elections.\nThe Registrar’s office anticipates opening approximately 130 ballot drop box locations starting May 9. Over 200 vote centers will open for four days starting June 4. Nearly 40 of those vote centers will open earlier, May 28, giving voters 11 days to cast their ballots.\nA list of ballot drop box and vote center locations will be available by April 1 at sdvote.com.\nWhat do you need to do?\nBe vote ready!\n\nCheck your voter registration information. Make sure your residence, and if different, your mailing address is up to date.\nHave you recently moved or changed your name? Whether you’re new to San Diego County or just moved down the street, you need to re-register to vote. You can do this by completing a new registration online at sdvote.com.\nAre you a first-time voter? Register to vote – it takes less than two minutes.\n\nLearn more about voting in the gubernatorial primary election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220228.11.43.03"}