{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Register to Vote by Oct. 21 for November Presidential General Election", "description": "If you want to vote in the November Presidential General Election, you must register by Monday, Oct. 21 to receive a ballot in the mail.", "datePublished": "2024-10-18T11:00:32-07:00", "url": "https://www.countynewscenter.com/register-to-vote-by-oct-21-for-november-presidential-general-election/", "keywords": ["elections", "2024 presidential general election", "conditional registration", "conditional voter registration", "county registrar of voters", "fgg", "nov. 5 presidential general election", "register to vote"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-10-18T11:33:36-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIf you want to vote in the November Presidential General Election, you must register by Monday, Oct. 21 to receive a ballot in the mail. Otherwise, you will need to make a trip in person to the Registrar’s office in Kearny Mesa or visit a vote center starting Saturday, Oct. 26 to conditionally register and vote provisionally through Nov. 5.\nRegistering to vote is quick and easy and can be done online at sdvote.com. You will need to register to vote if you:\n\nare not registered in San Diego County\nrecently moved\nchanged your name\n\nIf your signature is confirmed through records at the California Department of Motor Vehicles, your registration will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the form, sign it and return it to the Registrar’s office by 5 p.m. on Oct. 21.\nRegistration forms must be postmarked or delivered to the Registrar’s office by Oct. 21. Voters may also register online until midnight.\nIf you don’t have access to a computer, you may request a registration form by calling (800) 696-0136 or emailing rovmail@sdcounty.ca.gov.\nNot sure if you’re registered to vote? Check your registration status online at sdvote.com.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday.\nIf you prefer to vote in person and avoid long lines, 39 vote centers will open daily from 8 a.m. to 5 p.m. starting Saturday, Oct. 26.\nOn Saturday, Nov. 2, over 200 locations will be available. The vote centers will be open daily from 8 a.m. to 5 p.m. through Nov. 4. On the final day of voting, Nov. 5, all vote centers and official ballot drop boxes will be open from 7 a.m. to 8 p.m.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online on the election information page at sdvote.com.\nLearn more about voting in the November Presidential General Election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241018.11.00.32"}