{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County and Local Law Enforcement Hand Out Naloxone Kits to Save Lives", "description": "The County and Sheriff’s department announced the expansion of a partnership for the distribution of naloxone as part of a Comprehensive Harm Reduction Plan to help fight the illicit fentanyl crisis.", "datePublished": "2023-01-23T17:49:42-08:00", "url": "https://www.countynewscenter.com/?p=210622", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-01-23T17:49:42-08:00", "articleType": "video.other", "articleContent": "\nThe County and Sheriff’s department announced the expansion of a partnership for the distribution of naloxone as part of a Comprehensive Harm Reduction Plan to help fight the illicit fentanyl crisis. Sheriff’s deputies, first responders and other law enforcement agencies will hand out the kits, which can reverse the effects of an overdose, to people who may be at risk or know someone at risk of overdose. Each kit contains a box of naloxone with two nasal sprays and instructions in both English and Spanish.\nDrug overdoses are at crisis levels. A recent Medical Examiner Report shows accidental deaths involving drugs or alcohol have increased 139 percent in the past five years. In 2021, fentanyl was responsible for 62 percent of overdose deaths. For children and infants under five years of age, Rady Children’s Hospital reports accidental fentanyl ingestion has increased 1,600 percent in the past four years.\nNaloxone is a needle-free medication sprayed up a person’s nose that reverses the effects of an opioid overdose. It is safe, effective, and easy to use. A countywide public health order allows public health centers and outreach workers to provide naloxone to anyone.\nThe County offers numerous prevention and treatment programs across the region. People seeking help should call the San Diego County Access and Crisis Line 888-724-7240 or 2-1-1 San Diego. These resources are available 24 hours a day, seven days a week.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230123.17.49.42"}