{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Sheriff Helicopters Serve as a Regional Public Safety Asset", "description": "Two new state-of-the-art helicopters joined the San Diego County Sheriff's Department air fleet as part of the department’s commitment to safeguarding communities. ", "datePublished": "2023-11-21T12:11:38-08:00", "url": "https://www.countynewscenter.com/new-sheriff-helicopters-serve-as-a-regional-public-safety-asset/", "keywords": ["public safety", "aerial assets", "firefighting helicopters", "patrol helicopter", "sheriff kelly a. martinez"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-11-21T12:43:50-08:00", "articleType": "article", "articleContent": "\nTwo new state-of-the-art helicopters joined the San Diego County Sheriff’s Department air fleet as part of the department’s commitment to safeguarding communities.\nSheriff Kelly A. Martinez unveiled the new fire helicopter and patrol helicopter, a $21 million investment for the two, this week at the Aerial Support to Law Enforcement Agencies base in El Cajon.\nThese helicopters support first responders in meeting the demands of their critical roles. They represent a commitment to regional safety and preparedness and will be used whenever they are needed, she said.\nEvery second counts in an emergency. The new helicopters are a regional asset and significantly enhance the department’s ability to respond to emergencies.\nThe new fire helicopter is the 412EPX. It is designed to operate in challenging environments and weather conditions typically encountered during firefighting missions. The Sheriff Department cooperative work with CAL FIRE will continue with seven firefighters on board the 412 during fire calls. These coordinated efforts are crucial in stopping fires before they become catastrophic.\n“The new Helicopter will dramatically improve our response to both wildfires and our ability to rescue people in remote areas,” said Tony Mecham, County Fire and CAL FIRE San Diego Unit Chief.\nPhotos and video below courtesy of the San Diego County Sheriff’s Department\nThe new patrol helicopter is the 407GXi. It is dedicated to law enforcement operations24 hours a day and has a cutting-edge flight deck with precision navigation allowing pilots to accurately track and respond to incidents. Its powerful engine makes it fast in responding to emergencies and it is equipped with a bucket to help with water drops during a fire mission.\nThe ASTREA aviation unit has been providing aerial support to the Sheriff’s Department and partner agencies across the county since 1971. ASTREA averages nearly 6,000 missions per year to support patrol, as well as fire and rescue calls throughout the region.\nFunding for the helicopters came from the department’s budget and Proposition 172 money.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231121.12.11.38"}