{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s Time to ‘Check Your Mood’", "description": "How have you been feeling lately? It’s an important question we should all ask each other – and ourselves – from time to time to ensure continued emotional well-being. The County will host its annual Check Your Mood Day Oct. 6 to encourage San Diegans to get screened for depression and assess their mental health.", "datePublished": "2022-10-04T12:15:37-07:00", "url": "https://www.countynewscenter.com/its-time-to-check-your-mood-2/", "keywords": ["health", "check your mood day", "mental health", "self-care"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-10-04T13:47:31-07:00", "articleType": "article", "articleContent": "\nHow have you been feeling lately? It’s an important question we should all ask each other – and ourselves – from time to time to ensure continued emotional well-being.\nThe County will host its annual Check Your Mood Day on Oct. 6 to encourage San Diegans to get screened for depression and assess their mental health. This year’s event will be held in conjunction with National Depression Screening Day.\nAs part of Check Your Mood Day, the County will provide a variety of in-person and online activities, self-care tips, and resources. Community members who are unable to attend an in-person Check Your Mood Day event are encouraged to take an online self-assessment and participate in a social media campaign, with actionable steps and tips to stay mentally healthy.\n“Getting screened for behavioral health conditions is just as important as getting your blood pressure checked or seeing your medical provider for an annual physical,” said Luke Bergmann, Ph.D., director of the County’s Behavioral Health Services. “Mental health screenings are a quick and easy tool that can indicate the first signs of what could become a serious mental illness, and I encourage every San Diegan to take advantage of Check Your Mood Day.”\nAccording to Mental Health America, nearly one in five American adults suffers from a mental illness. Despite how common depression is, many Americans don’t realize they’re experiencing the condition, or they suffer in silence out of fear of being stigmatized.\nSymptoms of depression vary but include lack of energy, sadness, loss of interest in activities that previously brought joy, and trouble falling asleep or staying asleep. Many signs of clinical depression are overlooked or dismissed as something that will simply pass with time.\nSelf-care Tips\n\nSafely connect with family and friends\nGet outside for walks and hikes\nMeditate\nStay physically active\nEat healthy, nutritious meals\nListen to music and dance\n\nCheck Your Mood Day is part of the County’s Live Well San Diego health initiative. Visit the Check Your Mood Day page for details and more mental health tips and resources.\nIn addition to the virtual Check Your Mood event, the County’s multilingual Access and Crisis Line is available seven days a week, 24 hours a day at (888) 724-7240. Calls are answered by experienced counselors, with assistance available in over 200 languages.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221004.12.15.37"}