{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Holiday Precautions Urged as COVID-19, Omicron Cases Spike Up", "description": "An increasing number of COVID-19 cases, more upcoming holiday celebrations and the growing spread of the Omicron variant are prompting County health officials to urge San Diegans to do their part to keep the coronavirus spread from increasing even more.", "datePublished": "2021-12-22T18:45:38-08:00", "url": "https://www.countynewscenter.com/holiday-precautions-urged-as-covid-19-omicron-cases-spike-up/", "keywords": ["health", "coronavirus", "covid-19", "holiday spread", "vaccination"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-22T18:45:38-08:00", "articleType": "article", "articleContent": "\nAn increasing number of COVID-19 cases, more upcoming holiday celebrations and the growing spread of the Omicron variant are prompting County health officials to urge San Diegans to do their part to keep the coronavirus spread from increasing even more.\nA total 1,856 COVID-19 cases were reported in the region on Dec. 21. A figure that high has not seen since Aug. 26, 2021, when 1,865 infections were reported.\nAlso, an additional 16 Omicron cases were reported in the past week (Dec. 15 through Dec. 21), bringing the region’s total of known cases to 22. Furthermore, the first hospitalization due to Omicron was reported in the region.\nThe County and the Hospital Association of San Diego and Imperial Counties today issued an advisory urging San Diegans to take every precaution necessary to fight the increase of COVID-19 cases and the accompanying stress on the medical care system.\n“For those unvaccinated or in need of a booster, please get vaccinated now as an early New Year’s resolution,” Wilma J. Wooten, M.D., M.P.H., County public health officer, said in the advisory issued today. “I know many are weary of the pandemic, but we all need to pull together for one another and take the simple steps we know work, especially with the more transmissible omicron variant.”\nUnlike the surge this time last year, the region now has plenty of COVID-19 vaccines and booster doses, which remain the best long-term protection against COVID-19 hospitalizations and deaths. The overwhelming number of people in the hospital with COVID-19 are San Diegans who are not fully vaccinated.\nThere are more than 400 vaccination sites that include pharmacies, medical providers, clinics and County locations, the region has the capacity to meet demand.\nIn addition to wearing a mask indoors in public places, the following measures also help to protect against all varieties of COVID-19, including the Omicron variant:\n\nGet vaccinated and get a booster if you qualify. The vaccine is widely available in the region, including at health care providers, retail pharmacies and community clinics. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn.\nWear a mask, especially in public indoor settings, regardless of vaccination status.\nGet tested if you’ve traveled or have any symptoms, whether you’ve been vaccinated or not. You can make a free test appointment or find a walk-up test clinic at coronavirus-sd.com.\nGet CA Notify to receive alerts if you were in close contact with someone who tests positive for COVID-19.\nWash your hands frequently and stay home if you’re sick and distance yourself from others.\n\nVaccination Progress:\n\nDoses administered: Over 6.03 million.\nReceived at least one shot: Over 2.75 million or 87.4% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.44 million or 77.7 %.\nBoosters administered: 683,780.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n39 new deaths were reported since the last report on Dec. 15, 2021. The region’s total is 4,434.\n16 women and 23 men died between Aug. 11 and Dec. 18, 2021.\n14 were age 80 or older, nine were in their 70s, 12 were in their 60s, one was in their 50s and three were in their 40s.\n11 of the people who died were fully vaccinated and 28 were not fully vaccinated.\n37 had underlying medical conditions, one did not and one had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n1,856 COVID-19 cases were reported to the County on Dec. 21, 2021. The region’s total is now 403,358.\n7,507 cases were identified the previous week (Dec. 15 through Dec. 21) compared to 4,719 cases reported in the past week (Dec. 8 through Dec. 14).\nDuring the 30-day period between Nov. 9 to Dec. 8, there were 486 COVID-19 hospitalizations; 341 people were not fully vaccinated and 145 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 21.7 overall, 12.9 for fully vaccinated people and 37.7 for not fully vaccinated San Diegans.\n\nCommunity Setting Outbreaks:\n\n58 new community outbreaks were confirmed in the past seven days (Dec. 8 through Dec. 14): 23 in TK-12 grade school settings, 16 in business settings, five in restaurant/bar settings, four in government settings, three in daycare/preschool/childcare settings, three in retail settings, one in a hotel/resort/spa setting, one in social club setting, one in an emergency services setting and one in a residence setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211222.18.45.38"}