{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Delivery Shortfall Slows  COVID-19 Vaccination Availability", "description": "The County of San Diego today announced a shortage of vaccine caused by the delayed arrival of an expected Moderna shipment.", "datePublished": "2021-02-12T13:07:44-08:00", "url": "https://www.countynewscenter.com/delivery-shortfall-slows-covid-19-vaccination-availability/", "keywords": ["health", "closures", "coronavirus", "covid-19", "vaccine shortage", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-12T13:07:44-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego today announced a shortage of vaccine caused by the delayed arrival of an expected Moderna shipment. Vaccination sites county-wide will slow and, in some cases, will pause with appointments rescheduled. The shipment is expected now on Tuesday.\nSecond doses will remain the priority for vaccination sites.\nThe pause will affect the region’s largest vaccination site, the UC San Diego Health Petco Park Super Station, with no vaccinations taking place on Sunday, Monday and Tuesday. Petco appointments will be automatically rescheduled through UCSD MyChart.\nThe South County Super Station has supplies sufficient to get it through Monday as does  the East County Super Station.\nThe County points of dispensing, or PODs, and North County Super Station in San Marcos have sufficient supplies to meet second dose appointments along with a limited supply of first doses.\nFor those who may experience a delay in second doses, the Centers For Disease Control and Prevention has advised that people can wait up to 42 days between doses and still achieve maximum immunity. More information about the COVID-19 vaccine is available at www.vaccinationsuperstationsd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210212.13.07.44"}