{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Announces New Chief Medical Examiner", "description": "The County of San Diego has announced a new Chief Medical Examiner to lead an office with 57 personnel and a budget of $12.1 million responsible for the county’s medicolegal forensic death investigations.", "datePublished": "2021-02-26T11:33:45-08:00", "url": "https://www.countynewscenter.com/county-announces-new-chief-medical-examiner/", "keywords": ["public safety", "living safely", "medical examiner"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-02-26T11:33:45-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego has announced a new Chief Medical Examiner to lead an office with 57 personnel and a budget of $12.1 million responsible for the county’s medicolegal forensic death investigations.\nDr. Steven Campman, the former Chief Deputy Medical Examiner who had been filling the director position in an interim capacity for the past four months, has officially accepted the role on a permanent basis.\nIn his new position as director, Campman said he hopes to continue the reputation of the office as being one of the top forensic pathology facilities in the country, as well as providing education and assistance to families of the deceased in a timely and professional manner.\n“I want to make sure that the department is a valuable contributor to the safety and health of the people of the county by determining the cause and manner of death for all sudden and unexpected deaths in the county – making sure that we document what conditions cause unexpected death in our population,” said Campman, who has worked for San Diego County since 2001.\nAccording to Campman, it is important that the medical examiner’s office learn from that information so that the region can guide resources and policies to improve overall health and safety in the future.\n“Every single investigation is valuable, whether to the decedent’s family, or to attorneys or an insurance company,” said Campman. “But what we can learn from all deaths together is valuable to understanding what is going on in our community.”\nCampman said a lot of people don’t know that San Diego County has the second largest coroner-medical examiner system in the state of California.\n“It makes sense when you think about the county’s population being about 1% of the whole nation’s population,” added Campman.\nPrior to joining the county, Campman worked for the Armed Forces Medical Examiner and served more than 20 years in the U.S. Air Force and Air Force Reserve, retiring as a colonel in 2016. He has conducted more than 5,000 autopsies, served as an autopsy supervisor for more than 800 cases, testified in hundreds of court proceedings, and he has been published more than a dozen times in medical journals and forensic/pathology publications\nCampman said the San Diego Medical Examiner’s Office faced several challenges last year, not just with COVID-19 but also with fentanyl-related deaths and overall case volume.\n“We had initial jurisdiction over about 41% of the more than 25,000 deaths registered in San Diego County in 2020 and ended up transporting about 14% of those decedents back to the facility for examination to determine cause of death,” said Campman. “Last year’s case volume was the greatest we’ve ever investigated at 3,853.”\nIn addition to COVID, Campman said the office helps ensure county residents are living safely by providing important data to government officials on societal issues such as the rise in fentanyl-related cases, the opioid epidemic, methamphetamine abuse, suicides, child fatalities and homeless deaths. Campman said this data can then be used to help San Diego County government agencies implement programs to address current trends and to target the most vulnerable residents.\n“The department is here for the residents of the county,” said Campman. “Every member of the Medical Examiner’s staff is here because they’ve chosen to serve in this capacity and values the unique ways that we can help people.”\nCampman is a graduate of Loyola Marymount University and Creighton University School of Medicine and completed his residency at UC Davis Medical Center Dept of Pathology and his fellowship through UC Davis at the Sacramento County Coroner’s Office.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210226.11.33.45"}