{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens New Online Public Records Request Center", "description": "The County has unveiled a new, easy, do-it-yourself website to help people submit public record requests, track their progress and even see if those records are already available because somebody else asked for them.", "datePublished": "2024-03-21T11:09:51-07:00", "url": "https://www.countynewscenter.com/county-opens-new-online-public-records-request-center/", "keywords": ["government"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-03-21T11:09:51-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County has unveiled a new, easy, do-it-yourself website to help people submit public record requests, track their progress and even see if those records are already available because somebody else asked for them.\nHave you ever wanted to review County documents―maybe you were curious about a government function, or you were doing research for a project―but you didn’t know where to start?\nNow you can do it right online at the County’s Public Records Request Center website.\nThe website has numerous features to help people submit requests. It includes drop-down guides to help people figure out what County department might have the records they’re looking for. It has easy-to-use links to other County data portals. It has search-prompts to make looking for records easier. It has a list of frequently asked questions. And it has a how-to video in the frequently-asked-questions link showing—step-by-step—how to request the public records you seek.\nThe new Public Records Request Center is part of the County Clerk of the Board of Supervisors office. It was created to meet the County Board of Supervisors transparency initiatives and centralize public records requests in the clerk’s office. It will make requesting public records simpler because all requests will be handled through the center or the data portals on it.\nOne of the cool new features is the websites’ “View Existing Public Records Act Requests” tool. Clicking on that link will allow anyone to see the public records that others have asked for, starting with record requests made on or after March 21. When someone requests a public record, the County will automatically make the information available to the general public three days after the request is completed.\nCalifornia’s Public Records Act was established in 1968. It declared that “access to information concerning the conduct of the people’s business is a fundamental and necessary right of every person in this state.”\nUsing the new website is easy.\nGetting Started\n\nGo to the County Public Record Act website.\nClick on “Make a Request” and start by entering a description of the records/information—as detailed as possible—that you’re looking for.\nAs you are typing in your information, you may see yellow boxes appear.\nThe boxes may tell you to visit another website or resource. If so, please do that first.\nThey may also recommend adding a County department in the drop-down box that would be the best to handle your request. Add the department or departments you think can best help find the records you seek. You can also leave the department selection blank.\n\nAdd Your Contact Info\n\nWhen you finish describing the records you want, you should fill in your contact information—name, email address, address and phone. Do NOT include personal, confidential information such as your Social Security number or birthdate.\nIf you don’t add a valid email address, the County won’t be able to directly respond to you with the information you seek. You can submit a public records act request on the site anonymously and get the information you’re looking for. That’s because three days after a public records act request is closed, even if it was sent anonymously, the County will release the information to the general public. You can look for it with the “View Existing Public Records Act Requests” tool.\nHowever, adding your email allows the County to directly send you the information you’re looking for.\n\nCreating an Account\n\nWhen you add your email address to your request, the website will prompt you to set up an account using a username and password.\nThis offers additional benefits. When you create an account, you can attach files to your request if you’d like. Having the account also allows County staff to ask follow-up questions to ensure they know exactly what you’re looking for.\nHaving an account will also allow you to check on the status and progress of your request. And it will allow you to download documents you’re looking for.\n\nSo, there you have it. Getting the information you want about County government has never been easier.\nFor more information about public records and the online Public Records Request Center, contact the County Clerk of the Board of Supervisors Public Records Act unit at COBrecords@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240321.11.09.51"}