{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "East County Community Resource Fair Offers Help to Hundreds", "description": "The County of San Diego recently hosted its second annual East County Community Resource Fair, bringing together more than 90 service providers to support people on probation and other community members.", "datePublished": "2025-04-28T16:22:30-07:00", "url": "https://www.countynewscenter.com/east-county-community-resource-fair-offers-help-to-hundreds/", "keywords": ["public safety", "housing", "mental health", "probation", "rehabilitation", "resource fair", "substance use"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2025-04-28T16:29:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County of San Diego’s Probation Department recently hosted its second annual East County Community Resource Fair, bringing together more than 90 service providers to support community members and people on probation.\nMore than 300 people attended the free event at the El Cajon Courthouse on April 23. Youth and adults connected with services, including employment resources, medical and dental care, mental health support, help finding housing, substance use treatment program information, CalFresh assistance, access to food, clothing and more.\nThe day began with a session led by probation staff, highlighting the many service providers in attendance and the resources available countywide to help support and rehabilitate people on probation.\nThe second part of the event focused on connecting attendees with services to meet their varied needs in one convenient location.\nYouth and adults in attendance explored resources such as:\n\nMental health care\nSubstance use treatment\nLegal aid\nHelp with job applications\nTattoo removal and haircuts\nClothing\nSports programs\nHelp finding housing\nEducation resources\n\nThe fair also featured a special recognition ceremony honoring five people for their commitment to personal growth, positive change, building a support system and meeting the conditions of their probation.\nThe ceremony not only recognized their achievements but also served as inspiration for others on their paths to rehabilitation and success.\nTo learn more, visit the Probation Department’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250428.16.22.30"}