{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Cool This Holiday Weekend and Out of the ER", "description": "Extreme heat is expected at the coast and inland valleys of San Diego County this Labor Day weekend and into early next week. The National Weather Service in San Diego has issued an excessive heat warning calling for triple digits temperatures in some inland areas and the deserts through Tuesday, Se...", "datePublished": "2022-09-02T15:58:14-07:00", "url": "https://www.countynewscenter.com/stay-cool-this-holiday-weekend-and-out-of-the-er/", "keywords": ["health", "avoid the heat", "cool zones", "extreme heat", "heat warning", "public health"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2022-09-02T22:38:51-07:00", "articleType": "article", "articleContent": "\nExtreme heat is expected at the coast and inland valleys of San Diego County this Labor Day weekend and into early next week. The National Weather Service in San Diego has issued an excessive heat warning calling for triple digits temperatures in some inland areas and the deserts through Tuesday, Sept. 6.\nSan Diegans need to stay informed and protect themselves to prevent heat-related illness and to avoid hospitalization. Holiday weekends are a traditionally busy time in emergency departments. Dangerous heat conditions can add to the volume of people visiting the ED and strain hospital staff and resources.\n“Check weather forecasts, stay hydrated, limit time outdoors, check on elderly or disabled neighbors, and visit Cool Zones,” said Wilma J. Wooten, M.D. M.P.H., County public health officer. “Signs of heat exhaustion include heavy sweating, dizziness, nausea or vomiting, clammy skin and muscle cramps. Heatstroke symptoms include fever, flushed or red skin, lack of sweating, trouble breathing and disorientation or confusion.”\nA list of Cool Zones locations is available online. People can enter their address once they navigate to the map and it will show locations near them. Residents can also call 2-1-1 to find a location.\nOn Monday, three libraries will open Cool Zone community rooms from 10 a.m. to 6 p.m. The three library branches are Ramona, 1275 Main St, Ramona, CA 92065; Borrego Springs, 2580 Country Club Rd, Borrego Springs, CA 92004; and Valley Center: 29200 Cole Grade Rd, Valley Center, CA 92082. Please note that regular library services will not be available.\nProlonged heat with little relief at night can pose a substantial health risk for young children, the elderly, people with chronic diseases, pregnant individuals, people with disabilities, and people who are socially isolated. Family pets are also vulnerable to the extreme heat. County health officials offer the following tips:\n\nStay in an air-conditioned area during the hottest hours of the day.\nWear light, loose-fitting clothing.\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty.\nTake cool showers.\nNever leave a child, elderly person, or pet unattended in a car.\nAvoid unnecessary hard work or activities outside during the hottest part of the day.\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun.\nAvoid using the oven to cook.\nAvoid being out during peak heat hours.\nPet owners can exercise their pets in early morning hours or early evening to avoid prolonged exposure to the heat. Make sure they have shade throughout the day and plenty of water.\nEven a few hours spent in air conditioning can help your body stay cooler.\nDo not rely on electric fans for cooling if temperatures exceed 90 degrees.\n\nPeople in San Diego County unable to get to a Cool Zone location without transportation assistance, such as older adults, people with disabilities, or people who are homebound, can call 2-1-1 to be connected to a transportation or rideshare service at no cost.\nIf someone is showing signs of heat-related illness, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature, and continuing cooling efforts, and\nDo not give the victim fluids to drink\n\nMore information about the signs and symptoms of emergencies like heat exhaustion and heatstroke, visit the County Health and Human Services Agency Extreme Heat webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220902.15.58.14"}