{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Works to Close Digital Divide in Unincorporated Area", "description": "In San Diego County’s unincorporated areas, there are pockets where high-speed internet is unavailable, unreliable or unaffordable. The County is working to reduce the digital gap and has made available $9 million in funding through the American Rescue Plan Act for broadband infrastructure.", "datePublished": "2024-12-18T11:40:19-08:00", "url": "https://www.countynewscenter.com/county-works-to-close-digital-divide-in-unincorporated-area/", "keywords": ["government", "affordable internet", "comprehensive broadband plan", "equity", "high-speed internet", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-12-18T11:40:19-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteIn San Diego County’s unincorporated areas, there are pockets where high-speed internet is unavailable, unreliable or unaffordable. The County is working to reduce the digital gap and has made available $9 million in funding through the American Rescue Plan Act for broadband infrastructure.\nThrough an appointed Broadband Committee, the County has selected projects submitted by Internet Service Providers to provide affordable broadband service to over 1,000 residents in three unincorporated areas:\n\n$4.7M awarded to Onward to deliver high-speed internet service to 281 households in Warner Springs.\n$2.7M awarded to AT&T to deliver high-speed internet service to 101 households in San Dieguito.\n$1.5M awarded to AT&T to deliver high-speed internet service to 53 households in Ramona.\n\nEach chosen project provides affordable internet service at or below $30 per month to low-income households.\nIn July 2024, the Notice of Funding Availability was shared with all known Internet Service Providers in the county.\nThe County requested grant proposals through public outreach and engagement based on findings from the Comprehensive Broadband Plan.\nThe Plan supports the County’s efforts in attempting to close the digital divide in the unincorporated area by identifying problem areas and the partnerships, infrastructure and education needed to change that.\n“These projects will provide affordable internet plans for low-income households, and high-speed internet access, strengthening residents’ connection to telehealth, education and economic opportunities. This is one of several positive outcomes for the community advanced by our Comprehensive Broadband Plan,” said Dahvia Lynch, general manager of the County’s Land Use & Environment Group leading broadband efforts for the County.\nConstruction of the internet and full operable service into the homes will be completed by December 31, 2026.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241218.11.40.19"}