{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Find Your New Sweetheart at the County Shelter", "description": "Valentine’s Day is not just about romantic love, it’s also about sharing affection and showing how you care for others. So, who’s to say your sweetheart can’t be furry?", "datePublished": "2023-02-14T13:37:52-08:00", "url": "https://www.countynewscenter.com/find-your-new-sweetheart-at-the-county-shelter/", "keywords": ["animals"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-02-14T13:37:52-08:00", "articleType": "article", "articleContent": "\nValentine’s Day is not just about romantic love, it’s also about sharing affection and showing how you care for others. So, who’s to say your sweetheart can’t be furry?\nThe County Department of Animal Services is playing matchmaker this week. As part of a Sweetheart Special, starting on Valentine’s Day through Feb. 19, all animals are just $14 to adopt.\nThere is someone for everyone. For those of you who like to be the center of someone’s universe and don’t mind bad breath, try a dog. Maybe you prefer to earn your love, try a cat. If you like the intellectual type, try a pig — they’re smarter than dogs  You like slow walks on aquarium beaches, how about a red-eared slider turtle? Recently gone vegetarian? Share a nibble on a carrot with one of our bunnies.\nAll animals will be spayed or neutered, have vaccinations, a microchip and a one-year license for dogs in the service area.\nThe first step to finding a new best friend is browsing all the lovable animals from cats to dogs to chickens and pigs available now on the  Adoptions page.  Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already chosen by another person.\nWalk-in hours are from 1 to 4 p.m. Tuesday through Friday and from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nFill out an application online to print or pick one up at the shelter. Applications can also be emailed but it is quicker to go in person.\nIf you cannot adopt, consider fostering or volunteering.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230214.13.37.52"}