{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Traffic Light Backup Battery Project Could Make Residents Safer in Emergencies, Power Shutoffs", "description": "Supervisor Jim Desmond and Department of Public Works officials recently flipped the switch on a new traffic light backup battery system in San Dieguito that could eventually make residents around the county safer during emergencies.", "datePublished": "2021-10-08T11:21:54-07:00", "url": "https://www.countynewscenter.com/traffic-light-backup-battery-project-could-make-residents-safer-in-emergencies-power-shutoffs/", "keywords": ["public safety", "dpw", "emergencies", "emergency", "evacuation", "oes", "public safety", "public works", "wildfire"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-10-08T12:02:26-07:00", "articleType": "article", "articleContent": "\nCounty Supervisor Jim Desmond and Department of Public Works officials recently flipped the switch on a new traffic light backup battery system in San Dieguito that could eventually make residents around the county safer during emergencies.\nThe pilot project is located at a traffic light at San Dieguito Road and Via Dos Valles, an intersection that Desmond’s office said is a major evacuation route for several communities, including 4S Ranch, Carmel Valley and Rancho Bernardo.\nThe project replaced the traffic signal’s existing lead, acid-based backup battery — the kind you’d find in your car — that could keep the light operating for four-to-six hours in a blackout, to newer nickel-zinc batteries that can keep the light working for more than 24 hours.\nHaving extended backup power could keep people from blindly racing through non-working traffic signals and potentially save lives in an emergency evacuation situation or when San Diego Gas & Electric institutes a Public Safety Power Shutoff in high-wind conditions that increase wildfire risk.\n“We can’t stop wildfires from occurring in San Diego County,” Desmond said, “but we can do our best to keep people safe. Seeing this backup battery’s capabilities, I’m confident this will be a major asset during Power Safety Power Shutoff events, and I look forward to seeing many more installed throughout the county.”\nThe Board of Supervisors, led by Desmond and Supervisor Joel Anderson, directed County staff in March to look for ways to reduce the potential impacts of Public Power Safety Shutoffs, including backup power for road infrastructure and major intersections.\nAnderson was also pleased by the pilot project.\n“Installing these longer-lasting emergency backup batteries at traffic lights, particularly along evacuation routes, is something that will be very important for the safety of my constituents,” said Supervisor Joel Anderson. “My constituents have lived through major wildfires in the past, including two of the largest in state history, the Cedar fire in 2003 and the Witch Creek fire in 2007.”\nCounty public works officials said the department expects to eventually install the extended nickel-zinc backup batteries at the roughly 200 traffic lights operated on County-maintained roads in the unincorporated areas.\nThe San Dieguito light was chosen as a test site because it had ample space for installing up to eight nickel-zinc battery packs. The project was paid for by the vendor because the it was conducted as a test.\nPublic works officials said the department first installed lead-based backup batteries into traffic lights on County-maintained roads after the Sept. 8, 2011 Southwest blackout. The blackout, the largest in California history, suddenly cut power to 2.7 million customers for more than 11 hours, including all of San Diego County, parts of Mexico and Arizona, southern Orange County, Imperial Valley, Mexicali Valley and Coachella Valley.\nIn addition to closing schools and businesses, suspending water service in some areas, and shutting off television and radio news, the blackout also and shut off traffic lights, snarling traffic countywide.\nCounty officials who had already seen the traffic jam impacts of the 2003 and 2007 wildfires here immediately recognized the traffic light issues presented potential future problems in emergencies.\nThe likelihood of traffic lights being shut off has increased in recent years after power utilities, including San Diego Gas & Electric, started using Public Safety Power Shutoffs to temporarily cut electricity in areas during “red flag” high-wind events like Santa Anas, to keep downed lines from sparking fires.\nIn their March 2 Board letter, Desmond and Anderson said Public Safety Power Shutoffs in 2019 turned power off in 66 communities, including in the City of San Diego and Native American reservations. In 2020, 44 communities, including seven cities and Native American reservations were affected by Public Safety Power Shutoffs.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211008.11.21.54"}