{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Moves to Prioritized COVID-19 Case Investigations", "description": "The County is following the national recommendation to reprioritize COVID-19 case investigations to focus on cases reported in people who are at higher risk of developing serious complications from the disease.", "datePublished": "2022-03-09T17:56:21-08:00", "url": "https://www.countynewscenter.com/county-moves-to-prioritized-covid-19-case-investigations/", "keywords": ["health", "case investigations", "case investigations discontinued", "contact tracing", "coronavirus", "covid-19", "reprioritization"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-03-10T08:48:58-08:00", "articleType": "article", "articleContent": "\nThe County is following the national recommendation to reprioritize COVID-19 case investigations to focus on cases reported in people who are at higher risk of developing serious complications from the disease.\nCOVID-19 case investigations are now limited to people 65 years of age and older, as well as those in congregate living facilities where the virus can spread at a faster rate. The County will no longer be contact tracing all individuals, but will continue to support high-risk settings and outbreak responses.\n“COVID-19 vaccines are now widely available, and the majority of the local population is now more protected because they have received all the recommended doses,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Therefore, our efforts are now directed at high-risk people or individuals who reside in congregate settings, such as nursing homes, jails and homeless shelters, and in guiding them to care and treatment.”\nThe more focused approach began late last week and aligns with new recommendations from the Centers for Disease Control and Prevention, which is no longer recommending case investigation and contact tracing of every new case of COVID-19.\nThe change will result in fewer case investigations and contact tracing since the new target populations only represent about 10% of the total number of cases being reported.\n“Widespread vaccinations of most age groups, increased use of rapid antigen tests, and the emergence of more-transmissible variants with short incubation periods allowed for the reprioritization of case investigations and contact tracing,” Wooten said.\nCOVID-19 Data Changes\nThe changes will also result in certain data sets no longer being available. That includes discontinuing the County’s Triggers Dashboard, which included 13 surveillance, hospital capacity and public health response metrics.\nThe Triggers Dashboard will be replaced by the new SMARTER Plan, which California is now using to respond to the COVID-19 pandemic and prepare for potential surges of the virus or new variants.\nVaccination Progress:\n\nReceived at least one shot: Over 2.93 million or 93.2% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Nearly 2.58 million or 82.0%.\nBoosters administered: 1,182,653 or 55.1% of 2,146,688 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n45 new deaths were reported since the last report on March 2, 2022. The region’s total is 5,090.\n29 men and 16 women died between Nov. 27, 2021 and March 5, 2022.\n19 were age 80 or older, 14 were in their 70s, six were in their 60s, five were in their 50s and one was in their 40s.\n19 of the people who died were fully vaccinated and 26 were not fully vaccinated.\n41 had underlying medical conditions and four had medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n436 COVID-19 cases were reported to the County on March 8, 2022. The region’s total is now 742,724.\n3,599 cases were reported in the past week (March 2 through March 8) compared to 4,601 infections identified the previous week (Feb. 23 through March 1).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 17.7 for people fully vaccinated and boosted, 17.2 for fully vaccinated people and 43.9 for not fully vaccinated San Diegans.\n8,130 tests were reported to the County on March 6, 2022, and the percentage of new positive cases was 4.7%.\nThe 14-day rolling percentage of positive cases among tests reported through March 6, 2022 is 4.4%.\n\nCommunity Setting Outbreaks:\n\n75 new community outbreaks were confirmed in the past seven days (March 2, 2022 through March 8, 2022): 39 in TK-12th grade school settings, 10 in daycare/preschool/childcare settings, 10 in business settings, seven in government settings, three in restaurant/bar settings, three in emergency services settings, two in retail settings and one in a health care setting.\nThe community outbreaks trigger was more than seven in a 7-day period.\n\n\nThis metric will no longer be reported as the County is now using California’s SMARTER Plan.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220309.17.56.21"}