{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Keeps Child Safety Paramount During Child Abuse Awareness Month", "description": "A colorful pinwheel garden served as the backdrop today for a Child Abuse Awareness press conference at the County Administration Center downtown. Chairwoman Nora Vargas, County Child Welfare Services and Promises2Kids teamed up for the event to help raise awareness and prevent child abuse.", "datePublished": "2023-04-26T17:18:51-07:00", "url": "https://www.countynewscenter.com/county-keeps-child-safety-paramount-during-child-abuse-awareness-month/", "keywords": ["health", "child abuse", "pinwheels", "promises2kids"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-04-27T12:31:26-07:00", "articleType": "article", "articleContent": "\nA colorful pinwheel garden served as the backdrop today for a Child Abuse Awareness press conference at the County Administration Center downtown. Chairwoman Nora Vargas, County Child Welfare Services and Promises2Kids teamed up for the event to help raise awareness and prevent child abuse.\nEach week, an average of 400 active investigations of alleged child abuse and neglect are initiated in San Diego County. An estimated five children die every day in the United States as a result of child abuse or neglect. When families experience at least one material hardship, the likelihood of being investigated or neglect increases nearly three times.\nThe good news is child abuse and neglect are preventable.\n“For me, making sure that the children and families of San Diego County are taken care of is one of my top priorities and I absolutely believe that prevention is key,” Chairwoman Nora Vargas said.\nWith that goal in mind, the County also has created a new Child and Family Well-Being Department, combining prevention and protective services. This new department will focus on supporting and strengthening families first to make sure they have the resources they need before a crisis strikes. By prioritizing prevention, the hope is children and youth won’t ever need to enter the child welfare service system.\n“Locally, here in San Diego, we receive about 40,000 calls to our child abuse hotline and last year that represented almost 68,000 children here in our community that people were concerned are being abused or neglected in their homes,” said Director Kim Giardina, with the Child Welfare Services.\nEvery child deserves a chance to succeed and grow up in a safe, stable, and nurturing environment that is free from abuse and neglect. If you have reason to believe a child you know is experiencing abuse or neglect, contact the County’s Child Abuse Hotline at 858-560-2191 or 800-344-6000. You can also call 2-1-1 San Diego, or check this website for a variety of resources related to child abuse prevention.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230426.17.18.51"}