{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tsunami Zone Awareness Week", "description": "Did you know California is in a Tsunami zone? In the case of a major earthquake, tsunami waves could be generated off the coast of California. While the probability of a tsunami is lower than in other parts of the world, the   hazard does exist and what to do in the case of emergency is important to know.", "datePublished": "2025-03-26T12:13:08-07:00", "url": "https://www.countynewscenter.com/tsunami-zone-awareness-week/", "keywords": ["public safety", "emergency", "oes", "tsunami"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-03-26T16:23:20-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDid you know California is in a Tsunami zone? In the case of a major earthquake, tsunami waves could be generated off the coast of California. While the probability of a tsunami is lower than in other parts of the world, the hazard does exist, and it is important to know what to do in case of emergency.\nSeismic events can occur in one location and have an impact in another, faraway location. On Jan. 15, 2022, a volcanic eruption at Hunga Tonga-Hunga Ha’apai in the southwest Pacific Ocean generated a tsunami that affected several harbors. The National Oceanic and Atmospheric Administration tide gauges all showed rises. San Diego County reported a .60 inch max wave height, while Arena Cove in Mendocino County had 2.14 inches max wave height. Tsunamis can result in damage to some harbors and vessels.\nBeyond a tsunami in Southern California, it is important to know what to do in the event of one as it can happen when visiting other countries, and because it could save your life.\nIn San Diego County, it is important to be prepared by registering with AlertSanDiego, the county’s notification system, and know the signs of a tsunami and what to do.\n\nIf a tsunami warning is issued: Don’t panic but make your way AWAY from the coast, at least a mile inland and upward, ideally 100 feet above sea level, when possible. It is not safe to stay in the area and wait to see the effects.\nIf you are near the water and feel a strong earthquake, or hear a roar from the water, see a fast-rising flood, a wall of water or the water draining away from the ocean floor exposing rocks and fish, this is your warning that a tsunami may be coming.\nDrop, cover and hold on for the earthquake, then when it is safe to do so, move inland and upward when possible.\nRemain at the safe location and monitor official emergency information as it may take a tsunami several hours to generate.\n\nEducation is key to saving lives. Tilly Smith, a 10-year-old from Britain was vacationing in Phuket, Thailand in December 2004 when she saw the water recede and froth. She had recently learned the warning signs of a tsunami in school and told her parents who alerted other beach visitors and resort staff. Her warning saved lives on that beach.\nThe state Office of Emergency Services, the California Geological Survey, AECOM Technical Services and the Tsunami Research Center at the University of Southern California are tasked with creating tsunami maps for all 20 coastal counties and they are available to view on the California Department of Conservation website.  AlertSanDiego.org also has the 10 coastal cities maps on AlertSanDiego.org.\nLearn more at The TsunamiZone and talk to your family and work about it.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250326.12.13.08"}