{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Update: Shigella Outbreak in San Diego County — 12-3-2021", "description": "The County of San Diego has announced the ongoing outbreak of shigella now stands at 41 confirmed and seven probable cases, an increase from 38 confirmed and three probable cases in the Nov. 19 update.", "datePublished": "2021-12-03T17:01:24-08:00", "url": "https://www.countynewscenter.com/update-shigella-outbreak-in-san-diego-county-12-3-2021/", "keywords": ["health", "shigella", "shigella outbreak"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-03T17:01:24-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego has announced the ongoing outbreak of shigella now stands at 41 confirmed and seven probable cases, an increase from 38 confirmed and three probable cases in the Nov. 19 update.\nThe continuing investigation shows onset of illness dates between Aug. 16 and Nov. 21, 2021, with the three new cases occurring between Nov. 23 and Nov. 30, 2021, with symptom onset for the latest case being Nov. 21, 2021. The 48 cases in this outbreak represent 13% of the 372 total cases reported to date in San Diego County.\nThe County Public Health shigella website has been updated to include an epidemiological curve showing declining case numbers in recent weeks.\nThe County has been working with the Infectious Disease branch of the California Department of Public Health and determined that we are reaching levels of transmission that are typical for this disease.\nThe cases are among individuals experiencing homelessness, with the majority at multiple locations in central San Diego and two cases in North County.\nNo source of the outbreak has currently been identified.\nThe County continues to work closely with the City of San Diego, regional homeless service providers and others to identify new cases, prevent future potential exposures and promote good hygienic and sanitation precautions.\nShigella is a contagious infection typically spread by contaminated surfaces, food or water, or person to person. Those at increased risk include young children (especially those in daycare), people who are experiencing homelessness, travelers to locations with poor sanitation and men who have sex with men. In 2020, a total of 240 shigellosis cases were reported in San Diego County residents while the 426 cases reported in 2019 was the highest since 1995.\nTypical symptoms of shigellosis include diarrhea (sometimes bloody), fever and stomach cramps. While most people will recover fully without antibiotic treatment, some individuals with poor immune systems can develop life-threatening disease and may need further treatment.  People with symptoms that resemble shigella should contact their medical care provider. The provider may order stool testing to help with the diagnosis.\nStrategies to avoid getting or spreading shigella include frequent hand washing and not preparing food while ill with diarrhea.\nMore information about shigella and precautions are available through the County, a California Health Alert Network notification, the California Department of Public Health and the Centers for Disease Control and Prevention. The next regularly scheduled shigella outbreak news release will appear Friday, Dec. 17.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211203.17.01.24"}