{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Early Voting Begins for 79th Assembly District Election", "description": "Do you live in the 79th Assembly District? If so, the Registrar of Voters Kearny Mesa is now open for early voting from 8 a.m. to 5 p.m., Monday through Friday for the  79th State Assembly District Special Primary Election on April 6.", "datePublished": "2021-03-08T10:46:13-08:00", "url": "https://www.countynewscenter.com/early-voting-begins-for-79th-assembly-district-election/", "keywords": ["elections", "3/8/2021", "79th state assembly", "79th state assembly district special primary election", "early voting", "election", "fgg", "vote safer san diego"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-03-08T10:46:13-08:00", "articleType": "article", "articleContent": "\nDo you live in the 79th Assembly District? If so, the Registrar of Voters Kearny Mesa is now open for early voting from 8 a.m. to 5 p.m., Monday through Friday for the 79th State Assembly District Special Primary Election on April 6.\nBe prepared. Bring your face mask and plan to maintain social distance. The Registrar of Voters is adhering to the County’s public health orders and will make reasonable accommodations when needed to ensure the health and safety of all election workers, voters and observers in their office.\nOnly those who live in the 79th District can vote in the election. The area encompasses southeastern San Diego, the cities of La Mesa and Lemon Grove, and parts of Chula Vista, Bonita and National City. Not sure if you live in the 79th assembly district? You can find out here.\nOver 300,000 mail ballots have been sent out to registered voters residing in the 79th District. As mail ballots start showing up in mailboxes, the Registrar encourages voters to act early and make voting decisions from the comfort and safety of their home.\nYou can return your marked ballot in the pre-paid postage envelope to any U.S. Postal Service office or collection box. Voters who return their mail ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nStarting Monday, March 29, you’ll also have the option to drop off your ballot at one of many mail ballot drop-off locations around the district. A list of locations is in your mail ballot packet.\nIf you haven’t received your mail ballot by March 16 call the Registrar’s office at (858) 565-5800.\nTo learn more about Vote Safer San Diego and voting in the 79th State Assembly District Special Election, visit sdvote.com or call (858) 565-5800.\n \n \n \n \n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210308.10.46.13"}