{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More Grant Funds to Help County Predict and Prepare for Disease Outbreaks", "description": "More grant money is heading to San Diego County to help anticipate and prepare for future disease outbreaks.  ", "datePublished": "2024-09-10T16:19:07-07:00", "url": "https://www.countynewscenter.com/more-grant-funds-to-help-county-predict-and-prepare-for-disease-outbreaks/", "keywords": ["health", "cdc grant", "disease outbreak", "public health", "san diego county", "uc san diego"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-09-10T16:19:07-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesMore grant money is heading to San Diego County to help anticipate and prepare for future disease outbreaks.  \nThe Board of Supervisors today approved a $425,000 grant from the Centers for Disease Control and Prevention (CDC) through the University of California San Diego (UCSD). \nThe newly approved funding adds to another $1.3 million CDC grant received last October as part of the Resilient Shield UCSD Grant Project. \nThe funds will help County Public Health epidemiologists or “disease detectives,” use disease modeling to study what kinds of contagious diseases might affect San Diego communities in the future.  \nThis type of study involves collecting disease information from past public health emergencies and other sources and using it to study which diseases could be a future threat, especially for vulnerable communities. \n“This new information will help our County be more ready for upcoming disease outbreaks, make decisions on how to keep the public healthy and train local health professionals,” said Dr. Ankita Kadakia, interim Public Health Officer.  \nEpidemiologists have begun this work in partnership with UCSD researchers and experts from the University of California San Francisco, University of California Riverside, Mitre Corporation, Los Alamos National Laboratory and the University of Washington.   \nAlready, the funds have supported the County’s response to Mpox. When Mpox cases started to go up in San Diego, County epidemiologists and UCSD researchers used disease modeling and found that people were mostly getting sick with Mpox through local transmission rather than when traveling outside of the region or state where cases were also rising. This led to the County prioritizing more vaccinations among local community members, especially those at greater risk for Mpox.  \nThis work has also helped the County’s efforts around hepatitis A by showing the effectiveness of a gift card incentive program at increasing hepatitis A vaccinations among people experiencing homelessness and preventing the spread of disease and its impact on local and County resources. \nPlans for the newly approved funds include more work around tuberculosis control and dengue transmissions which are priority areas for the County. The work done in San Diego County will also help health jurisdictions and disease modeling throughout the United States. \nThe grant period runs through September 2028.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240910.16.19.07"}