{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrating Halloween Safely Amid Coronavirus Pandemic", "description": "Halloween is just around the corner, but like so many other special occasions and events, the 2020 edition of the spookiest day of the year will have to look a little different due to the coronavirus pandemic.", "datePublished": "2020-10-05T11:10:11-07:00", "url": "https://www.countynewscenter.com/celebrating-halloween-safely-amid-coronavirus-pandemic/", "keywords": ["health", "coronavirus", "covid-19", "halloween"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-10-05T11:10:11-07:00", "articleType": "article", "articleContent": "\nHalloween is just around the corner, but like so many other special occasions and events, the 2020 edition of the spookiest day of the year will have to look a little different due to the coronavirus pandemic.\nMany traditional Halloween activities pose a high risk for contracting or spreading COVID-19 because they typically bring together large groups of people that do not live in the same household.\n“While Halloween activities must change, we still want people to be able to dress up and have fun for the holiday,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Maybe plan a virtual or drive-by costume party that lets you celebrate while keeping up the fight against the spread of the virus.”\nDoor-to-door trick-or-treating is one of the most popular Halloween activities, but it, along with trunk-or-treating, or leaving bowls of candy for others to grab, is not advisable: too hard to maintain proper social distancing. Instead, consider “one-way trick-or-treating,” where individually wrapped goodie bags are lined up outdoors, allowing families to grab them while practicing social distancing.\nGatherings of any size are not permissible under current public health orders so you should avoid in-person costume parties. Instead, get your friends and family together for a virtual costume party and vote for the best costumes from the comfort of your own couch.\nHaunted houses are also not recommended because they often put crowds into tight, poorly ventilated areas. Instead, the County Health & Human Services Agency recommends dressing up your own home or yard with Halloween-themed decorations and taking a stroll or drive around your neighborhood to enjoy the spooky decor.\nOther safe ways to celebrate Halloween and the fall season include:\n\nAttending a drive-through Halloween event or car parade.\nWatching a spooky movie with your household members, either at home or at a drive-in theater.\nCarving pumpkins with members of your own household.\nMaking fall recipes and crafts as a family.\n\nHowever you celebrate, please follow the established safety measures to prevent the spread of COVID-19. This includes wearing a face covering, maintaining physical distance, washing your hands, and staying home when you feel ill.\nClick here for the full Halloween guidance from the County of San Diego Health and Human Services Agency.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201005.11.10.11"}