{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Register to Vote by Oct. 24 for Nov. Election Mail Ballot", "description": "You must register by Monday, Oct. 24 to receive a ballot in the mail for the Nov. 8 Statewide General Election. Otherwise, you will need to make a trip in person to the Registrar’s office in Kearny Mesa or visit a vote center starting Saturday, Oct. 29 to conditionally register and vote provisionally through Election Day.", "datePublished": "2022-10-21T08:46:25-07:00", "url": "https://www.countynewscenter.com/?p=209793", "keywords": ["elections", "county registrar of voters", "fgg", "mail ballot", "nov. 8 general election", "nov. 8 statewide general election", "register to vote"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-10-24T10:25:12-07:00", "articleType": "article", "articleContent": "\nYou must register by Monday, Oct. 24 to receive a ballot in the mail for the Nov. 8 Statewide General Election. Otherwise, you will need to make a trip in person to the Registrar’s office in Kearny Mesa or visit a vote center starting Saturday, Oct. 29 to conditionally register and vote provisionally through Election Day.\nRegistering to vote is quick and easy and can be done online at sdvote.com. You will need to register to vote if you:\n\nare not registered in San Diego County\nrecently moved\nchanged your name\n\nIf your signature is confirmed through records at the California Department of Motor Vehicles, your registration will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the form, sign it and return it to the Registrar’s office by 5 p.m. on Oct. 24.\nRegistration forms must be postmarked or delivered to the Registrar’s office by Oct. 24. Voters may also register online until midnight.\nIf you don’t have access to a computer, you may request a registration form. Call (800) 696-0136 or email rovmail@sdcounty.ca.gov.\nNot sure if you’re registered to vote? Check your registration status online at sdvote.com.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese, and Chinese.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday.\nYou can also choose to vote in person at any vote center.\nStarting Saturday, Oct. 29, 39 vote centers will be open daily from 8 a.m. to 5 p.m. Then starting Saturday, Nov. 5, over 200 vote centers will be open daily from 8 a.m. to 5 p.m.\nAll vote center locations and the Registrar’s office will be open on Election Day, Nov. 8, when voting hours change to 7 a.m. to 8 p.m.\nYou can find a complete list of the Registrar’s official ballot drop box and vote center locations inside your voter information pamphlet or at sdvote.com.\nLearn more about voting in the Nov. 8 Statewide General Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221021.08.46.25"}