{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County K-12 Youth Services Community Grant Program", "description": "The County announced today grant awards of up to $250,000 are available to help community and non-profit organizations support, promote, and improve educational options for San Diego County children.", "datePublished": "2022-05-02T15:55:55-07:00", "url": "https://www.countynewscenter.com/?p=208306", "keywords": ["government"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-05-02T16:15:16-07:00", "articleType": "article", "articleContent": "\nThe County announced today grant awards of up to $250,000 are available to help community and non-profit organizations support, promote, and improve educational options for San Diego County children. County leaders want to help organizations identify and implement new and innovative methods to support educational equity and acceleration of learning, support behavioral health needs, address housing, food stability, and poverty, and provide mentorship opportunities for kindergarten through 12th grade (K-12) youth and their families.\nThis opportunity is made possible by fines imposed by the court related to the District Attorney’s successful prosecution of one of the nation’s largest fraud schemes targeting state dollars intended for K-12 education.\n“It is truly rewarding for our team at the District Attorney’s Office to see millions of dollars that were recovered in restitution as part of our massive public corruption prosecution be used to care for our children by reducing inequities and improving opportunities for students across San Diego County.” said San Diego County District Attorney Summer Stephan.\nThis past fall, a workgroup was convened to help identify areas of need that could positively impact K-12 youth in our community. Representatives from the Office of the District Attorney, the Office of Equity and Racial Justice, Health and Human Services Agency, Behavioral Health Services and Child Welfare Services, Live Well San Diego Youth Sector and the County Office of Education participated in this important effort.\n“It’s critical to provide students with the tools necessary not just to survive but thrive in life,” said San Diego County Superintendent of Schools Dr. Paul Gothold. “But schools can’t do that alone. This grant program will help support students, families, and communities with high-impact partnerships, wraparound services, and deeper learning. By working with our partners, we can fully prepare students for the world as it is today so they can forge the tomorrow they want and we all need.”\nThe County is using these funds to provide an opportunity for smaller community-based organizations to begin promising new programs or to expand existing programs to improve educational outcomes and reduce inequities and disparities in our communities.\nProposals for the K-12 Youth Services Community Grant must focus on one or more of the following focus areas:\n\nEducational Equity/Acceleration of Learning\nBehavioral Health Needs\nHousing, Food Stability, Poverty\nMentorship\n\nOrganizations interested in applying for a K-12 Youth Services Community Grant must apply by 5 p.m., Friday, June 3. Grants are expected to range from $50,000 to $250,000 to be utilized for up to a twelve-month period.\nFor more information or to apply, visit sandiegocounty.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220502.15.55.55"}