{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Calls for Safe Easter Celebrations Amid COVID-19 Pandemic", "description": "With Easter weekend ahead of us, the County Health and Human Services Agency wants to remind San Diegans to celebrate the holiday safely.", "datePublished": "2021-04-02T16:55:09-07:00", "url": "https://www.countynewscenter.com/county-calls-for-safe-easter-celebrations-amid-covid-19-pandemic/", "keywords": ["health", "coronavirus", "covid-19", "easter", "red tier", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-04-02T16:55:09-07:00", "articleType": "article", "articleContent": "\nWith Easter weekend ahead of us, the County Health and Human Services Agency wants to remind San Diegans to celebrate the holiday safely. While the COVID-19 case numbers remain well below the December and January highs, it is too soon to let your guard down and attend gatherings without certain precautions.\nUnvaccinated San Diegans should continue to adhere to the current guidelines from the California Department of Public Health and keep gatherings small and short. Gatherings should include no more than three total households.\nAttendees should wear a face covering when not eating and adhere to social distancing practices. While indoor gatherings are allowed, outdoor gatherings are recommended.\nAccording to new guidance from the Centers for Disease Control and Prevention, those who are fully vaccinated can begin to relax restrictions and attend gatherings with other fully vaccinated people.\n“While new CDC guidance states that it is safe for fully vaccinated people to gather indoors or outdoors without a face covering, we know that at this time only about one in five San Diegans age 16 and over are fully immunized,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “I encourage everyone to follow the best practices for their situation to celebrate this holiday safely and keep us on a path to getting back to all the activities we enjoy.”\nEaster Testing and Vaccinations\nSeveral County testing and vaccination sites will pause on Sunday for the Easter holiday. The following sites will remain open, with modified hours:\n\nThe no-appointment testing sites at Cal State San Marcos and Tubman Chavez Community Center will be open with condensed hours from 10 a.m. – 2 p.m.\nThe vaccination sites at the North Coastal Live Well Center, Lemon Grove Community Center and South Region Public Health Center will be open from 9:30 a.m. – 3:30 p.m.\nThe Martin Luther King Jr. Community Center and Borderview YMCA vaccine sites will be closed on Easter.\n\nVaccination Progress:\n\nNearly 1.89 million COVID-19 vaccine doses have been delivered to the region, and almost 1.76 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, over 586,000 County residents, or 21.8% of San Diegans 16 and older, are fully immunized.\nOverall, more than 975,000 County residents have received at least one shot of the two-dose vaccine. That’s 36.3% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 4.9 cases per 100,000 residents. The County is in the Red Tier.\nCurrently, the testing positivity percentage is 2.1%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 2.7% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 6.\n\nCommunity Setting Outbreaks:\n\nTwo new community outbreaks were confirmed April 1, one in a restaurant/bar setting and one in a retail setting.\nIn the past seven days (March 26 through April 1), 10 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n18,435 tests were reported to the County on April 1, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,500.\n\nCases, Hospitalizations and ICU Admissions:\n\n496 COVID-19 cases were reported to the County on March 31. The region’s total is now 271,035.\n14,855 or 5.5% of all cases have required hospitalization.\n1,651 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n13 new COVID-19 deaths were reported April 1. The region’s total is 3,568.\nFour women and nine men died between Jan. 11 and April 1.\nOf the people who died, three were 80 years of age or older, seven were in their 70s, two were in their 60s and one was in their 50s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210402.16.55.09"}