{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "How to Protect Yourself from COVID-19 Omicron Variant", "description": "While the state’s first COVID-19 case caused by the Omicron variant has been detected in Northern California in a traveler from South Africa, San Diego County health officials are urging people to continue following existing guidance.", "datePublished": "2021-12-01T15:40:04-08:00", "url": "https://www.countynewscenter.com/how-to-protect-yourself-from-covid-19-omicron-variant/", "keywords": ["health", "coronavirus", "covid-19", "omicron variant", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-01T15:41:29-08:00", "articleType": "article", "articleContent": "\nWhile the state’s first COVID-19 case caused by the Omicron variant has been detected in Northern California in a traveler from South Africa, San Diego County health officials are urging people to continue following existing guidance.\nThe recommended preventive measures against COVID-19 and its previous variants, they say, are the best bet to protect against the new strain.\n“There’s a lot about Omicron we don’t know yet, such as how it spreads, how sick it can make people and how well existing vaccines work against it,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “In the meantime, the same precautions we’ve been advising for other strains of COVID-19 should help prevent or lessen the likelihood of people getting and spreading the Omicron variant, as well as the Delta, which is still the dominant strain.”\nAlthough no cases of the Omicron variant have been detected in the San Diego region, the County and the local medical community are regularly monitoring for the Omicron variant using genome sequencing.\nThe County is also working with the Centers for Disease Control and Prevention and the California Department of Public Health to review recommendations when the variant arrives in the region.\nHealth officials recommend the following measures to protect against all varieties of COVID-19, including the Omicron variant:\n\nGet vaccinated and get a booster if you qualify. The vaccine is available at health care providers, retail pharmacies and community clinics. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the My Turn website.\nWear a mask, especially in public indoor settings, regardless of vaccination status.\nGet tested if you have any symptoms, whether you’ve been vaccinated or not. You can make a free test appointment or find a walk-in test clinic at coronavirus-sd.com.\nWash your hands frequently and stay home if you’re sick and distance yourself from others.\n\nAn older man gets his COVID-19 vaccine at County Oceanside clinic.\nMore information about COVID-19, testing and vaccinations can be found at coronavirus-sd.com.\nVaccination Progress:\n\nDoses administered: Almost 5.63 million.\nReceived at least one shot: Over 2.66 million or 84.7% of San Diegans ages 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.36 million or 75.1 %.\nBoosters administered: 460,110.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n21 new deaths were reported since the last report on Nov. 24, 2021. The region’s total is 4,346.\n11 women and 10 men died between Aug. 16 and Nov. 27, 2021.\nFive were age 80 or older, five were in their 70s, six were in their 60s, three were in their 50s and two were in their 40s.\nTwo of the people who died were fully vaccinated and 19 were not fully vaccinated.\n16 had underlying medical conditions, four did not and one had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n622 COVID-19 cases were reported to the County on Nov. 30, 2021. The region’s total is now 385,396.\n2,955 cases were reported in the past week (Nov. 24 through Nov. 30) compared to 3,197 cases identified the previous week (Nov. 17 through Nov. 23)\nDuring the 30-day period between Oct. 19 to Nov. 17, there were 305 COVID-19 hospitalizations; 285 people were not fully vaccinated and 20 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 13.6 overall, 8.1 for fully vaccinated people and 23.1 for not fully vaccinated San Diegans.\n20,172 tests were reported to the County on Nov. 30, and the percentage of new positive cases was 3.1%.\nThe 14-day rolling percentage of positive cases among tests is 2.9%.\n\nCommunity Setting Outbreaks:\n\n17 new community outbreaks were confirmed in the past seven days (Nov. 24 through Nov. 30): four in TK-12 grade school settings, three in business settings, three in distribution warehouse settings, two in government settings, one in a restaurant/bar setting, one in a retail setting, one in a hotel/resort/spa setting, one in daycare/preschool/childcare setting and one in a hair salon/barbershop/nail salon setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211201.15.40.04"}