{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Adopt or Foster a Dog, Help Reduce Shelter Overcrowding", "description": "County animal shelters in Bonita and Carlsbad are looking for adoptive and foster families to address a problem affecting shelters throughout the United States, and that’s overcrowding. County shelters have too many pets, especially dogs.  ", "datePublished": "2024-01-18T11:54:35-08:00", "url": "https://www.countynewscenter.com/adopt-or-foster-a-dog-help-reduce-shelter-overcrowding/", "keywords": ["animals", "das", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-01-18T12:40:18-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty animal shelters in Bonita and Carlsbad are looking for adoptive and foster families to address a problem affecting shelters throughout the United States, and that’s overcrowding. County shelters have too many pets, especially dogs.  \nA variety of factors led to overcrowding, including a challenging economy and housing shortages for many families. This has forced some people to make the difficult decision to abandon or relinquish their beloved dogs.  The rising cost of food and veterinary care is also a factor for some families. \n“More dogs are coming into the shelter this year than there were last year, and fewer dogs in the shelters are being adopted or reclaimed by their owners,” said San Diego County Animal Services Director Kelly Campbell. “We don’t want to run out of room and need the community’s help.  Adopting or fostering makes a huge difference for the animals in our care and has great benefits for those fostering or adopting.”  \nA scientific study by the American Heart Association in 2019 showed that dog owners live longer and healthier lives than people without a dog. This was often due to an increase in physical activity from daily walks. Dogs also help people improve mental health by reducing daily stress or anxiety, according to a 1991 study in the Journal of the Royal Society of Medicine. \nLast year, the County Department of Animal Services shelters took in more than 57 hundred animals, and more than 51 hundred were adopted or returned to their owners. \nHousing and financial hardship were among the top five reasons why dogs were voluntarily relinquished to the shelters. The top reasons for relinquishment were the death of an owner or their ability to care for the animal and too many dogs in the home. \nIf you can adopt a dog, or foster one, but have been putting it off, please consider the urgent need. All dogs that have been in the shelter for more than 30 days will have adoption fees waived. \nIf adoption is not currently an option, fostering is always free. Please consider joining the County’s foster program. Even short breaks of a few days away from the shelter environment significantly improves the health and well-being of pets. All basic care supplies such as food, leash and bedding are included as part of the program. \nPet owners are asked to please have pets spayed or neutered to avoid pet overpopulation. County Animal Services can assist by providing low-cost referrals. \nPeople can also assist with dog food donations which Animal Services pass along to community members who need help.  \nIf you’re interested, in adopting one of the County’s wonderful dogs, walk-in hours are from 1 to 4 p.m. Tuesday through Friday and 10 a.m. to 4 p.m. Saturday and Sunday at the South Shelter, 5821 Sweetwater Road in Bonita and the North Shelter, 2481 Palomar Airport Road in Carlsbad.  \nCheck out some of the available pets on the Animal Services website. \nTo adopt, you just need a photo identification card. Adoptions are on a first-come, first-served basis.  \nFor more information on fostering animals, making pet food donations, or volunteering for the shelter, call (619) 767-2675 or visit the Animal Services main website. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240118.11.54.35"}