{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Second Local COVID-19 Death Reported", "description": "A second San Diego County resident has died from COVID-19, and two infants have been diagnosed with the disease.", "datePublished": "2020-03-24T18:59:08-07:00", "url": "https://www.countynewscenter.com/second-local-covid-19-death-reported/", "keywords": ["health", "coronavirus", "covid-19", "death", "firearms retail shops", "hhsa", "law enforcement", "novel coronavirus", "sheriff bill gore"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-03-26T13:30:22-07:00", "articleType": "article", "articleContent": "\nA second San Diego County resident has died from COVID-19, and two infants have been diagnosed with the disease.\nPublic Health Officer Dr. Wilma Wooten, M.D., M.P.H., reported during a news conference Tuesday that the 76-year-old man had significant health issues. Wooten also noted the first two San Diego County cases of coronavirus disease in infants, a 6-week-old boy and a 4-month-old girl. Both are currently isolated in their homes.\nCases are increasing daily and Wooten doesn’t expect a downturn anytime soon.\n“Things are likely to get worse before they get better. We do not believe that the local wave of COVID-19 cases has yet crested,” said Wooten. “It’s incumbent upon on all of us to do our part to flatten the curve.”\nCases Rise to 242\nThrough 5 p.m. Tuesday, the County total number of confirmed COVID-19 cases increased to 242, 12 more than Monday. Two San Diego County residents have died.\nOf the total, 226 were San Diego County residents and 16 were non-residents.\nOf the 242 cases, two are less than 9 years old, three are between 10 and 19 years old, 163 were people between the ages of 20 and 49; 33 were between 50 and 59; and 41 were 60 or older. The County’s daily coronavirus in San Diego webpage now also breaks down the number of cases by city and unincorporated communities.\nHealth Order Enforcement\nAt the news conference, Sheriff Bill Gore said his department has not issued any citations for violations of the state and county’s public health orders that close certain businesses and require social distancing.\n“We’re choosing instead to get voluntary compliance and so far, that’s what we received,” Gore said.\nIf that changes, the Sheriff’s Department will start to issue citations, which carry up to a $1,000 fine and six months in jail.\nCOVID-19 County Response Update\nCounty Supervisors were updated on the County’s response to COVID-19 during a board meeting Tuesday.\n\nTesting: The County will soon get additional testing kits to augment those coming from the CDC. Testing is conducted at the County Public Health Lab, hospitals and commercial labs. Six hospitals also offer lab testing, and another is expected by the end of the week. Two nationwide commercial labs, Quest and LabCorp are actively testing as well. Public health nurses began offering drive-through testing by referral only on March 13. So far, 26 people have been tested.\nSupplies: The County is low on face shields, gowns and goggles but supplies from the national stockpile are expected Tuesday. The County’s Medical Operations Center is in constant contact with hospitals and is filling supply requests daily.\nShelter and Care: The County developed a temporary lodging system for the general population and those experiencing homelessness who require isolation because of COVID-19. They must be referred by County nurses at the shelters, homeless outreach teams or health care providers. The County has about 2,000 hotels rooms in the region.\nFlattening the Curve: The County is actively trying to flatten the curve of cases and deaths from COVID-19. Wooten told the Board if nothing is done, the curve spikes increasing the number of deaths and overburdening the health system. If people follow guidelines to stay home, the curve flattens. COVID-19 cases extend along a greater time period, but the health system can manage the pandemic leading to fewer cases and deaths, until a vaccine and anti-viral medications can be produced.\n\nCounty Board Actions Tuesday\nThe County Board of Supervisors voted to:\n\nProtect tenants, homeowners and small businesses in the unincorporated area that cannot pay rent because of the COVID-19 pandemic with a moratorium on evictions. The County will also work with financial institutions to provide similar protections for those facing foreclosure.\nDefer County fees for most local food facilities that had to close, limit services and suffered financial losses because of the COVID-19 public health order. Health permit renewals, late fees and food plan review correction fees submitted before March 1 do not have to be paid until Sept. 1. While grocery stores and markets are allowed to continue operating under the order, other food and beverage industry operations such as restaurants, bars, breweries, caterers, mobile food facilities and schools need support to recover.\nApprove $10 million to cover COVID-19 related costs.\n\nWhat Everyone Can Do to Minimize Chances of Getting COVID-19\nPeople can help limit the spread of infection, by taking these steps:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nGet COVID-19 Info Via Text\nCounty residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system. The system allows County health officials to send real-time information about COVID-19 in the region. To sign up to receive the messages, text COSD COVID19 to 468-311. The system was set up to let County public health officials issue information and instructions on changes related to COVID-19 in the region.\nIf you have individual questions, please talk to your health care provider. For community resources, please call 2-1-1 San Diego or visit 211sandiego.org or the County’s Coronavirus Disease webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200324.18.59.08"}