{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State of the County Address Focuses on New Ideas in Challenging Times", "description": "San Diego County Board of Supervisors Vice Chair Terra Lawson-Remer gave the State of the County address during an evening presentation on Wednesday, April 16.", "datePublished": "2025-04-17T17:18:19-07:00", "url": "https://www.countynewscenter.com/state-of-the-county-address-focuses-on-new-ideas-in-challenging-times/", "keywords": ["government", "2025 state of the county address", "district 3", "natural history museum", "state of the county", "terra lawson remer", "vice chair"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-04-17T17:39:49-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSan Diego County Board of Supervisors Vice Chair Terra Lawson-Remer gave the State of the County address during an evening presentation on Wednesday, April 16.\nVice Chair Lawson-Remer focused her address challenges at the federal level and how they affect programs that impact San Diegans.\nShe outlined proposals on how to support the County’s health, behavioral health and homelessness programs, the environment, consumer protections and more.\nVice Chair Lawson-Remer told the audience she wants the County to start a Medicaid plan of its own, a managed health care plan that could come to fruition in four years.\nShe said a local revenue measure could leverage $1 billion a year to support the health program and other needs, like public safety, essential services, childcare for working families and expand in-home supportive services for the older adults.\nThe vice chair called for reform of the County’s reserves policy to staff and equip the new public health lab.\nShe supports a bill that would use border toll revenues to clean up the Tijuana River Valley and proposes using freed up County reserves to create a $10 million matching fund to match state grants or philanthropic donations.\nThe vice chair would like to create a new County Consumer Financial Protection Division to protect San Diegans and she’s exploring the possibility of creating a public bank that could finance affordable housing.\nShe closed by recognizing the efforts of County employees who serve the people in the region.\nThe live address took place at the San Diego Natural History Museum at Balboa Park and was available in American Sign Language at the venue, on social media channels and television. The broadcast offered live interpretation in Spanish via Zoom.\nFor details and information on additional proposals, watch the entire address above.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250417.17.18.19"}