{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "2 Additional COVID-19 Deaths Reported; Face Coverings Mandatory Starting May 1", "description": "The number of local COVID-19 deaths went up by two and total cases saw a record increase for a second day in a row with an additional 183 confirmed cases, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-24T18:45:10-07:00", "url": "https://www.countynewscenter.com/2-additional-covid-19-deaths-reported-face-coverings-mandatory-starting-may-1/", "keywords": ["health", "102 covid-19 deaths", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-04-25T15:18:44-07:00", "articleType": "article", "articleContent": "\nThe number of local COVID-19 deaths went up by two and total cases saw a record increase for a second day in a row with an additional 183 confirmed cases, the County Health and Human Services Agency announced today.\nBoth deaths were women, one in her late 40s, the other in her 60s. One of them died April 22 and the other died April 23. Both had underlying medical conditions.\n“Our sincerest sympathies and condolences go out to the family and friends of the deaths announced today,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We are very sensitive to the tremendous sacrifices being made by the community and I would like to commend the public for staying the course and staying home to decrease the spread of COVID-19.”\nTo date, 102 San Diegans have died from complications of COVID-19. Of the people who have died, 89 were 60 years and older; 56 were men and 46 were women. Age, gender and ethnic/race breakdowns for cases and deaths are posted at coronavirus-sd.com.\nCounty COVID-19 Cases Reach 2,826\nOf the nearly 42,000 COVID-19 tests administered to San Diegans to date, 2,826, or 6.8 percent have been positive. While today’s numbers represent the region’s highest one-day total of positive cases, it is important to note that the County also saw the highest number of tests being administered in one day. A total of 3,122 tests were administered and the 183 positives make up just under 6% of the total tests reported today.\nOf the local cases, 1,445 (51.1%) were men and 1,377 (48.7%) were women. The gender of one person is unknown. Of the reported cases, 658 (23.3%) have required hospitalization and 218 (7.7%) of the total number of people who tested positive had to be placed in intensive care. A total of 102 (3.6%) have died.\nChanges to Public Health Orders\nThe County announced it is dialing back restrictions on certain activities that are currently being limited to prevent the spread of COVID-19. Starting Monday, April 27, coastal communities can open beaches and bays for swimming, surfing, kayaking and paddleboarding. If cities open their beaches, walking and running on the sand will continue to be permitted.\nParking lots at beaches will remain closed and sitting or lying on the sand will be prohibited. Group activities like volleyball and other team sports are not permitted and boating is still banned.\nIndividual coastal cities will oversee beach access in their communities and may impose stricter guidelines than those outlined by the County or choose not to grant beach access.\nThe County is also taking steps needed to prepare for dialing back restrictions even further. Starting May 1, the County hopes to:\n\nRelax restrictions at parks and golf courses if they can enforce social distancing.\nAllow parks to reopen parking lots, with limitations\nAllow visitors to sit, lie down and picnic if they practice social distancing.\nAllow members of the same family or household to play team sports, including volleyball and basketball.\n\nBeginning next Friday, May 1, all County residents will also be required to cover their face while they are out in public and within six feet of someone that is not a household member.\nNew COVID-19 Testing Sites\nStarting Monday, the County will open two drive-through testing sites, one at the North Inland Live Well Center in Escondido and the other at the Public Health Center in Chula Vista. Mobile testing sites will soon be deployed in other parts of the region to accommodate the growing demand for testing.\nSymptomatic people who would like to be tested will need a referral from their doctor. People without a provider or health care coverage can call 2-1-1 and ask to speak to the nurse triage line to request a referral. People with doctor referrals must call 2-1-1 for a screening and an appointment.\nMore COVID-19 Information\nThe County is reporting the rate of positive cases by ZIP code, which is a more accurate indicator when comparing data among groups of different sizes.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200424.18.45.10"}