{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Getting Ready to Install Naloxone Vending Machines", "description": "The County of San Diego is readying a new tool to help fight the growing number of opioid overdoses in the region.", "datePublished": "2022-07-28T14:27:07-07:00", "url": "https://www.countynewscenter.com/?p=209067", "keywords": ["health", "comprehensive harm reduction strategy", "naloxone", "narcan", "substance use"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-07-28T14:27:07-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is readying a new tool to help fight the growing number of opioid overdoses in the region.\nThe County will install 12 naloxone vending machines throughout the region by next summer, with half of them scheduled to go up by the end of this year.\nNaloxone, also known by the brand name Narcan, is a medication used to reverse overdoses by restoring normal breathing. The drug can prevent overdose deaths if used quickly and followed by medical treatment.\n“Naloxone is a proven life saver in overdose situations and San Diego County Behavioral Health Services and its partners are working hard to expand access,” said Nicole Esposito, the County’s chief population health officer. “The enhanced distribution of naloxone into the hands of community members is vital in saving lives that might otherwise be lost to overdose.”\nRisks related to substance use and opioid-related drug overdoses have been on the rise in the region for the last couple of years.\nBased on preliminary data, nearly 900 people died from accidental opioid overdoses in San Diego County in 2021. That’s a 55 percent increase compared to 2020.\nA Comprehensive Effort\nThe goal of the County’s Naloxone Distribution Program is to disseminate 33,000 naloxone kits by June 30 of next year.\nUse of the vending machines will be open to anyone in the community 18 years of age or older.\nRegistration and use will be anonymous and free of charge. Anyone who wishes to access the vending machines must first complete an online training. Once completed, individuals will receive a pin to access naloxone from the vending machines.\nThe Naloxone Distribution Program directly aligns with the San Diego County’s Comprehensive Harm Reduction Strategy, which was approved by the County Board of Supervisors last year. The program provides wrap-around services for San Diegans who use drugs.\nIn addition to the naloxone vending machines, the effort includes targeted outreach and trainings and partnerships with community-based programs.\nTreatment is Available\nThe County funds residential and outpatient treatment programs across the region to help people recover from substance use disorders.\nParticipation in treatment and recovery services improves wellbeing, can reunite families and loved ones, and also improves overall health.\nSubstance use treatment resources are available by calling the County’s Access and Crisis Line at (888) 724-7240, calling 9-8-8 or by calling 2-1-1.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220728.14.27.07"}