{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "“Great Plates Delivered” to Send Free Meals to Seniors", "description": "Qualified older adults in the region can now sign up to get three free and healthy meals a day delivered to their home for a limited time through the “Great Plates Delivered” program, the County Health and Human Services Agency announced today.", "datePublished": "2020-05-14T14:39:12-07:00", "url": "https://www.countynewscenter.com/great-plates-delivered-to-send-free-meals-to-seniors/", "keywords": ["health", "coronavirus", "covid-19", "food", "older adults", "seniors"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-14T14:39:12-07:00", "articleType": "article", "articleContent": "\nQualified older adults in the region can now sign up to get three free and healthy meals a day delivered to their home for a limited time through the “Great Plates Delivered” program, the County Health and Human Services Agency announced today.\nThe initiative is a collaboration between the County and local restaurants. The goal of the program is to help older adults, who are at a higher risk of developing complications from COVID-19, avoid going out to restaurants or the grocery store to get food. The meal delivery is scheduled to run through June 10, though it may be extended.\n“Older adults are vital members of our community,” said Kimberly Gallo, Aging & Independence Services director. “The Great Plates Delivered program is an excellent example of how government and businesses can innovate and work together to meet the needs of older adults during these difficult times.”\nIn addition to assisting older County residents, the program will help local restaurants stay afloat amid the statewide stay-at-home orders. The County will reimburse restaurants for the cost of food, labor and incidentals, using a combination of funding provided by FEMA, the State and the County.\nFood providers were selected by a County committee based on several factors, including their ability to meet volume and nutritional standards, source local produce and meats, as well as prioritizing local jobs and worker retention.\nThe program is open to county residents who meet the following criteria:\n\nPeople 65 and older who live alone or with one other older adult\nCounty residents 60-64 who are high-risk as defined by the CDC, including:\n\nPeople who tested positive for COVID-19\nPeople with an underlying medical condition that puts them at a higher risk of developing complications from COVID-19\nPeople who have been exposed to COVID-19 and do not require hospitalization, but are required to self-isolate or self-quarantine\n\n\n\nThose currently receiving assistance from other state or federal nutrition assistance programs, such as CalFresh or Meals on Wheels, are not eligible for the Great Plates Delivered program. Participants must also fall within a specific income range.\nFor more details or to sign up, call the AIS Call Center at (800) 339-4661 or visit www.aging.sandiegocounty.gov/greatplates. You can also call 2-1-1 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200514.14.39.12"}