{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Postcards Go Out to Registered Voters for November Presidential General Election", "description": "The San Diego County Registrar of Voters office sent over 1.9 million postcards to the County’s registered voters.", "datePublished": "2024-07-23T14:14:55-07:00", "url": "https://www.countynewscenter.com/postcards-go-out-to-registered-voters-for-november-presidential-general-election/", "keywords": ["elections", "county registrar of voters", "fgg", "nov. 5 presidential general election", "registrar of voters", "voting option postcards"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-07-23T15:18:25-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe San Diego County Registrar of Voters office is sending over 1.9 million postcards to the County’s registered voters this week.\nThe “VOTE! MORE DAYS. MORE WAYS.” postcards are sent nearly 100 days before the election to remind voters of their voting options for the November Presidential General Election.\nEvery active registered voter will automatically receive a ballot in the mail and will have three options for returning that ballot: by mail, to one of the Registrar’s official ballot drop boxes or at any vote center. Voters can expect to receive their ballot the week of Oct. 6, giving them nearly a month to mark their ballot and return it by the final day of voting on Nov. 5.\nElections are no longer a one-day event and there is no need to wait until the final day to vote.\nBe prepared. Due to the large number of contests on the ballot, it may take you longer to complete your ballot.\nIf you want to vote in person and avoid long lines, select vote centers will offer early voting starting Saturday, Oct. 26. The vote centers will be open daily from 8 a.m. to 5 p.m.\nStarting Saturday, Nov. 2, over 200 vote centers will be open daily from 8 a.m. to 5 p.m. until the final day of voting on Tuesday, Nov. 5, when all vote centers will be open from 7 a.m. to 8 p.m.\nThe Registrar’s office anticipates opening 146 official ballot drop boxes starting Oct. 8. A list of official ballot drop boxes and vote centers will be available in September at sdvote.com.\nWhat do you need to do?\nBe vote ready!\n\nCheck your voter registration information. Make sure your residence address is up to date, and if you have a separate mailing address, check that too. If accurate, no further action is needed. If different, you need to complete a new voter registration.\nHave you recently moved or changed your name? Whether you’re new to San Diego County or just moved down the street, you need to re-register to vote. You can do this by completing a new registration online at sdvote.com.\nNot registered? Register to vote – it takes less than two minutes.\n\nLearn more about voting in the November presidential general at sdvote.com. or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240723.14.14.55"}