{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reminds People to get Up to Date with COVID-19 Vaccinations, Boosters", "description": "As the County plans to end its COVID-19 emergencies this month, County public health officials remind the public the response to the ongoing pandemic continues, and that people should also continue to protect themselves by getting up to date with COVID-19 vaccinations.", "datePublished": "2023-02-09T17:23:52-08:00", "url": "https://www.countynewscenter.com/county-reminds-people-to-get-up-to-date-with-covid-19-vaccinations-boosters/", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-02-09T17:26:19-08:00", "articleType": "article", "articleContent": "\nAs the County of San Diego plans to end its COVID-19 emergencies this month, County public health officials remind the public they will continue to respond to the ongoing pandemic.\nTo that end, they continue to urge people to protect themselves and get up to date with their COVID-19 vaccinations, including getting a bivalent booster if they haven’t already.\n“It remains extremely important for people to protect themselves, their families and their friends from COVID-19,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “The coronavirus is still circulating in our community and can be dangerous and even fatal for some who contract it. The best way to prevent getting seriously ill is to get current with your COVID-19 vaccinations, including your bivalent booster.”\nThe County’s Board of Supervisors accepted a COVID-19 update this week stating the County’s nearly 3-year-old coronavirus local and health emergencies will end Feb. 28, matching the state of California’s ending date.\nThe update also stated the County will continue to provide all the services needed to protect the public and respond to the continuing pandemic including surveillance, testing, tracing, treatment, vaccinations and public engagement.\nCOVID-19 cases and hospitalizations are currently declining in San Diego County.\nBoth COVID-19 vaccinations and treatment remain widely available throughout San Diego County. COVID-19 primary series vaccines and bivalent boosters, as well as flu vaccines are available at local pharmacies, medical providers’ offices, and County vaccination sites. People can check online for the days and hours sites are open.\nNew studies continue to report the bivalent COVID-19 boosters add protection against new COVID-19 variants that make up most new cases in the San Diego County, and they protect against COVID-19 causing hospitalizations and deaths. The Centers for Disease Control and Prevention (CDC) and California Department of Public Health (CDPH) recommend a bivalent booster for everyone six months of age and older. Previous CDC studies have reported that people who have not been vaccinated run much higher risks of dying from COVID-19 than those who have been vaccinated.\nPreventive Measures   \nIn addition to vaccination and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often.\nStaying away from sick people.\nWearing a facial covering, especially in crowded indoor settings.\nRegularly cleaning commonly touched surfaces.\nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County’s COVID-19 testing webpage.\n\nCOVID-19 Vaccination Progress \n\nMore than 2.69 million or 80.6% of San Diegans have received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 567,647 or 22.6% of 2,513,342 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators.\nCOVID-19 Data \nFor the week ending Feb. 4, 2023, the report shows:\n\n1,714 COVID-19 cases were reported to the County in the past seven days. The region’s total is now 978,824.\nThe 1,714 cases reported in the past week were lower compared to the 1,870 infections identified the previous week.\nSeventeen additional deaths were reported in the week ending Feb. 4, 2023. The region’s total is 5,745.\nFifteen of the people who died were 65 or older.\nThirteen of the people had been vaccinated and four were unvaccinated or had not completed the primary vaccine series.\nFourteen had underlying medical conditions. Three determinations of underlying medical conditions are pending.\n\nInfluenza Data \nFor the week ending Feb. 4, 2023, the report shows the following:\n\nOne additional flu death was reported; the season’s total is 40.\nThe individual had underlying medical conditions.\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 3% the previous week).\nLab-confirmed influenza cases for the week: 75 (compared to 88 the previous week).\nTotal lab-confirmed cases to date: 20,803 (compared to 1,512 at the same time last season and a 7,239 prior 5-year average during the same week).\n\nMore Information\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230209.17.23.52"}