{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Paves Way to Leverage State Homekey and Local Funding for New Housing Developments", "description": "County Supervisors approved setting aside $32 million in state and County funds Tuesday to help quickly create housing for people experiencing homelessness, or who are at risk of homelessness, and $4.6 million a year in services to support them.", "datePublished": "2023-05-23T16:36:36-07:00", "url": "https://www.countynewscenter.com/board-paves-way-to-leverage-state-homekey-and-local-funding-for-new-housing-developments/", "keywords": ["housing", "affordable housing", "hhsa", "homekey", "homelessness and housing"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-05-23T16:46:46-07:00", "articleType": "article", "articleContent": "\nCounty Supervisors approved setting aside $32 million in state and County funds Tuesday to help quickly create housing for people experiencing homelessness, or who are at risk of homelessness, and $4.6 million a year in services to support them.\nThe Board action came on the heels of the state making over $34 million for the San Diego region available in Homekey funding in late March.\nCalifornia’s Homekey program was started in 2020 to provide funding to local governments to rapidly buy housing options to help the most vulnerable during the COVID-19 pandemic. It is now in its third round of funding.\nThe County is partnering with the San Diego Housing Commission and the City of San Diego to apply for the Homekey funding to buy and rehabilitate housing focusing on four development projects.\nThe County’s $32 million would come from $24.5 million in federal American Rescue Act Plan funds and $7.5 million from the County’s Behavioral Health Impact Fund.\nThe City of San Diego would also contribute $32 million; the Housing Commission will add 320 project-based housing assistance vouchers valued at over $68 million.\nThe County’s Health and Human Services Agency would use the $4.6 million annual funding to provide behavioral health and other services to support new tenants.\n“This partnership coupled with the available Homekey funding can provide permanent housing and crucial supportive services to an estimated 325 to 500 San Diegans in need,” said David Estrella, Director of the County’s Housing and Community Development Services. “Today’s action paves the way to ensure valuable State resources are brought home for the most vulnerable residents in our community.”\nLocal governments that are eligible to use the Homekey money include cities, counties and other local public agencies that can apply with for-profit and nonprofit developers.\nIn 2022, the County, City of San Diego, San Diego Housing Commission and PATH ventures were awarded $11.8 million in Homekey funds to build a 41-unit development that is currently under construction.\nThe County’s reserved capital and supportive services funding is contingent on the completion of due diligence and Homekey funding awards.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230523.16.36.36"}