{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Health Officials Urge Mpox Vaccinations for People At Risk", "description": "County public health officials are urging people at risk who have not gotten Mpox vaccinations to do so following a cluster of Mpox cases in Chicago and warnings from the Centers for Disease Control and Prevention about the potential for a resurgence in cases.", "datePublished": "2023-06-06T08:57:03-07:00", "url": "https://www.countynewscenter.com/county-health-officials-urge-mpox-vaccinations-for-people-at-risk/", "keywords": ["health", "monkeypox", "mpox", "mpox vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-06-06T09:03:06-07:00", "articleType": "article", "articleContent": "\nSan Diego County public health officials are urging people at risk who have not gotten Mpox vaccinations to do so following a cluster of Mpox cases in Chicago and warnings from the Centers for Disease Control and Prevention about the potential for a resurgence in cases.\nSan Diego County last recorded a case of Mpox, formerly known as monkeypox, during the week of Feb. 18. The majority of the region’s 473 cases occurred between June 15, 2022 and Aug. 31. The County has reported 18 hospitalizations and no deaths from the virus.\nAlthough anyone can get Mpox infection, sexually active gay, bisexual and other men who have sex with men, as well as transgender individuals, have been most affected by Mpox in the United States and in San Diego.\nPeople who have received the two-dose vaccination do not have to be re-vaccinated. While cases have been reported in fully vaccinated people, the vaccine is still highly effective and the best tool for Mpox prevention. People who received only one dose of vaccine should receive their second as soon as possible to complete their series.\n“We are asking for people who are at risk of Mpox to get vaccinated or get up to date on their vaccinations and consider taking steps to prevent Mpox exposure,” said Dr. Ankita Kadakia, County deputy public health officer. “I am confident we can build off the collaboration and partnerships developed last year with the LGBTQ+ community to protect those at risk.”\nCounty public health officials are continuing to work with the LGBTQ+ community on education and prevention messaging.\nA local Mpox text message alert system established last year has 4,485 subscribers. To sign up to receive the messages, in both English and Spanish, text “COSD MONKEYPOX” to 468-311.\nThe JYNNEOS two-shot vaccination series is widely available. People can schedule vaccination appointments through California’s MyTurn website, their healthcare providers or a County STD clinic.\nFor the  latest information on Mpox in San Diego County and access to educational materials, go to the County Health and Human Services Mpox website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230606.08.57.03"}