{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "TB Exposure Reported at San Diego City College  ", "description": "The County's Tuberculosis Program, San Diego City College (SDCC) and SDCC’s Early Education Center (EEC) are working in close collaboration to notify employees, students and children potentially exposed to tuberculosis (TB) on the SDCC campus. ", "datePublished": "2024-02-29T19:13:02-08:00", "url": "https://www.countynewscenter.com/tb-exposure-reported-at-san-diego-city-college/", "keywords": ["health", "san diego city college", "tb", "tb expsoure", "tuberculosis"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-02-29T19:13:02-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Tuberculosis Program, San Diego City College (SDCC) and SDCC’s Early Education Center (EEC) are working in close collaboration to notify employees, students and children potentially exposed to tuberculosis (TB) on the SDCC campus. \nExposures to the general public, most SDCC students and faculty and to other employees are believed to be limited. \nThe dates of potential exposure are from Sept. 15, 2023, to Feb. 21, 2024. Those known to have been potentially exposed have been directly notified and have been provided direction from health officials. People sick with TB may be sick for many months before they are diagnosed, and as such, exposure periods can be long. \nTB is an airborne disease that is transmitted from person to person through inhalation of the bacteria from the air. The chance of infection is higher for people with prolonged indoor exposure to a person who is sick with TB.  \n“Symptoms of active TB disease include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with tuberculosis will become ill in the future, sometimes even years later if their latent TB infection is not treated. Blood tests and skin tests are effective in determining whether someone has been infected. Unfortunately, young children are at higher risk of rapid progression to active TB disease, so complete evaluation and preventive treatment for young children is particularly important.” \nPeople who test positive for TB but who don’t have symptoms of active TB should get a chest x-ray and talk to a medical provider, as they may have a latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.”  \nTaking medicines for latent TB infection can cure the infection and keep these people from ever getting active TB disease. Young children should complete a TB test, as well as chest x-rays, and in most instances should receive preventive medication until their evaluation is complete. \nThose with symptoms of active TB disease and who are immune-compromised should see a medical provider to rule out active tuberculosis and discuss preventive treatment. \nPeople who would like more information on this potential exposure should call the County TB Control Program at (619) 692-8621.  \nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 cases in 2020 and 201 people reported active disease in 2021. \n In 2023, 243 people were reported with active TB disease in San Diego County, up from 208 in 2022.  An estimated 175,000 people in San Diego County have latent TB infection and are at risk for developing active TB disease if they go without preventive treatment.  \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240229.19.13.02"}