{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Receives Independent Commission’s Final Redistricting Map", "description": "The County of San Diego received the new maps that will outline County supervisorial voting districts for the next decade Wednesday from the Independent Redistricting Commission.", "datePublished": "2021-12-15T15:57:23-08:00", "url": "https://www.countynewscenter.com/county-receives-independent-commissions-final-redistricting-map/", "keywords": ["government", "redistricting commission", "supervisorial districts", "voting"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-12-16T11:12:25-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego received the new maps that will outline County supervisorial voting districts for the next decade Wednesday from the Independent Redistricting Commission.\nRedistricting — redrawing voting boundaries — is done every 10 years, using U.S. Census data to ensure that voting districts contain roughly the same number of people.\nThis was the first time that local boundaries were set by an independent commission. The 14-member commission capped off a year of work and 49 public meetings last week to meet its Dec. 15 deadline to submit the new boundaries to the County Clerk of the Board of Supervisors.\nThe new maps establish one County supervisorial district — District 1 currently represented by Supervisor Nora Vargas — as a majority Latino district, with 61.4% of the population and 58.2% of the voting age population identified as Latino. District 1 includes unincorporated areas and the cities of Imperial Beach, National City and Chula Vista.\nDistrict 2 and District 5 are the largest geographic districts, between them stretching from the coast in the west, to the Orange and Riverside county lines to the north, east to the Imperial County line and south to the U.S.-Mexico border.\nDistrict 2, currently represented by Supervisor Joel Anderson, is mainly an eastern district and includes unincorporated areas and the cities of El Cajon, Poway and Santee.\nDistrict 5, currently represented by Supervisor Jim Desmond, is mainly a northern district and includes unincorporated areas and the cities of Escondido, Oceanside, San Marcos and Vista.\nDistrict 3, currently represented by Supervisor Terra Lawson-Remer, is mainly a coastal district stretching from Carlsbad to Coronado.\nDistrict 4, currently represented by Chair Nathan Fletcher, includes unincorporated areas around parts of the cities of San Diego, Lemon Grove and La Mesa.\nThe redistricting commission’s final maps and reports are available on the County of San Diego Redistricting webpage.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211215.15.57.23"}