{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Affordable Housing Headed to National City", "description": "An exciting groundbreaking today in National City marked the beginning of construction for a new multi-family affordable housing community. Union Tower will bring 94 new affordable homes to 2312 F Avenue, the first phase in an eight-phase development.", "datePublished": "2024-09-16T16:12:47-07:00", "url": "https://www.countynewscenter.com/affordable-housing-headed-to-national-city/", "keywords": ["health", "affordable housing", "innovative housing trust fund", "low-income housing", "national city", "vash"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-09-16T16:12:47-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteAn exciting groundbreaking today in National City marked the beginning of construction for a new multi-family affordable housing community.\nUnion Tower will bring 94 new affordable homes to 2312 F Ave., the first phase in an eight-phase development. When Union Tower is complete, it will offer residents 45 one-bedroom units, 24 2-bedroom units and 24 3-bedroom units along with one manager’s unit.\nIn addition, 24 of the apartments will be reserved for veterans and provide wrap-around supportive services including case management, physical and mental health care and service coordination.\n“The County of San Diego has invested more than $314 million in affordable housing since 2017 and is all in on its creation and preservation,” said Caroline Smith, interim director of the Health and Human Services Agency. “Our $3.5 million investment in Union Tower from the Innovative Housing Trust Fund and allocation of 24 vouchers for veterans will help keep these homes affordable for generations to come.”\nThe Union Tower property is centrally located between Interstates 5 and 805, offering easy access to public transit, shopping, and many other community resources. The development was made possible through a collaboration between the County, National City, San Diego County’s Building Trades Unions, Wakeland Housing and Development and other public and private partners.\nThe Tenant Interest List opens in the summer of 2025. For more information, visit Wakeland Housing and Development. Construction is expected to be complete in the spring of 2027.\nSince 2017, the County has invested more than $314 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal, and local funding sources administered by the County.\nThose funds have helped open doors to over 2,300 homes with 3,300 more on the way.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240916.16.12.47"}