{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Study States Regional Collaboration Key to Decarbonization", "description": "Reducing carbon emissions to zero regionally can be done, according to a new academic report commissioned by the County.  The reductions will require local governments and agencies to work together, and the County of San Diego is positioned to coordinate that effort, the report states.", "datePublished": "2021-11-15T13:17:17-08:00", "url": "https://www.countynewscenter.com/new-study-states-regional-collaboration-key-to-decarbonization/", "keywords": ["environment", "climate action", "climate justice", "decarbonization", "regional decarbonization framework", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-11-15T15:35:27-08:00", "articleType": "article", "articleContent": "\nReducing carbon emissions to zero regionally can be done, according to a new academic report commissioned by the County.  The reductions will require local governments and agencies to work together, and the County of San Diego is positioned to coordinate that effort, the report states.\nCounty Supervisors have scheduled a public hearing Wednesday, Nov. 17 to discuss the draft “San Diego Regional Decarbonization Framework” report’s findings as it nears its first phase of completion in February.\nThe Board commissioned the report in January when it voted to pursue leading an effort to move the entire region — not just the unincorporated county within its jurisdiction — toward net zero-carbon emissions. Project representatives said this county-led approach is the first of its kind in the nation.\nThe effort would require working with the region’s 18 cities and agencies like the San Diego Association of Governments (SANDAG).\nThe data-driven report is being developed by the UC San Diego School of Global Policy and Strategy and other energy, transportation and building systems experts. A supplemental study about the impact decarbonization would have on jobs, another by the University of San Diego Energy Policy Initiatives Center looking at climate action policies and social equity across the region, and the inclusion of additional stakeholder input will complete a fully integrated report in August 2022.\nThe UC San Diego report proposes strategies to reduce regional carbon emissions to net-zero levels no later than 2045, the carbon neutrality goal California set in 2018. The report states that it intends to inform regional, county and city policy making. And that it is separate from but complements ongoing climate action planning efforts by local governments — such as the County’s work to create a new Climate Action Plan — and agencies involved with regional energy, transportation and land-use planning.\nIt also says local governments have become the de facto leaders in the race to reduce greenhouse gases “in the absence of meaningful international action” because local governments are “on the front lines of both climate change adaptation and mitigation efforts.”\nThe report says the County of San Diego is in the right position to help lead local efforts in the region for several reasons.\nThe County has direct influence over greenhouse gas reduction in several areas, such as through its land-use development authority in unincorporated areas. It also has indirect influence as a regional governing body with elected officials representing all parts of the county. It has a role in developing and acquiring electricity as a member of San Diego Community Power. And it’s a voting member of several agencies and boards with authority over transit, water and air quality. That includes SANDAG, the San Diego Air Pollution Control District, the Metropolitan Transit District and North County Transit District, and the San Diego Regional Airport Authority.\nThe report proposes targeting four major contributors of greenhouse gases to reach net-zero emissions: electricity, transportation, buildings and land use.\nDecarbonizing Electricity:\nDramatically increasing the amount of renewable energy county residents use. That would require transitioning away from natural gas-powered electricity plants, siting more solar and wind electricity plants, and potentially upgrading transmission lines.\nDecarbonizing Transportation:\nFinding ways to get more people into electric vehicles — something the report noted the County has jump-started with its Electric Vehicle Roadmap that will build charging stations and encourage people to buy electric vehicles. The report says the region also needs to decrease the miles people travel and increase the use of mass transit.\nDecarbonizing Buildings: \nThe report says it will be critical to decarbonize buildings, not just new buildings but existing buildings. Heating and cooling buildings here accounted for 9% of all carbon dioxide emissions in 2014 — about 300,000 metric tons. The report proposes switching from using natural gas to heat water and spaces to electricity, and away from using furnaces and air conditioners to electric heat pumps.\nUsing the Natural Environment and Land Uses to Remove Carbon Dioxide from the Air:\nAnimals breathe in oxygen and expel carbon dioxide. But plants, trees, wetlands, grasslands and agriculture extract CO2 from the air and use it to grow through photosynthesis. The report said “the simplest, most effective, least expensive solution is to continue to protect and preserve natural and working lands,” such as the County has done through its Multiple Species Conservation Program and Purchase of Agricultural Lands Easement Program.\nBecause it is a draft report, the authors state that its analyses and implications could change before it’s finalized in February.\nSome of the draft report’s findings include:\n\nWhile some sources of carbon emissions in the region can be ascribed to a specific geographic area, such as methane from solid waste landfills, the three largest sources of emissions in San Diego, light-duty vehicles (37%), electricity (23%), and natural gas in buildings (8%) cut across municipal boundaries.\nReduction of GHG emissions across the region is a collective action problem that requires joint action by many actors that, in the absence of incentives, would choose not to contribute.\nMany policies necessary for reaching net-zero emissions are controlled at the state or federal level and not by local governments. The San Diego region can be a vocal advocate for these policies, such as federal tax incentives.\nSan Diego County has sufficient solar and wind resource potential to transition electricity to 100% of the estimated demand with renewable resources inside the County.\nNeighboring Imperial County has significant solar and geothermal beyond internal population demands.\nThe California Independent System Operator estimates necessary transmission network upgrades for San Diego-Imperial-Baja-Arizona to be $3.9 billion and will take decades to complete.\n\nTo read the draft Regional Decarbonization Framework report and submit comments, go to the County Sustainability webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211115.13.17.17"}