{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands COVID-19 Testing to Meet Demand Caused by Omicron", "description": "The County of San Diego Health and Human Services Agency is continuing to expand regional COVID-19 testing to meet the increased demand brought on by the rapid spread of the Omicron variant.", "datePublished": "2022-01-19T19:10:03-08:00", "url": "https://www.countynewscenter.com/county-expands-covid-19-testing-to-meet-demand-caused-by-omicron/", "keywords": ["health", "coronavirus", "covid-19", "covid-19 update", "omicron variant"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-01-19T19:10:03-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is continuing to expand regional COVID-19 testing to meet the increased demand brought on by the rapid spread of the Omicron variant. The County has a network of free testing sites, both walk-up and appointment-based.\nThe newest testing center is a site at Palomar YMCA in Escondido that can provide up to 800 tests a day, Monday to Friday. New appointments are made available daily and can be booked up to three days in advance.\nHowever, County-operated test sites are not the only testing option in the region. Local health care providers offer testing to members who meet each systems’ criteria. Many neighborhood pharmacies offer same-day testing as do other locations on this list.\nRapid antigen tests, which are available for purchase at many local pharmacies, are a good option if a testing site is unavailable. You can find information on how to best use rapid tests here.\nThe federal government rolled out a program this week that allows every residential household in the United States to order up to four at-home COVID-19 test kits free of charge. Tests can be ordered online at COVIDtests.gov. Those ordering the test kits need only provide a name and address. No ID, credit card, or health insurance information is required.\nAvoid Hospitals for COVID Testing\nMeanwhile, San Diegans should continue to avoid local emergency departments for COVID-19 testing. Area hospitals are experiencing an increase in COVID-19 hospitalizations, as well as staff shortages due to the coronavirus and are preserving their resources for patients who are seriously ill.\nThe County recommends that people worried about COVID-19 infection and others seeking COVID-19 testing go to a hospital to be tested only if they have severe symptoms.\n“There continues to be a lot of virus activity in our community and your best bet for preventing illness is to avoid large crowds, wearing your mask when out in public and getting a booster shot when you are eligible,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Boosters are available for fully vaccinated people ages 12 and older and provide protection against severe outcomes from the highly contagious Omicron variant.”\nVaccination Progress:\n\nDoses administered: Close to 6.48 million.\nReceived at least one shot: Over 2.83 million or 90.0% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.50 million or 79.5%.\nBoosters administered: 959,697.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n24 new deaths were reported since the last report on Jan. 12, 2022. The region’s total is 4,553.\n11 women and 13 men died between Dec. 15, 2021 and Jan. 13, 2022.\n11 were age 80 or older, four were in their 70s, six were in their 60s, one was in their 50s, one was in their 40s and one was in their 20s.\nOne of the people who died was fully vaccinated and 23 were not fully vaccinated.\n20 had underlying medical conditions and four had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n9,382 COVID-19 cases were reported to the County on Jan. 18, 2022. The region’s total is now 613,632.\n69,151 COVID-19 cases were reported last week (Jan. 12 through Jan. 18, 2022) compared to 85,659 cases identified the previous week (Jan. 5 through Jan. 11, 2022).\nDuring the 30-day period between Dec. 7, 2021 to Jan. 5, 2022 there were 729 COVID-19 hospitalizations; 419 people were not fully vaccinated and 310 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 209.7 overall, 173.3 for fully vaccinated people and 283.2 for not fully vaccinated San Diegans.\n41,506 tests were reported to the County on Jan. 18, 2022, and the percentage of new positive cases was 22.6%.\nThe 14-day rolling percentage of positive cases among tests is 26.4%.\n\nCommunity Setting Outbreaks:\n\n32 new community outbreaks were confirmed in the past seven days (Jan. 12, 2022 through Jan. 18, 2022): 20 in TK-12th grade school settings, four in government settings, two in business settings, two in college/university settings, one in a daycare/preschool/childcare setting, one in an emergency services setting, one in a healthcare setting and one in a hotel/resort/spa setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220119.19.10.03"}