{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "​County is Warning the Public Not to Eat Locally Harvested Shellfish ", "description": "​The County of San Diego is advising people not to eat locally harvested mussels, clams, scallops or oysters not purchased from a state-certified commercial shellfish harvester or dealer.  ", "datePublished": "2025-04-04T11:48:48-07:00", "url": "https://www.countynewscenter.com/county-is-warning-the-public-not-to-eat-locally-harvested-shellfish/", "keywords": ["health", "amnestic shellfish poisoning", "clams", "mussels", "oysters", "san diego", "scallops", "shellfish"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-04-04T11:48:48-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutes​The County of San Diego is advising people not to eat locally harvested mussels, clams, scallops or oysters that were not purchased from a state-certified commercial shellfish harvester or dealer.  \nShellfish safety notifications also have been issued in Los Angeles and Santa Barbara counties​. \nIn each county, dangerous levels of domoic acid, which can cause amnesic shellfish poisoning (ASP), have been detected in locally harvested mussels. \nThe naturally occurring domoic acid toxin can cause illness or death in humans. Cooking does not destroy the toxin.  \nThe warnings do not apply to mussels, clams, scallops, or oysters sold at stores from approved sources, such as those sold at local markets or restaurants, because state law allows only state-certified commercial shellfish harvesters or dealers to sell to restaurants and markets. Shellfish sold by certified harvesters and dealers are subject to frequent mandatory state testing to monitor for toxins. \nThe symptoms of amnesic shellfish poisoning can happen within 30 minutes to 24 hours after eating toxic seafood. In mild cases, symptoms may include vomiting, diarrhea, abdominal cramps, headache, and dizziness. Symptoms resolve within several days. In severe cases, a person may experience trouble breathing, confusion, disorientation, cardiovascular instability, seizures, excessive bronchial secretions, permanent loss of short-term memory, coma, or death. \nLocal information on amnesic shellfish poisoning is available online. The California Department of Public Health will continue local sampling to determine when sport-harvested shellfish is safe to eat again.  \nThe California Department of Public Health also operates a toll-free Shellfish Information Line at (800) 553-4133. For additional information, please visit the CDPH Marine Biotoxin Monitoring web page​. \nMarine mammals are also susceptible to domoic acid. The public is reminded to please maintain a safe distance (at least 50 yards) from any injured or deceased marine mammal. Although you cannot get domoic acid from the sea lions directly, these are large animals and protected species that need to be given space.  \nSick marine animals can be reported to SeaWorld Rescue by calling 800-541-7325. Deceased marine mammals and sea turtles can be reported by calling the National Oceanic and Atmospheric Administration (858) 546-7162. More local information on zoonotic disease is available online.   \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250404.11.48.48"}