{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Supervisor Receives Employee of the Year Statewide Award", "description": "A San Diego County Probation Youth Development and Community Support Services special projects supervisor has received the California Probation Employee of the Year.", "datePublished": "2024-12-13T16:50:44-08:00", "url": "https://www.countynewscenter.com/probation-supervisor-receives-employee-of-the-year-statewide-award/", "keywords": ["public safety", "chief probation officer tamika nelson", "county probation"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-12-13T16:50:44-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA San Diego County Probation Youth Development and Community Support Services special projects supervisor has received the California Probation Employee of the Year.\nThe Chief Probation Officers of California (CPOC), an association of all 58 counties, awarded Yvonne Salgado at its annual awards ceremony earlier this month. Salgado first received the Southern Region Employee of the Year award along with four other Region Employees of the Year. Then she was selected among the five region award recipients.\n“A true leader, Yvonne encourages excellence from her staff, fosters a culture of learning, and is dedicated to advancing the core values of our Probation Department,” said Chief Probation Officer for San Diego County Tamika Nelson. “Her positivity, genuine enjoyment of her work, and willingness to support her colleagues make her a beacon of inspiration in the field of probation work and enhance the health and safety for everyone in our community.”\nNelson said Salgado’s exceptional leadership, dedication and innovative approach to community collaboration and youth development has had a transformative impact on County Probation and the broader California Probation profession. She had made significant contributions on numerous critical projects and initiatives.\nRecognizing a need to note in the Probation case management system if the child was affected by the Child Welfare Act (ICWA), she led an effort to develop a ICWA Node in the Probation system. She did this by implementing ICWA policy and procedures in collaboration with Tribal Star for planning and working with County staff to assist with the technological set up.\nShe worked with community partners to create the Community Resource Directory, a comprehensive system facilitating referrals to community programs. Then, Salgado spearheaded a virtual resource fair where community partners showcased their unique programs and answered participant questions. Now, she has expanded the directory to include ICWA partners.\n“Officer Salgado exemplifies what it means to be a dedicated and forward-thinking leader,” said Tulare County Probation Chief Kelly Vernon, president of the CPOC. “Her tireless efforts and collaborative approach continue to uplift not only San Diego County but also serve as a model for probation across California.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241213.16.50.44"}