{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Summer’s Coming, County Opens Cool Zone Program", "description": "With summer just around the corner, the County of San Diego opened its annual Cool Zones program Thursday to give people free, safe, air-conditioned sanctuaries to escape extreme heat.", "datePublished": "2023-06-01T12:15:27-07:00", "url": "https://www.countynewscenter.com/summers-coming-county-opens-cool-zone-program/", "keywords": ["health", "cool zones", "extreme heat", "public health"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-06-01T12:15:27-07:00", "articleType": "article", "articleContent": "\nWith summer just around the corner, the County of San Diego opened its annual Cool Zones program Thursday to give people free, safe, air-conditioned sanctuaries to escape extreme heat.\nThe County created the Cool Zone Program two decades ago to give older adults, people with disabilities and those with health concerns that could be complicated by the effects of extreme heat.\nThe program will run from June 1 through Oct. 31; sites include the County’s 33 branch libraries, community centers and other locations across the county.\nA complete list of Cool Zone sites, their hours and locations is located online. The site includes a map feature where people can type in their address to find locations near them. People can also call 2-1-1 to find a location, or, if they cannot get to a Cool Zone, ask for help with free transportation.\nExtreme heat can be especially dangerous for older adults and children, and everyone is recommended to shelter in cool locations when the temperatures get too hot. Working or exercising outside on a hot day or staying in a hot space too long can cause heat-related illnesses, from cramps, to exhaustion and heatstroke—a condition when the body can no longer control its temperature.\nSigns of heatstroke or exhaustion include having an extremely high body temperature—103 degrees or higher—dizziness, nausea, confusion and headache. Anyone suffering these symptoms should call 9-1-1 and be cooled off immediately.\nIn addition to providing Cool Zone locations, the County, working with San Diego Gas & Electric, provide free electric fans to older or disabled San Diegans living on limited incomes.\nTo be eligible for the fan program, county residents must be 60 years old or older, or disabled, living on limited income, must not have access to an air-conditioned space at their home or apartment building and unable to travel to a Cool Zone site.\nTo learn more about the Cool Zone fan program or to request a fan, call 2-1-1 or 1 or visit www.coolzones.org to complete a fan eligibility survey.\nThe Cool Zone program is operated by the County Health and Human Services Agency. For more information about the Cool Zones program as well as tips to stay cool at home, visit www.coolzones.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230601.12.15.27"}