{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s First Park in Alpine Takes Shape", "description": "The County approved the environmental review documents for Alpine Community Park Wednesday, clearing the way toward hiring a contractor to begin phase one of Alpine’s first County-managed Park.", "datePublished": "2023-12-06T14:47:51-08:00", "url": "https://www.countynewscenter.com/countys-first-park-in-alpine-takes-shape/", "keywords": ["parks and rec", "county parks and recreation", "equitable communities", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-12-06T14:47:51-08:00", "articleType": "article", "articleContent": "\nThe County approved the environmental review documents for Alpine Community Park Wednesday, clearing the way toward hiring a contractor to begin phase one of Alpine’s first County-managed Park.\nThe Board of Supervisors also approved a four-way crossing to support pedestrian and bicyclist safety near the park’s entrance.\nThe Board’s actions bring the County one step closer to realizing the park that gained traction in 2019 with the purchase of a 98-acre parcel from Wright’s Field Partnership, LLC.\nSince then, County Parks teams have worked with the community to design a park that will offer a variety of recreational activities.\nThe County’s Park & Recreation office hosted five community meetings from 2021 to 2023 to gather input into the design of the park. The community asked for access to nature, playgrounds, mountain biking and restrooms, which is part of the park design.\nThe park will consist of 25 acres for organized activities and 73 acres will be open to the public and used as an open space nature preserve.\nAccess to the park will be along the northern part of South Grade Road next to the County property. The park was also designed to reduce noise, traffic, wildlife and safety risks and have a view with few obstructions.\nThis was in response to community feedback from over a dozen stakeholder meetings with Alpine community groups.\nThe park involves two phases of construction. Phase one is on the northern part of the park. Valued at $11.4 million, this construction will include utilities, northern trail connections, playgrounds, off-leash dog area, equestrian staging area, picnic areas, community garden, park office and restrooms, sports courts and parking.\nThe first phase of the Alpine Park construction will begin in Spring 2024 with completion expected in Winter 2025.\nThe Alpine Community Planning Group voted to support the project on April 6, 2021.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231206.14.47.51"}