{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccination Clinics Coming to Lemon Grove, Otay Mesa", "description": "New COVID-19 vaccinations sites are opening in Lemon Grove and Otay Mesa, the County Health and Human Services Agency announced today.", "datePublished": "2021-02-22T17:50:00-08:00", "url": "https://www.countynewscenter.com/covid-19-vaccination-clinics-coming-to-lemon-grove-otay-mesa/", "keywords": ["health", "coronavirus", "covid-19", "lemon grove", "otay mesa", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-23T08:01:47-08:00", "articleType": "article", "articleContent": "\nNew COVID-19 vaccinations sites are opening in Lemon Grove and Otay Mesa, the County Health and Human Services Agency announced today.\nStarting tomorrow, Feb. 23, the Otay Mesa site will begin administering doses from 9:30 a.m. to 3:30 p.m.  and will be open Sunday through Thursday at the Border View Family YMCA, 3601 Arey Dr. The clinic will start with a capacity to administer up to 500 doses daily but can expand to give 1,000 shots each day.\nSet to open Sunday, Feb. 28, the East County site will offer vaccines from 9:30 a.m. to 3:30 p.m. Sundays and Mondays at the Lemon Grove Community Center 3146 School Lane. When fully operational, the Lemon Grove clinic will be able to administer 500 doses each day.\nCurrently, the Otay Mesa clinic is the only county-operated site administering first doses of the coronavirus vaccine. All other points of dispensing and vaccination super stations are administering only second doses.\nMore information about the COVID-19 vaccine is available at www.vaccinationsuperstationsd.com.\nA COVID-19 vaccination is administered at the Grossmont Center Vaccination Super Station.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 22.2 cases per 100,000 residents (as of Feb. 16) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 6.4%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 9.7% and is in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 23.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed Feb. 21 in a business setting\nFour new community outbreaks were confirmed Feb. 20: two in business settings, one in an emergency services setting and one in a government setting.\nFour new community outbreaks were confirmed Feb. 19 in business settings.\nIn the past seven days (Feb. 15 through Feb. 21), 22 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n9,806 tests were reported to the County on Feb. 21, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 4.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 14,190.\n\nCases, Hospitalizations and ICU Admissions:\n\n321 cases were reported to the County on Feb. 21. This is the first time the daily case count has been under 400 since Nov. 3 when 404 case were reported. The region’s total is now 257,351.\n12,968 or 5.0% of all cases have required hospitalization.\n1,577 or 0.6% of all cases and 12.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported Feb. 21. The region’s total is 3,189.\nTwo new COVID-19 deaths were reported on Feb. 20.\nTwo women died Feb. 17 and Feb. 18.\nOf the two deaths reported Feb. 20, one person people who passed away was 80 years or older and one person was in her people 70s.\nBoth had underlying medical conditions.\n19 new COVID-19 deaths were reported Feb. 19.\n10 men and nine women died between Dec. 13 and Feb. 18.\nOf the 19 deaths reported Feb. 19, five people who passed away were 80 year or older, five were in their 70s, seven were in their 60s, one was in their 50s and one was in their 40s.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210222.17.50.00"}