{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Working with LGBTQ Leaders to Prevent Spread of Monkeypox, Vaccinate People at Higher Risk", "description": "As the number of human monkeypox cases increases in the region, the County continues to work with the lesbian, gay, bisexual, transgender and queer community to develop messaging, education materials and to administer the limited number of vaccines coming to the area.", "datePublished": "2022-07-25T17:49:05-07:00", "url": "https://www.countynewscenter.com/?p=209037", "keywords": ["health"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-07-25T17:49:05-07:00", "articleType": "article", "articleContent": "\nAs the number of human monkeypox cases increases in the region, the County continues to work with the lesbian, gay, bisexual, transgender and queer community to develop messaging, education materials and to administer the limited number of vaccines coming to the area.\nThe County is sponsoring two vaccination events July 28 and 29, where about 800 doses will be administered to those most at risk. Appointments are required to get a vaccine and are available by calling 2-1-1.\nAs it did earlier this month, the County is working with LGBTQ representatives and organizations to get the word out about the upcoming vaccination clinics. Appointments are expected to fill quickly.\nGiven the scarcity of the monkeypox vaccine and as guided by the California Department of Public Health, the County is focusing on delivering first doses to as many people at high risk as possible.  For the current outbreak, that includes men who have sex with men and multiple partners, as well as close contacts of reported cases. The County’s approach is in line with strategies in other large jurisdictions with monkeypox outbreaks, including New York and San Francisco.\nAlong with the two vaccine events, the County has sent about 900 doses to local vaccine providers such as UC San Diego, Family Health Centers of San Diego, Vista Community Clinic and San Ysidro Health. The County’s STD clinics also have some doses available for patients being seen at those clinics.\nThe state allocates vaccines to counties based on the number of monkeypox and syphilis cases in men reported in a region. To date, San Diego County has received about 2,200 doses and has 20 confirmed and probable cases.\n“The virus is primarily spreading in gay and bisexual men who have more than one sexual partner or attend sex parties, but anyone who is exposed can get it,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Having intimate contact or anonymous sex with people you meet in dating or hook-up apps increases your risk of contracting the virus. Please ask your partners about recent illnesses or rashes.”\nThe County is getting 80 courses of tecovirimat or TPOXX, an antiviral medication to treat people who have been infected with monkeypox. The treatment will be delivered primarily through the region’s established healthcare partners, with priority to patients who may be at risk of complications.\nCounty health officials will continue to meet with LGBTQ representatives to determine how and where vaccines should be distributed when more doses become available as well as appropriate messaging on steps people can take to prevent infection. Based on information from the CDC, the acute shortage of vaccinations is expected to continue into 2023.\nAbout Monkeypox\nMonkeypox is a viral infection that can spread through contact with body fluids, sores on the body of someone who has monkeypox, or from shared items (e.g., clothing and bedding) that have been contaminated with fluids from sores of a person with monkeypox.\nThe disease can also spread between people through saliva or respiratory droplets, typically between people in a close setting. Although monkeypox is not generally considered a sexually transmitted disease, it can be transmitted during sex through skin-to-skin and other intimate contact, regardless of gender or sexual orientation, including close contact that may not be necessarily sexual.\nMonkeypox Symptoms\nSymptoms of monkeypox are similar to, but milder than, the signs and symptoms of smallpox, a related but extinct virus. They include:\n\nFever\nHeadache\nMuscle aches\nBackache\nSwollen lymph nodes\nChills\nExhaustion\n\nA rash usually develops within 1 to 3 days after the appearance of fever.  This rash can look like pimples or blisters that appear on the face, inside the mouth, and on other parts of the body, like the hands, feet, chest, genitals, or anus.\nMost people who develop monkeypox experience symptoms within seven to 14 days (and up to 21 days) after exposure.\nMost people who become infected with monkeypox have a mild illness that improves without treatment over two to four weeks. Monkeypox is contagious and can spread to others once someone has symptoms from it and until scabs have fallen off and a new layer of skin has formed.\nWhat People Should Do\nAnyone who thinks they may have symptoms of monkeypox, including unusual rashes or lesions, should contact a healthcare provider right away or call 2-1-1 for more information.\nYou must have a rash, or spots, to get a monkeypox test. The monkeypox test is done on your skin with a swab at a clinic or health care provider. The swab is rubbed against spots on your skin, or parts of your rash, and then sent to a specialized lab for monkeypox testing. A preliminary lab test result is usually available within a few days.\nThose waiting for results are asked to take steps to care for themselves and others. These include:\n\nStay home and away from others.\nPut off travel on public transportation.\nContact your sex partner(s) and people you have had close contact with since the start of your symptoms.\nProtect any pets.\n\nFor more information on monkeypox, visit the County’s monkeypox website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220725.17.49.05"}