{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Case Reported at San Ysidro High School", "description": "A person at San Ysidro High School was recently diagnosed with tuberculosis and may have exposed students and school staff, the San Diego County Health and Human Services Agency announced today.", "datePublished": "2022-04-19T16:39:51-07:00", "url": "https://www.countynewscenter.com/tuberculosis-case-reported-at-san-ysidro-high-school/", "keywords": ["health", "san ysidro high school", "tb case", "tuberculosis"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-04-19T16:39:51-07:00", "articleType": "article", "articleContent": "\nA person at San Ysidro High School was recently diagnosed with tuberculosis (TB) and may have exposed students and school staff, the San Diego County Health and Human Services Agency announced today.\nThe dates of exposure were from January 11, 2022 to March 18, 2022. HHSA is working with San Ysidro High School officials to notify those who were potentially exposed. Meanwhile, the County’s TB Control Program is testing, at no-cost, all identified students and staff members.\n“Testing is recommended for people who were exposed to assure they are not infected, since initial infection usually has no symptoms,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “For any infected individuals, early diagnosis and prompt treatment can prevent the infectious form of the disease.”\nA negative test result usually indicates that the person is not infected with the TB bacteria. However, it may take eight to 10 weeks after exposure for a test to be positive. San Ysidro High School students and staff who were exposed  to the infected individual and receive a negative test result from their first TB test in April, will require a follow-up test next month.\nAbout Tuberculosis\nTuberculosis is transmitted from person to person through indoor air during prolonged contact with an infectious person. Most people who are exposed do not become infected.\nSymptoms of infectious tuberculosis include persistent cough, fever, night sweats and unexplained weight loss. People with symptoms of TB, or who are immune-compromised and may not show obvious symptoms, should consult their medical provider to be evaluated for the bacteria. Tuberculosis can be cured with an extended course of specific antibiotics.\nPeople who would like more information on this potential exposure should contact the San Diego County TB Control Program at (619) 692-8621, or San Ysidro High School at (619) 710-2300.\nTuberculosis is not uncommon in the San Diego region and, although decreasing since the early 1990s, case counts have stabilized in recent years. In 2021, 201 cases were reported in San Diego County. To date, 23 cases of tuberculosis have been reported in 2022.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220419.16.39.51"}