{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Moves Forward With Plans to Renovate Mira Mesa Epicentre", "description": "The Board of Supervisors agreed Wednesday to move forward with plans to renovate the Mira Mesa Epicentre as a County-operated community center.", "datePublished": "2024-07-17T12:21:22-07:00", "url": "https://www.countynewscenter.com/county-moves-forward-with-plans-to-renovate-mira-mesa-epicentre/", "keywords": ["parks and rec", "county parks and recreation", "epicenter", "equitable communities", "lueg", "mira mesa", "renovation", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-07-17T12:21:22-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe Board of Supervisors agreed Wednesday to move forward with plans to renovate the Mira Mesa Epicentre as a County-operated community center.\nThe County will rebuild and operate a portion of the property located at 8450 Mira Mesa Boulevard as an open recreation center for youth.\nOver the past three years, the County connected with community members during meetings, surveys and events to come up with programs to accommodate people of all ages.\nThe new facility will help promote health and well-being through various programming opportunities including mentoring, career counseling, performing and visual arts, gardening, cooking and recreational classes.\nThe reconstruction of the epicentre will also provide community members and teenagers access to a safe and positive environment.\nThe approval of the lease agreement contributes to many of the County’s sustainability goals by:\n\nImproving the layout of the building to accommodate people with diverse physical and mental abilities.\nTransitioning to a green, carbon-free economy by reducing the building’s energy demand by 50%.\nProtecting health and well-being by providing natural daylight, enriching landscaping, and using non-toxic materials.\nProtecting water; conserving ecosystems, habitats, and biodiversity; and reducing pollution and waste.\n\nAdditionally, the facility will be reconstructed to meet the latest California Green Building Standards and will strive to meet net-zero energy goals in-line with both the City of San Diego’s and County’s greenhouse gas emission reduction goals.\nThe central location of the facility to nearby public transit allows for easy access. The property is close to the Mira Mesa Community Park, Senior Center, Library, and Mira Mesa High School.\nThe County’s Department of Parks and Recreation worked with the City of San Diego to launch this project. The property will be leased to the County for a 45-year term.\nThe epicentre served Mira Mesa from 1977 to 2016. It closed in 2016 due to financial hardship experienced by the operator and has remained vacant.\nThe County will be the sole operator of the facility and will be funding the building repairs. The total project cost is $10.5 million. Construction is expected to begin in early 2025.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240717.12.21.22"}