{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Human Relations Commission Honors Leon L. Williams, Other Community Leaders", "description": "The namesake of the County of San Diego Leon L. Williams Human Relations Commission was among six community leaders honored in its first-ever awards ceremony Friday.", "datePublished": "2021-12-10T15:29:25-08:00", "url": "https://www.countynewscenter.com/human-relations-commission-honors-leon-l-williams-other-community-leaders/", "keywords": ["government", "awards ceremony", "board chair nathan fletcher", "leon l. williams", "leon l. williams human relations commission", "vice-chair nora vargas", "wilma wooten"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-12-10T15:47:32-08:00", "articleType": "article", "articleContent": "\nThe namesake of the County of San Diego Leon L. Williams Human Relations Commission was among six community leaders honored in its first-ever awards ceremony Friday.\nLeon L. Williams received a lifetime achievement award for his efforts in fighting racism and inequality, and his political leadership in both the County and City of San Diego.\nDuring the inaugural awards, County Board Chair Nathan Fletcher gave remarks and Senior Liaison Officer for the United Nations Refugee Agency Nathan Luke Williams gave the keynote address.\nThe virtual event was scheduled to coincide with International Human Rights Day.\nThe County Board of Supervisors re-established the Human Relations Commission in May 2020 and named it in Williams’ honor. The 99-year-old civic leader received the award during a private ceremony at his home. The presentation was featured in a video that played during the ceremony.\n\nFive other community leaders were recognized for their contributions.\nA Chair Leadership Award went to County Board Vice-Chair Nora Vargas. The district 1 supervisor was recognized as an example of a woman who takes control over negative situations, shows courage and stands up for what is right in all instances.\nCounty Public Health Officer Dr. Wilma Wooten won a Chair Leadership Award for her continuous work leading the region through the COVID-19 pandemic and saving lives in the process.\nThe Unsung Hero Award went to a Vietnamese immigrant who came to the United States in 1990. Jean-Huy Tran was honored for his work in the Asian Pacific Islander community and for his commitment to social justice initiatives, inclusion, equity and diversity.\nA Youth Award was presented to Evan Johnson, a young nonbinary adult, for their work, courage and leadership serving the transgender and gender diverse youth community in San Diego.\nA second Youth Award was given to Nedy Velasquez, a first-generation immigrant and DACA recipient, who was recognized for her work in advocating for her community. Among her achievements, Velasquez stepped up to gain COVID-19 health care for immigrants, non-English speaking residents and rural farmworkers in the North County where she lives.\nThe awards ceremony was streamed live. You can watch the ceremony in its entirety in the above video.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211210.15.29.25"}