{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Regional Emergency Managers Discuss Winter Outlook", "description": "There was a time when meteorologists could predict whether winter would be mild, moderate or severe.  That information helped emergency managers plan ahead and get resources ready to fit the forecast and try to avoid a disaster.", "datePublished": "2023-10-17T17:52:39-07:00", "url": "https://www.countynewscenter.com/regional-emergency-managers-discuss-winter-outlook/", "keywords": ["public safety", "emergency", "oes", "regional preparedness", "winter weather"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-10-17T18:00:37-07:00", "articleType": "article", "articleContent": "\nThere was a time when meteorologists could predict whether winter would be mild, moderate or severe.  That information helped emergency managers plan ahead and get resources ready to fit the forecast and try to avoid a disaster.\nNow, it’s difficult to predict the weather for more than 10 days at a time, said Stephen Rea, assistant director for the San Diego County Office of Emergency Services at a regional Winter Weather Workshop for local jurisdictions Tuesday in Kearny Mesa.\nRea paraphrased a statement by Eric Hysen, the chief information officer for the Department of Homeland Security, that when it comes to climate change in disaster planning, it’s no longer interpretation of weather models, data and looking at the past to make a long-range forecast. It’s more about anticipating the future.\nNational Weather Service Warning Coordination Meteorologist Alex Tardy, who gave a presentation to the room of emergency managers and to internet participants, agreed that the winter outlook has always been about the highest probability, but last year’s record wet 2022-23 winter and the very dry 2015-16 winters proved the opposite of the highest probability occurring across southern California.\n“We are having an El Niño winter, but we don’t know the impacts it will have on rain and snow levels,” Tardy said. “We have a slight chance of being wetter than average, 30 to 40 percent is the probability. So, it’s a very high uncertainty for the upcoming winter.”\nHe noted that they predict there will be six atmospheric rivers, while last year there were 13 and it was one of the wettest winters on record in San Diego history. While long-term predictions have not improved recently, the forecasts within a week have much-improved accuracy, Tardy said.\nRea said even if they can’t provide a definitive forecast, the idea behind the winter workshop is for emergency management professionals to have the opportunity to refresh their knowledge of the tools and resources available in the region to prepare for winter weather and to reestablish connections so they can coordinate for the winter weather season.\nThe workshop included an introduction to the County’s ALERT Flood Warning System, the flood gauges, and cameras available, and information on the region’s water supply, reservoir, and drought status from the San Diego County Water Authority. There were also presentations from County Public Works on road crew response during storm events, from CAL FIRE/San Diego County Fire on regional preparedness, swift water response and partners including the San Diego Lifeguard Swiftwater/Flood Rescue Team, and from the County’s Department of Homeless Solutions and Equitable Communities on how they help get the word out to people who are experiencing homelessness in a local disaster.\n“For me, it was really important to come because I’m new to California. The weather patterns are really different than what I’m used to on the East Coast,” said Edward Kramer, emergency manager for the City of Vista. “The panel was a broad range of people. It was really informative.”\nFor information on how to prepare at home for rain and flooding, visit AlertSanDiego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231017.17.52.39"}