{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Releases Eligibility Requirements for New COVID-19 Vaccination Groups", "description": "Beginning tomorrow, San Diegans who work in emergency services, child care and education, food handling and agriculture workers can sign up for COVID-19 vaccination appointments.", "datePublished": "2021-02-26T19:04:04-08:00", "url": "https://www.countynewscenter.com/twee/", "keywords": ["health", "coronavirus", "covid-19", "essential worker vaccinations", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-03-01T16:40:53-08:00", "articleType": "article", "articleContent": "\nBeginning tomorrow, San Diegans who work in emergency services, child care and education, food handling and agriculture can sign up for COVID-19 vaccination appointments. Those making appointments will be required to show a photo ID and proof of eligibility. Please keep in mind that vaccine supplies are still limited, so patience is required over the next several weeks.\nEligibility documents vary for the respective sectors but include a pay stub or timesheet issued within the last 90 days, an employee ID card, or a letter from the employer.\nEach of the newly-eligible sectors includes a wide variety of occupations and there are employer-coordinated vaccination plans in place for certain subsets of those groups.\nFor example, law enforcement officers will have their vaccination appointments coordinated by Scripps Health, regardless of their insurance carrier. Education staff working in TK through 12th grade who are covered by California Schools VEBA, must use vebavaccinates.com and should not show up at any vaccination site prior to an appointment confirmed through VEBA. Education staff working at childcare facilities or institutions of higher education should make appointments at any County Point of Dispensing (POD), Super Station or other vaccination location.\nThose not covered by specific vaccination plans for their occupation should contact their primary care doctor or schedule an appointment at vaccinationsuperstationsd.com. Appointments are required at County-operated sites and people will not be able to obtain the vaccination without a confirmed appointment.\n“We are asking anyone trying to make a vaccination appointment for patience,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The tier that is opening tomorrow includes half a million people and not everyone will be able to get an immediate appointment this weekend. More time slots will continuously be released as additional vaccine doses arrive in the region.”\nVaccination Site Updates\nA new appointment-only vaccination site opens on Sunday at the Copley-Price YMCA located at 4300 El Cajon Boulevard in City Heights. The walk-up clinic is open Tuesday to Friday from 9:30 a.m. to 3:30 p.m. and on Saturdays from 9:30 a.m. to 1:30 p.m.\nDue to a national shortage of Moderna vaccine, the UC San Diego Super Station at Petco Park will be closed from Saturday, Feb. 27 through Tuesday, March 2. People with appointments will be notified via MyChart.\nVaccination Progress\nTo date, more than 938,000 COVID-19 doses have been delivered to the region with close to 833,000 administered. The difference between the two numbers represents approximately what is expected to be administered the next seven days and doses still to be entered in the record system. More than 8,500 doses were administered and are pending full documentation.\nThose vaccinated to date include nearly 233,000 San Diegans who are fully vaccinated, while more than one in five San Diegans over age of 16 has received at least one dose.\nFollowing a positive advisory committee meeting regarding the Johnson and Johnson COVID-19 vaccine, the U.S. Food and Drug Administration said Friday it would rapidly work toward finalization and issuance of an emergency use authorization for this vaccine. The County expects to receive an unknown quantity of the vaccine sometime next week.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 15 cases per 100,000 residents (as of Feb. 23) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 5%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.4% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 2.\n\nCommunity Setting Outbreaks:\n\nThree new community outbreaks were confirmed Feb. 25: two in business settings and one in a retail setting.\nIn the past seven days (Feb. 19 through Feb. 25), 29 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n15,987 tests were reported to the County on Feb. 25, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 4.4%.  Target is less than 8.0%.\nThe 7-day, daily average of tests is 14,630.\n\nCases, Hospitalizations and ICU Admissions:\n\n662 cases were reported to the County on Feb. 25. The region’s total is now 259,644.\n13,107 or 5.0% of all cases have required hospitalization.\n1,580 or 0.6% of all cases and 12.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nEleven new COVID-19 deaths were reported Feb. 25. The region’s total is 3,271.\nFive women and six men died between Feb. 16 and Feb. 24.\nOf the 11 deaths reported Feb. 25, five people who died were 80 years or older, three were in their 70s, one was in their 60s and two were in their 50s.\nTen had underlying medical conditions and one has medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210226.19.04.04"}