{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Organic Carrots Linked to E. Coli Outbreak", "description": "County Public Health officials are asking people to throw away organic carrots tied to a nationwide E. coli outbreak. The implicated carrots are organic, whole bagged carrots and baby carrots sold under multiple brands by Grimmway Farms. ", "datePublished": "2024-11-26T14:28:52-08:00", "url": "https://www.countynewscenter.com/organic-carrots-linked-to-e-coli-outbreak/", "keywords": ["health", "carrots", "dr. kadakia", "e. coli", "health", "phs"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-11-26T14:30:49-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty Public Health officials are asking people to throw away organic carrots tied to a nationwide E. coli outbreak. The implicated carrots are organic, whole bagged carrots and baby carrots sold under multiple brands by Grimmway Farms. \nOne person in San Diego who consumed the carrots became ill from the same strain of Shiga Toxin producing E. Coli (STEC) that is part of a multi-state outbreak. Thirty-nine people infected with the outbreak strain of E. coli have been reported from 18 states. Fifteen people have been hospitalized, and one person has died. \nE. coli can cause severe stomach cramps, diarrhea and vomiting, often within three to four days. The STEC found in the carrots can cause hospitalization and even death. Grimmway Farms has issued a nationwide recall. The carrots are likely no longer in stores for sale but may be in your home. \n“If you or a loved one are feeling sick, contact your doctor as soon as possible,” said Ankita Kadakia, M.D., interim County public health officer. “The Shiga toxin producing E. Coli bacteria can cause serious kidney problems that require hospitalization, so it is important to get care promptly.” \nIf you think you purchased affected carrots, do not eat them. Throw them away and wash any containers or surfaces that touched the carrots with hot soapy water or in the dishwasher.  Make sure to also wash your hands with soap and water after handling the carrots or container.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241126.14.28.52"}