{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Warns of E. coli linked to Walnuts Sold in 10 Local Stores", "description": "County Public Health officials are asking people to throw away walnuts tied to a national E. coli outbreak that were sold in 10 local natural food stores and co-ops.", "datePublished": "2024-05-03T17:21:08-07:00", "url": "https://www.countynewscenter.com/county-warns-of-e-coli-linked-to-walnuts-sold-in-10-local-stores/", "keywords": ["health", "e. coli", "gibson farms", "walnut recall"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-05-03T17:21:08-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Public Health officials are asking people to throw away walnuts tied to a national E. coli outbreak that were sold in 10 local natural food stores and co-ops.   \nTwo people who ate the walnuts from local stores have gotten sick from the same strain of E. coli that is part of a multi-state outbreak in which the majority of people reported eating Gibson Farms walnuts. One person locally was hospitalized. \nThe Shiga toxin-producing E. coli found in the walnuts can potentially cause hospitalizations and even deaths. Gibson Farms Inc., which produced the walnuts, has issued a nationwide recall. \nThe walnuts were sold halved or in pieces in bulk bins as early as October 1, 2023. Stores may have also repackaged and sold the walnuts in individual bags or takeout containers for customer convenience.  \nThe County is working with local stores that received shipments of the recalled walnuts and confirmed that all stores have removed the product and disinfected the storage bins as of today, May 3. Those stores include: \n\nJimbos Naturally in San Diego (4S Ranch and Carmel Valley), Carlsbad and Escondido \nLazy Acres Market in San Diego and Carlsbad \nOcean Beach Co-Op \nFrazier Farms Market in La Mesa and Vista  \nSun Organic Farm in San Marcos  \n\nIf you think you purchased affected walnuts, do not eat them. Throw them away and wash any containers or surfaces that touched the walnuts with hot soapy water or in the dishwasher. \nE. coli can cause severe stomach cramps, diarrhea and vomiting, often within three to four days.\n“If you or a loved one are feeling sick, contact your doctor as soon as possible,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The E. coli bacteria can cause serious kidney problems that require hospitalization, so it is important to get care promptly.” \nThe CDC says illnesses linked to the recalled walnuts have also been reported in Washington. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240503.17.21.08"}