{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Youths Start Getting COVID-19 Vaccinations Around the County", "description": "Vaccination sites around San Diego County started giving shots out to the newest eligible group seeking COVID-19 protection Thursday, youths between the ages of 12 and 15 years old.", "datePublished": "2021-05-13T18:29:44-07:00", "url": "https://www.countynewscenter.com/youths-start-getting-covid-19-vaccinations-around-the-county/", "keywords": ["health", "coronavirus", "covid-19", "covid-19 update", "covid-19 vaccinations", "vaccines for 12-15-year-olds"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-05-17T16:02:06-07:00", "articleType": "article", "articleContent": "\nVaccination sites around San Diego County started giving shots out to the newest eligible group seeking COVID-19 protection Thursday, youths between the ages of 12 and 15 years old.\nAlso on Thursday, the County of San Diego opened its newest vaccine site, in southeastern San Diego, at the Joe and Vi Jacobs Center at 404 Euclid Avenue. The new site will be open for drop ins and appointments from 9 a.m. to 3:30 p.m. Tuesdays through Saturdays.\nThursday was the first day that parents and their 12- to 15- year old children could begin receiving Pfizer COVID-19 vaccines. Pfizer’s vaccine is the only one that has received FDA emergency approval for 12- to 15- year olds so far. Parental consent is required before anyone under the age of 18 can get vaccinated. Minors must show a photo ID and proof of age, or have the parent, guardian or caregiver accompanying them verify their age and identity when receiving a vaccination.\nParents, legal guardians and caregivers who cannot accompany their children to the vaccination site need to schedule an appointment on MyTurn.ca.gov to provide their consent in advance. If no parent, guardian or caregiver can be present, the minor will have to bring photo ID and, if under the age of 16, another adult must be present during the vaccination appointment.\nVaccination Progress:\n\nDoses delivered: More than 3.73 million.\nDoses administered: Roughly 3.25 million.\nReceived at least one shot: More than 1.75 million or 62.6% of San Diegans 12 and older. (Note: The percentage of vaccinated has decreased from yesterday because of the expansion of those eligible to be vaccinated to include 12-15 year old youth.)\nFully vaccinated: Nearly 1.3 million or 46.3%. (Note: The percentage of fully vaccinated has decreased from yesterday because of the expansion of those eligible to be vaccinated to include 12-15 year old youth.)\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people.\nTo date, 83.5% of the goal population has received at least one vaccine and 61.8% are fully vaccinated. These percentages will be updated as new populations become eligible. (Note: These percentages have decreased or remained the same from yesterday because of the expansion of those eligible to be vaccinated to include 12-15 year old youth.)\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 3.7 cases per 100,000 residents.\nThe testing positivity percentage is 1.7%.\nThe health equity metric is 2.0%.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, May 18.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed May 12 in a daycare/preschool/childcare setting.\nIn the past seven days (May 6 through May 12), 14 community outbreaks were confirmed.\nThe community outbreaks trigger is seven or more in seven days.\n\nTesting:\n\n15,749 tests were reported to the County on May 12, and the percentage of new positive cases was 1%.\nThe 14-day rolling average percentage of positive cases is 1.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,329.\n\nCases, Hospitalizations and ICU Admissions:\n\n190 COVID-19 cases were reported to the County on May 12. The region’s total is now 278,591.\n15,340 or 5.5% of all cases have required hospitalization.\n1,690 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported May 12. The region’s total is 3,729.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210513.18.29.44"}