{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Budget Hearings Set to Begin", "description": "The County Board of Supervisors will hold its first public hearing for the $8.11 billion recommended budget for fiscal year 2023-24 at 9 a.m. on Monday, June 12.", "datePublished": "2023-06-08T10:00:37-07:00", "url": "https://www.countynewscenter.com/county-budget-hearings-set-to-begin/", "keywords": ["government", "2023-24 recommended budget", "budget hearing", "evening hearing", "fiscal year 2023-24 budget"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-06-08T13:04:30-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors will hold its first public hearing for the $8.11 billion recommended budget for fiscal year 2023-24 at 9 a.m. on Monday, June 12.\nThe budget hearing will be followed by a second evening hearing at 5:30 p.m. on Thursday, June 15.\nThe budget plan was released May 4 and continues increased spending to fight homelessness; take on mental health and substance use disorder challenges; improve the justice system; help working families and invest in core services like roads, fire protection and parks.\nThe “Invested in Community” budget is $745.8 million larger than last year’s budget, a 10.1% increase. It also adds roughly 490 new positions, a 2.5% increase over last year.\nThe increase in budget and staff will support new and expanded social service programs and increasing caseloads to assist vulnerable populations. It also reflects investments in critical infrastructure, like a new Public Health Lab and affordable housing projects.\nThe public can learn more about the recommended budget by viewing an executive summary or the full recommended budget plan.\nThe budget was built on community input, and residents continue to play a role in the budget process. The public was invited to departmental budget presentations at a Board meeting on May 11, and to attend two community budget meetings on May 16 and 18.\nThe public is also welcome to attend, watch, listen and participate in both of the upcoming budget hearings and the 9 a.m. budget deliberations and adoption on Tuesday, June 27.\nAttend the Meeting in Person\nThe meeting will take place in room 310 at the County Administration Center located at 1600 Pacific Highway, San Diego, CA 92101.\nSpanish language translation services for public speakers are available at Board meetings. Arabic, Chinese (Mandarin), Korean, Persian (including Farsi, Dari), Somali, Spanish, Tagalog (including Filipino), and Vietnamese translations of the overall proceedings are also available upon request at least 72 hours prior to the meeting. Contact the Clerk’s office at (619) 531-5434 or email PublicComment@sdcounty.ca.gov.\nWatch Online\nThe live stream broadcast online may be delayed by 45-seconds or more depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo Livestream\nCounty YouTube Channel (Closed captioning available)\nFacebook Live\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nAT&T U-Verse Channel 99\n\nListen on the Phone\n\nCall in to (619) 531-4716 for a listen-only line to the live Board meeting while it is in session.\n\nComment Online or by Phone\n\nOnline: Submit an eComment on Engage San Diego County’s budget page until budget hearings formally close at 5 p.m. on June 21.\nBy phone: To speak during the live meeting by phone, fill out the Board of Supervisors tele-comments form and submit it before the meeting starts. After submitting the form, you will receive instructions on how to call in to the meeting.\n\nFor more information, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230608.10.00.37"}