{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Deaths Nearly Double in One Week", "description": "A total of 49 COVID-19 deaths were reported in the region in the past seven days (Aug. 25-31), nearly double the 25 reported the week before (Aug. 18-24), the County Health and Human Services Agency announced today.", "datePublished": "2021-09-01T16:49:03-07:00", "url": "https://www.countynewscenter.com/covid-19-deaths-nearly-double-in-one-week/", "keywords": ["health", "coronavirus", "covid-19", "deaths", "preventable deaths", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-02T11:00:20-07:00", "articleType": "article", "articleContent": "\nA total of 49 COVID-19 deaths were reported in the region in the past seven days (Aug. 25-31), nearly double the 25 reported the week before (Aug. 18-24), the County Health and Human Services Agency announced today.\nThe newly reported deaths include 37 men and 12 women. Most of the deaths occurred in late August. Forty-one had underlying medical conditions, four did not and four had medical history pending.\nOf the 49 deaths, 12 were 80 years of age or older, 13 were in their 70s, 12 were in their 60s, seven were in their 50s and five were in their 40s.\n“These deaths are very tragic because they could have been prevented,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “We now have very safe and effective vaccines against COVID-19. These deaths should not have occurred.”\nMost of the deaths being reported now have been San Diegans who were not vaccinated.\nPublic health officials expected that more people would get vaccinated after the Food and Drug Administration gave full approval to the Pfizer vaccine on Aug. 23. The region has seen a slight uptick in vaccinations.\nAn average of 3,749 San Diegans got their first doses daily between Aug. 23 and Aug. 28. In comparison, an average of 3,651 people received their first shot between Aug. 17 and Aug. 22.\n“Unvaccinated San Diegans are primarily the ones ending up in the hospital and, unfortunately, dying,” Wooten said.\nNo-cost COVID-19 vaccines are widely available in the region. They can be found at medical providers, retail pharmacies, community clinics and County public health centers for people who do not have a medical provider. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\nVaccination Progress:\n\nDoses administered: Nearly 4.56 million.\nReceived at least one shot: About 2.41 million or 85.9% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Over to 2.11 million or 75.4%.\nThe goal: vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 114.5% of the goal population has received at least one vaccine and 100.5% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nCases, Case Rates and Testing:\n\n949 COVID-19 cases were reported to the County on Aug. 31. The region’s total is now 335,302.\nSan Diego County’s case rate per 100,000 residents is 38.7 overall, 15.2 for fully vaccinated people and 68.0 for not fully vaccinated San Diegans.\n17,204 tests were reported to the County on Aug. 31, and the percentage of new positive cases was 5.5%.\nThe 14-day rolling percentage of positive cases among tests is 6.6%.\n\nCommunity Setting Outbreaks:\n\n66 new community outbreaks were confirmed in the past seven days (Aug. 25 through Aug. 31): 15 in business settings, 11 in daycare/preschool/childcare settings, nine in restaurant/bar settings, six in retail settings, five in health care settings, five in faith-based settings, four in TK-12 grade school settings, three in government settings, two in construction settings, one in an emergency services setting, one in a hotel/resort/spa setting, one in a restaurant setting, one in a grocery setting, one in a distribution warehouse setting, and one in a college/university setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210901.16.49.03"}