{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: HHSA and SDSU Form New Partnership to Address Community Issues, Build Workforce", "description": "A deeper working partnership was celebrated today between the County’s Health and Human Services Agency (HHSA) and San Diego State University’s College of Health and Human Services (CHHS). Both organizations signed a formal agreement to tackle major health and human service issues impacting the region, including housing insecurity.", "datePublished": "2022-10-28T09:26:12-07:00", "url": "https://www.countynewscenter.com/hhsa-and-sdsu-form-new-partnership-to-address-community-issues-build-workforce/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2022-10-28T09:26:12-07:00", "articleType": "video.other", "articleContent": "\nA deeper working partnership was celebrated today between the County’s Health and Human Services Agency (HHSA) and San Diego State University’s College of Health and Human Services (CHHS). Both organizations signed a formal agreement to tackle major health and human service issues impacting the region, including housing insecurity. The new Live Well Center for Innovation and Leadership will also streamline workforce development by offering internships and providing unique, hands-on cross-training opportunities for SDSU students. This will help bridge the gap between academics and real-life experience while building a local, qualified workforce ready to transition into County jobs.\nThis partnership is the first of its kind in California and builds on a history of successful collaborations between the university and HHSA. In the last few years alone, HHSA and SDSU worked together as part of a nationwide effort to address COVID-19 vaccine awareness and increase testing availability in underserved communities. SDSU’s public health experts also worked closely with HHSA to design a contact tracing program that focused on high-risk populations. Earlier on in the COVID-19 pandemic, more than 200 SDSU nursing students, in coordination with the HHSA, volunteered to administer COVID-19 vaccines.\nYou can read more about the launch of the Live Well Center for Innovation & Leadership here: SDSU news center.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221028.09.26.12"}