{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Record Number of COVID-19 Deaths", "description": "Seventy-nine deaths were reported Jan. 21, a new record for the region, the County Health and Human Services Agency announced today.", "datePublished": "2021-01-22T17:32:59-08:00", "url": "https://www.countynewscenter.com/county-reports-record-number-of-covid-19-deaths/", "keywords": ["health", "coronavirus", "covid-19", "record deaths", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-22T17:32:59-08:00", "articleType": "article", "articleContent": "\nSeventy-nine deaths were reported Jan. 21, a new record for the region, the County Health and Human Services Agency announced today.\nThe newly reported deaths surpass the previous one-day total set Jan. 19, when 65 deaths were reported.\nIt’s important to note that the dates of the deaths reported ranged from Dec. 16 to Jan. 21.\nHowever, 61 one of the newly reported deaths occurred between Jan. 15 and Jan. 21. Add to that the 67 deaths that were previously reported during the same period and the total jumps 128. These are people who likely got sick during the holidays.\n“It’s very unfortunate to see such a high number of people dying recently. Our condolences go out to the family and friends of all of the people who have died during this pandemic,” said Wilma Wooten, M.D., M.P.H., County public health officer. “It’s important to remember that our actions can save lives. We must do everything we can to protect those around us, especially people who are at higher risk of having severe consequences and potentially dying.”\nCounty health officials continue to urge San Diegans to do the following:\n\nWhen it’s your turn, get vaccinated\nWash your hands\nWatch your distance around others\nWear a mask\nWhen sick, stay home and get tested\n\nCOVID-19 Vaccination Clinic Opens and Two Testing Sites Close\nStarting Jan. 24, a new County-run COVID-19 vaccination site will be offering vaccines to health care professionals and people 75 years and older in Oceanside.\nThe walk-up clinic will be open from 9:30 a.m. to 3:30 p.m. Sunday through Thursday at the North Coastal Live Well Center, 3708 Ocean Ranch Blvd. in Oceanside. Appointments are required and 500 vaccine doses will be available daily.\nAlso, due to the inclement weather, the following testing sites will be closed on Jan. 23:\n\nTubman-Chavez Community Center, 415 Euclid Ave. in San Diego\nLeo Mission Church, 936 Genevieve St. in Solana Beach\n\nAll vaccination sites that are open seven days per week are expected to stay open through the weekend.\nFor more information about COVID-19, testing locations and vaccine distribution, visit www.coronavirus-sd.com.\nThe COVID-19 vaccine is now available for health care professionals and people 75 and older at multiple sites in the region.\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\nSix new community outbreaks were confirmed on Jan. 21: three in business settings, one in a construction setting, one in a community-based organization setting and one in a government setting.\nIn the past seven days (Jan. 15 through Jan. 21), 46 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n49,562 tests were reported to the County on Jan. 21, and the percentage of new positive cases was 6%.\nThe 14-day rolling average percentage of positive cases is 10.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 22,646.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases:\n\n2,847 cases were reported to the County on Jan. 21. The region’s total is now 222,578.\n8,673 or 3.9% of all cases have required hospitalization.\n1,329 or 0.6% of all cases and 15.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n56 men and 23 women died between Dec. 16 and Jan. 21.\nOf the 79 new deaths reported, 38 people who passed away were 80 years or older, 24 people were in their 70s, 10 people were in their 60s, five people were in their 50s, one person was in their 40s and one person was in their 20s.\n73 had underlying medical conditions, one did not and five had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210122.17.32.59"}