{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Edgemoor Skilled Nursing Facility is a Source of County Pride", "description": "This week is National Skilled Nursing Care Week, a time to acknowledge the vital role skilled nursing facilities have in our communities and the valuable contributions of caregivers and staff. In San Diego County, Edgemoor Skilled Nursing Facility is nationally recognized, providing high-level, specialized care for adults 18 years and up who require 24-hour support and rehabilitation.", "datePublished": "2025-05-12T09:21:28-07:00", "url": "https://www.countynewscenter.com/edgemoor-skilled-nursing-facility-is-a-source-of-county-pride/", "keywords": ["health", "edgemoor", "five star", "hospital", "long term care", "medi-cal", "rehabilitation", "skilled nursing facility"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-05-12T12:40:43-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThis week is National Skilled Nursing Care Week, a time to acknowledge the vital role skilled nursing facilities have in our communities and the valuable contributions of caregivers and staff.\nIn San Diego County, Edgemoor Skilled Nursing Facility is nationally recognized, providing high-level, specialized care for adults 18 years and up who require 24-hour support and rehabilitation.\nMost Edgemoor residents have been diagnosed with a physical, cognitive or behavioral condition that requires complex, long-term care and support. Board-certified physicians, nurses, psychologists, social workers and recreational therapists provide consistent and compassionate care daily and onsite.\nResidents who typically find a home at Edgemoor are those who need advanced care, are covered by Medi Cal insurance and cannot be placed in other settings.\nDespite primarily serving a clientele with limited means but requiring highly specialized care, Edgemoor regularly rates as a five-star facility and has been named one of the top nursing homes in the state and nation for over a decade.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250512.09.21.28"}