{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Keep Your Dogs Safe Over Fourth of July", "description": "For most dogs, Fourth of July fireworks are an assault to their sensitive ears, and the explosive booms and shrill sounds are extremely frightening. Frequently, dogs who are kept outdoors or are unleashed escape yards or run away in panic putting themselves in danger.", "datePublished": "2021-07-02T09:17:43-07:00", "url": "https://www.countynewscenter.com/keep-your-dogs-safe-over-fourth-of-july/", "keywords": ["animals", "das", "fourth of july", "lost dogs", "microchipping"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-07-03T14:05:19-07:00", "articleType": "article", "articleContent": "\nFor most dogs, Fourth of July fireworks are an assault to their sensitive ears, and the explosive booms and shrill sounds are extremely frightening. Frequently, dogs who are kept outdoors or are unleashed escape yards or run away in panic putting themselves in danger.\nOnce your dog is on the run, they can get lost and not be able to return home on their own, they can be hit by a vehicle, or they can even be attacked by other animals.\nIf they’re lucky, a neighbor may be able to grab them before they get too far or run out in traffic and get hurt. But if the owner is not around, they often end up in the animal shelters.\n“With many people becoming new dog owners over the past year, it is important to be alert to their dog’s reaction to fireworks. And if the noise is a problem for their dog, there are things they can do to help dogs feel safe and secure,” said County Animal Services Director Kelly Campbell. “We recommend keeping dogs inside and in a secure room as some dogs can have extreme panicky reactions that may include digging under, climbing over or even breaking through gates, screens, fences, windows and doors. The backup plan is microchipping your pet, in case they still manage to run away.”\nEvery year, dozens of dogs end up at shelters after fireworks shows.\nSome dogs are quickly reunited with their owners because they are licensed and microchipped. If your dog is not microchipped, residents in the unincorporated areas can get their dogs microchipped for a $20 fee at the County’s two shelters in Carlsbad and Bonita by calling (619) 767-2675 for an appointment.\nHere are some additional tips on how to protect your pet this Fourth of July:\n\nStay home with your dogs.\nAvoid taking your pet to fireworks displays. Keep your pets indoors in a sheltered, quiet area.\nSome dogs become destructive when frightened so remove dangerous objects your pet may chew. Leave a television or radio playing at normal volume to keep your pet company while you’re away.\nNever leave pets outside unattended, even in a fenced yard. In their fear, pets that normally wouldn’t leave the yard may escape and get lost.\nIf you know your pet is seriously distressed by loud noises like thunder, consult your veterinarian to see if anxiety-relieving medication is appropriate.\nDo not leave your pet in the car. With only hot air to breathe inside a car, your pet can suffer serious health effects, even death, within minutes.\nIf you are walking your dog near fireworks displays, be sure your pet is secured on a leash in case it tries to bolt.\n\nIf you find a lost pet in the unincorporated area of the County after the fireworks, call County Animal Services’ 24-hour emergency dispatch number at (619) 236-2341 so the animal can be cared for at the shelter. If you lose your pet, check the department’s lost and found page online.\nIf you see your dog is at County Animal Services, you can pick up your pet starting at 9:30 a.m. on Tuesday, July 6.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210702.09.17.43"}