{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Shelter Pets Make Grateful Guests for the Holiday Season", "description": "This holiday season, open your heart and home to foster a shelter dog or cat. Fostering is easy. Food, supplies and veterinary care are provided. You just provide the love, attention and temporary shelter.", "datePublished": "2023-11-22T09:19:42-08:00", "url": "https://www.countynewscenter.com/shelter-pets-make-grateful-guests-for-the-holiday-season/", "keywords": ["animals", "das", "dogs", "pet foster"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-11-22T09:22:28-08:00", "articleType": "article", "articleContent": "\nThis holiday season, open your heart and home to foster a shelter dog or cat. Fostering is easy. Food, supplies and veterinary care are provided. You just provide the love, attention and temporary shelter.\nCounty shelter staff and volunteers do their best to provide care and comfort to stray or relinquished animals, but there is no substitute for a home, even a temporary one.\nMany of the animals that come into County shelters were previously in homes, so being in a shelter can be stressful for them, especially over time.\nA foster opportunity gives homeless animals a break from an animal shelter and teaches them what it’s like to be in a home again.\nThe County’s shelters in Bonita and Carlsbad have twice as many animals as usual in their care right now, including an unusually high number of medium and large dogs. Some of those animals have been in the shelters for months and a few for over a year.\nOften financial issues or living restrictions prompt the difficult decision of relinquishment, not dog behavioral issues.\nTypically, the shelter reaches out to animal rescue partners and other shelters, but right now everyone is full.\nAdopt by going online to browse and download an application for the Department of Animal Services Bonita or for the Carlsbad shelter. If you cannot adopt but have some room at home for a temporary roommate, please consider fostering a pet. Even a short break from\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231122.09.19.42"}