{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Take Time to Prepare Before A Significant Earthquake to Survive and Recover", "description": "Earthquakes happen every day in California. Nearly all are so minor they go unnoticed. But one long-range scientific model forecasts a 6.7 magnitude will happen sometime in California in the next 12 years. Yet, the warning for a specific earthquake doesn’t come more than a few seconds ahead. That means the only time to prepare for a significant earthquake is before one happens. ", "datePublished": "2022-02-16T11:13:20-08:00", "url": "https://www.countynewscenter.com/take-time-to-prepare-before-a-significant-earthquake-to-survive-and-recover/", "keywords": ["public safety", "earthquake early warning", "earthquake preparedness month", "emergency", "emergency preparedness", "shakereadysd"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-02-16T12:50:37-08:00", "articleType": "article", "articleContent": "\nEarthquakes happen every day in California. Nearly all are so minor they go unnoticed. But one long-range scientific model forecasts a 6.7 magnitude will happen sometime in California in the next 12 years. Yet, the warning for a specific earthquake doesn’t come more than a few seconds ahead. That means the only time to prepare for a significant earthquake is before one happens.\nAs part of Earthquake Preparedness Month in California, the San Diego County Office of Emergency Services recommends residents have a plan to protect themselves in the event of an earthquake and practice what to do.\n“Taking steps to prepare now could reduce injuries and damage to your home and help your household recover in the event of a significant earthquake,” said Jeff Toney, director of the San Diego County Office of Emergency Services. “Many of these suggestions are cost-free and take just minutes to do. It’s important not to put emergency preparedness off.”\nDownload, the SD Emergency app which now has ShakeReadySD earthquake early warning technology, powered by ShakeAlert®, a product of the U.S. Geological Survey. The ShakeReadySD technology is designed to trigger an alert to your cellphone if you are in a location close enough to an earthquake with a magnitude 4.5 or greater with a shaking intensity of 3 or greater. If an earthquake has occurred nearby that is likely to cause shaking within seconds, the app will urge users to take protective action such as drop, cover and hold on or another appropriate safety measure.\n\nLearn and practice Drop, Cover and Hold On and other safety measures to take during shaking from an earthquake.\nLearn what your risk is for an earthquake using this online tool. San Diego County is home to three major active faults: the Rose Canyon Fault (which runs along the coast, through downtown, Old Town and La Jolla), and the San Jacinto and Elsinore faults, which run through the northern and eastern areas of the county. Earthquakes along these faults could produce damaging earthquakes that may disrupt roadways, transportation, and services like water, gas, and phone communication for weeks or months. Coastal areas are also at risk for tsunamis.\nUpdate your personal disaster plan. Templates are available in 12 languages and for people who may need assistance. A mobile version is also part of the SD Emergency app. Discuss with household members to include reunion locations since you may not be with your loved ones when a quake occurs, emergency supplies such as water, non-perishable food, specialized foods for infants, pets, first aid supplies, radios, flashlights, batteries and extra medications.\nRegister for AlertSanDiego  or AlertaSanDiego, the County’s cellphone notification service. By doing that, you will receive any emergency messages such as evacuation warnings that apply to the area you specify.\nAt home, people can secure large furniture and electronics to wall studs, move heavy items to lower shelves and install locks or latches on large cabinets.\nMake sure you know where the gas valve is located and have a tool to turn it off if needed. Make sure you only turn it off if you smell gas or suspect a gas leak.\nTo learn more about the steps you can take to prepare for earthquakes and other disasters, visit ReadySanDiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220216.11.13.20"}