{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccine to Open to Everyone 16 and Older", "description": "Starting April 15, everyone 16 and older will be able to get vaccinated against COVID-19.", "datePublished": "2021-04-14T16:56:33-07:00", "url": "https://www.countynewscenter.com/covid-19-vaccine-to-open-to-everyone-16-and-older/", "keywords": ["health", "16 and older", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-15T09:16:51-07:00", "articleType": "article", "articleContent": "\nStarting April 15, everyone 16 and older will be able to get vaccinated against COVID-19.\n“Every San Diegan who qualifies for the vaccine can now get vaccinated,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The vaccine is the best protection we have against COVID-19. Get your shot as soon as you can.”\nCurrently, only the Pfizer and Moderna vaccines are available in the region. Use of the Johnson & Johnson vaccine has been paused while it is reviewed following recent safety concerns.\nNew Guidance for Gatherings\nAlso going into effect April 15 is new guidance on gatherings, private and indoor live events, and performances.\nIn the Orange Tier, which the County is currently in, outdoor activities of up to 50 people are now permitted. Indoor gatherings are strongly discouraged but are allowed with modifications and if they do not exceed 25 people.\nPrivate outdoor events are permitted for up to 100 people; 300 persons if all guests show proof of a recent COVID-19 test or full vaccination. A maximum of 150 are allowed at an indoor event if everyone has been tested or shows proof of complete vaccination.\nOnly people living in the state are permitted to attend indoor, seated, live event or performances. For venues with a capacity of up to 1,500, a maximum of 15% or 200 people can attend; 35% if all guests have tested negative or have been fully vaccinated for COVID-19.\nA complete list of activities that can take place under the different tiers and additional gathering guidance can be found here.\nVaccination Progress:\n\nAlmost 2.28 million COVID-19 vaccine doses have been delivered to the region, and about 2.16 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, more than 757,000 County residents, or 28.2% of San Diegans 16 and older, are fully immunized.\nOverall, nearly 1.22 million County residents have received at least one shot of the two-dose vaccine. That’s 45.2% of those eligible.\nThe goal is to fully vaccinate 75% of San Diego County residents 16 and older or 2,017,011 people.\nThose who received the one-dose Johnson & Johnson vaccine, which is currently on hold in the County due to guidance from the Centers for Disease Control and Prevention and Food and Drug Administration, are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nA woman readies herself to receive a COVID-19 vaccine at the Educational Cultural Complex site in Mountain View.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.0 cases per 100,000 residents (as of April 13).\nThe County remains in the Orange Tier or Tier 3 under the state’s new guidance. The California Department of Public Health recently advised that unless there are extenuating circumstances, such as low rate of vaccine uptake, a county will only move to a more restrictive tier if hospitalizations are increasing significantly among vulnerable individuals, especially among vaccinated individuals, and both testing positivity and adjusted case rates show a concerning increase in transmission. This is currently not the case in the region.\nCurrently, the testing positivity percentage is 2.5%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 3.0% and is also in the Orange Tier or Tier 3.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 20.\n\nCommunity Setting Outbreaks:\n\nEight new community outbreaks were confirmed April 13: two were in restaurant/bar settings, one in a business setting, one a in grocery setting, one in a distribution warehouse setting, one in a retail setting, one in a private residence setting and one in a government setting.\nIn the past seven days (April 7 through April 13), 17 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n16,297 tests were reported to the County on April 13, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 1.9%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,831.\n\nCases, Hospitalizations and ICU Admissions:\n\n260 COVID-19 cases were reported to the County on April 13. The region’s total is now 273,968.\n15,033 or 5.5% of all cases have required hospitalization.\n1,666 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n25 additional COVID-19 deaths were reported April 13. The region’s total is 3,648.\nMost of these are not new deaths—21 occurred in December 2020— but were just added to the list after a rigorous review of death certificates that were incorrect or incomplete and required the analysis of the patients’ medical records to determine if they were COVID-19 deaths.\n13 men and 12 women between Dec. 3, 2020 and April 10, 2021.\nOf the people who died, 12 were 80 years of age or older, seven were in their 70s, five were in their 60s and one was in their 50s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210414.16.56.33"}