{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Identifies Projects to Dramatically Reduce Tijuana River Valley Sewage", "description": "The County of San Diego has released a report that identifies 27 projects that could potentially reduce the flow of sewage from Mexico into the U.S. and Tijuana River Valley each year by as much as 91%, from 138 days to 12.", "datePublished": "2020-06-09T13:06:04-07:00", "url": "https://www.countynewscenter.com/county-identifies-projects-to-dramatically-reduce-tijuana-river-valley-sewage/", "keywords": ["environment", "beach water quality", "sustainability", "tijuana river valley regional park"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-06-09T13:58:52-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego has released a report that identifies 27 projects that could potentially reduce the flow of sewage from Mexico into the U.S. and Tijuana River Valley each year by as much as 91%, from 138 days to 12.\nThe report, the Tijuana River Valley Needs and Opportunities Assessment, identifies strategies to manage impacts from sewage, trash, and sediment on the U.S. side of the border. It was created in collaboration with more than 30 agencies and organizations, numerous meetings and the review of more than 600 documents.\nThe report will now proceed to the Environmental Protection Agency (EPA) for consideration. Last month, the federal EPA said up to $300 million from the new United States-Mexico-Canda Agreement would be considered for projects to address the U.S.-Mexico border water issue. An oversight committee at the EPA will be formed and projects identified for funding.\nSan Diego County is advocating for the majority of those federal dollars to be used for this region.  It will also participate in developing the implementation plan with EPA, other federal agencies and local partners.\nNumerous local, state and federal agencies and organizations, including the United States International Boundary Water Commission and the state and federal EPAs, are involved in border water quality issue. The County’s Department of Environmental Health monitors beach water quality on the U.S. side of the border and notifies the public when water quality is not safe for swimming and recreating.\nThe report was developed by county staff and engineering consultants with funding provided through California Senate Bill 507, sponsored by State Senator Ben Hueso among others.\nCounty Board of Supervisors Chairman Greg Cox has championed efforts to resolve the water-quality issue for more than a decade.\n“Our County has been at the forefront of finding solutions to the persistent sewage problems in the Tijuana River Valley, and this study goes a long way to achieving that,” Cox said. “Thanks to my colleagues at the federal, state, and local level who have all worked tirelessly to advocate for and secure this federal funding, we are now ready to work with the EPA to identify the projects that will have the most impact in capturing, diverting and treating sewage so that we can finally reclaim and enjoy our beaches in the South Bay.”\nAccording to the report, implementation of the identified projects could reduce the number of days that sewage flows across the border from 138 days per year to just 12. That equates to the capture and treatment of up to 163 million gallons per day on the U.S. side of the border.\nThe structural projects recommended in the report include pump stations, sewage treatment facilities, detention basins, trash traps and screens, quarry and estuary restoration. The report also includes trash clean-up, habitat restoration, and expanded water-quality monitoring to supplement the infrastructure improvements.\nThe projects focus on four drainage areas in the Tijuana River Valley: the Tijuana River, Smuggler’s Gulch, Goat Canyon, and Yogurt Canyon. However, the projects are prioritized by the greatest return on investment, leaving the Tijuana River high on the list because that is where the flows are the greatest.\nTo improve water quality, the report explores three major approaches:\n\nDiverting sewage flows from the Tijuana River flows not captured on the Mexico side, building additional sewage treatment capacity on the U.S. side of the border, and discharging the treated water into the deep ocean\nDiverting those same overflows directly to the South Bay Ocean Outfall without treatment\nUse of in-stream basins to capture transboundary flows within the Tijuana River and/or canyon tributaries before flows reach the Tijuana River Estuary or the ocean.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200609.13.06.04"}