{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Libraries Feature Artwork of Late Sculptor and Artist James Hubbell", "description": "Iconic local sculptor and artist, James Hubbell, who brought his unique style of art to many places around the region, including several of the County’s libraries, passed away last Friday at the age of 92.", "datePublished": "2024-05-21T14:11:58-07:00", "url": "https://www.countynewscenter.com/county-libraries-feature-artwork-of-late-sculptor-and-artist-james-hubbell/", "keywords": ["library", "san diego county library", "sustainable communities"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-05-21T15:18:24-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIconic local sculptor and artist, James Hubbell, who brought his unique style of art to many places around the region, including several of the County’s libraries, passed away last Friday at the age of 92.\nHubbell’s designs go beyond artistic expression and incorporate community involvement, volunteerism and education.\nHis body of work includes mosaics, wrought iron railings and gates, stained glass and sculptures and graces hundreds of San Diego homes, churches and public spaces, including San Diego County Library branches at Alpine, Del Mar, Fallbrook, Julian, Ramona.\nThe artwork will continually serve our community as an inspirational reflection of one of the area’s most prolific artists.\n“Art and beauty can bridge prejudices, build lasting friendships, change people’s visions of who they are and what is possible in life, and, in fact, change our myths,” James Hubbell.\nTo learn more about San Diego County Library and the services it provides, go to www.sdcl.org.\nSee gallery below:\n \n\nAlpine Library – Stained glass art piece. Donated by the Alpine Library Friends Association and the late Virginia “Jinny” Lambert.\n\nDel Mar Library – A River of Time. Donated in 2022 by Del Mar Foundations and Friends of the Del Mar Library.\n\nFallbrook Library – Poet’s Patio and Mosaic Entry by Friends of the Fallbrook Library.\n\nJulian Library – Interior gate of iron, bronze and stained glass. Donated in 2012 by Friends of the Julian Library.\n\nRamona Library – Laurel Passage. Donated in 2014 by Friends of the Ramona Library.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240521.14.11.58"}