{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Appoints Interim Sheriff", "description": "The San Diego County Board of Supervisors unanimously appointed Anthony Ray as interim sheriff on Tuesday. He will step into the top leadership role through January 2023 when the winner of this year’s election for sheriff takes office.", "datePublished": "2022-03-22T12:45:30-07:00", "url": "https://www.countynewscenter.com/board-appoints-interim-sheriff/", "keywords": ["public safety", "board of supervisors meeting", "interim sheriff"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-03-22T12:48:30-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors unanimously appointed Anthony Ray as interim sheriff on Tuesday. He will step into the top leadership role through January 2023 when the winner of this year’s election for sheriff takes office.\nInterim Sheriff Anthony Ray\nRay will be sworn in on April 5. He is currently an assistant sheriff and has served more than 30 years in the department. He will oversee one of the largest sheriff’s departments in the nation, managing nearly 4,700 employees and providing primary law enforcement to nearly one million people.\nThe Board first interviewed the three applicants, Ray, Michael Barletta and Edwin Brock on March 15 and invited them back Tuesday for a final round of questions. At the conclusion, the Board members made their choice by vote and the results were then immediately read and entered into the record.\nThe public applicant interviews and selection process occurred after former Sheriff William Gore, who served as sheriff from 2009 until Feb. 3, retired with 10 months left in the current term.\nIn November 2022, voters will elect a successor who will take office in January 2023.\nNeither Ray nor the other two applicants who were considered for the job are vying for the permanent role in this election.\nThe San Diego County Sheriff’s Department provides patrol and investigative operations, air support, search and rescue service and forensic support for the San Diego region. The department operates seven detention facilities countywide and provides security to seven courthouses.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220322.12.45.30"}