{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Missed Voter Registration Deadline? It’s Not Too Late!", "description": "If you missed the voter registration deadline Tuesday, you can still register to vote and cast a provisional ballot in the March 3 Presidential Primary Election.", "datePublished": "2020-02-19T08:00:06-08:00", "url": "https://www.countynewscenter.com/missed-voter-registration-deadline-its-not-too-late/", "keywords": ["elections", "conditional voter registration", "fgg", "march 3 2020 election", "presidential primary election", "san diego county registrar of voters", "satellite locations"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-19T09:08:17-08:00", "articleType": "article", "articleContent": "\nIf you missed the voter registration deadline Tuesday, you can still register to vote and cast a provisional ballot in the March 3 Presidential Primary Election. For now, that’s only at the Registrar of Voters Office. Then on Feb. 29, the Registrar will open four satellite locations so voters will have more opportunities to register and vote. Voters will be taking advantage of the Conditional Voter Registration law which allows voters a chance to register and cast a ballot after the registration deadline. Voters will need to fill out additional paperwork before voting so they should allow for extra time.\nYou can still register and vote by visiting:\n\nThe Registrar of Voters office at 5600 Overland Ave., San Diego, CA 92123 during the hours of 8 a.m. to 5 p.m. Monday through Friday and until the polls close on Election Day. The office will also be open 8 a.m. to 5 p.m. on Saturday, Feb. 29 and Sunday, March 1 for weekend voting.\nAny of the Registrar’s four satellite voting locations from 8 a.m. to 5 p.m. Saturday, Feb. 29 through Monday, March 2 until Election Day when the voting hours will change to 7 a.m. to 8 p.m. to reflect the hours at the polls. The locations will be spread across the county.  The sites will be announced Feb. 25.\n\nYou may take advantage of this new law at your polling place. However, the Registrar urges you to visit the Registrar’s office now or one of its satellite locations during the three days prior to Election Day. These locations are better equipped to serve prospective voters and will have all ballot types in the election. Putting this off until Election Day will likely cause great delays and long lines.\nProspective voters will be able to register to vote, mark and cast their ballot provisionally. That means the ballots will be counted after election officials verify the voter registration and confirm the voter has not yet voted elsewhere in the current election. Provisional ballots are typically verified and counted after Election Day.\nDuring the last election, conditional voting was allowed only at the Registrar’s office. On Election Day, voters waited in long lines for hours to register and cast their ballots.\n“A presidential election comes with a big voter turnout and the potential for longer lines,” said Registrar Michael Vu. “Not registered? No problem. But don’t wait until Election Day when you can avoid the lines today.”\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nTo learn more about voting in the March 3 presidential primary, call (858) 565-5800 or visit sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200219.08.00.06"}