{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Prevent Underage Intoxication and Potentially Save Lives", "description": "With schools out for summer for many teens and children, the risk of them gaining access to alcohol goes up when parents are at work and teens may be unsupervised.", "datePublished": "2024-06-07T11:04:23-07:00", "url": "https://www.countynewscenter.com/prevent-underage-intoxication-and-potentially-save-lives/", "keywords": ["public safety", "marijuana", "sheriff", "underage drinking"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-06-07T14:00:30-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesWith schools out for summer for many teens and children, the risk of them gaining access to alcohol goes up when parents are at work and teens may be unsupervised.\nMinors often get alcohol or marijuana in one of these ways: from older friends; strangers willing to buy it for them; store clerks who fail to check IDs; online; friend’s parents and sometimes their own parents.\nThe Sheriff’s Department is reminding adults that it is against the law to provide alcohol or marijuana to minors, host underage drinking parties and to allow minors to drink or use marijuana.\n“The Sheriff’s Department takes these incidents very seriously and will continue to work with the District Attorney, the County and our contract cities to ensure those responsible for these underage incidents are held accountable,” said Undersheriff Rich Williams.\nUnderage drinking and drug use can impact a teen’s health, safety and judgment, leading to consequences such as alcohol poisoning, cannabis use disorder, assaults, drunk or drugged driving, accidental injuries, property damage and unprotected sex.\nCourtesy of the San Diego Sheriff’s Department\nAll 18 incorporated municipalities and the unincorporated areas of the County have adopted “social host” ordinances, making it illegal to host underage drinking or marijuana parties. Any person who sells or provides an alcoholic beverage to a minor can receive up to a $1,000, six months in jail or both.\nParents play a key role in preventing underage drinking. Health and safety experts recommend the following tips for parents to discourage underage drinking and other risky behavior.\nStay Involved: Show your children you care by spending time with them and doing something fun and interactive together.\nCommunicate: Regardless of the season, it is always a good to talk to your children about the dangers of alcohol, tobacco and other drugs.\nSet Rules: Establish clear rules regarding your expectations on drinking and marijuana use, as well as on unsupervised time spent with friends.\nSupervise: This can be challenging especially for parents of high school students; however, be physically present when you can. When you can’t, ask a neighbor, relative or friend to check on them.\nMonitor: Know what your children are doing and where they are always. Randomly call and text them.\nEngage: Help your children set some structure during summer by helping them find a summer job or engaging them in supervised activities, such as sports, camps and classes.\nTeam Up: Get to know the parents of your children’s friends. Make sure they feel the same way you do about underage drinking and marijuana use.\nEducating residents about making healthy and safe choices is part of Live Well San Diego, the County’s ongoing initiative to improve the health and well-being of residents.\nIf you have a tip about an underage drinking or marijuana use party, you can call the Crime Stoppers Anonymous Tip Line 24 hours per day at (888) 580-8477. You could be eligible for up to a $1,000 reward for information leading to an arrest.\nParents who suspect their child might have a drinking or drug use problem are encouraged to call the County of San Diego Access and Crisis Line at (888) 724-7240 or 211.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240607.11.04.23"}