{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Invites Community to Unite for National Recovery Month ", "description": "September is National Recovery Month and County Behavioral Health Services (BHS)is inviting community members and organizations to come together in support of the recovery community.  ", "datePublished": "2024-09-11T10:12:33-07:00", "url": "https://www.countynewscenter.com/county-invites-community-to-unite-for-national-recovery-month/", "keywords": ["health", "addiction recovery", "mental health", "national recovery month", "recovery", "substance use"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-09-11T10:14:43-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSeptember is National Recovery Month and County Behavioral Health Services (BHS) is inviting community members and organizations to come together in support of the recovery community.  \nNational Recovery Month brings awareness around mental health and addiction recovery. It also celebrates the recovery community and supports both those currently on their recovery journey and those people still struggling with addiction. \nEvidence-based treatment and recovery practices are available to help people battling substance use and mental health disorders. \nThere are a number of ways to mark and observe National Recovery Month, including these five suggestions from BHS.  \nAmong these five ways is sharing a spotlight story about a person with lived experience in recovery or an organization doing work that made a difference in a person’s recovery journey. BHS is collecting the stories to highlight the resiliency and the spectrum of recovery in the community. Submissions will be highlighted throughout the year.  \n“Every recovery story is unique and powerful,” said Luke Bergmann, Director of County Behavioral Health Services. “When people join together and share their stories with one another, it can provide strength and accountability, but more importantly it fosters a sense of connection and healing among the recovery community. It also helps reduce the stigma often associated with mental illness and substance use, encouraging more people to seek the supports they may need.” \nThe County’s Behavioral Health Services provides mental health and substance use disorder services to more than 111,000 San Diego County residents of all ages.  \nIf you or someone you care about is in crisis or would like behavioral health resources or support, including accessing Mobile Crisis Response Teams (MCRT), please call the Access and Crisis Line at (888) 724-7240 or 9-8-8 (24 hours a day, 7 days a week). Calls are answered by experienced counselors, with assistance available in over 200 languages.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240911.10.12.33"}