{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bomb Threat at Registrar of Voters Investigated, Is Not Credible", "description": "The County of San Diego Registrar of Voters received a bomb threat early Friday evening at its office in Kearny Mesa. Sheriff’s deputies conducted an investigation. They determined the threat was not credible, and those who were in the building were safe.", "datePublished": "2024-11-09T08:34:05-08:00", "url": "https://www.countynewscenter.com/bomb-threat-at-registrar-of-voters-investigated-is-not-credible/", "keywords": ["government", "registrar of voters", "sheriff", "threat"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2024-11-09T09:21:01-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County of San Diego Registrar of Voters received a bomb threat early Friday evening at its office in Kearny Mesa. Sheriff’s deputies conducted an investigation. They determined the threat was not credible, and those who were in the building were safe.\nThe safety of County employees and the public is a top priority. The Sheriff’s Office will continue working with law enforcement partners to monitor intelligence and information related to any possible threats, and they are prepared to handle any safety challenges that may arise.\nThe Registrar of Voters is committed to a safe, transparent and accurate election process and will continue to process remaining ballots to certify election results by Dec. 5. The Registrar expects to use the full certification period to make sure every legally cast vote is added to the count in the most expeditious, yet careful manner available, ensuring accurate results. All updates will be posted on sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241109.08.34.05"}