{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Aug. 30 is Deadline to Register to Vote", "description": "If you haven’t registered to vote in the Sept. 14 California Gubernatorial Recall Election and want to vote by mail, you need to register by Monday, Aug. 30.", "datePublished": "2021-08-27T07:28:46-07:00", "url": "https://www.countynewscenter.com/aug-30-is-deadline-to-register-to-vote/", "keywords": ["elections", "2021 recall election", "early voting", "registrar of voters", "voter registration deadline"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-08-27T08:19:31-07:00", "articleType": "article", "articleContent": "\nIf you haven’t registered to vote in the Sept. 14 California Gubernatorial Recall Election and want to vote by mail, you need to register by Monday, Aug. 30. Otherwise, you will need to make a trip in person to the Registrar’s office, or to any voting location, to register conditionally and vote provisionally.\nYou will need to register or re-register to vote if you:\n\nare not registered in San Diego County\nrecently moved\nchanged your name\n\nNot sure if you’re registered to vote? Check your registration status online at sdvote.com. If you’re not registered or need to change your registration, you’ll be able to complete an online registration form.\nIf your signature is confirmed through records at the Department of Motor Vehicles, it will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the form, sign it and return it to the Registrar’s office by 5 p.m. on Aug. 30.\nIf you don’t have access to a computer, registration forms are also available at the Registrar of Voters office or at the offices of the U.S. Postal Service, City Clerk, public libraries, and Department of Motor Vehicles. Check with each location to make sure they are open before you head over.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nRegistration forms must be postmarked or delivered to the Registrar by Aug. 30. The Registrar of Voters office will be open until 5 p.m. that day. Voters may also register online until midnight.\nIf you miss the deadline to register, you may still conditionally register and vote provisionally through Election Day.\nEarly voting is already underway at the Registrar’s office in Kearny Mesa. Voters can cast their ballots there from Monday through Friday, 8 a.m. to 5 p.m.\nTo learn more about voting in the upcoming recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210827.07.28.46"}