{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Has About $4 Million for Non-Profits Serving People Impacted by COVID-19", "description": "Non-profit organizations could qualify for a share of about $4 million from the County Housing and Community Development Services’ Community Development Block Grant.", "datePublished": "2020-12-10T10:37:38-08:00", "url": "https://www.countynewscenter.com/county-has-about-4-million-for-non-profits-serving-people-impacted-by-covid-19/", "keywords": ["health", "4 million", "cbdg", "coronavirus"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-10T11:30:28-08:00", "articleType": "article", "articleContent": "\nDo you run a non-profit organization which serves low and moderate-income people who’ve been impacted by the novel coronavirus pandemic?\nIf so, you may qualify for a share of about $4 million from the County Housing and Community Development Services’ Community Development Block Grant (CDBG).\nThe funds are available for projects in the following areas:\n\nPublic services such as grocery delivery, food pantries, rent or mortgage assistance programs, diagnostic testing and health care job training.\nConstruction or rehabilitation of testing or treatment community facilities.\nAcquire or rehabilitate housing related to isolation and quarantine.\n\nSome further examples of eligible projects are available here.\nAll activities must benefit residents in the unincorporated areas of the region, as well as the cities of Coronado, Del Mar, Imperial Beach, Lemon Grove, Poway and Solana Beach.\nProjects or programs funded with CDBG funds must benefit at least 51% of residents whose incomes are at or below 80% of the Area Median Income. Additionally, the project must serve people and families who have been affected by the Coronavirus pandemic.\nApplications are now open online and will be available through January 8, 2021 at 5 p.m. Completed applications can be sent to:\nCounty of San Diego\nHousing and Community Development Services\nCommunity Development Division\n3989 Ruffin Road\nSan Diego, CA 92123\nIf you would prefer to submit an electronic application, please submit to Marco De La Toba (marco.delatoba@sdcounty.ca.gov), Freddy Villafan (freddy.villafan@sdcounty.ca.gov), or Sarah Snook Brunson (sarahsnook.brunson@sdcounty.ca.gov).\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201210.10.37.38"}