{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Connects with Businesses in the South Bay", "description": "It’s matchmaking of sorts. The County needs a diverse pool of suppliers. And businesses that can offer those supplies, well, they need business. A company specializing in helping small businesses find government contracts brought the two together at a Connecting with the County event Wednesday in National City.", "datePublished": "2024-06-05T15:31:14-07:00", "url": "https://www.countynewscenter.com/county-connects-with-businesses-in-the-south-bay/", "keywords": ["government", "apex", "connecting with the county", "department of purchasing and contracting", "national city"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-06-05T15:43:14-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIt’s matchmaking of sorts. The County needs a diverse pool of suppliers. And businesses that can offer those supplies, well, they need business.\nA company specializing in helping small businesses find government contracts brought the two together at a Connecting with the County event Wednesday in National City.\nThe County is one of the largest buyers in the region, providing everything from pencils to entire new buildings.\nCounty Purchasing and Contracting makes conscious efforts to increase supplier diversity by reaching out to underrepresented suppliers and contractors.\n\nEighty-five people participated to learn more about doing business with the County.\nThe event included a panel discussion on how to get started, what is involved and how equity plays a role.\nOne woman came down from Los Angeles to find out more about winning contracts.\n“I’ve been so close. By point two, I lost my last one,” said Julie Saunders, business development manager for a company called buddi. “It’s now really learning about what more can I do. They talk about getting in front of the RFP (Request for Proposal), what does that mean, you know, so coming out here was definitely to learn and get that sort of training that I need…”\nSeven County departments were on hand to explain what they do and what they’re looking for in the way of services and supplies.\nThey included Child and Family Well-being, General Services, Homeless Solutions and Equitable Communities, the Library, Planning and Development Services, Public Health and the Sheriff’s Department.\n“The County procured nearly $2 billion worth of goods and services last fiscal year and we have over 2,000 suppliers registered in the County’s procurement system, BuyNet, but we are always on the lookout for a wider pool of businesses and non-profits who can supply what we need,” said County Purchasing and Contracting Director Jack Pellegrino. “South County features a diverse group of businesses and nonprofits, so we are glad we had the chance to connect.”\nThe County offers a local business preference program where a 5% preference is given to local, small, veteran-owned or disabled veteran businesses.\nThe department is also looking to increase access and opportunities for minority businesses and is instituting an equity in contracting review of all the County’s services. Purchasing and Contracting is also establishing a formal Supplier Diversity Program in partnership with the San Diego Council for Supplier Diversity.\nAPEX Accelerators worked with the County to put on the event. The company works with businesses on how to get procurement contracts with different government agencies like SANDAG, the Port of San Diego and the State of California.\nThe County and APEX may hold another event in the fall and is looking to schedule additional outreach opportunities in other regions within San Diego County. The Department of Purchasing and Contracting also offers workshops on a regular basis.\nBusinesses and nonprofits who would like to do business with the County can also find out what opportunities are available by signing up for BuyNet. A new BuyNet was recently put into place so those who are already in the system may need to reregister.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240605.15.31.14"}