{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New COVID-19 Vaccine to Be Available for San Diego Adults", "description": "San Diego County adults looking for a more traditional vaccine against COVID-19 will soon be able to get Novavax, the County Health and Human Services Agency announced today.", "datePublished": "2022-07-28T16:39:59-07:00", "url": "https://www.countynewscenter.com/?p=209074", "keywords": ["government"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-07-28T16:39:59-07:00", "articleType": "article", "articleContent": "\nSan Diego County adults looking for a more traditional vaccine against COVID-19 will soon be able to get Novavax, the County Health and Human Services Agency announced today.\nNovavax, which is currently being used around the world, will be available in the region as soon as this weekend, County health officials said.\nThe vaccine was developed using protein-based technology, which the U.S. Food and Drug Administration has been using for decades to treat diseases such as hepatitis B, shingles and human papillomavirus. The vaccine presents a specific portion of the virus which the body generates immunity against.\nNovavax has been authorized as a two-dose primary series, given three to eight weeks apart, to people ages 18 and older. Clinical trials showed that the vaccine is 90% effective at preventing mild, moderate and severe COVID-19.\n“This is yet another vaccine we have to slow the spread of COVID-19, especially now that we’re seeing an increase in cases and hospitalizations,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “San Diegans now have another safe choice to prevent serious complications from COVID.”\nClinical trials showed Novavax does not cause severe side effects. Reactions were mild and like those rare effects seen from COVID-19 vaccines using the mRNA technology, such as pain, tenderness, redness and swelling at the injection site.\nNovavax is expected to be available at local healthcare providers, retail pharmacies, community clinics and County public health centers and community vaccination events.\nEveryone 6 months and older can get COVID-19 vaccines at no cost. For those who received an mRNA vaccine, boosters are available for people 5 years and older. Parental consent is required for all eligible minors to be vaccinated.\nVaccination Progress:\n\nReceived at least one shot: Over 3.0 million or 89.9% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: More than 2.65 million or 79.3%.\nBoosters administered: 1,416,251 or 58.3% of 2,430,747 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n22 additional deaths were reported since the last report on July 21. The region’s total is 5,409.\nOf the 22 additional deaths, 14 were women and eight were men. They died between Jan. 24 and July 20, 2022; 15 deaths occurred in the past two weeks.\n12 of the people who died were 80 years or older, four were in their 70s, one was in their 60s, three were in their 50s, one was in their 40s and one was in their 30s.\n14 were fully vaccinated and eight were not.\n20 had underlying medical conditions, one did not and one had medical history pending.\n\nCases, Case Rates and Testing:\n\n5,092 COVID-19 cases were reported to the County in the past three days (July 25 to July 27, 2022). The region’s total is now 881,729.\n11,362 cases were reported in the past week (July 21 through July 27) compared to 12,528 infections identified the previous week (July 14 through July 20).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 54.35 for people fully vaccinated and boosted, 32.53 for fully vaccinated people and 93.86 for not fully vaccinated San Diegans.\n7,040 tests were reported to the County on July 23, and the percentage of new positive cases was 14.1% (Data through July 23).\nThe 14-day rolling percentage of positive cases, among tests reported through July 23, is 15.7%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220728.16.39.59"}