{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Recognized for Five COVID-19 Response Programs", "description": "The County Health and Human Services Agency has been recognized by the National Association of County and City Health Officials for five initiatives related to the region’s COVID-19 response.", "datePublished": "2021-06-24T16:48:50-07:00", "url": "https://www.countynewscenter.com/county-recognized-for-five-covid-19-response-programs/", "keywords": ["health", "awards", "coronavirus", "covid-19", "national association of county and city health officials"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-06-24T16:48:50-07:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency has been recognized by the National Association of County and City Health Officials for five initiatives related to the region’s COVID-19 response. The County received one gold award, one silver award, two bronze awards and an honorable mention.\nGold Award\nHHSA received the gold award for its efforts in proactively reaching out to over 400 health care providers, providing personalized consultations in areas with the highest case rates of COVID-19. Over a span of nine months, a County health care sector team communicated with all types of health care practices, including primary care, specialists, home health, alternative care and community clinics, through email and phone, sending over 600 emails and placing over 1,000 phone calls.\nThe goal of the initiative was to supply health care providers with the information they needed to connect patients to COVID-19 vaccinations, testing, health education resources and COVID-19 treatment. This effort contributed to reducing COVID-19 disparities, especially in minority communities which were some of the hardest-hit by the virus.\nSilver Award\nThe County was recognized with a silver award for its population health approach to the pandemic. The County developed teams of subject-matter experts who communicated information about COVID-19 to various sectors of the economy based on the specific needs of a group. Sectors included businesses, faith organizations, schools, the military, service providers for people experiencing homelessness, and others.\nSector teams strengthened existing connections between the County and the community and allowed members of the respective groups to have a regular dialogue with each other.\nBronze Awards\nThe County received two bronze awards, one for its hygiene kit distribution program and another for its cross-border communication and collaboration efforts.\nSince March 2020, the County distributed over 32,000 COVID-19 prevention hygiene kits to people experiencing homelessness. The kits included hand sanitizer, antiseptic wipes, bottled water, facial coverings and brochures with information about COVID-19 testing and vaccination opportunities.\nThe second bronze award recognizes the County’s efforts in communicating and collaborating with health officials in Baja California, Mexico. Recognizing the interconnectivity of the San Diego-Tijuana border region, the County initiated binational telebriefings at the onset of the pandemic to better address COVID-19 on both sides of the border.\nOver the last 14 months, officials on both sides of the border have shared data, facilitated cross-border medical care, coordinated large binational personal protective equipment donations, and implemented testing and vaccine strategies. The County’s binational sector is the only formal cross-border structure that was formed in response to the COVID-19 pandemic along the entire US-Mexico border.\nHonorable mention\nThe County’s Community Health Worker Communication and Outreach Services team received an honorable mention for its efforts in communicating pertinent COVID-19 information to the region’s communities of color. Throughout the pandemic, African Americans, Asian Pacific Islanders, Latinos, and refugee communities were disproportionately affected by COVID-19.\nThe County brought on a number of contracted partners to ensure vital information was shared in a culturally appropriate manner and in multiple languages to reach the diverse communities. The contractors also engaged each community of focus through traditional advertising and promotion, home visits, phone calls, and social media.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210624.16.48.50"}