{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Receives Report on Strong Families, Thriving Communities Initiative", "description": "The County Board of Supervisors received an in-depth look today at how the Strong Families, Thriving Communities initiative has improved the lives of minority families interacting with the County’s child welfare and juvenile justice systems.", "datePublished": "2020-02-11T11:40:58-08:00", "url": "https://www.countynewscenter.com/board-receives-report-on-strong-families-thriving-communities-initiative/", "keywords": ["families", "child welfare", "health", "juvenile justice"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-02-11T11:54:46-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors received an in-depth look today at how the Strong Families, Thriving Communities initiative has improved the lives of minority families interacting with the County’s child welfare and juvenile justice systems.\nStrong Families, Thriving Communities was created in 2017 in partnership with The San Diego Foundation and the Clinton Foundation. The collaboration was a response to national and local data that shows children of color, when compared to their white peers, have a disproportionate involvement in the child welfare and juvenile justice systems.\nSince the program started, the County has worked with more than 100 community partners to examine challenges and identify solutions to make child welfare and juvenile justice systems more equitable for families and children.\nTogether with its partners, Strong Families, Thriving Communities created a Blueprint for Action. The initiative outlined 29 specific goals, including suggested system changes and timelines for completing them. Significant accomplishments of the three-year coalition include:\n\nDevelopment of the Trauma-Informed Care Code of Conduct by youth to ensure that all child and family-serving systems and community supports have policies and practices that demonstrate trauma-informed principles.\nCreation of the San Diego Mentorship Network which supports the work of community mentors and evaluates the impact of mentoring.\nPartnership with the Health and Human Services Agency Behavioral Health Services in the creation of behavioral health hubs that increase access to clinical care in communities.\n\nCounty departments have focused their efforts to ensure that all staff receive trainings in trauma-informed care and an awareness of how biases impact decisions, relationships, and healthy outcomes for children and families in the child welfare and juvenile justice systems.\nFor more information about the Strong Families, Thriving Communities initiative, visit The San Diego Foundation website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200211.11.40.58"}