{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "When to Expect Presidential Primary Election Results", "description": "On election night, we all want to know the results right away, but counting ballots takes time.", "datePublished": "2024-03-05T12:39:21-08:00", "url": "https://www.countynewscenter.com/when-to-expect-presidential-primary-election-results/", "keywords": ["elections", "county registrar of voters", "election results", "election results updates", "fgg", "mail ballots", "march 5 presidential primary", "provisional ballots", "results take time"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-03-05T12:39:21-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesOn election night, we all want to know the results right away, but counting ballots takes time. Here are some reasons why:\n\nThe County has over 1.9 million active registered voters.\nEvery active registered voter received a ballot in the mail.\nMail ballots can be counted if postmarked on or before Election Day and received up to seven days after.\nThose not registered can conditionally register and vote provisionally up to and on Election Day.\n\nSo, what can you expect on election night?\nThe first set of unofficial election night results comes in shortly after 8 p.m. This will include mail ballots received before Election Day and vote center ballots from early voting between Feb. 24 – March 4.\nFor the latest results update on election night, you can visit sdvote.com or follow the Registrar’s office on X (formerly Twitter).\nAfter that, election night results will include only the vote center ballots cast on Election Day. There will be no more updates to mail ballots on election night.\nThe Election Day ballots come in after the vote centers close at 8 p.m. There will be a gap in time for the next set of results due to poll workers packing up supplies and driving in from over 200 vote centers located around the county.\nUpon arrival to the Registrar’s office, the vote center ballots will be scanned, and results will be periodically updated until all vote center ballots have been counted.\nSince there are fewer vote centers compared to the traditional polling place model, the Registrar’s office will provide less frequent result updates.\nThe final unofficial election night results may not come in until 1 a.m. or later and will only cover the ballots that could be counted immediately.\nThe counting of ballots does not end election night.\nWhat’s left to count?\n\nMail ballots\n\nThese are ballots dropped off at vote centers, official ballot drop boxes or picked up by the U.S. Postal Service on Election Day.\nBallots mailed right before or on March 5 have seven days to arrive if postmarked by Election Day.\n\n\nProvisional ballots\n\nPeople who missed the Feb. 20 registration deadline may conditionally register and vote provisionally in person up to and on Election Day.\nOnce their voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the state, the voter registration becomes active and the provisional ballot is counted.\n\n\n\nAfter election night, the next release of unofficial results is scheduled to be posted by 5 p.m. on Thursday, March 7.\nAdditional updates are at the discretion of the Registrar of Voters. The Registrar’s office will be closed on Monday, April 1 in observance of Cesar Chavez Day.\nHowever, the results must be certified by April 4 and the Registrar expects to use the full certification period to make sure the results are accurate. All updates will be posted on sdvote.com with the final certified results posted on April 4.\nLearn more about the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240305.12.39.21"}