{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voting by Mail is Simple, Safer and Secure", "description": "As mail ballots start showing up in mailboxes around San Diego County, the Registrar of Voters office is reminding voters that it’s safer to mark your ballot at home to avoid the risk of contracting COVID-19.", "datePublished": "2020-10-08T08:56:58-07:00", "url": "https://www.countynewscenter.com/voting-by-mail-is-simple-safer-and-secure/", "keywords": ["elections", "fgg", "mail ballots", "november 3", "november general election", "registrar of voters", "safer and secure", "simple", "voting"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-10-08T09:48:26-07:00", "articleType": "article", "articleContent": "\nAs mail ballots start showing up in mailboxes around San Diego County, the Registrar of Voters office is reminding voters that it’s safer to mark your ballot at home to avoid the risk of contracting COVID-19. More than 1.9 million mail ballots for the Nov. 3 Presidential General Election were sent out to registered voters earlier this week.\nVoting by mail is:\n\nSIMPLE: A mail ballot, instructions and an “I Voted” sticker are included in the mail ballot packet.\nSAFER: Avoid long lines, the need for safe distancing and a mask by making voting decisions from the safety of your home.\nSECURE: Sign and date your envelope, seal your completed ballot inside and return it postage free to a trusted source:\n\nReturn your ballot through the mail. For a location near you, visit the U.S. Postal Service office or collection box website.\nReturn it to one of 126 mail ballot drop-off locations around the county. Find the closest one to you by visiting the Registrar’s online locator tool.\nReturn it to the Registrar’s office where early voting is already underway from 8 a.m. to 5 p.m. Monday through Friday. If you plan to drop off your mail ballot there or vote in person, wear a face covering and maintain social distancing.\n\n\n\nYou can also track your ballot by signing up for Where’s My Ballot? You’ll get  notifications when the mail ballot is sent to you, when it arrives back at the Registrar’s office and when it’s counted.\nTo learn more about Vote Safer San Diego and voting in the Nov. 3 election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201008.08.56.58"}