{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Masks No Longer Required, But Strongly Recommended Indoors", "description": "The County is following new guidance from the California Department of Public Health and masks are no longer be required in most indoor settings.", "datePublished": "2022-03-02T16:43:54-08:00", "url": "https://www.countynewscenter.com/masks-no-longer-required-but-strongly-recommended-indoors/", "keywords": ["health", "coronavirus", "covid-19", "face coverings ending", "masks not required", "vaccination"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-03-03T08:53:24-08:00", "articleType": "article", "articleContent": "\nThe County is following new guidance from the California Department of Public Health and masks are no longer required in most indoor settings.\nThe California Department of Public Health discontinued the mask mandate March 1, but is strongly recommending that people continue wearing masks indoors regardless of their vaccination status.\nAlso, starting on March 12, K-12 schools and child care settings will no longer require masks indoors.\nSpecific high-risk settings will continue to require that everyone wear face coverings. These include health care, long-term care, and detention facilities, as well as transit hubs and public transit, cooling centers and emergency shelters.\nLocal businesses have the discretion to follow the new guidance or continue requiring masks indoors regardless of vaccination status. Also, San Diegans can choose to wear a mask at any time.\nWhere to Get COVID-19 Vaccines \nThe region has plenty of COVID-19 vaccine supply. The county has more than 400 vaccination sites including pharmacies, medical providers, clinics, and County locations.\n“Get your COVID-19 booster since the vaccine is the best protection we have against the virus,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Getting your booster when you are eligible helps to protect yourself, your family and others.”\nYou can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nReceived at least one shot: Almost 2.93 million or 93.0% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.57 million or 81.7%.\nBoosters administered: 1,169,223 or 54.8% of 2,134,791 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n43 new deaths were reported since the last report on Feb. 23, 2022. The region’s total is 5,045.\n24 men and 19 women died between Jan. 21, 2022 and Feb. 26, 2022.\n19 were age 80 or older, 13 were in their 70s, seven were in their 60s, one was in their 50s, one was in their 40s, one was in their 30s and one was in their 20s.\n23 of the people who died were fully vaccinated and 20 were not fully vaccinated.\n41 had underlying medical conditions, one did not and one had medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n952 COVID-19 cases were reported to the County on March 1, 2022. The March 1st total includes cases not reported to the County on Sunday and Monday. The region’s total is now 739,176.\n4,601 cases were reported in the past week (Feb. 23 through March 1) compared to 6,383 infections identified the previous week (Feb. 16 through Feb. 22).\nDuring the 30-day period between Jan. 18, 2022 and Feb. 16, 2022, there were 1,220 COVID-19 hospitalizations; 683 people were not fully vaccinated, 337 were fully vaccinated and 200 were fully vaccinated and boosted.\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 28.8 for people fully vaccinated and boosted, 30.9 for fully vaccinated people and 72.2 for not fully vaccinated San Diegans.\n2,820 tests were reported to the County on Feb. 27, 2022, and the percentage of new positive cases was 6.8%.\nThe 14-day rolling percentage of positive cases among tests reported through Feb. 27, 2022 is 5.4%.\n\nCommunity Setting Outbreaks:\n\n54 new community outbreaks were confirmed in the past seven days (Feb. 23, 2022 through March 1, 2022): 28 in TK-12th grade school settings, five in daycare/preschool/childcare settings, five in business settings, four in government settings, four in retail settings, two in healthcare settings, two in distribution warehouse settings, one in an emergency services setting, one in a restaurant setting, one in a college/university setting and one in a community-based organization setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220302.16.43.54"}