{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Library High School Celebrates Largest Graduation Yet", "description": "High school graduation is always special, but this year’s County Library High School graduation went above and beyond.", "datePublished": "2021-10-15T15:54:39-07:00", "url": "https://www.countynewscenter.com/county-library-high-school-celebrates-largest-graduation-yet/", "keywords": ["library", "county library", "department of child support services", "graduation", "graduation ceremony", "high school diploma", "library high school", "online classes", "san diego county library"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-10-15T15:54:39-07:00", "articleType": "article", "articleContent": "\nHigh school graduation is always special, but this year’s County Library High School graduation went above and beyond. Three sets of new graduates received their diplomas Thursday evening — fall 2019 students who finished school after that year’s graduation ceremony, 2020 grads whose ceremony was delayed by the COVID-19 pandemic and 2021’s graduates.\nAnd it wasn’t just a memorable occasion for the graduates; it was also special for the Library High School Program, which celebrated its largest ceremony since the program began in 2016. Thirty-three students donned caps and gowns to receive their diplomas at Spreckel’s Organ Pavilion in Balboa Park.\nThe County Library High School program gives students 18 years and older a way to earn high school diplomas through a nationally recognized program. It’s online, and students are able to go at their own pace. Classes are free.\nRoughly 13% of adults in San Diego County don’t have high school diplomas. Some had to quit school to go to work or they faced circumstances that prevented them from completing high school. Library High School gives them another chance, one that allows them to work around their regular schedule.\n“We are incredibly proud of our students, who placed their trust in San Diego County Library and dedicated their time and resources to obtaining a much-deserved high school diploma,” said San Diego County Library Director Migell Acosta. “These students worked at their studies after work, or after the children went to bed. Library High School opens an important door into new careers and supports the County Library’s vision of equitable access for all.”\nAny resident of San Diego County can apply for the program and students are accepted year-round. They can transfer up to 14 credits from their former high school and complete the online courses in five to 18 months. Students may also work toward a career certificate in any of eight different fields.\nWould-be students can apply online. They must take a prerequisite course to see if online learning would work for them and then the Library conducts virtual interviews before accepting applicants. Once enrolled, the student is provided with an online academic coach to help guide the student to be successful.\nThe program doesn’t award a general education diploma, known as a GED, but an actual high school diploma which allows for more opportunities to qualify for higher education and job opportunities. The County’s Department of Child Support Services partners with the program to refer potential students, enabling participants to further their education and improve employment prospects. Ten of those students were among the graduates Thursday.\nThe County’s Library High School is operated by Smart Horizons Career Online High School, an accredited, private national online school district. Since 2016, 99 people have graduated from the County’s online high school.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211015.15.54.39"}