{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Nonpartisan Voters – What You Need to Know to Vote for President", "description": "Calling all registered nonpartisan voters! If you want to vote for president in the March 5, 2024 primary election, you must inform the Registrar’s office which crossover party ballot you want by Jan. 5 so it is included in the initial mailing of ballots going out the week of Feb. 4.", "datePublished": "2023-12-20T09:00:53-08:00", "url": "https://www.countynewscenter.com/nonpartisan-voters-what-you-need-to-know-to-vote-for-president/", "keywords": ["elections", "crossover party ballots", "elections", "fgg", "march 5 presidential primary", "no party preference", "nonpartisan voters", "registrar of voters", "voting for president"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-12-20T13:31:22-08:00", "articleType": "article", "articleContent": "\nCalling all registered nonpartisan voters! If you want to vote for president in the March 5, 2024 primary election, you must inform the Registrar’s office which crossover party ballot you want by Jan. 5 so it is included in the initial mailing of ballots going out the week of Feb. 4.\nOtherwise, you will automatically receive a nonpartisan ballot in the mail, and it will not show the presidential primary contest or candidates.\nThe Registrar’s office sent the County’s nearly 490,000 nonpartisan registered voters a pre-paid return postcard requesting their selection of crossover ballot for the March 5, 2024 primary election.\nIf your postcard became lost among all the holiday mail, here is what you need to know.\nPolitical Parties Allowing Nonpartisan Voters to Crossover\nThis year, the American Independent Party, Democratic Party, and Libertarian Party are allowing nonpartisan voters to take part in their presidential primary elections.\nNonpartisan voters must request one of these three parties’ ballots to vote for that party’s presidential primary candidate. Selecting one of these three political party ballots will not register you with that party. You will remain a nonpartisan voter.\nWithout the postcard, you can still complete the Registrar’s nonpartisan crossover party ballot request form at sdvote.com or from 8 a.m. to 5 p.m. Monday through Friday at the Registrar’s office in Kearny Mesa.\nAlso note that the Democratic Party is allowing nonpartisan voters to vote in its presidential contest, but not its Central Committee contest. If requested, you will receive the nonpartisan version of the Democratic ballot.\nPolitical Parties NOT Allowing Nonpartisan Voters to Crossover\nThis year, the Green Party, Peace and Freedom Party, and Republican Party have closed their presidential primary to nonpartisan voters.\nNonpartisan voters will not be able to select one of these ballots. Nonpartisan voters who want one of these parties’ ballots will need to re-register with that party.\nYou can fill out a new voter registration form online at sdvote.com.\nNo matter what your party preference, all registered voters will be allowed to vote on nonpartisan contests and voter-nominated offices, such as U.S. congressional offices and state legislative offices.\nThe top two vote-getters in voter-nominated contests will advance to the Nov. 5 general election.\nNot sure which political party you’re registered with or if you’re registered to vote? \nYou can check your registration, re-register and register to vote at sdvote.com.\nThe Registrar’s office encourages you to do so well before Feb. 20 to avoid delays and long lines at vote centers.\nLearn more about voting in the March 5 presidential primary at sdvote.com or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231220.09.00.53"}