{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Summer Movies in the Park Season Starts Saturday at Waterfront Park", "description": "The County of San Diego’s free “2022 Summer Movies in the Park” season starts Saturday, May 28 with a 6 p.m. event and sunset showing of Walt Disney’s animated “Encanto” at the Waterfront Park.", "datePublished": "2022-05-26T13:15:35-07:00", "url": "https://www.countynewscenter.com/?p=208638", "keywords": ["parks and rec", "county parks", "lueg", "summer movies in the park", "waterfront park"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-05-26T15:24:51-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s free “2022 Summer Movies in the Park” season starts Saturday, May 28 with a 6 p.m. event and sunset showing of Walt Disney’s animated “Encanto” at the Waterfront Park.\nTo celebrate the opening, there will be numerous features and free fun for kids and families, including a “live” Mirabel Madrigal character — the fictional heroine of “Encanto” — bounce houses, themed crafts, music, games and other free activities. Although the movie starts at dusk, about 15 minutes past sunset, activities are expected to begin at 6 p.m. People should dress warmly and bring blankets as the weather is expected to be chilly.\nThe Summer Movies in the Parks events are a great way for families and friends to enjoy the outdoors, great parks, the night sky and great movies. Just bring a blanket or a lawn chair, maybe a picnic basket, settle back and enjoy adventures, comedies, superheroes and animated classics for the kids.\nNow in its 14th year, The County’s Department of Parks and Recreation has teamed up with eight cities and numerous local sponsors, including presenting sponsor Rose SD Realtor Group, to expand the number of movies and parks over the years.\nThis year’s schedule includes more than 150 movie showings in parks around the county, including 55 at 30 County of San Diego parks and facilities through October 29.\nSome of the films that will be featured this summer include: the Mel Brooks comedy classic “Young Frankenstein;” the adventure-comedy “Jumanji: Welcome to the Jungle,” starring the Rock; “Free Guy,” the adventure comedy about a video-game character who suddenly comes to life; Marvel’s action-adventure, “Spider-Man: No Way Home;” the animated musical comedy “Sing 2”; and the classic adventure-comedy-romance, “The Princess Bride.”\nHere is a full list of movies that will be presented at County parks through October. To see the entire list of upcoming movie events at all city and County parks this summer, and to get more information about them, go to at Summer Movies in the Park.\nFor more information about all County of San Diego’s parks and events, go to sdparks.org. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220526.13.15.35"}