{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves Otay Ranch Village Resort 13 Development", "description": "San Diego County supervisors approved a project this week that could build nearly 1,900 “zero-net-energy” solar-powered homes, condos, commercial space, parks, trails, open space, a school site, a fire/sheriff’s station and a hotel in South County.", "datePublished": "2020-11-19T14:12:10-08:00", "url": "https://www.countynewscenter.com/board-approves-otay-ranch-village-resort-13-development/", "keywords": ["government", "housing", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-11-20T16:49:40-08:00", "articleType": "article", "articleContent": "\nSan Diego County supervisors approved a project Wednesday that could build nearly 1,900 “zero-net-energy” solar-powered homes, condos, commercial space, parks, trails, open space, a school site, a fire/sheriff’s station and a hotel in South County between the City of Chula Vista and Jamul.\nThe County of San Diego’s Board of Supervisors voted 4-1 Wednesday to approve the Otay Ranch Resort Village 13 project. The project has long been anticipated under the Otay Ranch Plan the Board adopted in 1993, was included in the County’s 2011 general plan and fits within the County’s 1997 South County Multiple Species Conservation Plan.\nSupervisors Greg Cox, Dianne Jacob, Kristin Gaspar and Jim Desmond voted to approve the project. Supervisor Nathan Fletcher voted to oppose the project.\nThe project is located on 1,938 acres in the unincorporated county 2.5 miles east of State Route 125 and Interstate 805, just east of the City of Chula Vista and 12 miles southeast of Jamul.\nThe project plans to build 1,881 all-electric, solar-powered homes, 57 multi-family units, 20,000 square feet of commercial space in a village core, 25 acres of public and private parks, nine miles of community trails and pathways and 860 acres of open space.\nThe project’s homes would include solar panels with wiring for solar battery storage systems that could make them self-sustaining; no natural gas; electrical vehicle (EV) charging stations in half the homes and the other half EV ready, drought-tolerant landscaping and water-efficient irrigation systems.\nThe project would also include a 10-acre school site, a 6.1 acre homeowners association facility, a 2.5 acre joint use fire station and sheriff’s storefront and a 16 acre, 200-room resort hotel with outdoor plazas and retail space. County officials said the project expects to be built in phases over the next 8 to 10 years, depending upon market conditions.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201119.14.12.10"}