{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Hiking, Exploring, Learning, Fun; Lots of Free Stuff to do in July!", "description": "It’s the summer of coronavirus — but there are still some great, fun, free/or inexpensive things that kids, families and adults can do in July. And we’ve got a list!", "datePublished": "2020-07-09T11:58:49-07:00", "url": "https://www.countynewscenter.com/hiking-exploring-learning-fun-lots-of-free-stuff-to-do-in-july/", "keywords": ["families", "events", "library"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-07-10T09:06:39-07:00", "articleType": "article", "articleContent": "\nIt’s the summer of coronavirus — and to keep it from spreading we’re staying home more, foregoing big vacations and looking for new ways to entertain and educate kids who have been home for months.\nWell, here’s some good news. There are still some great, fun, free/or inexpensive things that kids, families and adults can do in July. And we’ve got a list!\nFor example, you can swap out those big vacations for some shorter, nearby, get-outside, socially distanced adventures at County parks and trails! Or join the County Library’s Summer learning challenge, check out great e-books — or call to check out actual books and material and pick them up at your library’s front door. Virtually tour cool museums, watch science experiments, or learn how to grow stuff, or make stuff.\nHere’s just some of the cool things you can still do in July:\nFrom the County Library\nTake the Library’s Summer Learning Challenge at www.sdcl.org/summer:  Register and track your reading progress; write book reviews for the community to enjoy; and complete learning challenges that will bring local art, culture, and recreation opportunities directly to you online. There are nine challenge tracks in English and six in Spanish, with something special for each age group.  Challenges include virtual hikes, poetry writing, online tours of local museums, and much more.\nPhysically pick up books, movies and CDs by appointment right at your library’s front door: Door-side pickup is now available by appointment at all 33 County library branches. Customers can check out available materials and set up a time to come pick them up. Call your branch library for more information. Visit the Library’s door-side service webpage for more information.\nGo digital: eBooks and audiobooks are available 24/7 with special collections curated for various ages, genres, and hot topics.\nStorytime Shorts: Watch and listen as your favorite library staff read books and sing songs. We’ve got dozens of them!\nBook Shorts: Love to read but not sure which book, novel, kids’ or young adult’s books to turn to next? Listen as our librarians give you short synopses of books and novels they recommend!\nLearn something new on Lynda.com: Use your County library card to tap into Lynda.com, which brings the best in online learning directly to you.\nTake a Virtual Program: The library offers video learning opportunities like science experiments, “Feeling Fit,” gardening, crafts and more.  Check weekly for new content.\nGet active with our Activity books: Check out our activity books with information for numerous subjects for all ages that you can download and print.\n From the County’s Parks and Recreation Department\nBecome a Track Trail-er at seven County Parks: Track trails lets kids and their families take self-guided tours on trails at seven County parks and earn rewards for “tracking” their progress in a brochure then reporting them online by smartphone, laptop or computer. Reach certain milestones and win nature-related prizes, including magnifying glasses, backpacks and bandanas.\nTrack Trails can be found at Felicita County Park, Guajome Regional Park, Lake Morena County Park, Lindo Lake County Park, San Dieguito County Park, San Elijo Lagoon Ecological Reserve, and  Stelzer County Park.\nHit the splash pads or fountains: You don’t have to go to the beach to enjoy the water. You can cool off at the splash pads at Hilton Head County Park in El Cajon and Sweetwater Summit Regional Park in Bonita. Or visit our fantastic fountains at the Waterfront Park in downtown San Diego!\nSee the birds and butterflies: You can meander through our bird and butterfly gardens at Lindo Lake County Park in Lakeside, San Dieguito County Park in Solana Beach and Tijuana River Valley.\nHike the Loop Trail at the Santa Ysabel Nature Center: While the nature center is closed, you can still hike the loop trail at the new, LEED-certified nature center!\n\nGo Fish: Cast your fishing pole from shore or by boat at Lake Morena County Park in Campo. You’ll be hooked! (Note: Check the webpage for fishing and boating fees.)\n \nBike: the 22.5-mile Bayshore Bikeway that travels on roads, trails and paths from the Waterfront Park in downtown San Diego to Coronado and back! Check out the video to see the ride.\nWander: among the trees and grassy meadows of Oakoasis County Park in Lakeside.\n\n \nPicnic and climb (if you’re hardy): to the top of Volcan Mountain in the Volcan Mountain Wilderness Preserve in Julian — a scenic and somewhat tough 5.5-mile roundtrip hike.\nDon’t Paws, just do it: Yeah! Take your favorite furry friend out for an adventure along the trail! Our friendly video will show you how to keep your pet safe when you’re on the trail.\nSD Nights Returns — Virtually! SD Nights (Safe Destination Nights) has been giving teens safe places to play and interact after school and during hours they may be unsupervised. Starting Friday July 17, SD Nights will give them a safe place on the Internet with a series of Facetime live and Zoom events. Check the website for details!\nSummer Movies in the Park — comes to your home! The County’s popular Summer Movies in the Park is turning into Summer Movies at Home, starting Saturday July 11 with the “Trolls World Tour” movie. You can stream the movie (available on Amazon Prime, On-Demand and Redbox) and download our interactive activity kit for Trolls-themed activities, including a DIY rubber band guitar, a musical scavenger hunt, and a rainbow popcorn recipe. To see the rest of the Summer Movies series, check out the Parks website, or its Facebook page.\nFrom our Live Well San Diego Partners\nCheck out the Live Well Virtual Events Calendar: There’s tons of events listed here.\nRun (or walk) the Live Well 5K — virtually — and/or take part in the Live Well 5K Fitness Challenge: Register to walk or run a 5K on Sunday, Aug. 16, submit your time to be added to the virtual race and pick up a free, limited edition Live Well 10th Anniversary cap. The 5k Fitness Challenge starts July 13 and finishes Aug. 16 with the virtual run/walk. Exercise can boost your immune system, so join in and maintain a good defense against the coronavirus with Live Well!\nSo, join in and take part! It’s July and there’s lots to do.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200709.11.58.49"}