{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Greenbrier Village Offers Affordable Housing in Oceanside", "description": "The County, City of Oceanside and other community partners celebrated the grand opening today of a new, centrally located affordable housing development in Oceanside. Greenbrier Village is a supportive housing community for people experiencing homelessness or on the brink of becoming homeless.", "datePublished": "2024-09-04T15:58:28-07:00", "url": "https://www.countynewscenter.com/greenbrier-village-offers-affordable-housing-in-oceanside/", "keywords": ["health", "ada units", "affordable housing", "foster youth", "no place like home funding", "oceanside", "permanent supportive housing", "veterans"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-09-04T16:04:13-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County, City of Oceanside and other community partners celebrated the grand opening today of a new, centrally located affordable housing development in Oceanside.\nGreenbrier Village is a supportive housing community for people experiencing homelessness or on the brink of becoming homeless. Developed by National CORE, the property has 60 studio and one-bedroom apartments, with five units reserved for veterans and three apartments for young adults aging out of the foster system.\nGreenbrier also features nine apartments that are designed for adults living with physical disabilities. They have lower kitchen counters, lower upper cabinets, and open lower cabinets for easy accessibility. Six apartments are designed for people with hearing and visual impairments.\nThe property offers residents a large common room, outdoor recreational space and landscaped community garden, barbecue areas, laundry facilities and private offices for personal meetings. The property is also within walking distance of groceries, stores, restaurants and the Sprinter rail line.\nGreenbrier provides on-site access to comprehensive case management including physical, mental and behavioral health services. Financial coaching is available along with academic support, employment development and veteran support services.\nFor more information about Greenbrier Village, visit National CORE.\nThe County invested nearly $6 million in No Place Like Home funds in this development.\nSince 2017, the County has invested $310 million into affordable housing, using excess land, its Innovative Housing Trust Fund and other state, federal and local funding sources administered by the County.\nThose funds have helped open 2,200 units with 3,300 more on the way.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240904.15.58.28"}