{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisors Fletcher, Vargas Open County’s New Demonstration Garden", "description": "Hoping to help sow the seeds of sustainable, nutritional living, County Board of Supervisors Chair Nathan Fletcher, Vice Chair Nora Vargas, master gardeners and County staff opened a new demonstration garden at the County Operations Center Wednesday.", "datePublished": "2021-10-27T15:58:55-07:00", "url": "https://www.countynewscenter.com/supervisors-fletcher-vargas-open-countys-new-demonstration-garden/", "keywords": ["environment", "community garden", "demonstration garden", "gardening", "health", "health equity", "live well food system initiative", "lueg"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-10-27T15:58:55-07:00", "articleType": "article", "articleContent": "\nHoping to help sow the seeds of sustainable, nutritional living, County Board of Supervisors Chair Nathan Fletcher, Vice Chair Nora Vargas, master gardeners and County staff opened a new demonstration garden at the County Operations Center Wednesday.\nFletcher and Vargas marked the event by planting the first plants — Italian parsley and chrysanthemums — in the garden that was developed by the master gardeners and the County’s Live Well San Diego Food System Initiative.\nThe 400-square-foot demonstration garden was designed to be a working example of the Food System Initiative’s goals, to showcase “a little bit of everything” to promote home, urban and community gardening, and its connection to sustainability.\nIn addition to growing seasonal fruits and vegetables, herbs, citrus, a wide variety of popular plants, and even native Californian plants, the County plans to use the garden as an educational space. There will be classes and workshops to learn about gardening, composting and other topics connected to sustainability and nutrition.\nFletcher and Vargas said home and neighborhood gardens provide a multitude of benefits, from improving the food system and addressing food insecurity, to cultivating better nutrition, creating a sense of community and promoting healthy living.\n“We can empower communities through food,” Fletcher said, “and bring them together with accessible community gardens. When we can gather together to grow our own food, it is not only a rewarding activity but also has tremendous economic and environmental benefits. I see gardens as an opportunity to build a stronger safety net for all San Diegans and create a more inclusive and resilient food and farm economy.”\nVargas said gardens can create a sense of community and promote social engagement among families and neighbors, in addition to giving people the opportunity to get outside, live active lifestyles and connect with nature.\n“The power of community gardens, the way they help build our communities’ resilience and improve not only physical and mental health outcomes, especially in food insecure communities, it really is powerful,” Vargas said. “It is my hope that this demonstration garden … will inspire others to plant their own gardens in their neighborhoods.”\nThe garden features four raised planting beds, including one that is accessible to people in wheelchairs, a demonstration rain barrel and compost-worm bin, and will eventually be watered by a drip irrigation system. It will also include a container garden, a flowering “pollinator” bed to attract bees, butterflies and ladybugs, and will use the County Operations Center’s existing composting system to recharge the garden’s soil.\nThere will be signs in multiple languages with information about gardening and nutrition, resources to healthy food, and even a Little Free Library outside the garden’s gate.\nYou can learn more about the garden and its future events at the Demonstration Garden’s webpage. For more information about the Food System Initiative go to the Live Well San Diego Food System Initiative webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211027.15.58.55"}