{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Meet the County’s New Chief Sustainability Officer", "description": "The San Diego County Office of Sustainability and Environmental Justice has a new chief at the helm. In addition to her unbridled passion for service and helping others, Eden Brukman brings more than two decades of sustainability leadership experience to the role.", "datePublished": "2023-10-10T10:39:52-07:00", "url": "https://www.countynewscenter.com/meet-the-countys-new-chief-sustainability-officer/", "keywords": ["environment", "environment", "environmental justice", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-10-10T11:26:50-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Office of Sustainability and Environmental Justice (OSEJ) has a new chief at the helm. In addition to her unbridled passion for service and helping others, Eden Brukman brings more than two decades of sustainability leadership experience to the role.\nBrukman boasts a diverse portfolio of environmentally minded building and infrastructure projects along with many years of experience in climate justice policies.\nShe is also on a mission to make the world a better place and is inspired by the theme of “tikkun olam,” a Hebrew phrase meaning “repair the world” — something that has been at the center of her identity from a young age.\n“This is not just about the environmental issues that we must address, but also is fundamentally about human relationships and connections – ways of seeing each other and supporting one another,” Brukman said.\nBefore joining the County team, she worked for the San Francisco Environment Department and chaired the Municipal Green Building Task Force while aiding in the development of the San Francisco 2021 Climate Action Plan.\nBefore that role, she held various positions as a developer and director of global standards, licensed architect, and sustainability coordinator in Portland, Oregon, the UK, Los Angeles, and the Bay Area.\n“I’m inspired by common themes across children’s books that teach youth that they should feel empowered to dream big and create their own realities when the existing paradigm doesn’t match their vision,” Brukman said.\nBrukman came to the County in March of this year and now oversees a team of 12 people. She says a major part of her job is to strive to reduce environmental and health disparities and expand opportunities in traditionally underserved areas by elevating community strengths.\n“To me, it is about finding new ways to understand barriers and identifying that seed that creates something new and allows for scalable solutions,” Brukman said.\nOSEJ focuses on both regional initiatives and County operations. The office seeks to achieve its goals by establishing meaningful connections, listening and elevating community needs, including those of our area Tribal nations, to achieve zero carbon emissions.\n“We are creating a roadmap for stronger tribal partnerships, to ensure a mindful approach to fostering cross-governmental relationships and a mutual awareness on matters and opportunities for the health and well-being, quality of life, and sustainability of tribes throughout the County,” Brukman said.\nBrukman said she was drawn to this role because of the County’s continued commitment to environmental justice through community engagement and its sustainability programs, including the Regional Decarbonization Framework and Climate Action Plan. The move also provided the opportunity to come back to the county in which she was raised.\n“It is an honor and privilege to connect with San Diegans and our partners throughout the region to build the Office of Sustainability and Environmental Justice,” said Brukman. “I look forward to our continued collaboration to cocreate and advance initiatives that help foster a region where all people can live in and enjoy a clean and healthy environment.”\nBrukman is a graduate of UC Berkeley where she received a B.A. in Architecture and a minor in Visual Studies. She also received a Master of Design at the Edinburgh College of Art.\nShe also received many awards, including the Women in Sustainability Leadership Award, the Buckminster Fuller Challenge and the Portland Business Journal 40 Under 40 Award. She is a U.S. Green Building Council LEED Fellow, Living Future Hero, and a children’s book author and illustrator.\nAs leader of the County’s Office of Sustainability and Environmental Justice, Brukman will bolster the County’s dedication to achieving a more sustainable, healthy, and just environment for area residents.\nIf you would like to learn more or share an idea about the County’s Regional Decarbonization Framework, click here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231010.10.39.52"}