{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Take on Alzheimer’s in San Diego County ", "description": "Community members are invited to join the County and the California Department of Public Health (CDPH) to the upcoming Take on Alzheimer’s free informational event.", "datePublished": "2024-06-11T14:12:54-07:00", "url": "https://www.countynewscenter.com/take-on-alzheimers-in-san-diego-county/", "keywords": ["health", "alzheimer s", "local resources event for alzheimers", "take on alzheimer s"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-06-11T14:31:15-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCommunity members are invited to join the County and the California Department of Public Health (CDPH) at the upcoming Take on Alzheimer’s free informational event.\nJune is Alzheimer’s and Brain Awareness Month which recognizes the millions of people living with Alzheimer’s and encourages everyone to learn about ways to promote brain health.  Alzheimer’s is the most common type of dementia, and affects memory, thinking and behavior. \nThe County and CDPH are bringing together clinicians and public health experts to talk about the impacts of Alzheimer’s in San Diego County, local strategies to address disparities, ways to catch the disease early and highlight available resources.  \nThe Take on Alzheimer’s event is on Thursday, June 20 from 10 to 11 a.m. at the Fourth District Seniors Resource Center, 570 S. 65th Street (off Skyline Drive).  Doors will open at 9 a.m. for a complimentary breakfast and an opportunity to connect with local resources.  \nTake on Alzheimer’s is a campaign by CDPH to share brain health tips, learn the early signs of Alzheimer’s and how to get a diagnosis.  \nAlzheimer’s is the second leading cause of death in California according CDPH. In San Diego County, Alzheimer’s and related dementias affect an estimated 98,610 San Diegans age 55 and older as of data from 2020.  \nMore information about local resources is available from County Aging & Independence Services. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240611.14.12.54"}