{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Active Tuberculosis Reported at California State University San Marcos", "description": "Students and staff at California State University San Marcos may have been exposed to tuberculosis during this fall semester 2022 session, the San Diego County Health and Human Services Agency announced today.", "datePublished": "2022-11-23T14:49:08-08:00", "url": "https://www.countynewscenter.com/active-tb-reported-at-california-state-university-san-marcos/", "keywords": ["health", "csusm", "exposure", "san marcos", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-11-23T15:19:06-08:00", "articleType": "article", "articleContent": "\nStudents and staff at California State University San Marcos (CSUSM) may have been exposed to tuberculosis (TB) during this Fall Semester 2022 session, the San Diego County Health and Human Services Agency (HHSA) announced today.\nHHSA Public Health Services and CSUSM officials have worked in close collaboration to identify and notify those with a higher risk of exposure to tuberculosis and will be providing no-cost testing to individuals at increased risk for infection. The period of exposure was from August 30, 2022 to November 8, 2022. \nTuberculosis is an airborne disease that is transmitted from person to person through inhalation of the bacteria from the air, which are spread when someone sick with TB coughs, speaks, sings, or breathes. people with frequent and prolonged indoor exposure to a person who is sick with TB should get tested.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. Some who become infected with tuberculosis will become ill at some point in the future, sometimes even years later. Blood tests and skin tests are effective to determine whether someone has been infected. All those notified of a high risk of exposure are encouraged to receive no-cost testing.”\nEffective treatments are available to treat people who are sick from active TB. It is especially important for individuals with symptoms of active TB and those who are immune-compromised to see their medical provider to rule-out active tuberculosis, and to discuss treatment.\nPeople who test positive for TB but who don’t have symptoms of active TB should get a chest x-ray and talk to a medical provider, as they most likely have “latent TB infection” or LTBI. People with a latent TB infection are infected with the TB germs, but the infection is essentially dormant or sleeping. Taking medicines for latent TB infection, or LBTI, can prevent people from getting active TB in the future.\nIndividuals who would like more information on this potential exposure should contact:\n\nCal State San Marcos: email csumasone@csusm.edu\nCounty TB Control Program at (619) 692-8621\n\nThe number of annual TB cases in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 cases reported in 2020 and 201 cases 2021.\nAs of the end of October, a total of 150 cases have been reported this year. An estimated 175,000 people in San Diego County have latent TB infection and are at risk for developing active TB without preventive treatment.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221123.14.49.08"}