{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adds More Supportive Housing Units for Seniors", "description": "The County and its community partners today celebrated the grand opening of a new affordable housing complex for seniors, including those with chronic physical illnesses and mental health conditions.", "datePublished": "2021-09-24T12:56:02-07:00", "url": "https://www.countynewscenter.com/county-adds-more-supportive-housing-units-for-seniors/", "keywords": ["housing", "affordable housing", "supportive housing", "wakeland"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-24T12:56:02-07:00", "articleType": "article", "articleContent": "\nThe County and its community partners today celebrated the grand opening of a new affordable housing complex for seniors, including those with chronic physical illnesses and mental health conditions.\nTrinity Place, located in the community of Grantville and built at the direction of Wakeland Housing and Development Corporation, was designed specifically for formerly unhoused seniors with chronic health issues, so residents will have access to social and medical services that promote health, housing stability and their overall well-being.\nOf the 73 apartments, 18 are dedicated permanent supportive housing units serving seniors 55 and older experiencing homelessness and mental health conditions.\nThese residents will receive County-funded supportive services in addition to permanent housing. Wakeland received more than $2.7 million in loans through the County’s Mental Health Services Act Special Needs Housing Program.\nSome unique features for seniors include:\n\nAdaptable apartments with bathroom grab bars, large door handles and easy-to-open cabinets\nA dedicated curbside pick-up area next to the main lobby for service provider vans to transport tenants, as well as four van spaces and a separate pick-up area in the garage\nApartments with ADA features for residents with hearing and vision impairments\nAn exercise room to promote movement for able-bodied residents\n\nResidents at Trinity Place have access to services from four high-quality providers: \n\nPATH (People Assisting the Homeless)\nSt. Paul’s PACE (Program of All-Inclusive Care for the Elderly)\nCommunity Research Foundation – Senior IMPACT\nAlpha Project Home Finder\n\n“Permanent supportive housing has repeatedly shown it can reduce the frequent need for behavioral health crisis services and emergency room visits, as well as criminal justice involvement,” said Dr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency. “Tenants report an increased ability to focus on their recovery, reconnect with loved ones, and are able to pursue educational and employment goals. I’m pleased that Trinity Place adds 18 more units to provide this level of care.”\nWilliam is one of the residents at Trinity Place.\nTrinity Place funding partners include the California Tax Credit Allocation Committee, Wells Fargo, San Diego Housing Commission, Civic San Diego, CalHFA/County of San Diego, California Community Reinvestment Corporation, Federal Home Loan Bank of San Francisco Low Income Investment Fund.\nWakeland works with these providers at other affordable housing communities like Trinity Place.\n“Completing this property demonstrates Wakeland’s commitment to provide affordable homes that help people who are struggling during the current housing crisis,” said Ken Sauder, Wakeland’s president and CEO. “Trinity Place is unique in that it not only gives these seniors a safe place to live, but also offers wraparound services designed to help them live stable, independent lives.”\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210924.12.56.02"}