{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Invited to Mental Health Walk and Interactive Expo This Saturday", "description": "Walking, creating art or even doing Tai-Chi can help improve your mental health and you can do it all at one place this Saturday, April 29 at the 19th annual San Diego NAMIWalks and Mental Wellness Expo.  ", "datePublished": "2023-04-27T16:26:15-07:00", "url": "https://www.countynewscenter.com/community-invited-to-mental-health-walk-and-interactive-expo-this-saturday/", "keywords": ["health", "mental health", "nami walk"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-04-28T11:56:24-07:00", "articleType": "article", "articleContent": "\nWalking, creating art or even doing Tai-Chi can help improve your mental health and you can do it all at one place this Saturday, April 29 at the 19th annual San Diego NAMIWalks and Mental Wellness Expo.  \nThe event, which is organized by the National Alliance on Mental Illness in partnership with the County’s Health and Human Services Agency, kicks off Mental Health Matters Month which is commemorated every May.  \nCommunity members are invited to join local organizations in raising awareness about mental health and addressing the stigma surrounding mental health topics.  \nThe day kicks off with a free community walk around Preble Field in NTC Park at Liberty Station at 8:15 a.m. following opening remarks. \nFamilies can also visit the Mental Wellness Expo between 7 a.m. and 11 a.m. The expo will feature more than 70 exhibitor booths offering community resources for families, children, military members and veterans, and hands-on activities that can help improve mental health.  \nBooths hosted by the County include activities like gardening for mindfulness, gratitude journaling, a stigma busting photo booth, check your mood screenings, a make-your-own button station and even Tai-Chi demonstrations.  \nTo learn about San Diego NAMIWalks and Mental Wellness Expo, check out the event website.  \nIf you or someone you know is experiencing a mental health challenge, you can reach support by calling the County’s Access and Crisis Line at 9-8-8. More resources are also available on the It’s Up to Us SD website as well as a list of other community events surrounding Mental Health Matters Months.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230427.16.26.15"}