{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "70% of San Diegans Vaccinated, COVID Continues Spread in Unvaccinated", "description": "San Diego is continuing to make progress on COVID-19 vaccinations, the County Health and Human Services Agency reported Wednesday.", "datePublished": "2021-07-28T17:05:48-07:00", "url": "https://www.countynewscenter.com/70-of-san-diegans-vaccinated-covid-continues-spread-in-unvaccinated/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-07-28T17:08:33-07:00", "articleType": "article", "articleContent": "\nSan Diego is continuing to make progress on COVID-19 vaccinations, with 70% of residents 12 and older now fully vaccinated, the County Health and Human Services Agency reported Wednesday. More than 81% of County residents have received at least one shot.\n“This is turning into the pandemic of the unvaccinated, so I want to thank San Diegans for responding to our call to get vaccinated,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The more contagious Delta variant is on the rise and being fully vaccinated affords the best protections against the disease.”\nWhile the vaccination percentage is on the rise, new COVID-19 infections continue to increase as well, mostly in unvaccinated San Diegans. In the last 30 days – June 28 to July 27 – 11,391 people tested positive for COVID-19. Of those, close to 90%, or 10,234, were not vaccinated and 10%, or 1,157 people, were vaccinated.\nNew Masking Recommendation\nThe County of San Diego will follow the latest guidance from the Centers for Disease Control and Prevention in recommending the universal wearing of masks by both vaccinated and unvaccinated people in indoor public settings.\nIndoor masking of unvaccinated people has been required since the end of the state’s Blueprint for a Safer Economy, and they have been required for everyone in certain settings including health care locations. The recommendation to wear a facial covering indoors, regardless of vaccination status, comes in light of new data that shows that the Delta variant is much more transmissible than previous strains of COVID-19. The new variant is expected to primarily strike the unvaccinated and also lead to an increase in cases in vaccinated individuals.\nVaccination Progress:\n\nDoses administered: More than 4.24 million.\nReceived at least one shot: Over 2.27 million or 81.1% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Over 1.96 million or 70%.\nThe goal: vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 108.1% of the goal population has received at least one vaccine and 93.3% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nDeaths:\n\nEleven new deaths were reported since the last report on July 21. The region’s total is 3,798.\nTwo women and nine men died between December 24, 2020 and July 22, 2021.\nFour of the deceased were in their 80s, two in their 70s, two in their 60s, two in their 50s and one was in their 40s.\nTen of the deceased had underlying medical conditions and one person did not have any underlying conditions.\n\nCases, Case Rate and Testing:\n\n765 COVID-19 cases were reported to the County on July 27. The region’s total is now 294,176.\nSan Diego County’s case rate is 13.4 cases per 100,000 residents as of July 27.\n10,090 tests were reported to the County on July 27, and the percentage of new positive cases was 7.6%.\nThe 14-day rolling percentage of positive cases among tests is 7.1%.\n\nCommunity Setting Outbreaks:\n\n30 new community outbreaks were confirmed in the past seven days (July 21 through July 27): eight in restaurant/bar settings, six in business settings, three in TK-12 school settings, two in a hotel/resort/spa setting, two in retail settings, one in a daycare/preschool/childcare setting, one in a distribution warehouse setting, one in an emergency services setting, one in a faith-based setting, one in a fitness/gym setting, one in a government setting, one in a grocery setting, one in a health care setting and one in a restaurant setting.\n\n\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m. on Wednesdays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210728.17.05.48"}