{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Don’t Rely on Luck, Survive and Recover in a Disaster", "description": "Giving yourself and your family the best chance in a local disaster isn’t just about luck, it’s about planning and preparing for various hazards to lower injuries, deaths and perhaps even damages.", "datePublished": "2025-03-12T10:06:10-07:00", "url": "https://www.countynewscenter.com/dont-rely-on-luck-survive-and-recover-in-a-disaster/", "keywords": ["public safety", "disaster kit", "disaster preparedness", "emergency", "oes"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-03-12T10:06:10-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesGiving yourself and your family the best chance in a local disaster isn’t  just about luck, it’s about planning and preparing for various hazards to lower injuries, deaths and perhaps even damages.\nStep one: Know Your Hazards risk in your neighborhood and workplace area with this easy- -to-use planning tool. Just type your address(s) in to find out if your home or workplace are in a floodplain, in a high wildfire hazard or a tsunami zone. If you are, preparedness tips will be shown to help residents minimize damage and protect household members.\nStep two: Complete and practice your Personal Disaster Plan, which you can do with this template, available in 12 languages and for people who may need assistance. The plan is a place to note important phone numbers for emergency agencies, emergency contacts, medical conditions, medications, allergies, and blood type. You will also develop an escape plan out of each room in the dwelling, two ways out of the neighborhood and identify meeting places in case household members are not together. The template includes hazard-specific tips such as what to do if evacuating during a wildfire, what to do before, during and after an earthquake and what to do during flooding.\nStep three: Assemble and maintain an Emergency Supply Kit that can be used in the event of an evacuation, or if sheltering in place. In addition to basic supplies like a first aid kit, a radio and extra batteries and a flashlight, all kits should be customized to your household’s needs. Make sure you have enough water and food for all the members. If you have someone in the family with dietary restrictions like an infant, senior or someone with allergies, make sure you have included food for them. If you have a pet, make sure they have food, and the same goes for medications for people and pets. A more comprehensive list is included in the Disaster Plan template and it doesn’t have to be expensive to gather the supplies. The kit should be ready to grab and go in case you have 15 minutes or less to evacuate.\nTo learn more about disaster preparedness, visit AlertSanDiego.org and click on green preparedness button. Staying informed is important in an emergency situation, you can also register for AlertSanDiego emergency alerts that will be sent to your mobile phone, internet phone and email — but only if you register. Download the AlertSanDiego app for emergency messaging in the County that may include urgent action for affected residents to take, or just inform you about a situation in an adjacent community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250312.10.06.10"}