{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Year Will Bring Expanded Medi-Cal Coverage to People Ages 26-49", "description": "Starting Jan. 1, more San Diegans will be eligible for full Medi-Cal coverage. A new state law gives full Medi-Cal coverage to adults ages 26-49, regardless of immigration status. ", "datePublished": "2023-12-08T09:31:59-08:00", "url": "https://www.countynewscenter.com/new-year-will-bring-expanded-medi-cal-coverage-to-people-ages-26-49/", "keywords": ["health", "expanded health care coverage", "medi-cal", "rick wanne"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-12-08T10:30:51-08:00", "articleType": "article", "articleContent": "\nStarting Jan. 1, more San Diegans will be eligible for full Medi-Cal coverage. A new state law gives full Medi-Cal coverage to adults ages 26-49, regardless of immigration status. \n“Expanding Medi-Cal to cover younger adults is desperately needed in such difficult financial times. Providing a safety net to our most vulnerable neighbors is incredibly important and builds the opportunity for San Diegans to thrive,” said Rick Wanne, Director of Self Sufficiency Services in the County of San Diego Health and Human Services Agency. \nAll Californians under age 26 and over age 50 are already eligible for full Medi-Cal benefits. Some of those who have previously been denied full Medi-Cal are now expected to be eligible. \nAll other Medi-Cal eligibility rules, including household income limits, still apply. \nFull-scope Medi-Cal covers vital services that help families stay healthy. It includes:    \n\nDoctor visits.  \nPrescribed medications.  \nVaccines. \nMental health care.\nSubstance use care.\nVision care/eyeglasses.\nDental care.\nEmergency services.\nReferrals to specialists and more. \n\nEveryone is welcome to apply. Applying for or using Medi-Cal will not affect your immigration status. \nLearn more about Medi-Cal and apply for benefits at Benefitscal.com or at SanDiegoCounty.gov/Medi-Cal.\nPeople with restricted Medi-Cal, which only covers emergency services, may also get full-scope services. Those with restricted Medi-Cal automatically will get a letter in the mail on their eligibility for full-scope Medi-Cal. They do not need to fill out a new application and will be automatically enrolled if eligible. \nThose applying are urged to watch out for scams. Medi-Cal will never require payment to submit a renewal or application. Anyone who gets a call asking for payment to apply or renew is asked to report it by calling the Medi-Cal fraud hotline at 1-800-822-6222.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231208.09.31.59"}