{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Urges Pregnant People to Get Tested, Treated to Protect Unborn from Congenital Syphilis", "description": "Federal, state, and county health officials are urging pregnant people to get blood tests and treatment if needed to keep them from infecting their unborn child with a dangerous, sometimes deadly, and almost completely preventable disease—syphilis.", "datePublished": "2023-03-23T08:44:27-07:00", "url": "https://www.countynewscenter.com/county-urges-pregnant-people-to-get-tested-treated-to-protect-unborn-from-congenital-syphilis/", "keywords": ["health", "child safety", "public health", "stds"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-03-23T08:44:27-07:00", "articleType": "article", "articleContent": "\nFederal, state, and county health officials are urging pregnant people to get blood tests and treatment if needed to keep them from infecting their unborn child with a dangerous, sometimes deadly, and almost completely preventable disease—syphilis.\n“You may not even know that you are infected with syphilis and unknowingly pass it on to your unborn child,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “This disease can kill your child or lead to a lifetime of serious health problems. But congenital syphilis is also almost completely preventable.”\nCounty STD Controller and Public Health Medical Officer, Winston Tilghman, M.D. said “All pregnant people should get a blood test for syphilis, and be treated with penicillin injections if needed, in their first prenatal care visit and again during the third trimester. Testing at delivery is also recommended if they’re at risk for getting infected or were not screened earlier in pregnancy.”\nCongenital syphilis is syphilis passed from parent to child during pregnancy. It can cause miscarriage, stillbirth, premature birth, low birth weight and death shortly after birth.  Infected children who survive birth can suffer among other illnesses, deformed bones, severe anemia, enlarged livers or spleens, and brain and nerve problems like blindness or deafness.\nFederal, State, and Local Statistics\nCongenital syphilis cases have jumped dramatically in recent years. Nationally, congenital syphilis rates have increased every year since 2013 and there were 2,148 cases and 149 deaths in 2020 alone. From 2016 to 2020, the most recent year of available data, California cases increased 126%, from 214 cases to 483 cases. Over that same period 146 babies died statewide.\nCongenital syphilis cases in San Diego County have gradually increased in recent years. There were 15 cases in 2018, 21 in 2019, 14 in 2020 and 30 in in 2021. However, any congenital syphilis case is tragic because it can be completely avoided with timely testing and treatment before or during pregnancy. From 2013 to 2021, there were 10 syphilitic stillbirths reported in San Diego County.\nWhat Is Syphilis? \nSyphilis is a bacterial disease that is mainly transmitted from person to person through sexual contact. But syphilis can also be transmitted from infected pregnant persons to unborn children during pregnancy, or to infants during activities like breast-feeding. The Centers for Disease Control and Prevention (CDC) state syphilis in early stages can cause ulcer-like sores called chancres that can occur in, on, or around the penis, vagina, anus, rectum, lips or mouth. These sores are often painless and may go unnoticed. In mid stages it can cause rashes, and possibly other symptoms that mimic other common diseases. Those can include, among other symptoms, fever, swollen lymph nodes, sore throat, headaches, fatigue and muscle aches.\nHowever, syphilis can be also dormant in infected people for years. While people who have had syphilis for over a year are not able to pass on the infection to others through sexual contact, syphilis can be transmitted from a pregnant person to a fetus during at any stage of the infection. The risk is particularly high for people who get syphilis while they are pregnant.\nThe only sure way for pregnant people to tell if they are infected with syphilis is to get a blood test.\nGet Tested \nPublic health officials and the American Academy of Pediatrics strongly recommend that anyone who is pregnant or considering becoming pregnant should be tested for syphilis. State and national guidelines recommend people be tested at least twice during pregnancy—at their very first prenatal visit and early in their third trimester, ideally between 28 and 32 weeks. More testing may be recommended at the time of delivery.\nGet Treated\nAgain, syphilis can be treated and cured with antibiotics—even during pregnancy. Pregnant people who test positive should receive penicillin injections. And their sexual partners should also be tested and treated to prevent being re-infected.\nThe County Health and Human Services Agency’s HIV, Sexually Transmitted Disease (STD) and hepatitis branch are working with California Chapter 3 of the American Academy of Pediatrics to increase awareness of congenital syphilis and how to prevent it with funding from the state department of public health.\nMore information about syphilis and congenital syphilis can be found at the CDC’s website. For more information about the community education campaign and resources about congenital syphilis, go to the American Academy of Pediatrics website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230323.08.44.27"}