{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrate Howl-O-Ween with a Deal on Your New Dog Companion", "description": "It’s no trick! Take advantage of an October treat during National Dog Adoption Month.  The San Diego County Department of Animal Services is waiving dog adoption fees throughout October to help find loving homes for dogs who have been in the shelter for more than 14 days.", "datePublished": "2023-10-06T17:09:00-07:00", "url": "https://www.countynewscenter.com/celebrate-howl-o-ween-with-a-deal-on-your-new-dog-companion/", "keywords": ["animals", "das", "dog", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-10-06T17:09:00-07:00", "articleType": "article", "articleContent": "\nIt’s no trick! Take advantage of an October treat during National Dog Adoption Month.  The San Diego County Department of Animal Services is waiving dog adoption fees throughout October to help find loving homes for dogs who have been in the shelter for more than 14 days.\nShelters in the County are nearly full of animals, especially dogs who have been waiting for their new families for a long time.\nAll animals adopted from County shelters will be spayed or neutered, have vaccinations, a microchip and a one-year license for dogs in the service area.\nPlease visit County Animal Services’ Adoptions page and browse the beautiful and lovable animals from cats to dogs to turtles and guinea pigs available now. Animal Services staff recommend that people pick out a second and third choice too, just in case someone else selected your first choice.\n  Walk-in hours are from 1 to 4 p.m. Tuesday through Friday and from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad. Fill out an application online to print or pick one up at the shelter.\nThe County Department of Animal Services’ top priority is providing excellent care in its shelters while finding good homes for every healthy and treatable animal. The goal is to find the right fit for animals and their permanent adopter to form a lasting and loving bond, but animal fostering is another opportunity for animals to learn how to be in a home and socialize with people and other animals.\nThe Department of Animal Services protects the health, safety and welfare of people and animals. Animal Services envisions a safe, thriving community where all people and animals in San Diego County have access to essential animal care and support services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231006.17.09.00"}