{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "First San Diego County Resident Dies from COVID-19", "description": "The County announced the first death of a San Diego County resident from COVID-19 during a news conference Sunday.", "datePublished": "2020-03-22T19:08:58-07:00", "url": "https://www.countynewscenter.com/first-san-diego-county-resident-dies-from-covid-19/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-03-22T19:08:58-07:00", "articleType": "article", "articleContent": "\nThe County announced the first death of a San Diego County resident from COVID-19 during a news conference Sunday.\nA man in his early 70s died in Santa Clara County after traveling to Hawaii. More information was not released for confidentiality reasons.\nCounty Public Health Officer Dr. Wilma Wooten, M.D., M.P.H., reminded the public that for the sake of public safety, they should adhere to the governor’s executive order to stay at home. Many residents are following the order, but others are gathering at beaches and other locations, and ignoring recommendations about social distancing.\n“Please, I implore you, to not gather with any non-household groups. Please adhere to the six-foot social distancing rule when you are in areas with non-household members,” said Wooten. “Per the governor’s order, not following the order is a misdemeanor subject to a $1,000 fine.”\nIf residents have concerns about gathering, they’re asked to use their judgment and if need be, call the non-emergency number in their community to contact local enforcement.\nMeanwhile, the region received good news in regard to beds and medical supplies for COVID-19. Late yesterday, the state announced San Diego County has been selected for a mobile field hospital which could provide up to 250 additional beds in the region.\nTomorrow the federal government is expected to deliver through the state face shields and gowns to help local medical staff. The County’s Medical Operations Center will begin filling requests from local medical facilities for protective wear immediately after the supplies arrive.\nCounty residents are reminded that most people do not need to wear a mask if they don’t have any symptoms of the disease.\n“If you’re not symptomatic, don’t wear a mask,” said Medical Operations Center Director Rob Sills. “When someone does not have symptoms and they wear a mask, it takes a mask away from providers who are providing care to our patients.”\nA call also went out to health care professionals who are no longer working and have time to give. They are asked to volunteer to help with the COVID-19 response by visiting healthcarevolunteers.ca.gov.\nMeantime, the governor’s stay-at-home directive allows for essential services to continue operating. They include restaurant carry-out and quick service food operations, workers supporting childcare establishments, and construction workers as well as commercial retail stores that supply essential sectors such as convenience stores, pet supply stores, auto supply and repair, hardware and home improvement.  See the full list of essential critical infrastructure workers.\nCounty Public Health Orders Remain in Place\nPeople — even those in essential services — should continue to follow the public health orders:\n\nPeople are encouraged not to gather in groups of any size unless it’s necessary.\nDay care must be limited to groups of up to 10 children in the same room and must remain in the same group each day with the same staff person.\nPeople 65 years of age and older, or anyone who has a chronic underlying condition or who is immunocompromised, should stay home.\nHospitals must conserve resources and delay non-emergency surgeries and elective procedures.\n\nBusiness ordered closed include:\n\nBars and adult-entertainment establishments that serve alcohol and not food\nRestaurants must close dining-areas, but may serve food for take-out, drive-through, or delivery\nSchools\nGyms and fitness centers\nHair and nail salons\n\nSocial Distancing to Flatten the Curve\nPublic health officials are urging people to “flatten the curve” of the novel coronavirus by staying home and keeping at least six feet away from other people unless they’re family. That would keep the virus from racing through populations, making everyone sick in a huge spike that could overwhelm hospitals and healthcare systems.\nFlattening the curve. Mitigation efforts can help reduce the number of daily cases and the pressure on the healthcare system.\nPeople can practice social distancing by staying at home — parents working remotely and students taking classes online. Businesses should also practice social distancing by keeping employees and customers at least six feet apart, if in an essential job, as well as working remotely, if possible.\nPeople can go out to get food or other essentials, assist a family member or friend, get medical attention, pick up medications, or go to work in jobs designated essential.\nLocal COVID-19 Cases\nThrough 5 p.m. Sunday, the County total number of confirmed COVID-19 cases increased to 205 — up by 46 from Saturday — with one death of a San Diego County resident who was hospitalized in Santa Clara County.\nOf the 205 cases 178 were San Diego County residents and 11 were non-residents. Cases under federal quarantine remained the same at 11.\nOf the 205 cases, three are between 10 and 19 years old, 131 were people between the ages of 20 and 49; 27 were between 50 and 59; and 44 were 60 or older. The County’s webpage tracking COVID-19 cases in San Diego now includes the number of cases by city and unincorporated communities.\nWhat Everyone Can Do to Minimize Chances of Getting COVID-19\nPeople can help limit the spread of infection, by taking these steps:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfectfrequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nGet COVID-19 Info Via Text\nCounty residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system. The system allows County health officials to send real-time information about COVID-19 in the region. To sign up to receive the messages, text COSD COVID19 to 468-311. The system was set up to let County public health officials issue information and instructions on changes related to COVID-19 in the region.\nIf you have individual questions, please talk to your health care provider. For community resources, please call 2-1-1 San Diego or visit 211sandiego.org or the County’s Coronavirus Disease webpage.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200322.19.08.58"}