{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Flu Deaths Up, Cases Down in San Diego County", "description": "The number of influenza deaths in the region increased to 39 after seven additional fatalities were reported last week, the County Health and Human Services Agency announced today.", "datePublished": "2020-01-29T12:05:03-08:00", "url": "https://www.countynewscenter.com/flu-deaths-up-cases-down-in-san-diego-county/", "keywords": ["health", "flu deaths", "flu shot", "influenza", "influenza daths"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-29T12:28:03-08:00", "articleType": "article", "articleContent": "\nThe number of influenza deaths in the region increased to 39 after seven additional fatalities were reported last week, the County Health and Human Services Agency announced today.\nThe number of lab-confirmed cases dropped last week after several weeks of continued increases. A total of 1,880 cases were reported in the region last week, 380 fewer than the previous week.\n“Influenza remains widespread in the region and people should continue taking the recommended precautions to avoid getting sick,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The best way to prevent the flu is getting vaccinated.”\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Jan. 25, 2020, the report shows the following:\n\nEmergency department visits for influenza-like illness: 8% of all visits (compared to 8% the previous week)\nTotal influenza deaths to date: 39 (compared to 24 at this time last season)\nTotal lab-confirmed cases to date: 11,778 (compared to 3,493 last season)\n\nWhen to Seek Medical Help\nPeople with influenza-like symptoms continue to crowd local emergency departments and are taxing some hospitals.\nCounty health officials are encouraging people who are sick to first contact their health care provider by telephone or arrange an urgent appointment.  You should go to an emergency department when you have any of the following symptoms:\n\nDifficulty breathing or shortness of breath\nChest pain or abdominal pain\nSudden dizziness\nConfusion\nSevere or persistent vomiting\nFlu-like symptoms that appear to get better, but then return with a fever and worse cough\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nFlu vaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nThe flu vaccine is available at doctors’ offices and retail pharmacies. If you don’t have medical insurance, you can go to a County public health center to get vaccinated. For a list of locations, visit www.sdiz.org or call 211 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200129.12.05.03"}