{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Announces Second Hepatitis A Death In Homeless Population", "description": "A second homeless person has died this year in San Diego County from hepatitis A. The 30 cases reported so far in 2023 are unchanged from last week, with 19 of them among people experiencing homelessness (PEH).  ", "datePublished": "2023-06-14T12:29:19-07:00", "url": "https://www.countynewscenter.com/county-announces-second-hepatitis-a-death-in-homeless-population/", "keywords": ["health", "hepatitis a", "san diego county", "vaccines"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-06-15T16:54:42-07:00", "articleType": "article", "articleContent": "\nA second homeless person has died this year in San Diego County from hepatitis A. The 30 cases reported so far in 2023 are unchanged from last week, with 19 of them among people experiencing homelessness (PEH).  \nThe first hepatitis A death this year in the homeless population occurred on January 16, 2023. The second was a 55-year-old unvaccinated man who died on June 5, 2023. He had additional serious underlying medical conditions, including a chronic substance use disorder.  \n“Cases remain primarily among the homeless population in central San Diego, and that is where the County is continuing to focus its work,” said Wilma Wooten, M.D., M.P.H., County public health officer. “This second death is a reminder to all of those working with and treating people with substance use issues to get vaccinated and to make sure that the patients they care for are also vaccinated. We need all of our partners to join us in this response.” \nThe increased cases seen this year are due to person-to-person spread. Of the 30 cases reported to date in the PEH population, 16 (53 percent) report illicit substance use.  \nWhile no single outbreak location has been identified, and no specific food or water source found, the County is actively taking and expanding steps to prevent further spread of the disease. \nSince early February 2023, foot teams, events and public health centers have vaccinated more than 3,835 people considered at risk. Of 4,328 at-risk people encountered by foot teams or at community events, the majority (65 percent) were already vaccinated. Homeless individuals are more vulnerable to getting sick from the virus because of its ability to spread in areas without convenient access to bathrooms and handwashing. \nOngoing County prevention efforts include more than 100 vaccination events this year and an expansion of outreach worker foot teams, with a focus on downtown San Diego encampments. The actions are in addition to a regular County-wide foot team distributing information and hygiene kits. \nThe hepatitis A vaccination schedule is generally a two-dose series. The first dose of the hepatitis A vaccine is considered to be around 95 percent effective. Because this protection will eventually begin to decrease, a second shot is recommended at six to 18 months later to provide immunity for between 20 and 40 years, according to the Centers for Disease Control and Prevention. \nIndividuals who work closely with people experiencing homelessness and illicit drug users, on a frequent and ongoing basis, such as those who work or volunteer at homeless services or substance use treatment agencies, should get the hepatitis A vaccine if they are not already vaccinated. \nCounty Public Health Services updates hepatitis A case and vaccination numbers online each Wednesday afternoon at sandiegocounty.gov/hepa. The website also contains links to resources and other information. In the United States, five states report person-to-person Hep A outbreaks and an outbreak related to organic strawberries with cases in three states. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230614.12.29.19"}