{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Applicants Needed for Alternatives to Incarceration Advisory Group", "description": "Community input is needed on the County’s Alternatives to Incarceration project. The County has launched a year-long study to improve the justice system, working with an independent contractor, the San Diego Association of Governments (SANDAG). SANDAG is taking applications for an Advisory Group to provide community and stakeholder input.", "datePublished": "2022-02-25T09:09:22-08:00", "url": "https://www.countynewscenter.com/applicants-needed-for-alternatives-to-incarceration-advisory-group/", "keywords": ["public safety", "alternatives to incarceration", "psg", "public safety", "sandag"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-02-25T09:09:22-08:00", "articleType": "article", "articleContent": "\nCommunity input is needed on the County’s Alternatives to Incarceration project. The County has launched a year-long study to improve the justice system, working with an independent contractor, the San Diego Association of Governments (SANDAG). SANDAG is taking applications for an Advisory Group to provide community and stakeholder input.\nThe Alternatives to Incarceration project will review the input and data to inform recommendations to safely reduce jail populations. The recommendations will also focus on better protecting residents by improving and expanding rehabilitative treatment and services while advancing equity. The project recognizes incarceration can disproportionately impact the poor, homeless, mentally ill, and people of color.\nThe Advisory Group will meet monthly for a year to conduct a review of jail and law enforcement data, research best practices for diverting individuals from custody who can be served in community-based settings rather than jails, and identify gaps in treatments, facilities, and programs.\nThose encouraged to apply include: community members who represent diverse perspectives and experiences, including incarcerated and formerly incarcerated individuals; local community-based-reentry, alternatives to incarceration, and recidivism experts (housing, substance use, reentry, mental and behavioral health, veteran services, domestic violence, etc.); and criminal justice reform advocates. Applications are due on Tuesday, March 15, 2022 at 5 p.m..\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220225.09.09.22"}