{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Health Recommends Testing for COVID After Rise in Cases", "description": "With summer travel beginning and people testing positive for COVID-19 at higher rates, County Public Health Services is advising people to test when they feel ill and get up to date on their vaccinations.", "datePublished": "2024-07-11T13:33:32-07:00", "url": "https://www.countynewscenter.com/county-public-health-recommends-testing-for-covid-after-rise-in-cases/", "keywords": ["health", "covid-19", "public health", "respiratory virus surveillance report"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-07-12T12:30:49-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesWith summer travel beginning and people testing positive for COVID-19 at higher rates, County Public Health Services is advising people to test when they feel ill and get up to date on their vaccinations.  \nIn the last month, the positivity rate for COVID-19 tests has increased to more than 14 percent. Because of the increase, the Respiratory Virus Surveillance Highlights Dashboard will be updated weekly (Thursdays) as it is typically during peak respiratory virus activity, usually October through May. \nWastewater surveillance, known to detect the amount of virus active in the community, has risen both throughout California and in San Diego. \nTo boost access to tests, the County has expanded the availability of no-cost testing at local public health centers during the below times. Appointments are highly encouraged, with walk-ins accepted based on availability.  \n\nCentral Region Public Health Center \n\n5101 Market St., San Diego \nCall: 619-932-8398\nMondays, Wednesdays and Fridays \n9 a.m. – 12 p.m.  \n12:30 p.m. – 2 p.m.  \n\n\n\n\nSouth Region Public Health Center  \n\n690 Oxford St., Chula Vista \nCall: 619-904-0839\nMonday through Friday \n9 a.m. – 12 p.m. \n12:30 p.m. – 2 p.m.  \n\n\n\n\nEast Region Public Health Center \n\n460 N. Magnolia Ave, Ste. A, El Cajon\nCall: 619-932-8398\nTuesdays and Thursdays  \n9 a.m. – 12 p.m. \n12:30 p.m. – 2 p.m. \n\n\n\n“We are recommending everyone take precautions so people can enjoy summer activities and stay healthy.” Interim Public Health Officer Dr. Ankita Kadakia said. “If you are experiencing COVID-19 symptoms or were recently exposed to someone who had COVID-19, test yourself and your family. Now is also a great time to get vaccinated if you haven’t done so already.” \nVaccines remain widely available and are especially encouraged for people with underlying conditions and adults 65 years of age and older. The updated vaccine, which was released in fall 2023, is an effective way to protect people from developing severe symptoms if they get sick from a new variant strain. A second dose of the 2023-2024 formulation is safe and recommended for people 65 years of age and older, and those with underlying conditions until the 2024-2025 COVID-19 becomes available. \nPregnant women are more likely to get very sick from COVID-19, compared to those who are not pregnant. COVID-19 vaccination during pregnancy is safe and effective. Getting vaccinated during pregnancy not only reduces the risk of complications from COVID infection that can affect the pregnancy and but also provides the newborn with some protection from COVID-19 until the are old enough to start receiving COVID vaccine. \nPeople can schedule a vaccine appointment by visiting MyTurn.ca.gov or contacting their local pharmacy or health care provider. The vaccines will continue to be free for most people through their health insurance plans, including Medi-Cal and regular health care providers.  \nCounty Public Health Centers continue to provide the vaccine to those who are uninsured and participate in outreach to vaccinate in the underserved communities. Availability at County vaccine events is updated on coronavirus-sd.com.  \nThe Centers for Disease Control and Prevention (CDC) recommends all people 6 months and older should receive the updated COVID-19 vaccine, as long as it’s been 2 months or more since their most recent dose.  The timing and number of doses for children depends on the previous COVID-19 vaccine received. Parents or caregivers should consult the child’s healthcare provider.  \nAlong with the vaccine, people can take a number of individual actions to protect themselves and limit the spread of COVID-19. These include:  \n\nStay home if you are sick.  \nSeek treatment from your doctor if you develop severe symptoms. Paxlovid is an effective treatment for patients at high risk for severe disease. \nConsider wearing a mask in public places, especially in crowded or poorly ventilated spaces.  \nWash your hands and practice good hygiene.  \nCover your cough or sneeze.  \n\nMore information is available at coronavirus-sd.com.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240711.13.33.32"}