{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reveals Top 10 Baby Names of 2022", "description": "One means “gift of God”—the other “peace.” Mateo and Olivia were the two most popular baby names for newborns in San Diego County in 2022, the County Health and Human Services Agency reported Wednesday.", "datePublished": "2023-10-04T11:37:23-07:00", "url": "https://www.countynewscenter.com/county-reveals-top-10-baby-names-of-2022/", "keywords": ["families", "baby names", "families", "top baby names"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-10-04T12:20:16-07:00", "articleType": "article", "articleContent": "\nOne means “gift of God”—the other “peace.”\nMateo and Olivia were the two most popular baby names for newborns in San Diego County in 2022, the County Health and Human Services Agency reported Wednesday.\nThey were closely followed in the annual Top 10 baby name list by Liam, Noah, Emma and Isabella.\nSan Diego County’s Health and Human Services Agency records all births in the region each year. Last year, 37,753 babies were born in the county, including 19,278 boys and 18,473 girls. The state Department of Public Health’s Center for Health Statistics and Informatics records the top names and passes the information on to counties.\nTwo hundred and thirty-four babies were named Mateo in San Diego County in 2022. Spanish for “gift of God,” it has been a popular name for years, and was the third most popular name for newborns in the county in 2021, 2020 and 2017.\nTwo hundred and eleven babies were named Olivia, a name that was popularized in the 17th Century by a character in William Shakespeare’s play, the “Twelfth Night.”\nIt has also been a popular name in recent years, ranking as the top name for girl babies in the county in 2020 and 2019.\nTo see the Top 10 baby names in San Diego County from 1996 through 2022, go here.\nHere is the Top 10 list of the most popular baby names in San Diego County for 2022:\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231004.11.37.23"}