{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Hantavirus Found in Mice at San Onofre State Campground", "description": "Two mice collected from a campground trail at San Onofre State Beach as part of ongoing surveillance to protect public health have tested positive for the potentially deadly hantavirus. County Vector Control team is working with campground officials to notify campground visitors and staff. ", "datePublished": "2024-09-16T12:07:49-07:00", "url": "https://www.countynewscenter.com/hantavirus-found-in-mice-at-san-onofre-state-campground/", "keywords": ["health", "hantavirus", "health", "lueg", "mouse", "vector control"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-09-16T12:16:18-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesTwo mice collected from a campground trail at San Onofre State Beach, as part of ongoing surveillance to protect public health, have tested positive for the potentially deadly hantavirus. County Vector Control team is working with campground officials to notify campground visitors and staff. \nFinding hantavirus in wild rodents is not uncommon in San Diego County, these are the 19th and 20th findings in mice in 2024. However, people rarely come into direct contact with infected animals because wild rodents naturally avoid humans. \nWhile exposure to hantavirus is rare, people should be careful around wild rodents as there is no cure or vaccine for hantavirus. \nSymptoms of hantavirus usually develop between 1-8 weeks after exposure and include: \n\nSevere muscle aches \n\n\nChills, fever or fatigue \n\n\nHeadache or dizziness \n\n\nNausea, vomiting or stomach pain \n\n\nDifficulty breathing \n\nIf you think that you may have been exposed to hantavirus, seek medical attention immediately. \nPreventing Infection \nPeople can be exposed to hantavirus when wild rodents invade their living area. Infected rodents shed the virus in their urine, feces and saliva. Once the matter dries, it can be stirred into the air where people could inhale the virus. \nIf people find wild rodents, nests or signs of them in their living spaces, they should always use “wet cleaning” methods — using bleach or other disinfectants, rubber gloves and bags. They should NOT sweep or vacuum, which could stir hantavirus into the air where it could be inhaled. \n Avoid Exposure to Hantavirus\n\nSeal up all external holes in homes, garages, and sheds larger than a dime to keep rodents from getting in. \n\n\nEliminate rodent infestations immediately. \n\n\nAvoid rodent-infested areas and do not stir up dust or materials that may be contaminated with rodent poop and urine. \n\n\nClean up rodent poop and urine using the “wet cleaning” methods described below. \n\n“Wet cleaning” Methods\n\nDo not sweep or vacuum infested areas. \n\n\nVentilate the affected area by opening doors and windows for at least 30 minutes before starting to clean. \n\n\nUse rubber gloves. Spray a 10 percent bleach solution or other disinfectants onto dead rodents, rodent poop, nests, contaminated traps and surrounding areas, then let the disinfectant stand for at least 15 minutes before cleaning. \n\n\nClean with a sponge or a mop that has been soaked in disinfectant. \n\n\nPlace disinfected rodents and debris into two plastic bags, seal them and discard them in the trash. \n\n\nWash gloves in a bleach solution, then soap and water, and dispose of them using the same double-bag method. \n\n\nThoroughly wash your hands with soap and water. \n\nFor more information, contact the County Environmental Health and Quality at (858) 694-2888 or visit the hantavirus web page. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240916.12.07.49"}