{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s Still Hot Out, but Winter’s Coming; Time to Get Discounted Rain Barrels", "description": "It’s still hot outside but fall officially arrived last week — and that means our winter rainy season is just around the corner. It also means this is the perfect time to get a discounted rain barrel for as little as $25, thanks to the County and the nonprofit Solana Center.", "datePublished": "2020-09-28T08:48:40-07:00", "url": "https://www.countynewscenter.com/its-still-hot-out-but-winters-coming-time-to-get-discounted-rain-barrels/", "keywords": ["environment", "beach water quality", "climate action plan", "rain barrels", "stormwater", "sustainability", "water pollution"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-09-28T09:10:22-07:00", "articleType": "article", "articleContent": "\nIt’s still hot outside but fall officially arrived last week — and that means our winter rainy season is just around the corner.\nIt also means this is the perfect time to get a discounted rain barrel for as little as $25 to catch every drop, cut your gardening water-costs and protect our beaches simultaneously.\nThanks to the County of San Diego’s Watershed Protection Program and the nonprofit Solana Center, you can order a top-of-the-line, discounted $90 Ivy rain barrel right online.\nAnd your total cost could be as low as $25 if you qualify for an additional Metropolitan Water District rebate and a separate County discount.\nHere’s how to do it. Just order an Ivy rain barrel online at the Solana Center’s website and choose to pick it up at one of two COVID-protected events: Saturday, Oct. 24 in El Cajon or Saturday, Nov. 7 in Valley Center.\nThe rain barrels will not be shipped. Order your rain barrel by Oct. 18 to pick it up from 2 p.m. to 5 p.m. Saturday, Oct. 24 at the Water Conservation Garden at 12122 Cuyamaca College Drive in El Cajon.\nOrder by Oct. 31 to pick your barrel up from 9 a.m. to noon Saturday, Nov. 7 at Bates Nut Farm at 15954 Woods Valley Road in Valley Center.\nTo protect everyone, customers must wear masks and remain in their cars. Workers at the events will also wear masks and load rain barrels into people’s trunks or back seats. There will be also be a staging area separated from the pickup spot for customers who need to adjust tie-downs or take other measures to secure rain barrels. A fuller explanation of the pickup process is located on the Solana Center’s webpage. \nIf you can’t make either pickup event, you can also pick up your barrel from noon to 5 p.m. on Thursdays and from 9 a.m. to 1 p.m. Saturdays at the Solana Center’s Encinitas offices at 137 N. El Camino Real.\nCounty residents can apply for a $35 rebate that can shrink their rain barrel’s cost from $90 to $55 if they get their water from the Metropolitan Water District of Southern California — either through the San Diego County Water Authority or its participating member agencies in San Diego County.\nIn addition, the County of San Diego is giving out its own $30 discount to residents who live in unincorporated areas — on the first 200 rain barrels ordered. Get that and your final cost shrinks to just $25!\nHaving a rain barrel can let you “harvest” rain right off your roof and use it to keep your gardens or lawns green the old-fashioned way. That can cut your water costs and even help protect our local beaches by preventing excess rain from washing pollution off our roofs and yards, and down our streets to the ocean.\nThe Ivy Rain Barrels have a locking, child-proof lid, are made of 100% recycled material, have overflow ports, protective screening to keep mosquitoes out, a ¾-inch ball valve to connect to your garden hose or to another barrel, and they don’t need pumps because they use gravity to dispense their collected rainwater.\nGetting your discounted rain barrel is as easy as one, two, three.\nOne, order your barrel. Two, apply for your rebate(s). Three, go pick up your barrel.\nOrder and buy your barrel\nGo to the County/Solana Center’s rain barrels website. Scroll halfway down the page and click on one of the two options to start your purchase:\n\n“Check address & Start Purchase” (to buy a $60 barrel if you live in the Unincorporated County)\n“Start Purchase” (to buy a $90 barrel if you’re a resident living in an incorporated city.)\n\nFrom there you’ll be asked to choose one of the three pickup locations. Do that and you can order and pay for your rain barrel with a credit card.\nYou may buy as many rain barrels as you’d like, but the Metropolitan rebate and County discount are limited to two per household.\nFinally, remember that your rain barrel will not be delivered. You can pick it up at any of the three pickup locations; remember to print out and bring your receipt.\nApply for your rebate(s)\n$35 rebates from the Metropolitan Water District are available within 90 days of ordering/buying your rain barrel, so as soon as you order your rain barrel go to Metropolitan’s SoCalWaterSmart rain barrel rebates webpage. Rebates are available on a first-come, first-served basis. You can check out the Metropolitan Water District rebates’ frequently asked questions for help.\nPick up your rain barrel!\nWhen you buy your barrel(s), Rainwater Solutions will email you a confirmation of your purchase. Remember to bring your confirmation email with you when you go to your chosen location to pick up your barrel. And remember to leave room in your car! Solana Center officials say that barrels fit easily in any four-door sedan or SUV and even into some two-door cars.\nFor more information, go to the Solana Center’s webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200928.08.48.40"}