{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Oral Treatment Available in San Diego in Coming Days", "description": "Medical providers in San Diego County will soon have a new option for treating COVID-19 patients after the Food and Drug Administration issued emergency use authorizations for two new oral antiviral medications.", "datePublished": "2021-12-23T13:31:51-08:00", "url": "https://www.countynewscenter.com/covid-19-oral-treatment-available-in-san-diego-in-coming-days/", "keywords": ["health", "coronavirus", "covid-19", "oral antiviral"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-12-23T13:31:51-08:00", "articleType": "article", "articleContent": "\nMedical providers in San Diego County will soon have a new option for treating COVID-19 patients after the Food and Drug Administration (FDA) issued emergency use authorizations for two new oral antiviral medications. However, supplies of these medications will initially be very limited and San Diegans should continue to mask up this holiday season to prevent infection.\nThe County expects its first shipment of Pfizer’s Paxlovid in the coming days. A second oral antiviral, Merck’s molnupiravir, is expected to start arriving in the region soon after.\nA prescription from a medical provider will be required for either drug. Both Paxlovid and molnupiravir are administered over the course of several days in pill form. Both will be available to patients with mild-to-moderate COVID-19 symptoms who are at risk of progressing to severe coronavirus disease, including hospitalization or death.\n“The FDA’s emergency use authorization of these new oral antivirals comes at a critical point in the pandemic as we see an increase in cases and a rapid spread of the Omicron variant,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “However, news of the arrival of these drugs does not mean we can let our guard down. We need to continue to mask up, especially in crowded indoor spaces, and I urge anyone who has not gotten vaccinated, or is overdue for their booster shot, to get vaccinated as soon as possible.”\nOnce the new oral antiviral treatments arrive in the region, they will initially be distributed through about two dozen area pharmacies. Pharmacy locations were pre-selected by the California Department of Public Health. The amount each pharmacy is receiving is based on community impact from the pandemic.\nThe state and County will expand distribution to more pharmacy locations as supplies increase.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211223.13.31.51"}