{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "The Real Huskies of Bonita Need Forever Homes", "description": "In this County, if you don’t know the canine breed with the most camera appeal, then stay and we’ll introduce you to some fetching aspiring housedogs who are all currently residing in Bonita, a hidden gem of an animal shelter.", "datePublished": "2022-01-14T13:49:30-08:00", "url": "https://www.countynewscenter.com/the-real-huskies-of-bonita-need-forever-homes/", "keywords": ["animals", "adopt pets", "das", "husky", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-01-14T13:53:10-08:00", "articleType": "article", "articleContent": "\nIn this County, if you don’t know the canine breed with the most camera appeal, then stay and we’ll introduce you to some fetching aspiring housedogs who are all currently residing in Bonita, a hidden gem of an animal shelter.\nThe San Diego County Department of Animal Services is dishing up all the treats with its January adoption specials on adult dogs: they only look expensive but they’re actually very down-to-earth.\nAnimal Services currently has an abundance of young huskies. They are an active breed that are always up for adventure. They need daily exercise and activities otherwise they might find other ways to entertain themselves that could make for some mischief and owner drama. They also need regular brushing to reduce shedding and keep their coats looking fabulous.\n“Sometimes people buy pets based on their looks and may not understand the needs of the breed, then become overwhelmed or frustrated,” said Animal Service Director Kelly Campbell. “Huskies can be wonderful dogs for the owners who are prepared for them.”\nDuring the month of January, adoption fees are waived for all adult dogs, even non huskies, at both the Bonita shelter and the Carlsbad shelter.\nMeet this season’s husky cast of characters.\nBlu Star is a year-old neutered male who keeps one ear up for praise and one down to all the haters. It’s about positivity. His ID number is A1889271, necktag number is S164 and kennel number is S077.\n\nKylo is also a year-old neutered male who knows how to charm and have a good time. His ID number is A1892979, necktag number is S573 and kennel number is S115.\nOba is a 2-year-old spayed strawberry blonde female who can bat her ice blue and amber eyes at you and steal your heart. Her ID number is A1888596, necktag number is S321 and kennel number is S127.\n\nStorm is a 5-year-old neutered male looking forward to the next phase of the good life. His ID number is A1892286, necktag number is S567 and kennel number is S110.\n\nMina is a 2-year-old spayed female who makes happiness her lifelong goal. Her ID number is A1887901, necktag number is S376 and kennel number is S098.\n\nMiles is a 5-year-old neutered male who knows a true friend is the best possession. His ID number is A1886931, necktag number is S221 and kennel number is S076.\nDue to COVID-19 precautions, Animal Services is offering adoptions by appointment, or walk-ins can be accommodated on Saturdays and Sundays from 10 a.m. to 4 p.m. in Bonita. If you would like to submit your application to be considered to adopt or foster, please visit the DAS website www.sddac.com and follow the instructions to complete and submit an adoption or foster care application, or call (619) 767-2675 to make an appointment.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220114.13.49.30"}