{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Saving San Diego’s Adult Residential Facilities", "description": "Board and care homes serve adults and seniors with serious behavioral health conditions who need specialized care. Though they fill a critical need, rising costs have many of these residential care facilities struggling to keep their doors open. A state grant program was recently created to help preserve and avoid closures and make some much needed property improvements.", "datePublished": "2025-02-19T09:36:03-08:00", "url": "https://www.countynewscenter.com/saving-san-diegos-adult-residential-facilities/", "keywords": ["health", "adult residential care", "behavioral health", "board and care", "community care and expansion program", "homelessness", "seniors"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-02-19T14:01:15-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteBoard and care homes serve adults and seniors with serious behavioral health conditions who need specialized care. Many are at risk of becoming homeless.\nLicensed by the state of California, board and cares offer a home-like atmosphere where residents have private or semi-private rooms and receive meals, housekeeping, transportation, medication management and grooming support.\nHere in San Diego, only eight board and care providers serve individuals with serious mental illness who are receiving Supplemental Security Income (SSI). The supply of beds has been shrinking. Since 2019, the region has seen a loss of over 3,200 board and care beds.\nNow, a new state grant program will soon provide board and cares a helping hand. The County has already received $16.6 million to step in with help.\nThe Community Care Expansion – Preservation (CCE-P) Program was created to preserve and avoid the closure of residential adult and senior care facilities that serve SSI recipients. Operators of these residences applied for grant funds issued to the County to help cover capital improvements including construction, property upgrades and rehabilitation projects.\nProviding financial assistance to the struggling Board and Care community will help ensure individuals with serious behavioral health challenges have a safe place to land when there are no other options. The investment will improve their quality of life, treatment outcomes and help prevent the cycle of homelessness and unnecessary hospitalization.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250219.09.36.03"}