{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Agriculture Blooming Again in New Crop Report", "description": "San Diego County releases its 2023 annual Crop Report showing totals and trends in local agriculture.  So, what tops the list?", "datePublished": "2024-10-11T11:52:35-07:00", "url": "https://www.countynewscenter.com/county-agriculture-blooming-again-in-new-crop-report-2/", "keywords": ["agriculture", "agriculture", "crop report", "crops", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-10-11T11:52:35-07:00", "articleType": "article", "articleContent": "\nReading Time:  4 minutesSan Diego County releases its 2023 annual Crop Report showing totals and trends in local agriculture. So, what tops the list?\nNursery & Cut Flower products were 71% of the total agricultural value, followed by Fruit & Nuts group that included crops such as avocados and citrus.  \nBedding Plants, Color, Perennials, Cacti & Succulents continue to reign supreme for the third year in a row, bringing in a total of $396,623,341, which is 24% of the total value of agriculture production in the county.\nThe second most valuable group is Ornamental Trees and Shrubs, valued at $383,114,393, equaling 23% of the region’s overall agricultural production value.\nThe report also shows total production is $1.66 billion in value, which is about $120 million less than 2022. This change is mainly due to the drop in value of Bedding Plants, Color, Perennials, Cacti & Succulents.\nThe report gives a yearly snapshot of agriculture’s contribution to the region’s economy, despite longstanding challenges like the region’s inclement weather, rising water costs, wildfires, freezes and pests.\nDid you know San Diego has 4,031 farms, 94% of which are family farms? It ranks 6th in the United States for the number of farms and has the most number of small farms in the state. San Diego County ranks No. 1 in Nursery, greenhouse, floriculture and sod in California and No. 2 in the United States.\nEven though the Crop Report covering the County’s 2023 growing season shows value declined, it also had some positive changes. The groups this year that thrived were Field Crops, Apiary Products and Forest Products.\nApiary Products were valued at $4,749,866, a 47% increase from last year. The increase is mainly due to an increase of 264% in Honey and Beeswax production, caused by an increase in rainfall. Pollinations dropped 8% because there were fewer colonies used for these services.\nField Crops’ value increased to $4,489,288, which is 14% higher than last year. The growth in the group’s overall value was mainly due to Field, Other, which increased by 44% in value due to an increase in acres.\nThe groups Nursery & Cut Flower Products, Fruit & Nut Products, Vegetable & Vine Crops and Livestock & Poultry decreased in value. This drop was due to lower acreage, demand of products, and prices.\nOther highlights from the report, compared to last year, include:\n\nThe value of Apples spiked by 73% due to higher profits as growers reported a recovery from last year’s 52% drop due to poor weather.\n\n\nThe overall value of Citrus increased by 5% compared to last year despite a 3% decrease in acres. All Citrus crops except Oranges increased in value. Lemons and Kumquats both rose by 21%, while Tangerines, Tangelos rose by 10%. The Citrus value growth is due to increased prices.\n\n\nFruit & Nut Crops’ value decreased to $292,644,242, a 4% drop from the previous year, due to decreased acres and prices\n\n\nThe value of Avocados decreased due to lower acreage, production, and prices.\n\n\nThe value of Grapes, Wine increased by 36% due to growth in production and acres.\n\n\nVegetable & Vine Crops’ value decreased to $89,665,332, a 31% drop from last year. This decrease was mainly due to a 34% drop in the value of Vegetables, Other. However, there was an increase in the value of Squash by 12%. The drop in value for this group is due to decreases in acres.\n\n\nThe value of Nursery & Cut Flower Products dropped by 3% to $1,177,552,435. Other, Cut Flowers & Bulbs had the biggest drop in percentage in this group which was 18%. The drop is due to a decrease in acres and reduced sales.\n\n\nLast year, the County certified 8,924 shipments of plant material, including fruits and vegetables, to 46 countries. The top issued certificates of goods grown in San Diego and exported in the United States, included: Ornamental Trees & Shrubs, Cacti & Succulents and Tomatoes.\n\nCounty Programs and Services\nThe report provides crop information and highlights the many diverse programs that the County’s Department of Agriculture, Weights and Measures (AWM) implements to support the food supply, agricultural trade, public health, consumer confidence and a sustainable environment.\nAWM applies state regulatory programs to detect, control and remove harmful insect pests, plant diseases and weeds, which is just one of the many programs the department undertakes and can be read about in the report.\nLast year, AWM inspectors stopped 20 snail and slug infestations and 121 plant diseases. The County also has a Detector Dog Team Program. The dogs checked shipments at parcel facilities and found:\n\n4,695 FedEx, UPS and Ontrac packages.\n\n\n88 pests that damage crops and landscape plants.\n\n\n313 packages that were in violation of state pest exclusion laws out of which 44% were incorrectly marked.\n\nPulling Together in an Emergency\nIn 2024, the San Diego region experienced extraordinary rains, flooding events, and mudslides. These events placed heavy burdens on regional communities and local agricultural operations. Regional damage estimates are projected to be $90 million.\nAWM took part in Emergency Operations Center meetings to help with regional emergency efforts. Twelve AWM staff worked a total of 674 hours as Disaster Service Workers. AWM performed verification visits to 26 operators who submitted damage reports. These damages totaled $664,000 to livestock and crops, agricultural infrastructure, and lost wages.\nMany agencies and organizations worked together to ensure a supportive recovery. AWM is honored to be a part of this community and to support San Diego agricultural operations in times of need.\nThe County compiles the Crop Report each year and publishes it online. There is also an integrated Microsoft Translate feature to read the report in many languages.\n                                                                                                                                             Here is a look at the 2023 Top 10 Crops\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241011.11.52.35"}