{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Partners with San Diego State University for PSA Campaign", "description": "The County of San Diego is rolling out a new set of public service announcements created by San Diego State University students to raise awareness about safety measures put in place to curb the spread of COVID-19.", "datePublished": "2020-08-20T13:00:00-07:00", "url": "https://www.countynewscenter.com/county-partners-with-san-diego-state-university-for-psa-campaign/", "keywords": ["health", "coronavirus", "covid-19", "health and human services", "psa", "sdsu"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-08-20T13:00:00-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is rolling out a new set of public service announcements created by San Diego State University students to raise awareness about safety measures put in place to curb the spread of COVID-19. Students were asked to create video messages specifically targeting their peers.\nThe campaign comes in response to a spike in cases in young people, particularly in the 20-29 age group. One in four lab-confirmed cases in the San Diego region are in that age group.\nThe PSA contest invited students to submit 15- to 30-second videos, in English or Spanish, that highlight the importance of frequent hand washing, social distancing and wearing face coverings. A committee of both county and SDSU staff selected the winning videos.\n“We really appreciate the creativity and continued partnership of SDSU’s School of Public Health as we collectively address the ongoing threat of the novel coronavirus,” said Nick Macchione, director of the County’s Health and Human Services Agency and lead of T-3, the county’s program to expand COVID-19 testing, tracing and treatment throughout the region. “The videos I watched clearly and effectively delivered all the right messages to our youth population.”\nThe county has a longstanding partnership with SDSU and the university is one of the county’s Live Well San Diego partners. As such, the university has adopted the county’s vision for a region that is healthy, safe and thriving.\n“This contest was an opportunity to support the county’s effort to reach youth through peer to peer messaging,” said Hala Madanat, director of the SDSU School of Public Health and lead organizer of the contest. “SDSU students rose to the occasion producing outstanding videos that send a clear message about the importance of social distancing, wearing face coverings, and hygiene to prevent the spread of COVID-19. I am so proud of our students.”\nBoth the county and SDSU will use the winning videos on social media to promote the importance of following public health guidelines.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200820.13.00.00"}