{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Close Indoor Operations at Gyms, Nail Salons and Other Sectors", "description": "Following new state guidance, the County will be closing indoor operations for certain sectors effective July 15.", "datePublished": "2020-07-13T17:05:08-07:00", "url": "https://www.countynewscenter.com/county-to-close-indoor-operations-at-gyms-nail-salons-and-other-sectors/", "keywords": ["health", "additional closures", "coronavirus", "covid-19", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-13T17:51:35-07:00", "articleType": "article", "articleContent": "\nFollowing new state guidance, the County will be closing indoor operations for certain sectors effective July 15.\nThey include:\n\nGyms and fitness centers\nPlaces of worship\nPersonal care services, including nail salons and massage and tattoo parlors\nHair salons and barbershops\nIndoor malls\nOffices for non-essential sectors\n\nThese closures will remain in effect until further notice.\nThe additional actions are being taken due to the rising number of cases across state and the County, which could overwhelm the healthcare system.\n“We have been seeing an increasing number of cases and we need to take further action now,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We’re following state guidance to further mitigate the spread of COVID-19.”\nOutdoor operations can occur under a tent, canopy or other sun shelter but only if the sides are not closed and there is sufficient outdoor air movement.\nCOVID-19 Testing to Focus on Priority Groups\nAs the amount of novel coronavirus testing supplies is dwindling across the nation, state and the region, the County will be focusing its testing efforts on people who need it the most.\nThe highest priority for the County remains to test those with symptoms or people in high-risk groups that may include:\n\nHealthcare workers, first responders, other social service employees and people in essential jobs\nOlder adults\nPeople with chronic medical conditions\nPeople living in a residential or group setting, such as a long-term care facility or shelter\nPeople exposed to infected individuals in places where COVID-19 risk is high\n\nToday, the County also announced a new partnership with Helix, a San Diego company, to expand access to COVID-19 testing.\nThis public-private partnership will give San Diego County access to up to 2,000 COVID-19 tests per day with results returned in 24 to 48 hours.\nFounded in 2015, Helix is a population genomics company in San Diego. Since the start of the pandemic, it has shifted the majority of its resources to support COVID-19 testing and now operates one of the nation’s highest throughput COVID-19 testing labs.\nPeople who want to get a COVID-19 test should contact their healthcare provider. San Diegans without one should call 2-1-1 to get a referral. For more information on testing, visit www.211sandiego.org or call 2-1-1.\n\nCommunity Setting Outbreaks and Other Triggers:\n\nNo new community setting outbreaks were identified on July 12.\nIn the past seven days, 17 community outbreaks were confirmed.\nThe number of community outbreaks remains more than double the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\nThe County also reached the Case Investigation trigger because only 60% of investigations were initiated within 24 hours of notification over a 7-day period. The percentage should be at least 71%.\nThe state’s threshold of no more than 100 cases per every 100,000 residents is also in the red and currently registers at 137 in San Diego County.\n\nTesting:\n\n6,542 tests were reported to the County on July 12 and 6% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 6.0%. The target set by the state is less than 8%.\nThe 7-day, daily average of tests is 7,693.\n\nCases:\n\n419 new cases were reported in San Diego County for a total of 20,348.\n2,052 or 10.1% of cases have required hospitalization.\n538 or 2.6% of all cases and 26.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo COVID-19 deaths were reported in San Diego County on July 12. The region’s total remains at 422.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200713.17.05.08"}