{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More than Half of County Fully Vaccinated; County Adds More Mobile Events", "description": "More than half of all San Diegans 12 years old and older — 50.3% — have now been fully vaccinated, County officials announced Thursday in an important milestone.", "datePublished": "2021-05-20T17:32:59-07:00", "url": "https://www.countynewscenter.com/more-than-half-of-county-fully-vaccinated-county-adds-more-mobile-events/", "keywords": ["health", "coronavirus", "covid-19", "covid-19 update", "covid-19 vaccinations", "mobile covid-19 vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-05-20T17:42:02-07:00", "articleType": "article", "articleContent": "\nMore than half of all San Diegans 12 years old and older — 50.3% — have now been fully vaccinated, County officials announced Thursday in an important milestone.\nOfficials also announced that they’re continuing to expand mobile vaccination sites and that they have created a new video and visual art contest with prizes for youths between the ages of 12- to 24-years-old to show the importance of COVID-19 vaccinations.\nIn addition to surpassing the 50% fully-vaccinated mark for eligible county residents — representing nearly 1.41 million San Diegans — County officials said nearly two-thirds of those San Diegans 12 and older, 66.2%, have now had at least one shot.\nUnlike the early days of the national vaccination effort, the region now has more supply of vaccine than there is demand. To help reach people who may have had difficulty getting to vaccination sites, County officials announced they plan to expand the number of mobile vaccination sites, with a list of new vaccination events stretching into late June at businesses, churches and religious centers, community and senior centers, and other locations.\nCounty officials also announced they have created a “Youth Leadership” video and visual art vaccine challenge/contest, that will start Monday, May 24 and allow submissions through June 14, to engage the county’s youth in the vaccination effort.\nYouths in three age groups, from 12- to 24-years-old, can win prizes for submitting videos and personal artwork about COVID-19 vaccinations in a number of categories. Those include short videos about why getting vaccinated was important to them personally or what they’re most excited about getting back to after being fully vaccinated, or art showing positive facts about COVID-19 vaccinations.\nThe “Our Health is Worth a Shot,” contest will offer prizes to youths in each of the three age categories who create winning videos or paintings, memes, posters, handouts, flyers or infographics. For more information, see the County’s Youth Challenge Contest website.\nFull List of New Mobile Vaccination Events \n(The County’s vaccination website will only show 1 week of events at a time)\n\n5/21/2021: Southwestern College Otay Lakes, 900 Otay Lakes Rd, Chula Vista, CA 91910\n5/21/2021: Urban Corps of San Diego County, 3127 Jefferson Street, San Diego, CA 92110\n5/22/2021: Islamic Center of San Diego East County, 833 Broadway, El Cajon, CA 92021\n5/22/2021: EJE Academies, 851 S. Johnson Ave, El Cajon, CA 92020\n5/22/2021: Vista Innovation Center, 840 Olive Ave, Vista, CA 92083\n5/23/2021: Foothill Oak Elementary School, 1370 Oak Dr, Vista, CA 92084\n5/25/2021: Scripps Ranch Civic Association, 11885 Cypress Canyon Road, San Diego, 92131\n5/25/2021: New Life Baptist Church, 9255 Lamar Street, Spring Valley, CA 91977\n5/25/2021: DJO Global, 1430 Decision Street, Vista, 92081\n5/26/2021: Bahia Hotel, 998 W Mission Bay Drive, San Diego, CA 92109\n5/27/2021: Pacific Beach Library, 4275 Cass St. San Diego, CA 92109\n5/28/2021: 12th & Imperial Transit Center, 1255 Imperial Ave, San Diego 92101\n5/29/2021: Encinitas4Equality, 1900 N, Coast Hwy, Encinitas, CA 92024\n5/29/2021: St. Francis of Assisi Catholic Church, 525 W. Vista Way, Vista, CA 92083\n5/30/2021: Oceanside First Presbyterian, 2001 S El Camino Real, Oceanside, CA 92054\n6/1/2021: Elks Lodge El Cajon, 1400 E. Washington Ave., El Cajon 92019\n6/3/2021: Viasat, 2502 Gateway, Carlsbad, 92009\n6/3/2021: Northgate Market, City Heights, 5403 University Avenue, San Diego, CA 92105\n6/4/2021: Muslim Community Center, 14698 Via Fiesta, San Diego, CA 92127\n6/4/2021: Mira Mesa Senior Center, 8460 Mira Mesa Blvd, San Diego, CA 92126\n6/5/2021: Poway Farmer’s Market, 14134 Midland Road, Poway, CA 92064\n6/5/2021: Rancho Buena Vista High School, 1601 Longhorn Dr, Vista, CA 92081\n6/6/2021: Mission San Luis Rey, 4050 Mission Ave, Oceanside, CA 92057\n6/8/2021: Sherman Heights Community Center, 2258 Island Ave, San Diego 92102\n6/9/2021: The former Burlington Coat Factory, 650 Sycamore Ave, Vista, CA 92081\n6/10/2021: Mission San Luis Rey, 4050 Mission Ave, Oceanside, CA 92057\n6/12/2021: Vista Innovation Center, 840 Olive Ave, Vista, CA 92083\n6/13/2021: EJE Academies, 851 S. Johnson Ave, El Cajon, CA 92020\n6/13/2021: Foothill Oak Elementary School, 1370 Oak Dr, Vista, CA 92084\n6/16/2021: Southwestern College, Otay Lakes, 900 Otay Lakes Rd, Chula Vista, CA 91910\n6/18/2021: 12th & Imperial Transit Center, 1255 Imperial Ave, San Diego 92101\n6/19/2021: Mission San Luis Rey, 4050 Mission Ave, Oceanside, CA 92057\n6/19/2021: St. Francis of Assisi Catholic Church, 525 W. Vista Way, Vista, CA 92083\n6/22/2021: Elks Lodge El Cajon, 1400 E. Washington Ave., El Cajon 92019\n6/24/2021: Northgate Market, City Heights, 5403 University Avenue, San Diego, CA 92105\n6/25/2021: Mira Mesa Senior Center, 8460 Mira Mesa Blvd, San Diego, CA 92126\n6/26/2021: Rancho Buena Vista High School, 1601 Longhorn Dr, Vista, CA 92081\n\nVaccination Progress:\n\nDoses delivered: Nearly 3.95 million.\nDoses administered: More than 3.45 million.\nReceived at least one shot: More than 1.85 million or 66.2% of San Diegans 12 and older.\nFully vaccinated: Nearly 1.41 million or 50.3%.\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people.\nTo date, 88.3% of the goal population has received at least one vaccine and 67.0% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 3.4 cases per 100,000 residents.\nThe testing positivity percentage is 1.6%.\nThe health equity metric is 2.1%.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, May 25.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed May 19, in a TK-12 school setting.\nIn the past seven days (May 13 through May 19), 13 community outbreaks were confirmed.\nThe community outbreaks trigger is seven or more in seven days.\n\nTesting:\n\n14,862 tests were reported to the County on May 19, and the percentage of new positive cases was 1%.\nThe 14-day rolling average percentage of positive cases is 1.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,135.\n\nCases, Hospitalizations and ICU Admissions:\n\n145 COVID-19 cases were reported to the County on May 19. The region’s total is now 279,489.\n15,384 or 5.5% of all cases have required hospitalization.\n1,700 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFour new COVID-19 deaths were reported on May 19. One previously reported death was removed from the case and death counts after it was found to be a duplicate report during routine Quality Assurance and reinspection. The region’s total is 3,749.\nFour men died between May 11, 2020 and June 11, 2020.\nThe deaths from 2020 were added to the list after a rigorous review of death certificates that were incorrect or incomplete and required the analysis of the patients’ medical records to determine if they were COVID-19 deaths.\nTwo of the deceased were in their mid-60s, one was in his early 70s and one was in his mid-70s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210520.17.32.59"}