{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "10 Years Later – Remembering the Great Japan Tsunami and to Prepare", "description": "Ten years ago this month, the world watched as a 9.1 magnitude earthquake and subsequent tsunami devastated the eastern coast of Japan.", "datePublished": "2021-03-29T14:48:07-07:00", "url": "https://www.countynewscenter.com/10-years-later-remembering-the-great-japan-tsunami-and-to-prepare/", "keywords": ["public safety", "office of emergency services", "preparedness", "tsunami"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-03-29T14:48:07-07:00", "articleType": "article", "articleContent": "\nTen years ago this month, the world watched as a 9.1 magnitude earthquake and subsequent tsunami devastated the eastern coast of Japan.\nThe combined events caused over $360 billion in damage and washed 1.5 million tons of debris, including wrecked cars, buildings and homes, into the ocean. The tsunami also flooded Japan’s Fukushima-Daiichi nuclear power plant, which melted its cores and leaked radiation. More than 18,000 people died, and many others were reported missing.\nThe California coast experienced over $100 million in damage. Locally, tsunami surges and strong currents caused flooding and minor damage, mainly to the boating community. The County of San Diego Office of Emergency Services and San Diego County’s hazardous materials division also worked with local, state and federal agencies to develop emergency plans to document and handle debris that could potentially wash ashore in the years following.\nThe events on March 11, 2011 have helped shape local and statewide emergency planning and preparedness efforts and serve as a lasting reminder of the importance of being prepared. While tsunamis are rare along San Diego’s 70 miles of coastline, it is important to know your risks and be prepared. Whether you work, live, or visit the coast, here are some simple and no-cost steps you can take to be this tsunami preparedness week to be ready for tsunamis:\n\nUse the Know Your Hazards map tool to discover your level of risk for local hazards, like tsunamis.\nMake a disaster plan for yourself and loved ones.\nRegister your cell phone and email with AlertSanDiego, the region’s emergency mass notification system.\nReview your local tsunami evacuation routes and know important landmarks and potential flood areas.\nKnow what to do: If you are on the beach or in a low-lying coastal area and feel a strong earthquake – drop, cover, and hold on, and then immediately move inland and to higher ground to a safe location.\nIf you have school age children or are a teacher – watch and share this video with your classroom. (Spanish)\nVisit the California Geological Survey tsunami page and tsunamizone.org .\nVisit ReadySanDiego.org/tsunami/.\n\nThe California Geological Survey has also put together a summary of the Japan Tsunami along with what happened to our coast, and the Redwood Coast Tsunami Work Group has compiled videos from tsunami observers in California.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210329.14.48.07"}