{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar Michael Vu Named County Assistant Chief Administrative Officer", "description": "A face familiar to many in election and media circles, Registrar of Voters Michael Vu is now taking on the responsibilities of Assistant Chief Administrative Officer for the County of San Diego.", "datePublished": "2021-01-22T13:35:29-08:00", "url": "https://www.countynewscenter.com/registrar-michael-vu-named-county-assistant-chief-administrative-officer/", "keywords": ["government", "acao", "assistant chief administrative officer", "fgg", "michael vu", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-01-22T13:35:29-08:00", "articleType": "article", "articleContent": "\nA face familiar to many in election and media circles, Registrar of Voters Michael Vu is now taking on the responsibilities of Assistant Chief Administrative Officer for the County of San Diego.\nVu began his new role Jan. 8 after working for the County for nearly 14 years, the last eight as Registrar.\nThe Chief Administrative Office is responsible for implementing policy decisions from the Board of Supervisors. The office also manages day-to-day operations.\nChief Administrative Officer Helen Robbins-Meyer praised Vu for working tirelessly to engage the San Diego community in a way that represents County values.\n“Not only has he enjoyed taking on new challenges, but he has been innovative and resourceful in responding to them,” said Robbins-Meyer. “For this, he has gained the respect and trust of many within our community, including community-based organizations, advocacy groups, elected officials and the media.”\n“I am eager to contribute in any way to the goals of the County and to work with the Chief Administrative Officer and the Board of Supervisors on the most pressing issues that the County faces.” said Vu. “Having dedicated myself to public service for 24 years in conducting elections, I am looking forward to bringing those experiences with me in this new role.”\nAs Vu takes on his new responsibilities, he will also continue to lead the Registrar of Voters particularly now that a special vacancy election is expected for the 79th Assembly District. Assistant Registrar Cynthia Paes will serve as the Acting Registrar.\nVu succeeds Tracy Sandoval as Assistant CAO. Sandoval left the County last October to become the Chief Executive Officer for the San Diego County Employees Retirement Association (SDCERA).\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210122.13.35.29"}