{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Technology to Improve Emergency Evacuations Countywide", "description": "A new technology launched Wednesday that will help streamline the evacuation process during emergencies throughout the region.", "datePublished": "2024-05-29T15:39:09-07:00", "url": "https://www.countynewscenter.com/new-technology-to-improve-emergency-evacuations-countywide/", "keywords": ["public safety", "alertsandiego", "cal fire", "evacuation", "genasys evac", "jeff toney", "oes", "office of emergency services", "san diego county sheriff s department", "sd emergency app", "wildfires"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-05-29T16:18:54-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteA new technology launched Wednesday that will help streamline the evacuation process during emergencies throughout the region.\nEvacuation zones powered by Genasys EVAC technology will help emergency managers and dispatchers send out more precise location-based alerts during an emergency evacuation.\nThe zones were developed by a coalition of local emergency managers, law enforcement and fire officials, and other safety experts. The team used geo boundaries, like lakes, freeways, mountains and neighborhoods, to create more logical and precise mapping zones.\nThe updated mapping will provide more specific evacuation areas, which will limit unnecessary evacuations. This will also support more efficient repopulations to get people back into their homes sooner.\nGenasys EVAC will be integrated into AlertSanDiego.org and the SD Emergency app. Residents who are already registered do not need to resubscribe or download anything new to get emergency alerts.\nAgencies throughout San Diego County will utilize this technology as part of regional efforts to continue to innovate and capitalize on best practices to keep residents safe and informed during emergencies.\nWith peak fire conditions ahead, regional fire and safety officials gathered Wednesday to promote the Genasys EVAC launch and urge residents to stay safe and prepared.\n\nMake sure you are registered for emergency alerts through AlertSanDiego.org and the SD Emergency app. You’ll get information about evacuations, road closures, emergency shelters and more.\nIn addition to registering for alerts, it is also important to take precautions for increased fire conditions. Here are some tips to reduce the fire risk for your property.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240529.15.39.09"}