{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Urged to Get Flu Vaccine in Time for Holidays", "description": "The County of San Diego is ramping up its flu vaccination efforts to lower the risk of San Diegans getting influenza this holiday season.", "datePublished": "2021-10-27T10:50:09-07:00", "url": "https://www.countynewscenter.com/san-diegans-urged-to-get-flu-vaccine-in-time-for-holidays/", "keywords": ["health", "flu", "flu update", "flu vaccination", "influenza"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-10-27T10:50:09-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is ramping up its flu vaccination efforts to lower the risk of San Diegans getting influenza this holiday season. County health officials are concerned this year’s flu season will be more severe than last year, when many people were staying at home due to COVID-19.\nWhile influenza cases are still low in the region at the moment, it takes about two weeks after vaccination to develop protection against the virus. That’s why it’s best to get vaccinated before influenza starts to spread in the community.\n“The upcoming Halloween festivities are a great reminder that the holiday season and the increased gatherings it brings are right around the corner,” said Wilma J. Wooten, M.D., M.P.H., County public health officer.  “This holiday season, protect yourself and others by getting a flu shot. It’s the best way to protect yourself from influenza.”\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Oct. 23, 2021, the report shows the following:\n\nEmergency department visits for influenza-like illness: 3% of all visits (compared to 3% the previous week)\nTotal influenza deaths to date: 0 (there were no deaths at this time last season)\nTotal lab-confirmed cases to date: 229 (compared to 10 last season and an average of 163 at this date for the past five years)\n\nPreventing the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time.\nThe flu vaccine is especially important for people at higher risk of having serious complications from the virus.\nThey include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe influenza vaccine is now available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nIn 2020, a total of 848 influenza cases were reported in San Diego, including two deaths. In 2019, a total of 108 San Diegans died from influenza and more than 20,700 flu cases were reported.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211027.10.50.09"}