{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registration Opens for Newest Live Well Career Prep Program", "description": "Registration is open for the next event in the Live Well San Diego Career Prep Series. The series is designed to guide and inspire San Diegans at every stage of their professional journey.", "datePublished": "2024-08-12T14:19:26-07:00", "url": "https://www.countynewscenter.com/registration-opens-for-newest-live-well-career-prep-program/", "keywords": ["families", "career", "live well"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-08-12T14:19:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteRegistration is open for the next event in the Live Well San Diego Career Prep Series. The series is designed to guide and inspire San Diegans at every stage of their professional journey.  \nYou can register online for the Aug 20 virtual event featuring a range of dynamic industries, including non-profits Jewish Family Service, Latinas in Tech and MAAC, BioCom, Verizon Connect and a special appearance by the San Diego Padres.  \nLooking ahead, the series has one more event planned. That in-person event will center on trade and vocational careers, highlighting professions that offer careers that don’t require a traditional four-year degree. \nThe Career Prep Series was launched in February 2024 based on outreach and feedback from Live Well San Diego Youth Sector participants. Live Well San Diego includes four ‘sectors’ or collaborative groups of population-specific organizations that share resources and best practices.  \n \n\nThe series already hosted two previous panels, one focused on emergency services, the other on public health careers.\nFor more information and to register for upcoming panels, visit LiveWellSD.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240812.14.19.26"}