{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Allows San Diego County to Move Into Red Tier", "description": "The state notified the County today that it will be allowed to lift some COVID-19 restrictions starting Wednesday and move from the most restrictive Purple Tier into the less restrictive Red Tier.", "datePublished": "2021-03-16T18:20:05-07:00", "url": "https://www.countynewscenter.com/state-allows-san-diego-county-to-move-into-red-tier/", "keywords": ["health", "coronavirus", "covid-19", "red tier", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-03-16T18:20:05-07:00", "articleType": "article", "articleContent": "\nThe state notified the County today that it will be allowed to lift some COVID-19 restrictions starting Wednesday and move from the most restrictive Purple Tier into the less restrictive Red Tier. The change in tiers will allow restaurants, gyms, movie theaters and other businesses to begin moving operations indoors with capacity limits.\nBeginning tomorrow, restaurants and movie theaters will be allowed to resume indoor operations at 25 percent capacity, or 100 people, whichever is fewer. Gyms and fitness centers will be allowed to reopen indoor operations at 10 percent of their indoor capacity. Museums, zoos and aquariums will be able to open indoor operations at 25 percent capacity and retail and shopping centers will be able to increase their indoor operations to 50% capacity.\nAll establishments will still be required to follow social distancing and face covering guidelines for their employees and patrons.\n“It is because of the efforts of our community that the County is able to move back into the Red Tier after four months of Purple Tier restrictions,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “However, the relaxing of restrictions should not encourage San Diegans to let their guard down. We are urging community members to continue to do their part, get vaccinated once they are eligible and take the necessary precautions to avoid getting and spreading COVID-19.”\nVaccination Progress:\n\nMore than 1.41 million COVID-19 vaccine doses have been delivered to the region, and over 1.27 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, over 450,000 County residents, or 16.7% of San Diegans 16 and older, are fully immunized.\nOverall, over 722,000 County residents have received at least one shot of the two-dose vaccine. That’s 26.9% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.8 cases per 100,000 residents. The County is allowed to move into the Red Tier tomorrow, March 17.\nCurrently, the testing positivity percentage is 2.8%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 4.2% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March 23.\n\nCommunity Setting Outbreaks:\n\nTwo new community outbreaks were confirmed March 15: one in a business setting and one in a daycare/preschool/childcare setting.\nIn the past seven days (March 9 through March 15), 17 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n8,790 tests were reported to the County on March 15, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,675.\n\nCases, Hospitalizations and ICU Admissions:\n\n257 COVID-19 cases were reported to the County on March 15. The region’s total is now 265,906.\n13,365 or 5% of all cases have required hospitalization.\n1,627 or 0.6% of all cases and 12.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n10 new COVID-19 deaths were reported March 15. The region’s total is 3,462.\nTwo women and eight men died between Dec. 31 and March 15.\nThree people who died were 80 years or older, five were in their 70s and two were in their 60s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210316.18.20.05"}