{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Helps Select County’s New Leadership Team", "description": "County of San Diego Chief Administrative Officer Ebony Shelton announced several additions to her leadership team.", "datePublished": "2024-09-17T12:44:53-07:00", "url": "https://www.countynewscenter.com/community-helps-select-countys-new-leadership-team/", "keywords": ["government", "acao", "andrew strong", "brian albright", "cao", "caroline smith", "dahvia lynch", "dcao", "ebony shelton", "joan bracci", "kim giardina"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-09-17T12:44:53-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesCounty of San Diego Chief Administrative Officer Ebony Shelton announced several additions to her leadership team.\nAfter beginning her role as Chief Administrative Officer in July, one of Shelton’s first priorities was to build her leadership team to advance the County’s vision of a just, sustainable and resilient future for all. This included selecting Deputy Chief Administrative Officers to lead the County’s four operational groups and appointing an Assistant Chief Administrative Officer and a Chief Financial Officer.\nThe County conducted a robust national recruitment and prioritized community feedback to help advance qualified applicants through the interview process.\nCommunity members from a variety of organizations were asked to screen the resumes of the most qualified candidates and participate in the interview process, providing critical input from the community perspective.\n“This is an exciting time in our organization as we look towards the future, working together to support our employees and reflect the communities we serve,” said Shelton. “The fact that the community played a key role in helping select this new team is indicative of the collaboration we need to move the region forward.”\nHere are the candidates who were selected:\nAssistant Chief Administrative Officer: Caroline Smith\n\nSmith brings a passion for policy and public service combined with broad experience supporting a variety of operations in her almost 19 years with the County. Her most recent role was as the Agency’s interim Deputy Chief Administrative Officer, and she has held many positions in the group throughout her County career. She is also the former Director of the Office of Economic Development and Government Affairs.\n\nChief Financial Officer: Joan Bracci\n\nBracci has supported the County’s finances and operations since joining the organization in 2008. She has served in many roles including the Finance and General Government Group interim Deputy Chief Administrative Officer and as its Chief Operations Officer, helping the County develop its annual budget and providing long-term financial forecasting. Before joining the County, Bracci held public finance roles in the private sector.\n\nDeputy Chief Administrative Officer, Finance and Government: Brian Albright\n\nAlbright shared duties as the interim Land Use and Environment Group Deputy Chief Administrative Officer and has served as the County’s Director of Parks and Recreation. He held similar positions with the City of Carlsbad and City of Alexandria, Virginia. He will lead the County’s Finance and General Government Group which includes 15 departments, and provides services such human resources, information technology, data analytics and management of County facilities.\n\nDeputy Chief Administrative Officer, Health and Human Services Agency: Kim Giardina\n\nGiardina takes on her new role after leading the Child and Family Well-Being department. She oversaw the reimagining of the department’s services and has more than 20 years of service to children in need. Child and Family Well-Being is one of the many departments and programs in Health and Human Services Agency, which provides a broad range of health and social services to make people’s lives healthier, safer and self-sufficient.\n\nDeputy Chief Administrative Officer, Land Use and Environment: Dahvia Lynch\n\nLynch was the director of Planning & Development Services and also shared duties as the interim Deputy Chief Administrative Officer for the Land Use and Environment Group. She has worked in planning and development for the City of San Marcos and North County Transit District. She will lead the Land Use and Environment Group’s six departments with a broad range of functions including protecting health and the environment, promoting sustainability, supporting local agriculture and managing infrastructure like roads.\n\nDeputy Chief Administrative Officer, Public Safety: Andrew Strong\n\nStrong was previously in the role of interim Public Safety Deputy Chief Administrative Officer. Prior to that, he was the director of the Office of Equity and Racial Justice, responsible for identifying and eradicating systemic bias and racism while fostering a culture of equity and belonging. The Public Safety Group includes departments such as Emergency Services, District Attorney, Public Defender, Sheriff, Medical Examiner, Probation and Animal Services.\n\nThe Land Use and Environment Deputy Chief Administrative Officer will start her position tomorrow, September 18. The Deputy Chief Administrative Officers for the other operational groups and the Assistant Chief Administrative Officer begin their new roles September 30. The Chief Financial Officer starts her position October 10.\nThe County of San Diego has an $8.5 billion dollar annual budget and about 20,000 employees who provide essential and diverse services in our region, including critical support for some of the most vulnerable members of the community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240917.12.44.53"}