{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Supervisors Sworn In to Office", "description": "Three new members of the San Diego County Board of Supervisors were sworn in during a virtual event on Monday.", "datePublished": "2021-01-04T14:49:49-08:00", "url": "https://www.countynewscenter.com/new-county-supervisors-sworn-in-to-office/", "keywords": ["government", "2021", "board of supervisors", "board supervisors", "fgg", "supervisor joel anderson", "supervisor nora vargas", "supervisor terra lawson-remer", "swearing in", "sworn in"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-01-04T16:02:49-08:00", "articleType": "article", "articleContent": "\nThree new members of the San Diego County Board of Supervisors were sworn in during a virtual event on Monday.\nSupervisor Nora Vargas succeeded long-time District 1 Supervisor Greg Cox, who had served on the board since 1995.\nThe district covers Coronado, Imperial Beach, Chula Vista, National City, some communities within the City of San Diego, and unincorporated areas including Bonita, Lincoln Acres and East Otay Mesa.\nSupervisor Vargas was sworn in by her goddaughters, Fatima and Farah Jimenez. Afterward, the new board member made remarks in both English and Spanish noting her status as the first woman of color, an immigrant and first Latina to serve on the board.\n“I may be the first, but I will absolutely not be the last,” said Supervisor Vargas. “I stand before you committed to governing with intentionality, integrity, empathy, transparency and con muchisimo corazon.”\nSupervisor Joel Anderson took over the reins for District Two Supervisor Dianne Jacob who began her stint on the board in 1992 and is the longest-serving board member in San Diego County government history.\nWith wife Kate at his side, Supervisor Anderson was sworn in by former State Senator Mark Wyland.\n“I know that we’re facing tremendous challenges in the county whether it’s COVID, homelessness or attainable housing but we’re going to be laser-focused on these issues delivering for our community,” said Supervisor Anderson. “With that I got work to do. You’re counting on me showing up day one and I want to get going right now.”\nDistrict 2 covers a broad swath of unincorporated East County, including the communities of Lakeside, Alpine, Ramona, Julian, as well as 11 Indian reservations, La Mesa, El Cajon, Poway, and some communities in the City of San Diego.\nSupervisor Terra Lawson-Remer will take over for District Three from former Supervisor Kristin Gaspar. The district includes Del Mar, Solana Beach, Encinitas, Escondido, San Pasqual Valley, some communities in the City of San Diego and Marine Corps Air Station Miramar.\nJudge Margaret McKeown of the United States Court of Appeals for the Ninth Circuit and state Senator Toni Atkins gave Supervisor Lawson-Remer the oath of office.\n“We face historic challenges, and we have historic ambition to match so I’m heartened by the partners I’m joining this morning to improve the lives of San Diegans,” said Supervisor Lawson-Remer. “We have a lot of work ahead and I’m ready to roll up my sleeves and get started.”\nThe three new board members will join Supervisors Nathan Fletcher and Jim Desmond for an organizational meeting Tuesday, Jan. 5. The board will select a chair, vice chair and chair pro tempore for the 2021 calendar year.\nDue to ongoing safety concerns about COVID-19, the meeting will be virtual, but the public can still watch the proceedings live and request to speak via teleconference or submit written eComment.\nWatch Online\nThere may be a 45-second or more delay when viewing the broadcast online, depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo Livestream\nYouTube\nFacebook\nTwitter\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nCurrently not available on AT&T U-Verse\n\nListen on the Phone\nA call-in line is also available to listen to the live Board meeting while it is in session at 619-531-4716. This is a listen-only line.\nComment\nMembers of the public can use the eComment service to submit comments on agenda and non-agenda items before and during the meeting.\nThose who want to participate in the meeting and speak via teleconference must fill out the online Board of Supervisors tele-comments form and submit it before the meeting starts. After submitting the form, you will receive instructions on how to call in to the meeting to provide your comments.\nLarge groups wishing to comment on a common item are encouraged to submit comments in writing or to identify one spokesperson to join the teleconference on behalf of the group.\nFor more information, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210104.14.49.49"}