{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Over 200 Vote Centers Available Saturday", "description": "Additional vote centers open Saturday allowing voters to cast their ballot early at any one of more than 200 vote centers in the county.", "datePublished": "2024-03-01T10:30:49-08:00", "url": "https://www.countynewscenter.com/over-200-vote-centers-available-saturday/", "keywords": ["elections", "county registrar of voters", "fgg", "march 5 presidential primary", "more vote centers open", "registrar of voters", "vote centers open"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-29T16:18:47-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesAdditional vote centers open Saturday allowing voters to cast their ballot early at any one of more than 200 vote centers in the county. These locations will be open for four days leading up to and including the final day of voting, March 5. Vote centers allow voters to avoid long lines by voting early.\nThe hours are 8 a.m. to 5 p.m. through Monday, March 4. On the final day of voting, Tuesday, March 5, all vote centers and official ballot drop boxes will be open from 7 a.m. to 8 p.m.\nLocations for both are listed in your voter information pamphlet or you can find them online at sdvote.com.\nPlease note that Santee-Lakeside Elks Lodge is no longer serving as a vote center. Voters will be directed to the two nearest vote centers: Lakeside Community Center located at 9841 Vine St. and Willowbrook Golf Course located at 11905 Riverside Dr.\nIf you’re not registered to vote and want to participate in the election, you may visit any vote center to conditionally register and vote provisionally through March 5.\nOnce the voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the state, the voter registration becomes active and the provisional ballot is counted.\nVote centers replace polling places and provide more services. You can:\n\nVote in-person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters may use a touch screen to:\n\nMake their selections on a ballot marking device\nPrint out the official ballot\nReview it\nPlace it in the secrecy sleeve\nGive it to a poll worker to insert in the ballot box\n\nThe ballot will be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember, campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or measure on the ballot. People may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nDon’t delay! If you have been holding onto your ballot, act now.\n\nVote from home.\n\nSign and date your return envelope, seal your completed ballot inside.\nReturn it promptly by mail.\nMail ballots postmarked on or before March 5 and received by the Registrar’s office by March 12 will be considered timely cast.\nOr return it to one of 146 official ballot drop boxes. The secure stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.”\n\n\nGo to a vote center.\n\nYou can bring the official ballot you received in the mail, check in at the vote center, sign the electronic roster and cast your ballot free of its return envelope.\n\n\n\nFind the ballot drop boxes or vote centers close to you through the Registrar’s online locator tool or inside your voter information pamphlet. For drop boxes, check each location’s hours of operation before heading out at sdvote.com.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nIf you plan to vote for president, the Registrar urges voters to review each political party’s rules.\nLearn more about voting in the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240301.10.30.49"}