{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting Saturday, Five Vote Centers Open for 80th Assembly District Election", "description": "You don’t have to wait until Election Day to vote in person. Voters eligible to vote in the April 5 Special Primary Election for Assembly District 80 can take advantage of early voting at five vote centers starting Saturday, March 26.", "datePublished": "2022-03-25T10:00:06-07:00", "url": "https://www.countynewscenter.com/starting-saturday-five-vote-centers-open-for-80th-assembly-district-election/", "keywords": ["elections", "80th assembly district special primary election", "ballot marking devices", "early voting", "registrar of voters", "vote centers open"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-03-26T11:08:52-07:00", "articleType": "article", "articleContent": "\nYou don’t have to wait until Election Day to vote in person. Voters eligible to vote in the April 5 Special Primary Election for Assembly District 80 can take advantage of early voting at five vote centers starting Saturday, March 26. The centers will be open from 8 a.m. to 5 p.m. through Monday, April 4 at the locations below:\n\nSouthwestern Community College\n\nLot A, Building 18A-Room 214\n900 Otay Lakes Road\nChula Vista, 91910\n\n\nCamacho Recreation Center\n\nGym\n1810 E. 22nd Street\nNational City, 91950\n\n\nSouthcrest Recreation Center\n\nMeeting Room 1\n4149 Newton Ave.\nSan Diego, 92113\n\n\nMontgomery High School\n\nLibrary\n3250 Palm Ave.\nSan Diego, 92154\n\n\nColonel Irving Salomon Community Center\n\nGame Room\n179 Diza Road\nSan Diego, 92154\n\n\n\nOn Election Day, April 5, four more vote centers will open for a total of nine locations and the hours will change to 7 a.m. to 8 p.m. You can find a vote center or ballot drop box location near you inside your voter information pamphlet. Or you can look it up online at sdvote.com.\nVote centers replace polling places and provide more services. You can visit any one of the County’s vote centers to drop off your ballot or vote in person. Vote center services include:\n\nADA accessible ballot marking devices\nVoting assistance in the County’s four federally covered languages: Spanish, Filipino, Vietnamese and Chinese\nVoter registration or updates, and voting on the same day\nVoting in person if you made a mistake or lost your mail ballot\n\nVoters will use a touch screen to make their selections on ballot marking devices. When finished, the voter will print out a paper official ballot with their selections. The voter can review the ballot and place it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or ballot drop box location is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate on the ballot.\nVoters can still save themselves the trip and mark their ballot from home. Be sure to sign and date the return envelope, seal your completed ballot inside and return it to a ballot drop box location or vote center.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday. Some ballot drop box locations and the Registrar of Voters office will be closed on Thursday, March 31 in observance of Cesar Chavez Day.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nLearn more about voting in the 80th Assembly District Special Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220325.10.00.06"}