{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Youth Transition Campus Completed", "description": "A new Youth Transition Campus, designed to be less like an outdated correctional facility and more like a therapeutic, rehabilitative campus, is complete in the Kearny Mesa area of San Diego. The Youth Transition Campus supports young people with longer stays in custody and has been designed to reflect national best practices that promote positive youth development and staff well-being. The standards reflect the San Diego County Board of Supervisors’ commitment to provide the resources that help young people succeed and thrive.", "datePublished": "2022-01-28T10:50:44-08:00", "url": "https://www.countynewscenter.com/new-youth-transition-campus-completed/", "keywords": ["public safety", "probation", "youth transition center"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-01-28T15:09:46-08:00", "articleType": "article", "articleContent": "\nA new Youth Transition Campus, designed to be less like an outdated correctional facility and more like a therapeutic, rehabilitative campus, is complete in the Kearny Mesa area of San Diego. The Youth Transition Campus supports young people with longer stays in custody and has been designed to reflect national best practices that promote positive youth development and staff well-being. The standards reflect the San Diego County Board of Supervisors’ commitment to provide the resources that help young people succeed and thrive.\n“Youth who make poor decisions should be given an opportunity to turn their life around. We want to help them avoid a lifetime of incarceration and find a path of meaning and purpose” said Nathan Fletcher, Chair of the San Diego County Board of Supervisors.  “This new campus is a place where young people who want to change their circumstances can receive the encouragement, treatment, education, support, and skills they need to get on a path to a better future.”\nSince 2017, Probation has worked with justice partners and community leaders including the Children’s Initiative which played a key role in helping County staff reimagine the future of juvenile detention with a specific focus on how research and data promote more successful outcomes. The design of the facility and the operating approach follows the Youth in Custody Practice Model designed by national experts from Georgetown University’s Center for Juvenile Justice Reform and the Council of Juvenile Justice Administrators.\nCounty officials cut a ceremonial ribbon to open the Youth Transition Center on Jan. 28 in Kearny Mesa.\n“Going into the future, the new Youth Transition Campus will emphasize restorative justice, or repairing the harm young people may have caused to their family or in the community. Struggling youth will be provided with trauma-informed rehabilitative and supportive services to complete their high school education, learn life skills, promote pro-social behaviors and prepare them for a successful reentry to the community,” said Interim Chief Probation Officer Cesar Escuro.\nThe new Youth Transition Campus is a complete transformation of the 1950s-era Juvenile facility and is built across 12 acres on the southern part of the County Juvenile Hall property. Eight housing units that accommodate 96 beds are organized along an arching tree-lined pathway with an open courtyard that includes basketball courts, handball courts, garden space and an amphitheater and stage. Along the other side of the courtyard is the main large visitation and dining building that includes a state-of-the-art culinary arts working kitchen, and a standalone school complex with a career technical education building, and an indoor gymnasium. The residential living units have high wood beam ceilings, large open areas with home-like finishes, and mental health clinicians in each unit.\n“This work is part of the County’s larger efforts to ensure at-risk youth are provide evidence-based services and programs, including individual and group counseling, promoting family engagement and providing lived experience mentors,” said Sandra McBrayer, CEO of The Children’s Initiative. “The Youth Transition Center and the accompanying programs will provide youth the skills and tools they need to thrive. It will be a model for the country to implement positive youth development in a therapeutic detention setting.”\nThe Youth Transition Campus is where youth, ages 13 to 20, will reside after a true finding in juvenile court, and are committed to time in custody. Staff and 12 youth will move in the first week of February with more youth transitioning throughout the month.\nThis project is a LEED gold certified campus that will save taxpayers money by replacing an aging, facility with a modern, energy-efficient rehabilitative campus.\nThe Youth Transition Campus project is the first part of two phases in redeveloping the overall juvenile justice campus. The next phase of construction is set to begin in the spring and will include a 72-bed Temporary Residential Placement Facility, previously known as Juvenile Hall, and a small office building to support Probation staff and families.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220128.10.50.44"}