{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Child Support Services Recognized for Innovative Program", "description": "The San Diego County Department of Child Support Services received an award for two new programs to help families work through problems facing many parents. The Innovation in the Child Support Program Award was given to the County by the California Child Support Directors Association.", "datePublished": "2022-05-13T17:00:55-07:00", "url": "https://www.countynewscenter.com/?p=208525", "keywords": ["families", "award", "department of child support services", "expanded service delivery", "innovation", "super saturday", "youth with dreams"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-05-13T17:27:20-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Department of Child Support Services received an award for two new programs to help families work through problems facing many parents.\nThe Innovation in the Child Support Program Award was given to the County by the California Child Support Directors Association. The award highlights the department’s Expanded Service Delivery and Youth with Dreams programs.\nThe Child Support Services team understands their customers come from all walks of life and are often working, handling child care, struggling with transportation and working though daily hurdles. The need to visit an office during common hours can be an obstacle for many parents. The Expanded Service Delivery Program allows customers to receive help at a time and setting that works for them.\nChild Support now connects with families via chat, video conferencing, texting, through a call center or even in person on Super Saturday events. All are options to let customers meet with representatives quickly and conveniently. There are even family law facilitators to help answer questions for those who do not have access to an attorney.\nAlmost 5,000 families have conducted virtual conferences, more than 2,000 have used the chat feature, and nearly 450 customers visited on Super Saturdays.\nThe Youth with Dreams program was started last year to encourage teen and young adult parents to continue reaching for goals. In the program, young families access essential resources like education, employment and resources to help lead a self-sufficient life. The goal is to reduce barriers young customers face, dismantle stereotypes associated with teen and young adult parents, and to help end the cycle of intergenerational poverty. In less than a year, more than 400 people were receiving help through the Youth with Dreams program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220513.17.00.55"}