{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Emergency Rental Assistance Applications Now Open", "description": "Low-income San Diegans who have experienced a financial impact due to the ongoing COVID-19 pandemic can now apply for rental and utility assistance grants from the County.", "datePublished": "2021-03-02T17:01:26-08:00", "url": "https://www.countynewscenter.com/emergency-rental-assistance-applications-now-open/", "keywords": ["health", "coronavirus", "covid-19", "housing and community development services", "rental assistance"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-02T17:02:03-08:00", "articleType": "article", "articleContent": "\nLow-income San Diegans who have experienced a financial impact due to the ongoing COVID-19 pandemic can now apply for rental and utility assistance grants from the County.\nDuring the COVID-19 update to the County Board of Supervisors Tuesday, David Estrella, director of Housing and Community Development Services, said San Diegans can apply for financial assistance to help lessen housing cost burdens and maintain housing stability.\nThe County’s Emergency Rental Assistance Program is funded by over $100 million in state and federal monies.\nTo be eligible, households must be renting and have experienced a financial hardship related to COVID-19 or have qualified for unemployment during the pandemic.\nBoth landlords and tenants can apply; however, tenants will have to co-sign applications submitted by the landlord.\nFor more information or to apply, visit www.sdhcd.org. The application period will be open for three weeks and will be extended if necessary.\n“If you’ve received assistance through a past rent or utility assistance program, you may still apply for the outstanding rent or utilities that have not been covered,” Estrella said.\nThe County’s Emergency Rental Assistance Program will assist San Diego residents countywide, except for those residing in the cities of San Diego and Chula Vista. Residents of San Diego and Chula Vista can visit http://www.ERAPSanDiego.org for information about rental assistance programs in those cities.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 10.8 cases per 100,000 residents (as of March 2) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 4.2%, placing the County in Tier 3 or the Orange Tier. While the testing positivity rate for the County qualifies it for Tier 3, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 6% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 9.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed March 1.\nIn the past seven days (Feb. 23 through March 1), 29 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n9,303 tests were reported to the County on March 1, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 3.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 13,333.\n\nCases, Hospitalizations and ICU Admissions:\n\n376 cases were reported to the County on March 1. The region’s total is now 261,001.\n13,162 or 5% of all cases have required hospitalization.\n1,598 or 0.6% of all cases and 12.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n14 new COVID-19 deaths were reported March 1. The region’s total is 3,317.\nEight men and six women died between Jan. 21 and Feb. 28.\nOf the 14 deaths reported March 1, four people who died were 80 years or older, four were in their 70s, two were in their 60s and three were in their 50s and one was in their 40s.\n12 had underlying medical conditions, one did not and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210302.17.01.26"}