{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: New, One-Stop Shop for County Services in Ramona", "description": "The new Ramona Community Resource Center is open, providing those in the area with a one-stop place with access to many County services like mental health, nutrition, and healthcare. ", "datePublished": "2025-01-14T15:05:09-08:00", "url": "https://www.countynewscenter.com/new-one-stop-shop-for-county-services-in-ramona/", "keywords": [], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2025-01-14T15:05:09-08:00", "articleType": "video.other", "articleContent": "\nReading Time:  2 minutesThe new Ramona Community Resource Center is open, providing those in the area with a one-stop place with access to many County services like mental health, nutrition, and healthcare. \nThe $15 million facility replaces one that had been in operation since 1988. Centrally located on the corner of 12th and Main Streets, the facility is next to a County library branch. A 100-unit senior affordable housing complex on the property is being planned and should be up and running in the coming years.  \nThe center is expected to see around 6,000 visits in the next year. Nearly 9,000 people in the community are now receiving County services, including CalFresh and medical assistance. \nThe state-of-the-art building includes new services to better support Ramona residents, including services for older adults and veterans. It was planned and built with input from the community and includes a conference room that is available for the community to reserve upon request. \nA dream 25 years in the making, the County Board of Supervisors took the first step and approved the purchase of land from the California Department of Transportation in 2017. A design-build contract was awarded to Nielsen Construction in 2022 and the County worked with Sillman Architects on what the center would look like. The County broke ground on the project in June 2023. \nThe one story, 7,300 square foot building is designed to reflect the community and its residents and includes public art. \nThe center achieves a gold standard rating in Leadership in Energy and Environmental Design (LEED) from the U.S. Green Building Council. The building is also zero net energy, meaning it will generate more energy from the solar panels on its roof than it consumes each year. It also achieved a 30% reduction in embodied carbon which helps reduce greenhouse gas emissions. \nThe Ramona Community Resource Center is part of the County’s work to expand accessibility, equitably across the region. Local business, small businesses, and disadvantaged businesses participated in its construction, including in the excavation and earthwork, fire protection, framing and door hardware, material supplies, and artwork. \nSince 2020, the County has opened two other new resource centers, the North Coastal Live Well Center in November 2020, and the Southeastern Live Well Center in July 2023. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250114.15.05.09"}