{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supports Sustainable, Equitable and Local Food Sourcing", "description": "The San Diego County Board of Supervisors voted Tuesday to adopt a policy that emphasizes value-based food sourcing for County-provided meals through the continued monitoring of food and beverage data.", "datePublished": "2023-12-11T08:42:19-08:00", "url": "https://www.countynewscenter.com/county-supports-sustainable-equitable-and-local-food-sourcing/", "keywords": ["health", "food sourcing", "food vision 2030", "sustainability"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-12-11T08:42:19-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors voted Tuesday to adopt a policy that emphasizes value-based food sourcing for County-provided meals through the continued monitoring of food and beverage data. \nSpending about $27 million each year, the County is a large buyer of food. \nThe Sustainable, Equitable and Local Food Sourcing Program and Policy Framework prioritizes locally sourced, equity-informed, organic or regenerative-certified food that is produced with low carbon emissions and has nutritional benefits for both people and the environment.  \nThe policy inherently supports the local economy. It helps local farmers, reduces carbon emissions, and provides healthy food. Local food producers, workers, and businesses owned and/or operated by people in underserved communities are prioritized. \nOver the past year, the County served about eight million meals to vulnerable populations. These groups include older adults, foster youth, individuals living with HIV/AIDS and youth and adults residing in public hospitals and detention facilities. \nPrioritizing locally sourced food is consistent with the region’s Food Vision 2030, a 10-year strategic plan created in 2021 to reimagine the food system in the San Diego region. \nAmong the objectives of Food Vision 2030 is to scale local, sustainable and equitable food value chains by leveraging the purchasing power of institutions. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231211.08.42.19"}