{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County LEEDing the Way", "description": "When the County broke ground last month on its seventh Crisis Stabilization Unit—a place to give people in the midst of crisis a calm place to recover—it wasn’t just a boon for behavioral health. It was also a boost for the environment, sustainability and thwarting climate change in San Diego County.", "datePublished": "2024-08-05T13:45:27-07:00", "url": "https://www.countynewscenter.com/county-leeding-the-way/", "keywords": ["government", "addressing climate change", "crisis stabilization unit", "equity", "general services", "leed", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-08-05T14:28:21-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesWhen the County broke ground last month on its seventh Crisis Stabilization Unit—a place to give people in the midst of crisis a calm place to recover—it wasn’t just a boon for behavioral health.\nIt was also a boost for the environment, sustainability and thwarting climate change in San Diego County.\nThat’s because when the building opens next year in El Cajon it will be the County’s sixty-eighth to meet the U.S. Green Building Council’s LEED environmental standards. LEED stands for “Leadership in Energy and Environmental Design.”\nIt will also be the County’s eleventh “Zero Net Energy” building, meaning it will produce more electrical energy than it uses—thanks to solar rooftop panels, ample use of natural lighting, air circulation and other green amenities.\nAnd it will be the third County facility to reduce its carbon footprint by using “embodied carbon” techniques.\nMarko Medved, head of the County’s Department of General Services, said embodied carbon is newer to the County. But he said it has become the third environmental pillar, along with LEED status and Zero Net Energy, that the County uses to build sustainable facilities.\nEmbodied carbon reduces the overall carbon footprint of buildings by building them with materials that use less energy to create—like low-carbon concrete, and timber that grows naturally instead of steel that has to be mined, crushed and fired in blast furnaces.  Embodied carbon techniques also use low-energy transportation, installation, maintenance, demolition and disposal.\nMedved said the County estimates the embodied carbon approach will reduce the carbon emissions it takes to build the new Crisis Stabilization Unit in El Cajon by 30%.\nThe County has been building to Zero Net Energy and LEED standards for many years.\n“You get there,” Medved said, “by having an efficient building, having low water use, recycling, using local materials and making the interior environment good for the people who are working in there—having good, natural light, good circulation and good air quality.”\nIn fact, in 2018 San Diego County become the first county in California and the second in the nation to receive the U.S. Green Building Council’s Platinum certification—its highest distinction—in its LEED for Communities program.\nA number of notable County buildings are green.\nThe County Operations Center in Kearny Mesa has achieved several LEED certifications.\nSeven of the County’s branch libraries are LEED certified, including Alpine, Borrego Springs, Fallbrook, Lakeside, Lincoln Acres, Imperial Beach and Ramona. Of those, six are certified “gold.” And four are also Zero Net Energy buildings: Alpine, opened in 2016; Imperial Beach, opened in 2017; Borrego Springs, opened in 2018; and Lakeside, opened in 2023.\nThe Assessor/Recorder/County Clerk’s Office & Archive building in Santee that opened 2020 and won an Orchid award for outstanding architecture is certified LEED gold and is the first Zero Net Energy archive in the United States.\nThe new East Otay Mesa Fire Station is LEED certified and Zero Net Energy.\nAnd the County’s $79 million, 65,000 square-foot, two-story Southeastern Live Well Center that opened in 2023 is also LEED certified and a Zero Net Energy building.\nFor more information about the County Department of General Services sustainability plans, go to its Operations Energy & Sustainability Management webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240805.13.45.27"}