{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Could See More Housing Dollars with “Prohousing” Designation", "description": "San Diego County could see more money for housing after it was named one of 11 additional cities and counties to receive a “prohousing” designation from the state for being committed to building more housing, faster.", "datePublished": "2023-05-03T15:15:26-07:00", "url": "https://www.countynewscenter.com/county-could-see-more-housing-dollars-with-prohousing-designation/", "keywords": ["housing", "affordable housing", "hhsa", "lueg"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-05-03T15:15:26-07:00", "articleType": "article", "articleContent": "\nSan Diego County could see more money for housing after it was named one of 11 additional cities and counties to receive a “prohousing” designation from the state for being committed to building more housing, faster.\nCities and counties that earn the prohousing designation receive additional points for state housing funding programs and are eligible for additional funding through the $25.7 million “Prohousing Incentive Pilot Program.”\nThe designation is awarded to cities and counties that implement zoning and land use policies that favor development, accelerate housing production timeframes, reduce housing and production costs, and provide financial subsidies and is another tool to use in addressing regional affordable housing supply needs.\nSan Diego County has taken numerous actions in recent years to add affordable housing and fight the housing crisis. It is currently working to build a roadmap, or Housing Blueprint, to guide its response to the housing crisis. This month, the County Board of Supervisors made $25 million available for affordable housing developments through the County’s Innovative Housing Trust Fund, administered by the County’s Housing and Community Development Services.\nIn October 2022, the County announced a goal of working with the City of San Diego to build 10,000 affordable housing units by 2030 on publicly owned land.\nThe County also spent millions of dollars and worked with numerous other cities and organizations last year to build housing to help people with low incomes, people experiencing homelessness, seniors and veterans. There were affordable housing communities in City Heights, in Carlsbad, Vista and downtown San Diego. In a first-of-its-kind project for the County, it used its own surplus property to begin transforming an empty lot into a site for low-income affordable housing.\nSince 2017, the County has leveraged about $1.9 billion in federal and state funding by investing more than $241 million on 50 affordable housing projects in 30 communities. Many are completed, others are under construction, and more are on the way.\nBeyond funding the development of housing units, the County, through its Planning & Development Services, is streamlining permitting processes, providing ADU fee waivers and pre-approved ADU plans, working to identify areas where the development of housing may be incentivized and taking other steps to facilitate housing production.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230503.15.15.26"}