{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Sudden Cardiac Arrest Took Local Mom’s Life – An Emergency Medical Team Brought Her Back", "description": "ECMO, or extracorporeal membrane oxygenation, is a medical procedure for critical care patients with life-threatening heart or lung failure. Last July, the County launched a new pilot program that uses ECMO in a new way. It is now saving the lives of people who suffer sudden cardiac arrest outside of the hospital and who would have otherwise died.", "datePublished": "2024-07-22T10:16:04-07:00", "url": "https://www.countynewscenter.com/sudden-cardiac-arrest-took-local-moms-life-an-emergency-medical-team-brought-her-back/", "keywords": ["health", "cardiac arrest", "cpr", "ecmo", "ecpr", "heart failure"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-07-22T10:20:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteECMO, or extracorporeal membrane oxygenation, is a medical procedure for critical care patients with life-threatening heart or lung failure. An ECMO machine is used to pump blood out of a patient’s body, add oxygen, remove carbon dioxide, and then pump the blood back into the body.\nIn 2022, San Diego County brought local medical leaders together to create the San Diego Resuscitation Consortium (SDRC), with the goal of saving more lives using ECMO. A new system of care was established, and last year, the County launched the “Extracorporeal Cardiopulmonary Resuscitation (ECPR)” pilot program.\nParamedics identify patients in the community and take them to one of three local hospitals, Sharp Memorial, Scripps La Jolla and Sharp Grossmont, that joined the program. In just one year, the Emergency Physicians who placed patients in full cardiac arrest outside of the hospital on ECMO, saved lives that would have without question, been lost. The program may soon become a new standard and transform cardiac arrest care worldwide.\nNot all patients suffering sudden cardiac arrest are good candidates for the program. For those who are, ECMO can bring them back from certain death. Patients like Michelle Alvarado are living proof.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240722.10.16.04"}