{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Leave Measles Out of Spring Break", "description": "The number of measles cases in the United States continues to grow this year. While a large outbreak is centered in Texas and New Mexico, there are over 400 confirmed cases across 19 states and at least two confirmed fatalities.  The best way to protect yourself and your family from measles is with a vaccine.", "datePublished": "2025-03-24T12:47:06-07:00", "url": "https://www.countynewscenter.com/leave-measles-out-of-spring-break/", "keywords": ["health", "boosters", "children", "disease", "immunization", "measles", "outbreak"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-03-24T12:47:06-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe number of measles cases in the United States continues to grow this year. While a large outbreak is centered in Texas and New Mexico, there are over 400 confirmed cases across 19 states and at least two confirmed fatalities.\nMeasles is one of the most contagious viruses in existence. It is a respiratory infection that spreads through droplets in the air when a person breathes, coughs, or sneezes. The virus can linger in the air and on surfaces for hours.\nSo far, no cases have been reported in San Diego County in 2025. But with many people taking advantage of spring break, the potential for new infections could rise and travelers should be aware.\n“If you have traveled internationally or nationally near an outbreak area and are experiencing the symptoms of measles, call your healthcare provider immediately,” said Dr. Seema Shah, Medical Director of County Epidemiology and Immunization Services. “Measles isn’t just a fever and rash.  It can be a very dangerous illness, especially for young children and babies.” \nInfants under 12 months are most at risk because they have not had their measles vaccine yet. Children over 12 months who are not immunized and people with compromised or weakened immune systems are also at high risk.  \nEven when not deadly, measles can lead to severe health complications. About one case in every 1,000 unvaccinated children is fatal. \nThe symptoms of measles include fever, cough, runny nose, red eyes and fatigue. A red rash usually appears one to four days after symptoms begin, starting at the head and then spreading to the lower body. There is no cure or treatment.  \n“The best way to prevent measles and protect your child from getting sick is with a vaccine,” said Dr. Shah. “Getting the measles vaccine is safer than getting the measles.”  \nAdults vaccinated between 1963 and 1967 should check with their healthcare provider to see if they have the most current formula. Some adults may need a booster.  \nFor more information about measles, other vaccine-preventable diseases and the shots that protect against them, visit the County’s Immunization Branch online or by phone at (866) 358-2966.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250324.12.47.06"}