{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s VAX to school time!", "description": "The start of August means summer break is coming to an end, and it is time to get the kids ready to go back to school. As families make their back-to-school to-do lists, vaccinations and well-child checkups should be top of mind, say County health experts.", "datePublished": "2022-07-27T16:22:38-07:00", "url": "https://www.countynewscenter.com/?p=209055", "keywords": ["health", "back to school", "child vaccinations", "national immunization awareness month"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-07-27T16:46:23-07:00", "articleType": "article", "articleContent": "\nThe start of August means summer break is coming to an end, and it is time to get the kids ready to go back to school.\nAs families make their back-to-school to-do lists, vaccinations and well-child checkups should be top of mind, especially since the COVID-19 pandemic caused many children miss important health checkups and recommended vaccinations.\n“As families with kids partake in fun back-to-school activities, like shopping for supplies and getting haircuts, they should also prioritize scheduling well-child checkups.” said Kelly Motadel, M.D., M.P.H, County Child Health Officer. “Doctor visits are essential to make sure our children are on track with growth and developmental milestones and with routine vaccinations. These shots can protect our kids from more than a dozen diseases.”\nAlong with kids, August is also a good time for everyone to revisit vaccine records because it is National Immunization Awareness Month (#NIAM). This annual observance highlights the importance of getting recommended vaccines throughout your life.\nVaccines for school-aged children include DTaP (diphtheria, tetanus and pertussis/whooping cough), Hep B, MMR (measles, mumps, and rubella vaccine), chickenpox, polio and more.\nAdditionally, the HPV vaccine is recommended for children ages 9 to 12, and everyone through age 26 to help prevent certain cancers and infections.\nMore information about vaccines and where to get them is available on the County website or by calling 211.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220727.16.22.38"}