{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s New Chief Geriatric Officer to Help Advance Elderhood in Region", "description": "For the first time, a Chief Geriatric Officer will help lead the County’s efforts surrounding the health and wellbeing of San Diego’s growing older adult population. ", "datePublished": "2022-10-27T09:56:26-07:00", "url": "https://www.countynewscenter.com/countys-new-chief-geriatric-officer-to-help-advance-elderhood-in-region/", "keywords": ["health", "chief geriatric officer", "geriatric", "lindsey yourman"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-10-27T10:55:22-07:00", "articleType": "article", "articleContent": "\nFor the first time, a Chief Geriatric Officer will help lead the County’s efforts surrounding the health and wellbeing of San Diego’s growing older adult population.\nLindsey Yourman, MD will fill the role of Chief Geriatric Officer, joining the County’s Health and Human Services Agency (HHSA) Medical Care Services department.\nThis position is one of the first of its kind in the state and nation for a local integrated health and human services system. HHSA Director Nick Macchione said the time was right for its creation in San Diego County.\n“In 2010, our region had about a half million residents 60 years of age or older,” said Macchione. “Since then, we have added about a quarter million more and by 2030 the older adult population is expected to surpass 900,000. The growth is even more rapid for the number of San Diegans 85 years of age and older, which will see its population is going to grow 40 percent in the next eight years. The need is here, and we are excited to add Dr. Yourman to the team which already includes a Child Health Officer.”\nDr. Yourman’s 16-year career of health advocacy, improving care systems and studying the needs of older adults is motivated by her close relationship with her grandparents.\nA graduate of Harvard College, Dr. Yourman continued her education as a Health Advocacy Fellow at the Medicare Rights Center in New York City and later attended the University of California, San Francisco Medical School.\nDr. Yourman went on to complete her Internal Medicine Residency at Scripps Mercy and Geriatric Fellowship at the University of California, San Diego, where she worked clinically in diverse settings across San Diego County and became interested in studying models of care that best serve older adults.\nSince 2015, Dr. Yourman’s work surrounding older adults has included clinical leadership of interprofessional teams to help older adults live independently and studying quality improvement and implementation science to improve health care delivery for older adults. She was the inaugural graduate and now serves as co-director of the West Health-UCSD Geriatrics Quality Improvement Science Fellowship designed to support early-stage geriatricians to pursue careers in quality improvement for older adults.\nDr. Yourman joins the County from UC San Diego, where she worked as a Primary Care Geriatrician, served as the Medical Director of Geriatrics Quality Improvement, and launched their Age-Friendly Health System’s Initiative.\n“I see the creation of the County’s Chief Geriatric Officer position as a victory for older adults and for us all as we age in San Diego County,” said Dr. Yourman. “For me, personally, it means the opportunity to apply my life’s passion, the soul and science of Geriatric Medicine, to support the health, dignity and connectedness of all of us we age.  My grandparents inspired me to go into Geriatric Medicine and I wish they were here to celebrate this.”\nThe Chief Geriatric Officer will work in HHSA’s Medical Care Services department headed by Eric McDonald, MD, MPH, Chief Medical Officer.\n“Dr. Yourman brings the County an immense wealth of knowledge, experience and expertise surrounding the unique needs of older adults,” said Dr. McDonald. “We are thrilled to have her join our team and lead the County’s vision to better serve this growing population.”\nThe addition of a Chief Geriatric Officer is part of County efforts to support the needs and celebrate the contributions of its expanding population of older adults through the Aging Roadmap, which launched in 2019 with direction from the County Board of Supervisors.\nThe Aging Roadmap is San Diego County’s regional vision and framework for supporting healthy aging for people of all ages and ensuring the needs of older adults are met when it comes to care and support, affordable housing, accessible transportation and opportunity to work and volunteer.\nAs a significant milestone in these efforts, in August of this year, San Diego became the first county in the nation where every eligible non-military hospital has earned geriatric emergency department (GED) accreditation from the American College of Emergency Physicians.\nOn the current regional efforts toward the Aging Roadmap, Macchione commented, “from transforming emergency departments and primary care clinics to building out behavioral health’s continuum of care and integrating experts on aging in our day-to-day work, the entire region is on its way to making San Diego County the national model for elderhood.”\nThe new Chief Geriatric Officer will work closely with County Aging & Independence Services and support all HHSA departments serving older adults. The CGO will advance the County’s Aging Roadmap by helping to improve coordination of health and social services, and working with local physicians to improve the detection, diagnosis and management of Alzheimer’s disease and related dementias.\nDr. Lindsey Yourman begins her new position on November 4, 2022.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221027.09.56.26"}