{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "All San Diegans 50 and Older Can Get COVID-19 Vaccine", "description": "More San Diegans will be able to get vaccinated against COVID-19 now that the state and the County have expanded eligibility to include all people between 50 and 64 years of age, the first group in Phase 2.", "datePublished": "2021-04-01T16:29:50-07:00", "url": "https://www.countynewscenter.com/all-san-diegans-50-and-older-can-get-covid-19-vaccine/", "keywords": ["health", "50 and older", "coronavirus", "covid-19", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-01T16:29:50-07:00", "articleType": "article", "articleContent": "\nMore San Diegans will be able to get vaccinated against COVID-19 now that the state and the County have expanded eligibility to include all people between 50 and 64 years of age, the first group in Phase 2.\nWhile more people now qualify for the COVID-19 vaccine, health officials are urging San Diegans to be patient since there is still a shortage of doses.\n“We know some San Diegans are anxious to get vaccinated, but we’re asking people to be patient,” said Wilma Wooten, M.D., M.P.H., County public health officer. “As we get more vaccines, it will be easier to make an appointment and get vaccinated.”\nStarting April 15, everyone between 16 and 50 years of age, the second group in Phase 2, will also qualify for the COVID-19 vaccine.\nThe state’s goal is to vaccinate 75% of people 16 and older to achieve herd immunity. That’s about 2.02 million San Diegans.\nSan Diegans wishing to get vaccinated can make an appointment by visiting www.vaccinationsuperstationsd.com. Those 65 and older can call 2-1-1 for help.\nFree COVID-19 Testing at Black Churches\nFree COVID-19 testing is now available at three churches in San Diego County through June 30.\nA new partnership between the County, the Tabernacle Community Development Corporation and the African American Community Empowerment Council launched today to offer COVID-19 testing at Bethel AME, Bayview Baptist Church and Total Deliverance Worship Center.\nWhile vaccine distribution is now underway, community-based testing remains a key strategy to reducing coronavirus transmission and mortality. Through this partnership, COVID-19 testing will be more accessible to vulnerable communities.\n“The COVID-19 pandemic is still a very dangerous part of our life. That remains especially true for the African American community,” Wooten said at a news conference to announce the partnership. “Testing is one of the most important things we can do to get back faster to the things we love.”\nCounty Public Health Officer Wilma Wooten encourages San Diegans to continue getting tested for COVID-19.\nBlack churches are well-positioned to inform the community about the importance of COVID-19 testing and to provide a known, safe space for accessing testing. The goal is to test 150 people daily at each church testing location through June 30. For more information, visit www.aacec-cal.org.\nFree COVID-19 testing is also available at many locations throughout the region. To find a walk-in site or schedule an appointment, visit coronavirus-sd.com/testing.\nVaccination Progress:\n\nNearly 1.89 million COVID-19 vaccine doses have been delivered to the region, and almost 1.73 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, over 576,000 County residents, or 21.4% of San Diegans 16 and older, are fully immunized.\nOverall, more than 956,000 County residents have received at least one shot of the two-dose vaccine. That’s 35.6% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 4.9 cases per 100,000 residents. The County is in the Red Tier.\nCurrently, the testing positivity percentage is 2.1%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 2.7% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 6.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed March 31 in a fitness/gym setting.\nFour new community outbreaks were confirmed March 30: two in grocery settings, one in a fitness/gym setting and one in a college/university setting.\nIn the past seven days (March 25 through March 31), 11 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n16,441 tests were reported to the County on March 31, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 2.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,820.\n\nCases, Hospitalizations and ICU Admissions:\n\n252 COVID-19 cases were reported to the County on March 31. The region’s total is now 270,539.\n14,855 or 5.5% of all cases have required hospitalization.\n1,642 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported March 30 or March 31. The region’s total is 3,555.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210401.16.29.50"}