{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Working with Restaurants, Healthcare Facilities, Partners to Provide Support for Boil Water Advisory", "description": "The County of San Diego is working closely with the State Water Resources Control Board Division of Drinking Water to notify impacted residents and businesses about an E. coli contamination in drinking water in some South Bay communities serviced by California-American Water, also known as Cal-Am Water.", "datePublished": "2023-08-25T17:19:14-07:00", "url": "https://www.countynewscenter.com/county-working-with-restaurants-healthcare-facilities-partners-to-provide-support-for-boil-water-advisory/", "keywords": ["health", "boil water advisory", "dehq", "emergency", "environmental health", "public health"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-08-25T23:22:10-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is working closely with the State Water Resources Control Board Division of Drinking Water to notify impacted residents and businesses about an E. coli contamination in drinking water in some South Bay communities serviced by California-American Water, also known as Cal-Am Water.\nCal-Am says the areas included in the Boil Water Advisory are portions of Imperial Beach, the City of Coronado south of Fiddler’s Cove, certain customers within the City of San Diego neighborhoods of Nestor and Otay Mesa West, and portions of Southwest Chula Vista.\nMore than 17,000 customer accounts, as many as 106,000 people, are affected by the Cal-Am Boil Water Advisory. Customers with questions can call Cal-Am Water at 1-888-237-1333 or visit www.amwater.com for more information.\nTo date, no illnesses or outbreaks have been reported associated with the contamination that led to the boil water advisory.\n“The County has been working closely with the state, the water agency and other local agencies in response to this situation,” said San Diego County Board of Supervisors Chairwoman Nora Vargas. I want to make sure that I emphasize that our County Emergency Operations Center has been activated and is setting up coordination events with all the emergency managers in the affected cities as well.\nThose residents and business that are impacted should follow the Centers for Disease Control guidance for a boil water order, which includes actions to ensure contaminated water is not consumed.  Residents are advised to use bottled water to drink, prepare food and brush teeth when possible. If bottled water is not available, they need to boil water for at least a full minute and let it cool before it is safe to use.\n“The thing you don’t want to do is basically ingest it because the bacteria that have been detected can cause gastrointestinal or diarrheal type of illnesses, but you can use the water for other purposes,” said Dr. Eric McDonald, interim HHSA director. “I would emphasize specifically that people get in trouble when they forget about their icemaker and their ice machine, if they’re brushing their teeth, or if they’re bathing small children. The small amounts that small children can inadvertently ingest can cause, again those types of illnesses, as we’ve discussed.”\nCalifornia-American Water is investigating the source of the contamination and will work with the County to ensure residents are updated.\nEnvironmental Health and Quality inspectors are reaching out to make sure the 300 impacted food facilities and restaurants are aware that it’s unsafe to prepare food, wash dishes and hands with E. coli contaminated water, and Public Health Services is notifying impacted healthcare facilities.\nIn addition, the Office of Emergency Services posted a survey for affected businesses to determine the financial impact of the advisory.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230825.17.19.14"}