{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Focus on Health Equity Saving Lives", "description": "Health equity is making sure social position doesn’t prevent people from reaching their full health potential.", "datePublished": "2021-11-08T10:02:22-08:00", "url": "https://www.countynewscenter.com/countys-focus-on-health-equity-saving-lives/", "keywords": ["health", "3-4-50", "health equity", "naomi billups"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-11-08T10:02:22-08:00", "articleType": "article", "articleContent": "\nHealth equity.\nThis goal has been a priority for the County Health and Human Services Agency for over a decade, but it has gained new attention as part of efforts to address the full spectrum of social justice.\nHealth equity is making sure social position doesn’t prevent people from reaching their full health potential.\nHHSA established the Chronic Disease and Health Equity Unit to create environments and policies to help all residents thrive and minimize the impact of chronic diseases.\nThe unit works with residents, schools, businesses, and leaders on policy to change the systems that keep some people from having a fair and equal opportunity to be healthy.\n“We’re trying to change the environment where people live,” said Naomi Billups, public health nutrition manager for HHSA. “People do not want to not be able to afford healthy food. They do not want to live in an area where their children can’t go out and play or there’s not enough access to healthy foods.”\nSince 2010, the Chronic Disease and Health Equity Unit has led the effort to build better health in the region, a component of Live Well San Diego, the County of San Diego’s vision for healthy, safe, and thriving residents and communities.\nThe goal is to reduce and prevent chronic diseases by making healthy living easier and more affordable in the places where people live, work, learn and play.\nHowever, not every neighborhood enjoys the advantages of healthy choices, such as access to fresh, locally grown food, safe physical activity options or smoke-free environments.\n“We have a duty as a government, and as people, to reverse the systems that don’t allow the same opportunity for everyone,” said Billups.\nAs an example, Billups was part of the effort to get the City of San Diego to adjust its urban agriculture ordinance. That has resulted in more community gardens and recreational facilities and residents being able to be beekeepers and raise goats and chickens in their own backyards.\nCounty public health nutrition manager keeps three goats for milk.\n“People want the ability to have hens for eggs and goats for milk,” said Billups, a City Heights resident. She is part of a small co-op that keeps three goats, several chickens and two donkeys at City Farmers Nursery, a place she visits daily to milk the goats, collect the eggs and clean their pens. Billups says she gets all the milk and eggs she needs and the extras she gives to people in her community.\n3-4-50\nBillups was recently named the 2021 Community Change Agent by RISE San Diego. She received the award in partnership with the Nonprofit Institute at the University of San Diego.\n“I am very humbled,” said Billups. “The award gives me hope, but there’s tons more to be done.”\nBillups received the award for her effort to have a positive impact in the three behaviors that lead to chronic disease.\nTobacco use, poor nutrition, and physical inactivity contribute to four major chronic diseases — cancer, heart disease and stroke, type 2 diabetes, and lung disease — that lead to more than 50 percent of deaths in the county, a concept referred to as “3-4-50.”\nIn 2010, about 57 percent of San Diegans were dying from the four major conditions. Eleven years later and thanks in part to Live Well San Diego and the Chronic Disease and Health Equity Unit, that figured has dropped seven percentage points.\n“We’re seeing some progress in the fight against chronic disease, but thousands of San Diegans are still dying from these preventable diseases,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Small changes can make a big difference in individuals, families and communities and can lead to a better quality of life.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211108.10.02.22"}