{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pop Quiz: Are You Doing Enough to Avoid Lithium-Ion Battery Fires?", "description": "Lithium-ion battery fires are at an all-time high, according to the San Diego Fire Hazardous Materials Team. These batteries store a large amount of energy and pose a threat if not disposed of properly. They can overheat, catch fire, or even explode.", "datePublished": "2023-08-18T13:28:55-07:00", "url": "https://www.countynewscenter.com/pop-quiz-are-you-doing-enough-to-avoid-lithium-ion-battery-fires/", "keywords": ["environment", "environmental health", "lueg", "recycling"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-08-18T13:28:55-07:00", "articleType": "article", "articleContent": "\nLithium-ion battery fires are at an all-time high, according to the San Diego Fire Hazardous Materials Team.\nYou can find rechargeable lithium-ion batteries in cordless power tools, cordless vacuums, laptops, cell phones, cameras, electric bicycles and electric scooters, to name a few.\nThese batteries store a large amount of energy and pose a threat if not disposed of properly. They can overheat, catch fire, or even explode.\n“Lithium battery fires can be extremely hazardous to firefighters for several reasons. These fires can produce a large amount of heat, flames, and toxic gases,” said CAL FIRE Capt. Brent Pascua. “The fact that these fires will have a sometimes-violent reaction to water, make these fires extremely dangerous and unpredictable.”\nDisposal of rechargeable lithium-ion batteries in the trash or recycling is illegal. Improper disposal of these batteries cause many trash truck and recycling facility fires.\nWhen disposing of rechargeable lithium-ion batteries, remember the following:\n\nBuy used devices listed by a qualified testing laboratory.\nFollow the manufacturer’s instructions for charging and storage.\nDo not charge any device under your pillow, on your bed, on a couch, in a closet or out of plain sight.\nDo not keep a battery on a charger if it is fully charged.\nAlways use the manufacturer’s cord and power adapter made for that device.\nKeep batteries and devices at room temperature.\nDo not place batteries in direct sunlight.\nKeep batteries away from anything flammable.\nStore batteries in an area that has a smoke detector.\nStore batteries in an area that is well ventilated and away from entry and exit doors.\n\nAre you ready to test your knowledge? Here’s a quiz from the County’s Department of Environmental Health and Quality.\nWhat should you do if a battery overheats?\nA. Continue to use it until the battery dies.\nB. Turn it off, count to 10, then turn it back on.\nC. Stop using it immediately.\nD. Put it in a bag of rice.\n \nAnswer: C. If a battery overheats, or you notice an odor, change in shape or color, leaking or odd noises – STOP USING IT IMMEDIATELY! If it’s safe to do so, move the device outside away from anything that is flammable and call 9-1-1.\nWhat’s the proper way to remove or dispose of rechargeable lithium-ion batteries?\nA. Throw them in the trash.\nB. Dispose of lithium-ion batteries at a recycling location, recycling event or contact the Household Hazardous Waste for help.\nC. Throw them in your recycling bin at home.\nD. Contact the Department of Animal Services for help.\n \nAnswer: B. It is illegal to discard rechargeable lithium-ion batteries in the trash or recycling. Improper disposal of batteries cause many trash truck and recycling facility fires. To help the environment, dispose of lithium-ion batteries at a recycling location, recycling event or contact the Household Hazardous Waste for more information.\nWhy do lithium-ion batteries fail?\nA. Mechanical.\nB. Electrical.\nC. Thermal.\nD. All of the above.\n \nAnswer: D. Physical damage to the battery or manufacturing defects can cause mechanical failures. Electrical failure occurs when using the wrong charging device, short circuits, overcharging or when the voltage point is critically low due to over-discharging. Thermal failure happens when the battery overheats, which can impact other batteries in the device.\nHow do you prevent lithium-ion battery fires?\nA. Unplug the device.\nB. Properly store & dispose of the battery.\nC. Regularly inspect devices for any signs of battery damage.\nD. All of the above.\n \nAnswer: D. When you’re not using a device, unplug it from the charger or power source. Store devices with lithium-ion batteries in a cool and dry place, away from direct sunlight, extreme heat or humidity. Only use the manufacturer approved charging device. Check the charging cables and connectors for any visible damage. If a device has undergone physical trauma, inspect it for any signs of internal damage to the battery.\nWhat are the results of lithium-ion battery failure?\nA. Fires/Explosions.\nB. Hazardous Waste.\nC. Release of toxic gases.\nD. A cloudy day.\nE. Everything except answer D.\n \nAnswer: E. Do not dispose of these batteries in the trash! If batteries are not disposed of properly, they can catch fire in the trash truck or recycling facility. Fires and explosions can lead to the release of hazardous toxic, flammable and corrosive gases. An increase in fires can result in serious injuries and property damage.\n\nWith these helpful tips, you can raise awareness about the safe ways to charge, store and dispose of rechargeable lithium-ion batteries.\nTo help the environment, dispose of lithium-ion batteries at a recycling location, recycling event or contact the Household Hazardous Waste for more information.\nHave a recycling question? Email Recycle@sdcounty.ca.gov or call the Recycling Hotline: (877) R-1-EARTH (877-713-2784)\nTo learn more about hazardous waste materials, visit the County’s Department of Environmental Health and Quality website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230818.13.28.55"}