{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County Public Health Officials Report 17 Percent Rise in TB Last Year", "description": "County Public Health officials are reporting a 17 percent increase in active tuberculosis (TB) cases in San Diego County. ", "datePublished": "2024-03-05T13:31:30-08:00", "url": "https://www.countynewscenter.com/county-public-health-officials-report-17-percent-rise-in-tb-last-year/", "keywords": [], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-03-05T13:31:30-08:00", "articleType": "video.other", "articleContent": "\nReading Time:  2 minutesIn Summary:\n\nCases of TB are up in San Diego County.\nTB symptoms could include a lasting cough, fever, night sweats and unexplained weight loss. \nTreatment is available if you have a TB infection or are sick with TB.\n\nCounty Public Health officials are reporting a 17 percent increase in active tuberculosis (TB) cases in San Diego County. \nIn 2023, 243 cases of TB were reported, exceeding the average of 205 cases in 2021 and 2022. Over the last 10 years, reported cases have ranged from an annual high of 264 in 2019 and a low of 193 in 2020. \nTB is a disease that is passed through the air from person to person when someone who is sick with TB coughs, speaks, sings or breathes.  \nTB cases in recent years declined during the pandemic, likely because of multiple factors. Some COVID-19-related precautions such as masking and social distancing, may have reduced TB transmission as well.  People may also have missed getting diagnosed or it may have taken longer to see a doctor because of strains on the healthcare system or changes in their own care-seeking behaviors.  \nMore than 175,000 people in San Diego County are believed to have latent TB infection, and most do not know it. Without preventive treatment, as many as 10 percent of people with latent TB infection may go on to get sick with active, contagious TB disease. \nTuberculosis Prevention Efforts \nThe County Board of Supervisors approved the San Diego TB Elimination Initiative in 2020 to end TB in San Diego.  \nThrough collaboration with 25 public-private partnerships including schools, medical providers, and community groups, the initiative works to promote TB prevention, through screening, testing, and treatment particularly for those most at risk of TB.  \nTo expand the efforts of this work, the County is hosting the San Diego TB Prevention Education and Community Engagement Summit at the Southeastern Livewell Center on March 22, 2024.  \nThose in the medical community and healthcare organizations are encouraged to attend and participate.  \nProviders can learn whether their patients might have risks for TB infection by answering questions from the San Diego TB Control Branch’s risk assessment tool. Those identified as having risk factors should get tested for TB. \nSymptoms of TB could include lasting cough, fever, night sweats and unexplained weight loss. \n“If you or a loved one have TB symptoms or think you may have been around someone with TB, it’s important that you call your doctor or healthcare provider and get tested,” said Wilma Wooten, M.D., County public health officer. “We are seeing more cases of TB, not just in San Diego County, but around the state. We all need to be aware of the symptoms and take action quickly so that we can stop the spread of TB and protect ourselves, our families and our communities.” \nMedicines are available to cure people who are sick with TB and to help prevent people from getting sick if they test positive for TB but do not have symptoms. This is called latent TB infection (LTBI)and means people are infected with TB but the infection is “sleeping,” and they do not have active TB disease. A chest x-ray can help determine if a person has LTBI. \nThe County operates a TB Clinic at the North Central Public Health Center, 5055 Ruffin Rd. Public Health Services also offers testing at regional public health centers throughout the County. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240305.13.31.30"}