{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Defender Seeks Nominations for Remarkable Teens", "description": "The San Diego County Public Defender is looking for the community’s help in identifying the region’s most remarkable young people for this year’s third annual installment of the “25 Most Remarkable Teens in San Diego” program.", "datePublished": "2021-08-10T13:53:54-07:00", "url": "https://www.countynewscenter.com/county-public-defender-seeks-nominations-for-remarkable-teens-2/", "keywords": ["public safety", "public defender s office", "remarkable teen", "teens", "youth"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-08-10T13:53:54-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Public Defender is looking for the community’s help in identifying the region’s most remarkable young people for this year’s third annual installment of the “25 Most Remarkable Teens in San Diego” program.\nInitiated in 2019, the program highlights youths ages 13 through 19 who are phenomenal at something they do. Some of the categories for this year’s awards include community service, leadership, writing, art, innovation and the courage to overcome adversity.\nThe goal of the program is to celebrate teens for their positive accomplishments and showcase the many ways they contribute to the success of their community.\n“Celebrating the contributions of young people is particularly meaningful this year as we are transitioning out of the COVID-19 pandemic,” said Public Defender Randy Mize. “We are confident there are many untold stories of youth demonstrating courage, spirit and unparalleled tenacity and we hope to hear some of those stories in the community nominations we receive for the Most Remarkable Teens 2021.”\nAll nominees will receive a certificate of recognition for the honor of being nominated. The 25 teens who are selected for the award will be featured on County News Center.\nThe nomination form and list of award categories are available here.\nNominations must be completed and submitted no later than Sept. 21. The form can be emailed to connie.howard@sdcounty.ca.gov or can be mailed to Connie Howard, San Diego County Public Defender Youth Council, 451 A St., Suite 1480, San Diego, CA 92101.\nCheck out last year’s Most Remarkable Teens for some examples of what the selection committee is looking for.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210810.13.53.54"}