{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Teams Up With MIT Global Research Center", "description": "The County has been chosen to team up with a Massachusetts Institute of Technology global research center, which will provide technical assistance on the evaluation of a County pilot program aiming to keep low-income seniors from becoming homeless.", "datePublished": "2023-11-29T11:08:54-08:00", "url": "https://www.countynewscenter.com/county-teams-up-with-mit-global-research-center/", "keywords": ["government", "homeless housing", "housing for seniors", "oepa"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-11-29T11:08:54-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego has been chosen to team up with a Massachusetts Institute of Technology (MIT) global research center, which will provide technical assistance on the evaluation of a County pilot program aiming to keep low-income seniors from becoming homeless.\nThe County’s Office of Evaluation, Performance and Analytics (OEPA) will work with the Abdul Latif Jameel Poverty Action Lab (J-PAL) at MIT, also known as J-PAL North America. Together they will design a data-based “randomized evaluation” of the County’s Shallow Rental Subsidy Program.\nThe program looks to keep low-income seniors from becoming homeless by paying them a rent subsidy.\nRicardo Basurto-Dávila is the head of OEPA. He said the evaluation is just the kind of deeper data analysis the County wants to do to better assess programs and improve policies.\n“We’re excited to partner with J-PAL,” said Basurto-Dávila. “This evaluation will help us understand if senior incentives work, if they keep people housed, and give us data about how to move forward.”\nThe Shallow Rental Subsidy Program was approved by the County’s Board of Supervisors in 2022. It is managed by the Department of Homeless Solutions and Equitable Communities in the County’s Health and Human Services Agency.\nThe program is providing $500-a-month subsidies to low-income seniors who are rent-burdened and at risk of becoming homeless. The subsidies will be paid to the people’s landlords for 18 months. The people in the program were selected by a random selection process from a pool of qualified applicants.\nA simple evaluation of the program would just track the people receiving the subsidies and record how many of them were able to remain in their homes. The randomized study will also measure and compare outcomes for people who receive the subsidies against a similar group of seniors who did not receive them.\n“This comparison gives us more confidence that the results of the study will reflect the actual impact of the program,” Basurto-Dávila said.\nThe County created the Office of Evaluation, Performance and Analytics in 2021 to use modern analytics to sift through the County’s vast collection of data in new ways; to look for patterns, trends and associations that can help leaders improve programs, services and policies.\nThat particularly includes top priorities including homelessness, mental health, equity and racial justice.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231129.11.08.54"}