{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisor Vargas, Parks Officials Reopen Expanded Lincoln Acres County Park", "description": "County Supervisor Nora Vargas, County Parks officials, National City fire officials and others held a family-friendly grand reopening and dedication of Lincoln Acres County Park Saturday, Aug. 28.", "datePublished": "2021-08-28T14:56:13-07:00", "url": "https://www.countynewscenter.com/supervisor-vargas-parks-officials-reopen-expanded-lincoln-acres-county-park/", "keywords": ["parks and rec", "county parks and recreation", "lincoln acres", "live well", "park improvements", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-08-28T15:03:09-07:00", "articleType": "article", "articleContent": "\nCounty Supervisor Nora Vargas, County Parks officials, National City fire officials and others held a family-friendly grand reopening and dedication of Lincoln Acres County Park Saturday.\nThe neighborhood park, nestled just in front of the County’s Lincoln Acres branch library at 2717 Granger Ave. in the community of Lincoln Acres in National City, has been expanded in size to 1 ½ acres and equipped with new conveniences.\nImprovements include two gazebos, covered picnic tables, a community garden, drinking fountain and water refilling station, and restrooms. The surfacing of the park’s existing playground was also upgraded. The park already provided families in the neighborhood with a children’s playground, basketball courts, restrooms and a community room.\n“With new acreage and more equitable amenities and access, Lincoln Acres County Park has become a more desirable, prominent place for real community connection,” Supervisor Vargas said. “It’s important that we continue to prioritize projects like this; projects that support walkable and inclusive play spaces for small, densely populated communities like Lincoln Acres.”\nVargas, National City Fire Chief Frank Parra and County Parks Director Brian Albright opened Saturday’s event with a brief presentation, followed by an outdoor open house for a couple hundred members of the public who attended the event.\nFormer County Supervisor Greg Cox, who represented the area before Supervisor Vargas, also attended. The presentation included a dedication of a memorial plaque honoring the Lower Sweetwater Fire Protection District.\nThe open house included fun things for all ages, including animal “touch tables” with skulls, animal skins and live animals, an instructor-led exercise station, a planting workshop, plant-pot painting, photo opportunities with a National City fire engine. The County’s Live WoW (Well on Wheels) resource bus was also at the event, in addition to sheriff’s officials and local authors of a “Lincoln Acres Centennial Book.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210828.14.56.13"}