{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Health Officials Report Love Your Heart Screened More Than 46,000 People", "description": "San Diego County released its annual Love Your Heart report Tuesday, showing the February blood-pressure screening campaign alerted 473 people they were in imminent medical danger and warned nearly 22,000 others they could be vulnerable to serious illness and death from heart disease, stroke and COV...", "datePublished": "2022-08-02T15:02:42-07:00", "url": "https://www.countynewscenter.com/?p=209110", "keywords": ["government"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-08-02T15:02:42-07:00", "articleType": "article", "articleContent": "\nSan Diego County released its annual Love Your Heart report Tuesday, showing the February blood-pressure screening campaign alerted 473 people they were in imminent medical danger and warned nearly 22,000 others they could be vulnerable to serious illness and death from heart disease, stroke and COVID-19.\nCounty Board of Supervisors Chair Nathan Fletcher, Board Vice Chair Nora Vargas, County public health officials and others gathered at the County Administration Center Tuesday for a Love Your Heart recognition event.\nThe annual Love Your Heart campaign, held each February, urges people to ‘know their numbers’ by getting their blood pressure screened and promotes education about the dangers of high blood-pressure. Also known as hypertension, high blood-pressure is often referred to as a “silent killer” because most people who have it do not show symptoms.\nCounty officials said Tuesday this year’s campaign tested the blood pressure of more than 46,000 people, online, and in person at more than 287 sites in San Diego County and Mexico, between Feb. 12 and Feb. 20.\nOfficials said the screenings found 473 people with “crisis levels” of high blood pressure, giving them the opportunity to get immediate help. They also found another 21,813 people with higher-than-normal levels―giving them an early warning to lose weight, eat healthier, reduce stress and exercise more to avoid heart attacks or even death.\nHigh blood pressure is a major risk factor for strokes and heart disease, the leading cause of death in the U.S. More than 4,000 people in the county die each year of heart disease or stroke.\nHigh blood pressure also continues to be the most common underlying condition identified in San Diego County’s COVID-19 associated deaths.\nNick Macchione, agency director of the County’s Health and Human Services Agency, said the County’s Love Your Heart campaign has reduced local deaths associated with preventable health threats including heart disease by 7% over the past 11 years.\nHe said the campaign has accomplished that by helping residents know their blood pressure levels and make healthy life choices, including eating healthier, exercising more and reducing stress. Macchione said the annual campaign was a public health success that is helping make San Diego County a healthy, safe and thriving place to live.\nOfficials said this year’s Love Your Heart campaign reached more than 7.5 million people, through the combined mediums of print, radio, billboard, transit and social media. It gave community partners more than 6,000 blood pressure monitors to give to underserved residents and supplied Love Your Heart educational packets at all COVID-19 testing sites. The campaign also reached more than 500 people through community events including the Refugee & Newcomer Fair.\nTo see the full Love Your Heart report, go to the County Live Well San Diego’s Love Your Heart webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220802.15.02.42"}