{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Keep Holiday Celebrations Small, Short, Safe", "description": "Given the surge in cases and hospitalizations due to COVID-19, County health officials are urging San Diegans to keep Thanksgiving and other holiday celebrations small, short and safe.", "datePublished": "2020-11-23T17:02:09-08:00", "url": "https://www.countynewscenter.com/holiday-celebrations-small-short-safe/", "keywords": ["health", "coronavirus", "covid-19", "holiday gatherings", "thanksgiving"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-23T17:03:16-08:00", "articleType": "article", "articleContent": "\nGiven the surge in cases and hospitalizations due to COVID-19, County health officials are urging San Diegans to keep Thanksgiving and other holiday celebrations small, short and safe.\n“There should be a small number of people and gatherings should be short in duration,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We are asking people to please follow the public health guidance to provide a safe experience for everyone attending the gathering.”\nGatherings with members of your own household represent a lower risk of getting and passing COVID-19. But if you’re going to gather, Wooten said you should take precautions to lower the spread of the novel coronavirus.\nThe smaller the better, and the health order calls for no more than three households, with gatherings outside when possible. They should be short and not last longer than two hours. And attendees should be safe and wear a face covering when not eating or drinking, maintain social distance, and practice good hand hygiene.\n“If you are sick, stay home and avoid any non-household gathering or event,” Wooten said.\nThe County has issued COVID-19 guidance for Thanksgiving and other upcoming holidays.\nOther recommendations include:\n\nRemote events with family and friends, such as a virtual dinner, sharing recipes, a virtual turkey trot or online game\n\nTelevised or live streaming events at home with members of your own household\nOutdoor orchards, food markets, and seasonal craft fairs where state guidanceis followed\n\n\n\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure of case rate or testing positivity to assign tiers regarding what activities are permitted. Indoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed.\nThe County’s state-calculated, adjusted case rate is currently 10.7 cases per 100,000 residents and the region is in Purple Tier or Tier 1 for that metric.\nThe testing positivity percentage is 4.3%, placing it in Tier 3 or the Orange Tier for that metric.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.2% and it’s in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance.\nThe California Department of Public Health announced that tier assignments, typically given each Tuesday, may now occur any day of the week and may occur more than once a week.\n\nCommunity Setting Outbreaks:\n\n13 new community outbreaks were confirmed on Nov. 22: four in retail settings, three in restaurant settings, two in business settings, two in restaurant/bar settings, one in a government setting and one in a construction setting.\n10 community outbreaks were confirmed Nov. 21: two in restaurant/bar settings, two in business settings, two in retail settings, one in a restaurant setting, one in a distribution warehouse setting, one in a healthcare setting and one in a residence setting.\n12 community outbreaks were confirmed Nov. 20: two in restaurant/bar settings, two in business settings, two in retail settings, one in a fitness/gym setting, one in a hotel/resort/spa setting, one in an adult daycare setting, one in a faith-based setting, one in a healthcare setting and one in a distribution warehouse setting.\nIn the past seven days (Nov. 16 through Nov. 22), 61 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n22,117 tests were reported to the County on Nov. 22, and the percentage of new laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 20,138.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n1,167 new cases were confirmed among San Diego County residents on Nov. 22, the second highest one-day total. The region’s total is now 72,815.\n4,414 or 6.1% of all cases have required hospitalization.\n994 or 1.4% of all cases and 22.5% of hospitalized cases had to be admitted to an intensive care unit.\nA new COVID-19 case rate mapshows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nNo new deaths were reported in the County on Nov. 22. The region’s total remains at 968.\nTwo new deaths were reported Nov. 21. Two men died between Nov. 10 and Nov. 12 and their ages ranged from early 60s to mid-90s. Both had underlying medical conditions.\nSix new deaths were reported Nov. 20: Five men and one woman died between Nov. 12 and Nov. 19 and their ages ranged from early 50s to mid-80s. All had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201123.17.02.09"}