{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board Accepts $24 Million for COVID-19 Response in High-Risk Populations, Receives Vaccine Survey Results", "description": "The County Board of Supervisors today received the results of a new local survey with details about why some are still hesitant to get vaccinated and approved an investment of $24 million in federal funds to support COVID-19 response in high-risk communities.", "datePublished": "2021-07-13T16:27:35-07:00", "url": "https://www.countynewscenter.com/county-board-accepts-24-million-for-covid-19-response-in-high-risk-populations-receives-vaccine-survey-results/", "keywords": ["health", "coronavirus", "covid-19", "more covid funding", "survey results"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-07-13T17:04:46-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today received the results of a new local survey with details about why some are still hesitant to get vaccinated and approved an investment of $24 million in federal funds to support COVID-19 response in high-risk communities.\nFirst, the Board received an update on COVID-19 rates in San Diego County.\nThe number of local COVID-19 cases has been rising the past few weeks, increasing the case rate from 1.9 cases per 100,000 residents on June 15 to 3.7 cases per 100,000 residents now. The daily case count increased to 355 on July 12 and has been at or above 200 for the last seven days.\n“We are now seeing about double the number of cases that were being reported a month ago,” said Wilma Wooten, M.D., M.P.H., County public health officer. “This has led to a 46% increase in hospitalizations and 10% uptake in intensive care unit admissions in the past few weeks. We expect further increases in ICU admissions since they lag behind the trend in cases and hospitalizations.”\nCOVID-19 variant cases also are increasing. Ten variants have been identified in the region, four of them having been designated as variants of concern, including the Delta variant. To date, 107 cases of the Delta variant have been reported in the region.\nVaccine Survey Findings \nThe Board also received an update on the second countywide vaccine confidence survey. The survey was conducted between June 13 and 24 to determine the most common concerns among residents who are reluctant to get a COVID-19 vaccine.\nThe survey identified three focus areas:\n\nCounty residents who received their first shot of the COVID-19 vaccine and are overdue for their second dose\nResidents who are hesitant about getting the vaccine because they feel they do not have enough trusted information\nSan Diegans who are vaccine resistant\n\nResidents who stated they were unlikely to get vaccinated were most concerned about potential side effects of the vaccines. Another common concern was that vaccine development was rushed.\nThe survey also showed a divide among race/ethnicity and gender lines. Close to half of the men who responded to the survey said they were likely to eventually get vaccinated, while only one-third of women planned to get vaccinated. About half of all respondents of color said they were likely to get the vaccine, while nearly two-thirds of white respondents said they were unlikely to do so.\nThe findings of the survey were shared with the medical community last week to better help physicians and providers address patient concerns surrounding vaccinations. The County is in the process of tailoring messaging, creating tools, and working with its partners to increase access to information in areas with low vaccination rates.\nMore Funding to Fight COVID-19\nThe Board also voted to accept more than $24 million in federal funds to address COVID-19 in high-risk populations and communities.\nThe funds from the Centers for Disease Control and Prevention will be used to develop and implement strategies to improve the local COVID-19 response and prevention capacity through testing, tracing and vaccination in populations that are underserved and at high risk for COVID-19, including racial and ethnic minority groups and people living in rural communities.\nThe County COVID-19 Health Disparities Project, a collaboration with community partners and contracted service providers, will also help to improve public health data systems and access to health and social services, reduce health disparities and expand health equity in vulnerable populations and communities.\nAdditionally, the Board authorized the acceptance of $4.5 million in funding from the State to expand the Community Health Worker model to work with local community groups to provide COVID-19 vaccination assistance, communications and outreach.\nThe Board also took another step on a spending plan to provide housing, direct payments and legal assistance to people experiencing homelessness or are at risk of losing their home.\nAnother goal is to expand the Safe Haven transitional housing program in the City of San Diego, which is designed around the Board’s harm reduction strategies to reduce the negative consequences associated with drug use. The expansion of the program will cost about $4.6 million and calls for having three separate sites with up to 25 beds.\nThe County will also evaluate options to develop a plan to provide direct stimulus payments to children and youth living with foster care families.\nAdditionally, today’s action allows the County to expand by $10 million legal services for those facing eviction, and $5 million for coordinated eviction prevention services.\nThese actions align with the County’s Live Well San Diego vision by expanding critical behavioral health services to vulnerable populations and taking further action to continue to ensure people and families throughout the region have housing and other services to support their health and well-being.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210713.16.27.35"}