{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Surpasses 800,000 COVID-19 Cases Since Start of Pandemic", "description": "More than 800,000 COVID-19 cases have been reported in the San Diego region since the start of the pandemic, the County Health and Human Services Agency reported today.", "datePublished": "2022-06-09T16:14:11-07:00", "url": "https://www.countynewscenter.com/?p=208737", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-06-09T16:17:33-07:00", "articleType": "article", "articleContent": "\nMore than 800,000 COVID-19 cases have been reported in the San Diego region since the start of the pandemic, the County Health and Human Services Agency reported today.\nThe County has recorded a total of 803,293 cases of the virus since the first local case was identified in March 2020.\nWeekly average coronavirus cases have more than tripled in the past 30 days. Hospitalizations are also on the rise.\n“The somber milestone and recent spike in cases should serve as a reminder this isn’t the time to let our guard down,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Please, make sure you’re up to date on your vaccinations and boosters, and consider a mask, especially if you’re medically vulnerable yourself or may be around people who are.”\nMasking is particularly important when traveling or moving through crowded indoor spaces, as is avoiding large gatherings.\nCounty health officials stress that vaccination and boosters continue to be the best defense against COVID-19 and associated hospitalizations or death.\nBoosters are available for everyone age five and older. Those 50 and older, and those who are moderately or severely immunocompromised, are encouraged to get a second booster four months after their initial booster.\nTreatment Options\nSan Diegans who test positive for COVID-19 can access monoclonal antibody treatment and antiviral drugs free of charge, regardless of health insurance or immigration status.\nAntiviral drugs are administered over the course of several days in pill form. They are available to patients with mild-to-moderate COVID-19 symptoms who are at risk of progressing to severe coronavirus disease, including hospitalization or death.\nMonoclonal antibody therapies are used to treat mild-to-moderate COVID-19 in adults and children 12 years and older.\nAntiviral pills must be prescribed by a health care provider and started within five days of symptoms to be effective. Monoclonal antibodies must be started within seven days.\n“The available treatments are safe and effective and lower the risk of severe illness and hospitalization by nearly 90 percent,” Kaiser said.\nYou may be eligible for treatment if you:\n\nTested positive for COVID-19; and\nHave symptoms of COVID-19, but not for more than 10 days; and\nAre at high risk for developing severe illness from COVID-19.\n\nTo learn more about all treatment options, visit the County’s COVID-19 Treatment page.\nVaccination Progress:\n\nReceived at least one shot: More than 2.97 million or 94.4% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.63 million or 83.6%.\nBoosters administered: 1,343,505 or 58.7% of 2,287,929 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n12 additional deaths were reported since the last report on June 2. The region’s total is 5,315.\nOf those 12 additional deaths, eight were women and four were men. They died between Feb. 4, 2022 and June 5, 2022; four of the deaths occurred in the past two weeks.\nNine of the people who died were 80 years or older, two were in their 70s and one was in their 60s.\nFive of the people who died were fully vaccinated and seven were not fully vaccinated.\n11 had underlying medical conditions and one did not have underlying medical conditions.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n4,428 COVID-19 cases were reported to the County in the past three days (June 6 – June 8, 2022). The region’s total is now 803,293.\n10,370 cases were reported in the past week (June 2-June 8) compared to 8,563 infections identified the previous week (May 26-June 1).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 38.41 for people fully vaccinated and boosted, 22.35 for fully vaccinated people and 71.95 for not fully vaccinated San Diegans.\n10,544 tests were reported to the County on June 4, and the percentage of new positive cases was 10.9% (Data through June 4).\nThe 14-day rolling percentage of positive cases, among tests reported through June 4, is 10.0%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220609.16.14.11"}