{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Remains in High-Risk COVID Level", "description": "COVID-19 activity remains high in the region, the County Health and Human Services Agency reported today.", "datePublished": "2022-08-04T17:58:24-07:00", "url": "https://www.countynewscenter.com/?p=209159", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-08-04T17:58:24-07:00", "articleType": "article", "articleContent": "\nCOVID-19 activity remains high in the region, the County Health and Human Services Agency reported today. The Centers for Disease Control and Prevention moved San Diego County to the high-risk level for COVID-19 three weeks ago and cases continue to trend high.\nThe CDC’s high-risk community level means COVID-19 is widespread throughout the region and San Diegans should continue taking precautions to slow the spread of the virus. You should:\n\nWear a mask indoors when in public,\nGet all the vaccine doses and boosters,\nStay home if you are sick and get tested,\nAvoid crowded places, and\nTake other precautions, such as washing your hands and staying away from people who are visibly sick.\n\nThe County continues to follow the California Department of Public Health’s SMARTER plan, which recommends vaccination, use of masks, testing and treatment among other things.\n“San Diegans should do what they can to slow the spread of COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “If you feel sick, stay home, get tested for COVID-19 and talk to your doctor about treatment options.”\nGot COVID? Get Treatment\nTreatment is available and can help prevent severe infection, but it is important to seek help as soon as possible to see if it’s right for you.\nTreatment centers and medical offices in the region may offer oral antiviral pills, such as Paxlovid and/or monoclonal antibodies delivered as an intravenous infusion. A provider will determine what treatment option is best for each individual patient based on their symptoms, age and potential underlying conditions.\nTreatment is available to individuals who meet the U.S. Food and Drug Administration’s guidelines for the medications, including those who are at high risk for developing severe COVID-19:\n\nAdults age 50 or older,\nPeople of color,\nLower economic status,\nPeople with underlying condition(s), and\nUnvaccinated San Diegans.\n\nTo determine which treatment is best for you, talk to your doctor or health care provider, or call 2-1-1 to find a provider.\nVaccination Progress:\n\nReceived at least one shot: Over 3.0 million or 89.9% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: Close to 2.66 million or 79.4%.\nBoosters administered: 1,424,581 or 58.5% of 2,435,363 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n15 additional deaths were reported since the last report on July 28. The region’s total is 5,424.\nOf the 15 additional deaths, six were women and nine were men. They died between July 11 and July 31, 2022; 14 deaths occurred in the past two weeks.\nSix of the people who died were 80 years or older, eight were in their 70s and one was in their 60s.\n13 were fully vaccinated and two were not.\n13 had underlying medical conditions and two had medical history pending.\n\nCases, Case Rates and Testing:\n\n3,728 COVID-19 cases were reported to the County in the past three days (Aug. 1 to Aug. 3, 2022). The region’s total is now 891,394.\n9,495 cases were reported in the past week (July 28 through Aug. 3) compared to 11,362 infections identified the previous week (July 21 through July 27).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 56.80 for people fully vaccinated and boosted, 36.79 for fully vaccinated people and 111.77 for not fully vaccinated San Diegans.\n8,942 tests were reported to the County on July 30, and the percentage of new positive cases was 13.7% (Data through July 30).\nThe 14-day rolling percentage of positive cases, among tests reported through July 30, is 14.4%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220804.17.58.24"}