{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supervisors Approve Appointment of New Chief Administrative Officer", "description": "The County Board of Supervisors voted unanimously Tuesday to appoint Ebony Shelton as the new Chief Administrative Officer. Shelton is the first Afro-Latina in County history to serve in the role. She will start her new position June 14.", "datePublished": "2024-06-04T12:05:54-07:00", "url": "https://www.countynewscenter.com/county-supervisors-approve-appointment-of-new-chief-administrative-officer/", "keywords": ["government", "board of supervisors", "chairwoman nora vargas", "chief administrative officer", "ebony shelton", "helen robbins-meyer", "interim cao sarah aghassi", "supervisor monica montgomery steppe"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-06-05T10:36:34-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County Board of Supervisors voted unanimously Tuesday to appoint Ebony Shelton as the new Chief Administrative Officer (CAO). Shelton is the first Afro-Latina in County history to serve in the role. She will start her new position June 14.\nShelton is a visionary leader who has dedicated her career to serving the community, most recently in a dual role as the County’s chief financial officer and as a deputy chief administrative officer, overseeing the departments in the County’s Finance and General Government group.\n“Ebony has the vision, the talent and the expertise to serve our residents and support working families as the Chief Administrative Officer,” said Board Chairwoman Nora Vargas. “She has nearly 30 years of experience working for the County and is a native San Diegan who is committed to our communities.”\nThe County’s CAO is responsible for implementing the Board’s policies and running the County’s daily operations, including more than 20,000 employees who serve nearly 3.3 million people in the region.\nThe County provides many services across the region, such as food and restaurant inspections, beach and bay water testing, elections, social services, health programs, foster care, adult protective services and more.\nIn addition, the County provides city-type services for those who live outside of the region’s 18 cities in the unincorporated area, including law enforcement and fire protection, and maintenance of parks, libraries and roads.\n“I am deeply honored by the Board’s approval and the opportunity to lead the County team in service of our residents,” said Shelton. “I am committed to driving positive change and fostering a future of prosperity, inclusivity and resilience for all in the region.”\nSarah Aghassi currently serves as the interim Chief Administrative Officer. She was unanimously selected by the Board to serve as the interim during the recruitment process. Aghassi previously led the departments in the Land Use and Environment group as the deputy chief administrative officer and general manager. She has been with the County for over 18 years.\nAghassi took the role after former CAO Helen Robbins-Meyer retired in the beginning of January. She applied for the role knowing that the Interim CAO would not compete or be chosen for the permanent role. Aghassi did not apply for the permanent job as CAO.\n“We extend our sincerest gratitude to Sarah for her exemplary service as interim CAO during this critical transitional period. Sarah’s dedication, leadership and unwavering commitment have been invaluable to our County organization,” said Supervisor Monica Montgomery Steppe.\nShelton began her career with the County in 1997 at the age of 19 as a payroll clerk, earning consistent promotions in various human resource and financial roles, including the director of the Office of Financial Planning where she guided financial planning policies and coordinated the creation of the County’s annual multi-billion-dollar budget.\nHer leadership paved the way for her most recent position overseeing several departments and offices and managing the County’s fiscal financial functions.\nAs an Afro-Latina, Shelton is proud of her Black and Salvadoran ancestry. She understands the impacts of history on Black and Latino communities, and the importance of equity for all San Diego County residents.\n“The people that we serve, they are my lifelong friends and my family, and I understand explicitly how the decisions that we make here on a day-to-day basis impact the life, liberty and justice, of not just my friends and family, but all San Diegans,” said Shelton.\nShelton holds an Undergraduate Degree in Business Administration from the University of Phoenix and an Executive Master’s Degree in Public Administration with an emphasis in Public Sector Leadership from California State University at Northridge.\nIn her personal time, Shelton enjoys spending time with her husband and three daughters.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240604.12.05.54"}