{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches Respiratory Virus Surveillance Report", "description": "The County of San Diego Health and Human Services Agency is introducing a new combined Respiratory Virus Surveillance Report that will provide San Diegans with a detailed snapshot of common respiratory illness activity in the region on a weekly basis.", "datePublished": "2022-10-20T18:12:49-07:00", "url": "https://www.countynewscenter.com/?p=209812", "keywords": ["health", "coronavirus", "covid-19", "flu", "influenza", "respiratory virus surveillance report"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-10-21T16:39:57-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is introducing a new combined Respiratory Virus Surveillance Report that will provide San Diegans with a detailed snapshot of common respiratory illness activity in the region on a weekly basis.\nThe new report will be released each Thursday and contains, for now, both flu and COVID-19 activity, including cases, outbreak information and deaths. The report contains graphs and tables that allow the community to compare illness activity this year to activity during prior seasons.\nThe Respiratory Virus Surveillance Report replaces the separate Influenza Watch and COVID-19 Watch reports the County released previously.\n“The new report paints a more comprehensive picture of respiratory illness activity in the region,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The report is a one-stop-shop for community members and healthcare providers, and we will continue to update it with new features in the future, as necessary.”\nSan Diegans can sign up for the report here, or access it on the County of San Diego COVID-19 website and Influenza website.\nBivalent Boosters For Children 5 And Older\nThe California Department of Public Health recently updated its emergency use authorization of the bivalent COVID-19 boosters in California to include younger children. Eligibility for the Pfizer-BioNTech bivalent booster now extends to individuals 5 years of age and older and eligibility for the Moderna bivalent booster now extends to individuals 6 years of age and older.\nThese bivalent boosters are available through healthcare providers, at participating pharmacies, and at County public health centers. Parents should visit the state’s My Turn website to schedule an appointment.\nBivalent boosters were designed to protect individuals from the worst outcomes of COVID-19, including hospitalization and death. Everyone 5 years of age and older who has had their primary vaccination series is eligible to get the updated booster two months following any COVID vaccine or booster dose.\nVaccination Progress:\n\nClose to 2.69 million or 80.4% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBoosters administered: 1,480,105 or 60.0% of 2,467,279 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n10 additional deaths were reported since the last report on Oct. 13, 2022. The region’s total is 5,517.\nOf the 10 additional deaths, two were women and eight were men. They died between Jan. 29, 2022 and Oct. 5, 2022. One of the newly reported deaths occurred in the last two weeks.\nFour of the people who died were 80 years or older, three were in their 70s and three were in their 50s.\nEight received at least the primary series of the vaccine and two had not.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n1,591 COVID-19 cases were reported to the County in the past seven days (Oct. 11 to Oct. 17, 2022). The region’s total is now 927,970.\nThe 1,591 cases reported in the past week were slightly lower compared to the 1,855 infections identified the previous week (Oct. 4 to Oct. 10, 2022).\n4,710 tests were reported to the County on Oct. 15, and the percentage of new positive cases was 4.0% (Data through Oct. 15).\nThe 14-day rolling percentage of positive cases, among tests reported through Oct. 15, is 3.9%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221020.18.12.49"}