{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Marks Overdose Awareness Day: “No one has to Die”", "description": "Standing in front of 645 placards representing every person who died by accidental drug overdose in San Diego County last year, County and other officials said Monday these deaths did not have to happen — and no one else has to die.", "datePublished": "2020-08-31T13:17:05-07:00", "url": "https://www.countynewscenter.com/county-marks-overdose-awareness-day-no-one-has-to-die/", "keywords": ["public safety", "drug deaths", "overdose deaths", "prescription drug deaths"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-09-01T13:31:43-07:00", "articleType": "article", "articleContent": "\nStanding in front of 645 placards representing every person who died by accidental drug overdose in San Diego County last year, County and other officials said Monday these deaths did not have to happen — and no one else has to die.\nCounty Supervisor Kristin Gaspar, County District Attorney Summer Stephan, County Behavioral Health Director Dr. Luke Bergmann, law enforcement, drug prevention and healthcare officials gathered at the County Administration Center Monday morning to commemorate International Overdose Awareness Day.\nThe annual global event was created in 2001 to raise awareness of overdose deaths, reduce the stigma attached to them and acknowledge the grief of victims’ families and friends.\nCollectively, the speakers said overdose deaths were increasing locally and victims could be anyone of any ethnicity and background — mothers, fathers, sons, daughters, friends, rich, poor, old, young. They said law enforcement was crucial, but that society must collectively realize substance abuse disorder was a disease that can, and must, be beaten.\nAnd they urged people to act, to get help by calling the County’s Access and Crisis line (1-888-724-7240) or 2-1-1 San Diego; to safely get rid of old prescription drugs at biannual Prescription Drug Take Back days or by taking them to local Sheriff’s offices and fire stations; and to learn more about the overdose crisis at the San Diego Opioid Project.\nGaspar called on parents to go to their medicine cabinets to get rid of old prescription drugs that children can get to.\n“Immediately, first step,” Gaspar said, “look in your medicine cabinet. Anything in there, expired, unused meds — we need to make every day prescription (drug) takeback day in San Diego County. Those can go immediately to your Sheriff’s department … to a fire station, disposed of properly. They are dangerous.”\nStephan and others said overdose deaths plague San Diego County like the rest of the nation. She said fentanyl deaths in particular have become a rising problem, due in part to drug dealers “lacing” other various illegal drugs with deadly fentanyl. She said fentanyl-related deaths have increased in San Diego County from 152 in all of 2019, to 203 in just the first six months of 2020.\nDr. Bergmann said that the COVID 19 pandemic has exacerbated the problem because people who are stressed and turning to substance abuse feel disconnected from care. But he said advancements in telehealth means that anyone can get help, and he urged people who were struggling, or who had loved ones struggling with addiction issues to call.\n“If you can get access to a phone,” Bergmann said, “you can get care. And there’s not a better day, I would say, to begin a recovery journey than today.”\nSome of the other comments from Monday’s speakers included:\n\nGaspar said she strongly supported the Methamphetamine Strike Force and Prescription Drug Abuse Task Force initiatives, and that the County’s new $6.5 billion budget directed $100 million to address COVID and all its impacts. Gaspar said that included an additional $15 million for technology needed for behavioral health such as telehealth, outreach and engagement, and workforce recruitment and retention.\nUS Attorney Robert Brewer Jr. said federal law enforcement was doing everything in its power to disrupt and dismantle drug traffickers and their networks. But he added “we can’t enforce and incarcerate our way out of this supply-demand-addiction cycle.” Brewer said partnerships between state, local and community agencies and groups were critical and urged everyone to work together to “hammer home” the message that overdose is preventable and drug addiction is a treatable disease.\nStephan said the District Attorney’s Office prosecutes drug dealers but also protects the public through awareness and outreach through initiatives like the Opioid Project.\nBergmann said people can and do recover from substance abuse disorder. He said the County Health and Human Services Agency provides services and help to more than 111,000 county residents of all ages. Bergmann said the County’s nine programs work with justice partners hospitals, community health centers and other community-based providers to improve, expand and introduce new methods to help those in need.\n\nThe most poignant comments came from Pam Summerfruit, who identified herself simply as “the parent of an overdose drug victim.”\nSummerfruit said that a week before Thanksgiving in 2016 her 26-year-old son died of a fentanyl overdose after taking an illegally obtained dose of what he thought was Percocet, a pain medication. Summerfruit said her son’s dealer pleaded guilty and was sentenced for manslaughter. But her son is still gone.\n“We’re left,” Summerfruit said, “like so many other families, to remember our loved ones and to act by spreading the word on this international Overdose Awareness Day that overdose death is preventable.”\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200831.13.17.05"}