{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tijuana River Valley Pollution Survey Completion Rate Passes 1,000 Mark", "description": "A new survey asking San Diegans how Tijuana River sewage pollution has impacted their lives hit a milestone this weekend when the thousandth form was completed. ", "datePublished": "2024-11-04T16:25:09-08:00", "url": "https://www.countynewscenter.com/tijuana-river-valley-pollution-survey-completion-rate-passes-1000-mark/", "keywords": ["health", "ace survey", "cdc", "sewage", "south san diego", "tijuana river"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-11-04T16:26:35-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA new survey asking San Diegans how Tijuana River sewage pollution has impacted their lives hit a milestone this weekend when the thousandth form was completed. \nThis signifies the halfway mark, as the goal is to see at least 2,000 respondents complete the survey. The current milestone was achieved sooner than anticipated and those eligible to respond who haven’t yet completed the survey are encouraged to act now.  \n“We are really grateful to the public for this response,” said Dr. Seema Shah, County Interim Deputy Public Health Officer. “Teams have been doing outreach door-to-door, at community events, through social media and with our partners in schools, businesses, health centers and community organizations and asking to share the ACE survey widely. There are still many voices to be heard so I ask anyone who is eligible to please take 20 minutes to share their experiences. We need to gather as much information as possible so that further next steps can be identified and taken to address this crisis.” \nThe Assessment of Chemical Exposures (ACE) survey is for people who work, live or have visited the areas most impacted. It asks about physical and mental health effects from the area’s sewage pollution, health services used and medical history. Pet health is also included in the survey. \nThe County opened the ACE survey on Oct. 21. in partnership with the federal Agency for Toxic Substances and Disease Registry which is a branch of the Centers for Disease Control and Prevention (CDC). It followed the CDC’s Community Assessment for Public Health Emergency Response or CASPER, a household survey focused on the Imperial Beach and Nestor communities that took place the weekend of Oct. 17. \nBoth surveys examine lifestyle and health effects of people in the southern part of the County. \nThe CASPER was designed to assess the impact of the sewage crisis by visiting people in their homes in the South Region and doing in-person interviews. \nThe ACE survey is available online for anyone who lives, works or spends time in the areas around the Tijuana River Valley, Nestor and up to Coronado and allows for anyone who did not have the opportunity to be interviewed during the CASPER to also share their information about exposures during the crisis. \nThe ACE survey is open through Nov. 22 and can be accessed at this link. It takes about 20 minutes to complete and is completely confidential and voluntary. Parents and guardians can also take the survey for their children who are minors.  \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241104.16.25.09"}