{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Booster Shots Available for Immunocompromised", "description": "San Diegans with moderately to severely compromised immune systems can get a booster shot of the COVID-19 vaccine to fight waning immunity.  ", "datePublished": "2021-08-18T16:24:16-07:00", "url": "https://www.countynewscenter.com/covid-19-booster-shots-available-for-immunocompromised/", "keywords": ["health", "boosters", "coronavirus", "covid-19", "immunocompromised", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-08-19T14:20:58-07:00", "articleType": "article", "articleContent": "\nSan Diegans with moderately to severely compromised immune systems can get a booster shot of the COVID-19 vaccine to fight waning immunity.\nThe Centers for Disease Control and Prevention (CDC) announced the recommendation late last week because these people are more susceptible to severe disease from the virus. When making the recommendation, the CDC provided a very specific list of conditions for people who should receive the additional dose.\n“San Diegans who are immunocompromised should speak with their doctor to determine the best course of action,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The best protection against COVID-19 is the vaccine and a third dose will help most people with compromised immune systems from developing severe illness from the virus.”\nThe estimated immunocompromised population in San Diego County is about 26,000. The County has begun working on vaccine plans to meet the guidance being drafted by the CDC for an expansion of additional doses in late September. No details are available currently.\nIn the meantime, Wooten continued to urge unvaccinated San Diegans to get their first dose and for those due a second dose to not delay. The Delta variant, which is more contagious, continues to drive up the number of cases being reported in the region.\n“The COVID-19 vaccine is the best way to get us out of this pandemic,” Wooten said. “Get vaccinated now to avoid getting sick and passing the virus to others, especially people who are more vulnerable to the disease.”\nThe COVID-19 vaccine is available at medical providers, retail pharmacies, community clinics and County public health centers for people who do not have a medical provider. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\nVaccination Progress:\n\nDoses administered: More than 4.45 million.\nReceived at least one shot: About 2.36 million or 84.2% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Over 2.06 million or 73.6%.\nThe goal: vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 112.2% of the goal population has received at least one vaccine and 98.1% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nDeaths:\n\n16 new deaths were reported since the last report on Aug. 11. The region’s total is 3,834.\n11 men and five women died between July 29 and Aug. 15, 2021.\nTwo were 80 years of age or older, five were in their 70s, four were in their 60s, two were in their 50s, two were in their 40s and one was in their 30s.\n13 had underlying medical conditions and three had medical history pending.\n\nCases, Case Rate and Testing:\n\n1,117 COVID-19 cases were reported to the County on Aug. 17. The region’s total is now 318,152.\nSan Diego County’s case rate per 100,000 residents is 28.7 overall, 6.0 for fully vaccinated people and 55.7 for not fully vaccinated San Diegans.\n16,329 tests were reported to the County on Aug. 17, and the percentage of new positive cases was 6.8%.\nThe 14-day rolling percentage of positive cases among tests is 7.5%.\n\nCommunity Setting Outbreaks:\n\n43 new community outbreaks were confirmed in the past seven days (Aug. 11 through Aug. 17): 12 in business settings, eight in TK-12 grade school settings, six in restaurant/bar settings, four in health care settings, three in daycare/preschool/childcare settings, three in retail settings, two in hotel/resort/spa settings, one in a faith-based setting, one in a government setting, one in a restaurant setting, one in a fitness/gym setting and one in a community-based setting.\n\n\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m. on Wednesdays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210818.16.24.16"}