{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "People at Holiday Gatherings Urged to Get Tested for COVID-19", "description": "It’s important that you get tested and decrease unnecessary activities this week to avoid spreading the virus.", "datePublished": "2020-11-30T17:03:22-08:00", "url": "https://www.countynewscenter.com/people-at-holiday-gatherings-urged-to-get-tested-for-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "thanksgiving testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-30T17:03:22-08:00", "articleType": "article", "articleContent": "\nIf you traveled or gathered with people outside your household over the Thanksgiving holiday weekend, you were at higher risk of having contracted COVID-19 and could inadvertently be spreading it.\nThat’s why it’s important that you get tested and decrease unnecessary activities this week to avoid spreading the virus.\n“By getting tested, people will know whether they have contracted COVID-19 and prevent spreading the virus to others,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should also wear a face covering, maintain social distance, avoid crowds and monitor for symptoms.”\nThe County operates more that 50 testing sites throughout the region. All COVID-19 tests are free and most of the sites do not require an appointment.\nFor more information on testing, visit 211sandiego.org or call 2-1-1.\nCounty public health nurse administers a COVID-19 test.\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure of case rate or testing positivity to assign tiers regarding what activities are permitted. Indoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed.\nThe County’s state-calculated, adjusted case rate is currently 15.6 cases per 100,000 residents and the region is in Purple Tier or Tier 1 for that metric.\nThe testing positivity percentage is 4.7%, placing it in Tier 3 or the Orange Tier for that metric.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 9.3% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health announces tier assignments at least once a week.\n\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed on Nov. 29: three in business settings, one in a restaurant setting, one in a faith-based setting, one in a healthcare setting and one in a grocery setting.\nNine community outbreaks were confirmed Nov. 28: four in business settings, one in restaurant setting, one in a retail setting one in a daycare/preschool/childcare setting, one in a government setting and one in an emergency services setting.\n16 community outbreaks were confirmed Nov. 27: five in business settings, three in restaurant/bar settings, three in retail settings, one in a restaurant setting, one in a grocery setting, one in a faith-based setting, one in a daycare/preschool/childcare setting and one in a healthcare setting.\n10 community outbreaks were confirmed Nov. 26: two in restaurant/bar settings, two in business settings, two in retail settings, two in restaurant settings, one in a grocery setting and one in a daycare/preschool/childcare setting.\n12 community outbreaks were reported Nov. 26: three in business settings, two in restaurant/bar settings, one in government setting, one in a grocery setting, one in a retail setting, one in a food/beverage processing setting, one in a construction setting, one in a faith-based setting and one in an other setting.\nIn the past seven days (Nov. 22 through Nov. 28), 79 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n15,348 tests were reported to the County on Nov. 29, and the percentage of new laboratory-confirmed cases was 6%.\nThe 14-day rolling average percentage of positive cases is 6.1%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,378.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n959 new cases were confirmed among San Diego County residents on Nov. 29. The region’s total is now 82,043.\n4,635 or 5.6% of all cases have required hospitalization.\n1,019 or 1.2% of all cases and 22% of hospitalized cases had to be admitted to an intensive care unit.\nA COVID-19 case rate mapshows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nNo new deaths were reported in the County on Nov. 29. The region’s total is now 997.\nOne death was reported to the County on Nov. 27: a man in his late 80s died in mid-November and had underlying medical conditions.\nEight deaths were reported Nov. 25. Seven men and one woman died between Nov. 11 and Nov. 24 and their ages ranged from late 40s to mid-90s. All but one had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n \n \n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201130.17.03.22"}