{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Budget Deliberations and Adoption Tuesday", "description": "The County Board of Supervisors will hold deliberations, and then adopt a budget for Fiscal Year 2023-24 on Tuesday. Supervisors will consider a revised budget that includes proposed changes to the recommended budget that was released in May.", "datePublished": "2023-06-23T14:07:27-07:00", "url": "https://www.countynewscenter.com/county-budget-deliberations-and-adoption-tuesday-2/", "keywords": ["government", "2023-24 change letter", "2023-24 recommended budget", "budget adoption", "budget deliberations", "deliberations", "revised budget", "revised recommended budget"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-06-23T15:45:40-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors will hold deliberations, and then adopt a budget for Fiscal Year 2023-24 on Tuesday.\nSupervisors will consider a revised budget that includes proposed changes to the recommended budget that was released in May.\nThe original budget plan includes funding to address homelessness, mental health and substance use disorders, the justice system; help for working families and continued investment in core services like roads, fire protection and parks.\nThe revised recommended budget adds $60.6 million or an increase of 0.7 percent to the May plan for a total of $8.17 billion. That is an increase of $806.4 million or 11 percent from last year.\nIt includes another 50 positions, with the majority assigned to the County initiative of removing barriers to housing. The 0.2 percent increase brings the total of County employees to 20,387.25 staff years, an increase of 539.75 staff years from last year.\nThe revised plan also includes more funding to address the housing crisis, special election costs, an upgrade to the regional communication system, two mobile service center vehicles for the Probation Department, road safety improvements and more.\nThe County’s budget was built on community input, and residents were invited to departmental budget presentations at a Board meeting on May 11, two community budget meetings the following week and two budget hearings in June.\nThe public is also welcome to attend, watch, listen and participate in the budget deliberations and adoption starting at 9 a.m. on Tuesday.\nAttend the Meeting in Person\nThe meeting will take place in room 310 at the County Administration Center located at 1600 Pacific Highway, San Diego, CA 92101.\nSpanish language translation services for public speakers are available at Board meetings. Arabic, Chinese (Mandarin), Korean, Persian (including Farsi, Dari), Somali, Spanish, Tagalog (including Filipino), and Vietnamese translations of the overall proceedings are also available upon request at least 72 hours prior to the meeting. Contact the Clerk’s office at (619) 531-5434 or email PublicComment@sdcounty.ca.gov.\nWatch Online\nThe live stream broadcast online may be delayed by 45-seconds or more depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo Livestream\nCounty YouTube Channel (Closed captioning available)\nFacebook Live\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nAT&T U-Verse Channel 99\n\nListen on the Phone\n\nCall in to (619) 531-4716 for a listen-only line to the live Board meeting while it is in session.\n\nComment by Phone\n\nTo speak during the live meeting by phone, fill out the Board of Supervisors tele-comments form and submit it before the meeting starts. After submitting the form, you will receive instructions on how to call in to the meeting.\n\nFor more information, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230623.14.07.27"}