{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Be Like Santa, Double-Check Your Receipts", "description": "The holiday season is the perfect time to remind everyone to remember to always, always double-check your receipts to make sure you’re not accidentally overcharged by faulty cash registers and price scanners.", "datePublished": "2024-11-25T10:26:28-08:00", "url": "https://www.countynewscenter.com/be-like-santa-double-check-your-receipts/", "keywords": ["consumer", "ag weights and measures", "check receipts", "holiday shopping", "lueg"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-11-25T11:36:39-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesBreak out your wallets and purses—but protect them too—the holiday shopping season is back!\nThe holiday season is the perfect time to remind everyone to remember to always, always double-check your receipts to make sure you’re not accidentally overcharged by faulty cash registers and price scanners.\nThe holidays are definitely the shop-shopping-est time of the year. And even though online buying has gotten huge, most of us are still heading off to our local stores to buy stuff. According to the U.S. Census Bureau’s E-Commerce Second Quarter 2024 report, online sales made up 15.2% of all retail sales. That means most of us are still going to, and spending money in, shopping malls and stores.\nAnd being overcharged can happen.\nThe County’s department of Agriculture, Weights and Measures inspects more than 1,420 local businesses and 21,400 price-scanning devices every year to make sure customers are being charged accurately. That includes scales that charge for items by weight, and other price-setting equipment.\nAnd every year, even the best businesses have occasional overcharges.\nIn 2024, between January and October, 19% of every business inspected—nearly one out of every five—had overcharge errors. And the average overcharge was $1.52. An extra buck-and-a-half doesn’t sound like much. But even tiny overcharges can add up to make big dents in your wallet or purse, especially during the holiday shopping season.\nSo, take a lesson from Santa! Check your receipts; check ‘em twice. That will help make sure your holiday season is merry and nice.\nHere are some other tips to help you shop smartly and safely:\nProtect Against Overcharging:\n\nAlways verify receipts and immediately notify store management of any price discrepancies.\nStores are required to display the price of an item, as you are buying it, before the transaction is complete. Watch the display screen as your items are scanned.\nTake sales advertisements with you when shopping to verify prices.\nKnow that stores cannot legally charge more than their lowest advertised, posted or quoted price.\n\nShop Smart:\n\nPlan ahead. Start watching for store sale flyers, flea markets, garage sales, clearance sales, etc.\nMake a list of what you need.\nComparison shop with at least five different sources for the best values.\nDon’t buy everything at once. Establish a spending plan and timetable to buy what you need over several weeks or months to take full advantage of future sales and true bargains.\nDownload and use the County’s Tell Us Now app to contact Agriculture, Weights and Measures, or call AWM at 1-888-TRUE SCAN (1-888-878-3722) or email to wm.awm@sdcounty.ca.gov to report overcharges you can’t resolve with a store.\n\nFor more information, go to Agriculture, Weights and Measure’s Consumer Protection webpage. And you can check out our archived video about scanner inspection program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241125.10.26.28"}