{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Stepping Up Health Order Enforcement", "description": "The County has stepped up its enforcement efforts to make sure businesses and other entities are following the local health order.", "datePublished": "2020-11-19T17:07:31-08:00", "url": "https://www.countynewscenter.com/county-stepping-up-health-order-enforcement/", "keywords": ["health", "coronavirus", "covid-19", "curfew"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-20T09:13:46-08:00", "articleType": "article", "articleContent": "\nIndoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed as part of efforts to curb the spread of COVID-19.\nThat is why the County has stepped up its enforcement efforts to make sure businesses and other entities are following the local health order.\nTo date, the County has issued more than 70 cease and desist and closure orders to local businesses and organizations for failure to comply. Over 40 of those were served this week.\nWhen a business or entity is reported, the County investigates and determines whether to issue a cease and desist order. If one is issued, and the entity continues to violate the local health order, a closure notice is issued. A list of cease and desist and closure orders is available at the County’s corovavirus site.\n“We are ramping up and enhancing compliance as well as testing given the surge in cases,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We have not seen numbers like these in the course of the pandemic.”\nAdditionally, all local law enforcement agencies have been asked to help enforce the local health order.\nThe San Diego County Sheriff’s Department will be sending enforcement teams throughout the region to help ensure the public health guidance is followed. The teams will first encourage compliance but will issue citations if necessary.\nSan Diegans are encouraged to report businesses or entities that are not following the local health order. Reports can be anonymous.\nThey can do it by calling (858) 694-2900 or emailing at SafeReopeningComplianceTeam@sdcounty.ca.gov\nCurfew Ordered for Counties in Purple Tier\nThe state has issued a limited curfew for all counties in the Purple Tier of its COVID-19 risk assessment system, which includes San Diego County.\nStarting Nov. 21, non-essential work and gatherings must cease from 10 p.m. to 5 a.m. The curfew will last for 30 days.\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure – case rate or testing positivity – to assign tiers.\nThe County’s state-calculated, adjusted case rate is currently 10.7 cases per 100,000 residents, placing it in that metric’s Purple Tier.\nThe testing positivity percentage is 4.3%, placing it in that metric’s Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.2% and it’s in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to less restrictive tiers.\nThe California Department of Public Health announced that tier assignments, typically given each Tuesday, may now occur any day of the week and may occur more than once a week.\n\nCommunity Setting Outbreaks:\n\nFive new community outbreaks were confirmed on Nov. 18: two in restaurant/bar settings, two in business settings and one in a retailer.\nIn the past seven days (Nov. 12 through Nov. 18), 36 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n12,811 tests were reported to the County on Nov. 18, and the percentage of new laboratory-confirmed cases was 7%.\nThe 14-day rolling average percentage of positive cases is 4.9%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 14,920.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n899 new cases were confirmed among San Diego County residents on Nov. 18. The region’s total is now 68,140.\n4,303 or 6.3% of all cases have required hospitalization.\n975 or 1.4% of all cases and 22.7% of hospitalized cases had to be admitted to an intensive care unit.\nA new COVID-19 case rate map shows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nSeven new deaths were reported in the County on Nov. 18. The region’s total is now 952.\nSix men and one woman died between Nov. 15 and Nov. 17. Their ages ranged from early 30s to mid-90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201119.17.07.31"}