{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What’s New For In-Person Voters In Gubernatorial Recall Election", "description": "San Diego County voters who choose to cast their votes in person in the Sept. 14 Gubernatorial Recall Election will notice a few differences. Voting locations will be open Sept. 11 through Election day.", "datePublished": "2021-09-08T10:47:25-07:00", "url": "https://www.countynewscenter.com/whats-new-for-in-person-voters-in-gubernatorial-recall-election/", "keywords": ["elections", "ballot marking device", "gubernatorial recall election", "registrar of voters", "rov"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-09-08T10:47:25-07:00", "articleType": "article", "articleContent": "\nSan Diego County voters who choose to cast their votes in person in the Sept. 14 Gubernatorial Recall Election will notice a few differences. Voting locations will be open Sept. 11 through Election Day.\nWhere to Vote\nVoters won’t be tied or assigned to a specific voting location. That means any voter can find their ballot and cast their vote at any of the 221 in-person voting locations open across the county. Voters can find the most convenient voting location for them to cast their vote by checking the Registrar’s Voting Locations Finder map and typing in their address or location.\nCasting your Vote\nEveryone voting in person will cast their votes on touch-screen ballot marking devices that will print out a paper ballot with their choices that they can review before placing them in the official ballot box to be counted on election night.\nThe device prints out a ballot with the voters’ selections, but does not store, tabulate or count any votes.\nThe ballot marking devices, which the County has used in previous elections, are fully compliant with the Americans with Disabilities Act. In addition to English, voters can select a translated ballot in one of the County’s four federally covered languages: Spanish, Filipino, Vietnamese and Chinese. The ballot marking devices also allow voters to change text size to make reading easier or  use the headphones with an audio ballot and handheld controller for voters with a visual impairment.\nA poll worker will start a voter’s session by activating the device. Voters choose the language and make their selections by touching the screen next to voting choices. Voters can review their choices and make corrections if necessary on-screen, then tap “print ballot” to print it out. After reviewing their selections, voters can place their ballots in the secrecy sleeve or envelope given to them by the poll worker and may place it in the ballot box or give it to a poll worker to place in the ballot box for them. See step-by-step images of the process.\nKeeping the Public Safe\nMany of the 221 voting locations, such as schools, will require voters to wear face coverings when voting inside, regardless of their vaccination status. Voters can check to see which voting locations require face coverings before they head out. If you forget your face covering, poll workers will have one to give to you. Voters who are unable to wear a face covering will be able to vote outside.\nIf you plan to vote at the Registrar of Voters Office, or to drop off your mail ballot at a drop-off location, the County has put protocols in place to ensure the health and safety of voters, election workers and observers. They include:\n\nAll unvaccinated voters, observers and election workers must wear face coverings. Outdoor accommodations will be made available for voters who are unable to wear one.\nAll vaccinated voters, observers and election workers are strongly encouraged to wear face coverings.\nHand sanitizer will be readily available for everyone entering and exiting facilities.\nMasks and gloves will be available for all voters and visitors.\nPlexiglass barriers will be in use at the Registrar’s office and all voting locations.\nControlled path of travel when entering and exiting.\nFrequently touched objects and surfaces will be regularly cleaned/disinfected.\n\nVoters who have received mail ballots can still save themselves the trip and mark their ballot from home. Be sure to sign and date the return envelope, seal your completed ballot inside and mail it or return it to a mail ballot drop-off location or voting location.\nYou can confirm your ballot was received by the Registrar’s office at sdvote.com.\nTo learn more about voting in the upcoming recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210908.10.47.25"}