{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Affordable Housing Development in San Ysidro Celebrates a Grand Opening", "description": "Milejo Village, a new affordable housing development in San Ysidro, celebrated an official grand opening today. Located at 429 West San Ysidro Boulevard, the project features 64 one-, two- and three-bedroom homes with wrap-around supportive services to seniors and families facing homelessness and mental health challenges. ", "datePublished": "2023-11-02T17:18:36-07:00", "url": "https://www.countynewscenter.com/affordable-housing-development-in-san-ysidro-celebrates-a-grand-opening/", "keywords": ["health", "affordable housing", "innovative housing trust fund", "milejo village", "no place like home funding", "permanent supportive housing", "senior housing"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-11-02T17:18:36-07:00", "articleType": "article", "articleContent": "\nMilejo Village, a new affordable housing development in San Ysidro, celebrated an official grand opening today.  \nLocated at 429 West San Ysidro Boulevard, the project features 64 one-, two- and three-bedroom homes with wrap-around supportive services to seniors and families facing homelessness and mental health challenges. \nThe housing was built in partnership between the County of San Diego, San Diego Housing Commission and Jamboree Housing Corp. The County invested $6.7 million in the project through No Place Like Home Funding and the Innovative Housing Trust Fund.  \nMilejo Village offers permanent supportive housing to families and individuals with incomes at or below 25% of the Area Median Income (AMI) or $34,450 per year for a family of four.  \nOn-site amenities include a large community center and kitchen, a computer lab, laundry facilities, pet washing room, outdoor courtyard with a BBQ and dining area, a tot lot and parking. The homes are also close to grocery stores, public transportation, community parks, health centers and educational resources. \nPeople who live at Milejo have access to onsite case management and counselors along with the opportunity to participate in ESL classes, life skills training, job training, financial empowerment, after-school programs for youth, healthcare accessibility, nutrition and exercise classes and resident goal plans. \nMilejo Village is currently 100% occupied. For more information on how to apply for Jamboree Housing please visit their website. \nThis is the County’s sixth affordable housing development ribbon cutting of 2023. In addition, the County has been a partner in breaking ground on nine additional affordable housing projects so far this year. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231102.17.18.36"}