{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Close to COVID-19 Vaccination Milestone", "description": "With almost 2.1 million San Diegans having gotten at least one shot of the COVID-19 vaccine, the County is continuing to get closer to herd immunity.", "datePublished": "2021-06-11T18:00:55-07:00", "url": "https://www.countynewscenter.com/county-close-to-covid-19-vaccination-milestone/", "keywords": ["health", "coronavirus", "covid-19", "herd immunity", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-06-14T08:43:59-07:00", "articleType": "article", "articleContent": "\nWith almost 2.1 million San Diegans having gotten at least one shot of the COVID-19 vaccine, the County is continuing to get closer to herd immunity.\nTo date, a total of 2,098,135 San Diegans 12 and over have received at least one vaccine. That’s 99.8% of San Diego County’s current goal to fully vaccinate 2,101,936 – 75% – of eligible residents, thereby reducing the likelihood of COVID-19 infection in San Diegans who can’t or won’t get vaccinated. Currently, a total 1,728,882 or 82.3% of the goal population are fully vaccinated.\n“The more people who get vaccinated and achieve immunity, the more protected we’re all going to be,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Go get vaccinated now so that we can go back to doing the things we love.”\nSan Diegans who have not gotten vaccinated have plenty of incentives, including Padres tickets, $50 and opportunities for other prizes.\n“The pandemic is not over. Get vaccinated now to protect yourself and others,” Wooten said.\nVaccination Progress:\n\nDoses delivered: More than 4.2 million.\nDoses administered: Over 3.86 million.\nReceived at least one shot: Over 2.1 million or 74.9% of San Diegans 12 and older.\nFully vaccinated: Nearly 1.73 million or 61.7%.\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people.\nTo date, 99.8% of the goal population has received at least one vaccine and 82.3% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 1.2 cases per 100,000 residents, placing the County in the Yellow Tier.\nThe testing positivity percentage is 1.1% and the County is in the Yellow Tier.\nThe health equity metric is 1.3%, placing the County in the Yellow Tier.\nThe state’s metric system will be retired June 15.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed June 10.\nIn the past seven days (June 4 through June 10), three community outbreaks were confirmed.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nTesting:\n\n10,145 tests were reported to the County on June 10, and the percentage of new positive cases was 0.9%.\nThe 14-day rolling average percentage of positive cases is 0.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 9,121.\n\nCases, Hospitalizations and ICU Admissions:\n\n92 COVID-19 cases were reported to the County on June 9. The region’s total is now 281,143.\n15,460 or 5.5% of all cases have required hospitalization.\n1,712 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nTwo new deaths were reported June 10. The region’s total is 3,768.\nTwo men in their 70s and with underlying medical conditions died May 29 and June 3.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210611.18.00.55"}