{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Agriculture Tops $1.8 Billion in New Crop Report", "description": "Agriculture values topped $1.8 billion for the first time since 2014 in the County of San Diego’s annual Crop Report that covers the 2020 growing season, overcoming decreases in many crop values and reported mixed effects of the coronavirus pandemic.", "datePublished": "2021-08-12T09:36:11-07:00", "url": "https://www.countynewscenter.com/agriculture-tops-1-8-billion-in-new-crop-report/", "keywords": ["agriculture", "agriculture", "crop report", "crops", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-08-12T13:01:46-07:00", "articleType": "article", "articleContent": "\nAgriculture values topped $1.8 billion for the first time since 2014 and just the third time in 30 years in the County of San Diego’s annual Crop Report that covers the 2020 growing season, overcoming decreases in many crop values and reported mixed effects of the coronavirus pandemic.\nThe total value of all agriculture crops and commodities rose just 0.8% in the new Crop Report. But that was enough to push total values from $1,795,528,573 in 2019 to $1,810,326,411.\nIt was the fourth time in the past five Crop Reports that overall agriculture values increased, and the third time since 1990 that total values topped $1.8 billion in San Diego County. Values exceeded $1.8 billion in both 2013 and 2014.\nThe overall increase in 2020 was boosted by gains from the two largest groups of crops grown in the county — Nursery & Cut Flower Products, which account for 70% of all crop values; and Fruit & Nut Crops, which account for 19% of all crop values.\nNursery & Cut Flower Products increased 2%, from $1.25 billion to $1.27 billion. Fruit & Nut Crops increased 0.7%, from roughly $342 million to $344 million.\nA smaller agriculture group, Forest Products, which includes timber and firewood, increased 1.5% from $855,154 in 2019 to $868,398.\nBut the other four crop groups decreased ­— Vegetable & Vine Crops, Field Crops, Apiary Products and Livestock and Poultry.\nThe largest of those groups, Vegetable & Vine crops, which account for 7% of total agriculture values, decreased 6.3%, from roughly $131 million to $122 million. It marked the fourth decline for Vegetable & Vine crops in the past five reports.\nThe report stated that the effects of the coronavirus pandemic appeared to be mixed. Some growers reported labor shortages and business closures; others suggested the people staying home because of the pandemic may have increased demand for items such as bedding plants, perennials, and indoor flowering and foliage plants.\nAmong the individual crops, the county’s king of the annual Top 10 list continued to be Ornamental Trees & Shrubs despite a 3% decrease in total value.\nOrnamental Trees & Shrubs decreased from $445 million in 2019 to $432 million, but still edged out the number two crop, Bedding Plants, Color & Herbaceous Perennials, Cacti & Succulents, at $431.8 million.\nSan Diego County’s most well-known crop, Avocados, remained in fourth place on the Top 10 list, increasing in value in 2020 by 9.2%, from nearly $140 million to nearly $153 million, after increasing nearly 16% in 2019.\nThe rest of the Top 10 crops remained relatively similar to past years. Oranges and Livestock and Poultry exchanged places, with Oranges falling from the seventh spot to eight, and Livestock and Poultry rising from eight to seven.\nThe annual Crop Report is compiled by the County’s Department of Agriculture, Weights and Measures and can be seen online. The report provides a yearly snapshot of an industry that remains a staple of the region’s economy despite challenges like drought, rising water costs, fires, freezes, pests and the pandemic.\nSan Diego County’s Board of Supervisors has taken several actions over the years to boost agriculture, including creating a boutique winery ordinance to promote the creation of small wineries; approving a beekeeping ordinance that allows more beekeeping while protecting the public; adopting an agricultural easement program that preserves agricultural space; and streamlining regulations for things like cheese-making, agritourism and onsite horticultural sales.\nLast year, the Board unanimously voted to help growers by deferring fees for export certification, direct marketing, and hazardous materials inventory, allowing growers use those funds for operation needs during the pandemic.\nSupervisor Jim Desmond represents the County’s Fifth supervisorial district, which is home to a lot of the county’s agricultural land.\n“During the pandemic, we have seen how essential farming is in San Diego County,” Desmond said. “Despite a difficult past 16 months for everyone, it’s great to see farming thriving. It is an honor to be the supervisor of District Five, which has a diverse variety of agricultural crops ranging from flowers to strawberries and avocados!”\nOther highlights from the report include:\n\nWine grapes decreased in total value by nearly 7%, from roughly 5.6% million to $5.2 million, after posting 21.5%, 19% and 28% gains the previous three years.\nAt $431 million, Bedding Plants, Color & Herbaceous Perennials, Cacti & Succulents accounted for 24% of the region’s total agriculture production.\nThe 9.2% increase in avocado’s value was fueled in part by a 46% increase in yield.\nAlthough total citrus values decreased by 3%, grapefruit crop values increased by 14%.\n\nHere’s a look at the 2020 Top 10 crops:\n\nFor more information go to the 2020 Crop Report.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210812.09.36.11"}