{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Final Love Your Heart Week of Action Event March 11", "description": "The 12th Annual Love Your Heart Week of Action took place a few weeks ago and early results show that 3,000 San Diegans got blood pressure checks and 4% of those screened needed an urgent visit to their doctor. ", "datePublished": "2023-03-06T11:06:20-08:00", "url": "https://www.countynewscenter.com/final-love-your-heart-week-of-action-event-march-11/", "keywords": ["health", "blood pressure", "love your heart", "lyh"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-03-06T15:40:30-08:00", "articleType": "article", "articleContent": "\nThe 12th Annual Love Your Heart Week of Action took place a few weeks ago and early results show that more than 3,000 San Diegans got blood pressure checks and more than 100 of those screened needed an urgent visit to their doctor. \nA Love Your Heart community fair held in Chula Vista provided blood pressure screenings, flu vaccines, Narcan distribution and other resources. \nThe second community fair in the North County was initially planned for Feb. 25 but was postponed, due to weather. That community fair will take place March 11 from 1 p.m. to 4 p.m. at the Ramona Library. There will be free blood pressure screenings, COVID-19 and flu vaccines, food for those in need and other valuable resources. \nIn identifying community fair locations, organizers looked to the California Healthy Places Index to identify areas with an above-average recorded incidence of high blood pressure.  \nLove Your Heart Week of Action is an annual event hosted by the County of San Diego to share information and resources on the importance of knowing your blood pressure numbers. No-cost screenings are available across San Diego County and Mexico as a part of the Week of Action.  \nKnowing your blood pressure numbers is a vital to heart health. Heart diseases are the leading cause of death in the United States, and the second leading cause of death in San Diego County. In 2021, nearly 5,000 people died in San Diego County from diseases of the heart. \nMaking small changes to your daily life, including diet and exercise as well as knowing your numbers are important in the prevention of heart disease, cardiac arrest, and stroke. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230306.11.06.20"}