{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Cool Zones, Free Fans Can Help San Diegans Beat the Heat", "description": "The County of San Diego is reminding San Diegans that Cool Zones are available throughout the region to help them beat the heat this summer. The County operates 16 Cool Zones at various locations, including libraries, recreation centers and senior centers across the region.", "datePublished": "2021-07-28T15:50:19-07:00", "url": "https://www.countynewscenter.com/cool-zones-free-fans-can-help-san-diegans-beat-the-heat/", "keywords": [], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-07-28T15:50:19-07:00", "articleType": "video.other", "articleContent": "\nThe County of San Diego is reminding San Diegans that Cool Zones are available throughout the region to help them beat the heat this summer. The County operates 16 Cool Zones at various locations, including libraries, recreation centers and senior centers across the region.\nCool Zones are free, air-conditioned locations where people can go to cool down. Some of the locations are operating with extended or weekend hours.\nHot temperatures can be particularly dangerous for seniors and children, and they are advised to seek shelter in cool locations when temperatures rise. Working or exercising outside on a hot day, or staying too long in an overheated place can cause heat-related illnesses, including cramps, exhaustion and heatstroke.\nAn extremely high body temperature (103 or higher), dizziness, nausea, confusion, and headache are signs of heatstroke or exhaustion. If someone shows these signs, call 9-1-1 and begin cooling the person immediately.\nPeople who are homebound, lack transportation, or decide to stay home due to the risk of COVID-19, may not be able to take advantage of traditional Cool Zone sites.\nTo help these community members beat the heat, the County of San Diego, in partnership with SDG&E, provides free electric fans to those who are living on limited incomes.\nTo be eligible for the fan program, a County resident must not have access to an air-conditioned space at their home or apartment building. To learn more about the Cool Zones Fan Program or to request a fan, call Aging & Independence Services at 800-339-4661. \nFor more information on the Cool Zones program as well as tips to stay cool at home, visit www.coolzones.org.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210728.15.50.19"}