{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Girls Draw Inspiration from STEM", "description": "Two girls from County Probation’s Youth Transition Campus had the chance to get inspired by all things involving science, technology and math.", "datePublished": "2025-05-29T10:54:10-07:00", "url": "https://www.countynewscenter.com/justice-involved-girls-draw-inspiration-from-stem/", "keywords": ["public safety", "county probation", "youth transition campus"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-05-29T11:27:28-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteTwo girls from County Probation’s Youth Transition Campus had the chance to get inspired by all things involving science, technology, and math.\nThe 5-hour long Girls in STEM Igniting Passion, Engineering Tomorrow event was put on by the Society of Women Engineers on a recent Saturday at Wilson Middle School in San Diego.\nIt was a day of discovery, connection and inspiration for those who attended and provided opportunities to connect with STEM professionals.\n“There was a role model presentation, where we heard from inspiring women in STEM who are leading change and innovation,” said Senior Probation Officer John Durment. “We also engaged in speed-mentoring, connecting youths with mentors in fun, fast-paced conversations to ask questions and gain valuable insights.”\nThe girls also participated in hands-on activities including driving robots and a group activity where they had to build a bridge using popsicle sticks.\nCounty Probation works to help justice-involved youth grow, heal, and build better futures, and that starts with safety, fairness, and trust for everyone involved.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250529.10.54.10"}