{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Senior Lives His Best Life in a New Home", "description": "Life is sweet for San Diego senior Earl Deshazer eight months after moving into his new affordable home at Levant Senior Cottages in Linda Vista. Earl lives in one of 127-units designed to meet the needs of low-income seniors 55 and up, earning between 25 percent and 50 percent of the Area Median Income. ", "datePublished": "2025-01-24T14:27:03-08:00", "url": "https://www.countynewscenter.com/local-senior-lives-his-best-life-in-a-new-home/", "keywords": ["health", "affordable housing", "aging adults", "county excess land", "levant senior cottages", "linda vista", "senior"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-01-24T14:27:03-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteLife is sweet for San Diego senior Earl Deshazer eight months after moving into his new affordable home at Levant Senior Cottages in Linda Vista. Earl lives in one of 127-units designed to meet the needs of low-income seniors 55 and up, earning between 25 percent and 50 percent of the Area Median Income.\nBuilt on county excess land by Wakeland Housing and Development, Levant Senior Cottages was the first to open of 11 affordable housing communities planned for county property. It is designed to be a comfortable community for residents and provide social opportunities within walking distance for a population that often feels isolated and alone.\nFor Earl, the relief and thrill of settling into his own home are a dream come true after a health scare left him unable to work and reliant on his family for housing. Now he says, he is independent again and overjoyed.\nLearn more about Levant and their interest list.\nSince 2017, the County has invested more than $314 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal, and local funding sources administered by the County. Those funds have helped open doors to over 2,500 homes with 3,100 more on the way.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250124.14.27.03"}