{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Community Setting Outbreaks Continue to Be Confirmed in County", "description": "Outbreaks of COVID-19 in community settings continue to pop up throughout the region, prompting County health officials to remind San Diegans to take precautions to slow the spread of the virus.", "datePublished": "2020-07-08T18:05:38-07:00", "url": "https://www.countynewscenter.com/covid-19-community-setting-outbreaks-continue-to-be-confirmed-in-county/", "keywords": ["health", "13 triggers", "community outbreaks", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-09T09:01:50-07:00", "articleType": "article", "articleContent": "\nOutbreaks of COVID-19 in community settings continue to pop up throughout the region, prompting County health officials to remind San Diegans to take precautions to slow the spread of the virus.\nFive new community outbreaks were confirmed July 7, bringing the seven-day total to 24, the highest number over the seven-day period. The new outbreaks represent 137 cases, but since the outbreaks are still active, the figure might increase.\nAn outbreak in a community setting is defined as three or more COVID-19 cases in people of different households. One of the County’s “triggers,” or metrics that could lead to additional restrictions, is that there be no more than seven outbreaks over a seven-day period. That measure has been mostly in the red since it was hit June 17.\n“Community outbreaks occur when people don’t follow the public health guidance,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We can’t be complacent and think that we can go back to living our lives before COVID-19. The pandemic is not over. The virus is still here.”\nA lower number of COVID-19 community setting outbreaks was being reported at the beginning of the pandemic. During the first three months of the pandemic, 27 outbreaks were reported in the region.\nMore community outbreaks began to be confirmed as the economy reopened. Thirty-four outbreaks were reported in June, and 23 during the first week of July.\nThe great majority of community outbreaks have been reported in restaurants with bars. The County Department of Environmental Health continues to work with restaurants to make sure they are following the public health guidelines. County strike teams will soon be deployed to other businesses and worksites where outbreaks are confirmed.\nCounty health officials continue to urge San Diegans to follow the public health guidance to protect themselves and others. People should:\n\nWear a face covering\nKeep six feet apart\nPractice good hand hygiene and sanitation\nNot have house parties or gatherings\nStay home if they are sick\n\n“When people gather at home, they tend to put their guard down because they are with family and friends,” Wooten said. “If they follow the guidance given, we can help slow the spread of COVID-19 and can save lives.”\nCOVID-19 Triggers, Tests, Cases and Deaths\nCommunity Setting Outbreaks and Other Triggers:\n\nThe five new outbreaks were confirmed in a restaurant, a healthcare setting, a gym, a day care and a resort/spa.\nIn the past seven days, 24 community setting outbreaks were identified.\nThe number of new outbreaks in community settings is above the trigger of seven in seven days.\nThe County also reached the Case Investigation trigger because only 64% of investigations were initiated within 24 hours of notification over a 7-day period. The percentage should be at least 71%.\nThe state’s threshold of no more than 100 cases per every 100,000 residents is also in the red and currently registers at 135.9 in San Diego County.\n\nTesting:\n\n7,607 tests were reported to the County July 7 and 3% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 5.8%.\nThe 7-day daily average of tests is 7,434.\n\nCases:\n\n264 were reported July 7 in San Diego County for a total of 17,842.\n1,961 or 11.0% of cases have required hospitalization.\n524 or 3% of all cases and 26.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSeven new COVID-19 deaths were reported July 7, and the region’s total is now at 406.\nSeven women died between July 2 and July 6, and their ages ranged from 66-91 years.\nAll had underlying medical conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200708.18.05.38"}