{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "CDC and County Launch Health Survey in Tijuana River Valley", "description": "Months of planning and coordination came together Thursday morning as teams of volunteers began interviewing residents living near the Tijuana River Valley about sewage pollution and its effect on their health and well-being.", "datePublished": "2024-10-18T17:15:51-07:00", "url": "https://www.countynewscenter.com/cdc-and-county-launch-health-survey-in-tijuana-river-valley/", "keywords": ["health", "casper", "cdc", "health survey", "phs", "pollution", "sewage"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-10-18T17:15:51-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteMonths of planning and coordination came together Thursday morning as teams of volunteers began interviewing residents living near the Tijuana River Valley about sewage pollution and its effect on their health and well-being.\nMore than 80 people from the Center for Disease Control and Prevention (CDC), County of San Diego and local universities fanned out throughout the south region where, through Saturday, they will be interviewing selected households about living near the polluted river valley. The assessment is part of a CDC-developed survey called a CASPER, or Community Assessment for Public Health Emergency Response.\nInterview teams are working in 30 single-block areas, chosen in part by the number of odor complaints received from residents. They will visit 210 randomly chosen households to document residents’ health information.\nWhen all surveys are complete, responses will be analyzed by the CDC in the coming days, weeks and months. The resulting information will used by the County and other agencies to make decisions about additional actions and resources that can help the community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241018.17.15.51"}