{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Precautions to Stay Safe During Cold Winter Storm System", "description": "Rain, strong winds and cold temperatures predicted to bring significant snow to local mountains as low as 2,000 feet began Tuesday evening and are forecast to continue through Saturday. The winds will additionally bring high surf to beaches, so everyone should take precautions if on the water.", "datePublished": "2023-02-22T07:51:45-08:00", "url": "https://www.countynewscenter.com/precautions-to-stay-safe-during-cold-winter-storm-system/", "keywords": ["public safety", "dpw", "emergency", "flooding", "oes", "rainy driving", "snow", "storm"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-02-22T09:06:10-08:00", "articleType": "article", "articleContent": "\nRain, strong winds and cold temperatures predicted to bring significant snow to local mountains as low as 2,000 feet began Tuesday evening and are forecast to continue through Saturday. The winds will additionally bring high surf to beaches, so everyone should take precautions if on the water.\nCounty Emergency Services and Public Works road crews recommend everyone stay alert and take precautions at home and on the roads during the atmospheric river event.\nThe National Weather Service winter storm systems forecast is available and can be checked for updates.\nDamaging winds are expected through the week and could result in tree damage or falling trees or limbs. Driving, particularly if you are driving a high-profile vehicle, is predicted to be hazardous at times.\nAvoid driving in heavy rain conditions but if the trip is necessary:\n\nSlow down to avoid getting into an accident. Remember, it takes longer to stop when roads are wet. Allow yourself at least an extra 15 minutes or so to arrive at your destination to adjust for slower traffic.\nTurn on your headlights to see better and make it easier for other drivers to see you. It’s the law.\nTry to drive toward the middle lanes as water tends to gather in outside lanes.\nDefog your windows for better visibility. Rain can cause windows to fog up. Along the same lines, check your windshield wipers preferably before it rains again and replace them as needed.\nAvoid driving through deep water because it can affect your brakes. If you cannot avoid it, test your brakes afterward to make sure they’ve dried out and are working properly.\nGive the cars in front of you extra distance. The spray from their vehicles — particularly from larger trucks and buses — can hamper your vision. And giving extra space to the guy in front of you also gives you more time to brake or adjust if you need to.\nKeep calm, don’t oversteer or stomp on the brakes if you start to hydroplane or skid when your tires lose traction with the wet road. The Department of Motor Vehicles says keep the steering wheel straight and take your foot off the accelerator so your vehicle can slow down slowly.\nTurn around, don’t drown. In heavy rains, never drive through a flooded roadway if you cannot see the pavement. Even a few inches of water running at the right velocity can sweep a car, and even a truck, and its occupants off the roadway and downstream. The same tip applies to trying to walk or swim across a flooded roadway.\nStay focused. Remember, it’s illegal, and dangerous, to try to text or use a hand-held cell phone when you’re driving.\nSlow down for the cone zone if you see highway or road workers ahead or to your side. Watch out for DPW crews and equipment.\nIf driving in the snow, keep up with the weather reports to see if tire chains are required. Be aware conditions on the ground can change rapidly. Also keep some extra safety equipment in your car.\n\nChain controls, road condition updates, and other safety advisories are posted on DPW’s Facebook and Twitter sites.\nThe San Diego County Office of Emergency Services has flood ready information to help you prepare and learn more about flood risks, the most common natural disaster.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230222.07.51.45"}