{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Pauses Use of Johnson & Johnson Vaccine in San Diego", "description": "The County is following the guidance of the Centers for Disease Control and Prevention and the Food and Drug Administration and pausing the use of the Johnson & Johnson COVID-19 vaccine after a rare type of blood clot was reported in six recently vaccinated women in the United States.", "datePublished": "2021-04-13T15:56:42-07:00", "url": "https://www.countynewscenter.com/county-pauses-use-of-johnson-johnson-vaccine-in-san-diego/", "keywords": ["health", "coronavirus", "covid-19", "j&j pause", "johnson and johnson"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-13T16:07:05-07:00", "articleType": "article", "articleContent": "\nThe County is following the guidance of the Centers for Disease Control and Prevention and the Food and Drug Administration and pausing the use of the Johnson & Johnson COVID-19 vaccine after a rare type of blood clot was reported in six recently vaccinated women in the United States.\n“The health and safety of San Diego County residents is our number one priority, and, in an abundance of caution, we are pausing use of the Johnson & Johnson vaccine while state and national authorities thoroughly investigate these reports,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nThe CDC and FDA reported that six women ages 18 to 48 who suffered a rare and severe type of blood clot, cerebral venous sinus thrombosis (CVST), in combination with low levels of blood platelets (thrombocytopenia) within two weeks after getting the Johnson & Johnson vaccine.\nCVST is a form of blood clot that typically occurs in younger patients, usually under 50 years old and predominantly women. According to the CDC, CVST occurs 5–16 people per 1 million people per year in the United States.\nAccording to the CDC, about 6.85 million doses of the Johnson & Johnson vaccine have been administered in the U.S.\nIn San Diego County, about 58,000 San Diegans have received the Johnson & Johnson vaccine and no known severe adverse effects have been reported in the region.\n“The cases that prompted the pause appeared in the Vaccine Adverse Event Reporting System (VAERS). The fact that the six cases of a rare condition were identified after recent vaccination followed by a pause while further investigations occur is a sign that the system works,” Wooten said.\nCOVID-19 vaccines were evaluated in tens of thousands of participants in clinical trials. The vaccines met FDA’s rigorous scientific standards for safety, effectiveness, and manufacturing quality needed to support emergency use authorization.\nCOVID-19 vaccines have been undergoing the most intensive safety monitoring in U.S. history.\nThe CDC and FDA use VAERS to collect reports from health care professionals, vaccine manufacturers and the public of adverse events that happen after vaccination. Reports of adverse events that are unexpected, appear to happen more often than expected or have unusual patterns are followed up with specific studies. The CDC will convene a meeting of the Advisory Committee on Immunization Practices (ACIP) on Wednesday, April 14.\nFor San Diegans who got the vaccine more than a month ago, the risk to them is very low at this time. For San Diegans who recently got the vaccine—within the last few weeks—they should be aware of any symptoms.\nIf you have received the vaccine and develop severe headache, abdominal pain, leg pain, or shortness of breath, you should contact your health care provider and seek immediate medical treatment.\n“San Diegans should continue to get vaccinated with a Pfizer or Moderna vaccine, which are now being used at the clinics that offered the Johnson and Johnson vaccine,” Wooten said.\nThe CDC is asking health care providers to report adverse events to the Vaccine Adverse Event Reporting System.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210413.15.56.42"}