{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Five Minutes Could Save Your Life, Know Your Blood Pressure Numbers", "description": "The County’s Love Your Heart campaign is celebrating 14 years of spreading awareness about the silent dangers of heart disease. San Diegans are invited to get a free blood pressure screening at locations throughout the county and Mexico. ", "datePublished": "2025-02-10T13:41:46-08:00", "url": "https://www.countynewscenter.com/five-minutes-could-save-your-life-know-your-blood-pressure-numbers/", "keywords": ["health", "blood pressure", "dr. tuteur", "heart disease", "love your heart", "lyh"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2025-02-10T15:29:01-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Love Your Heart campaign is celebrating 14 years of spreading awareness about the silent dangers of heart disease. San Diegans are invited to get a free blood pressure screening at locations throughout the county and Mexico. \nHeart disease is the leading cause of death in the United States and Mexico, and the second leading cause of death in San Diego County. In 2022, nearly 5,000 people died in San Diego County from heart diseases. \nA person’s blood pressure numbers are key indicator for heart health, and they are often one of the only signs of heart disease. This year Love Your Heart offers screenings starting Feb. 10 through Valentine’s Day, Feb. 14. People can search their nearest location at LoveYourHeartSD.org. \n“Too many of our loved ones—our parents, grandparents, aunts, uncles, brothers, and sisters—are still being lost to a disease that we can prevent,” said County Board Supervisor Monica Montgomery Steppe. “It’s so important for all of us to take action, get our blood pressure checked, and encourage our families and communities to do the same. A simple check today could save a life tomorrow. Let’s take charge of our health because the time to act is now!”\nIn 2022, 43 African Americans died from heart failure in our region. The number of these preventable deaths has nearly doubled compared to a decade ago, with 25 deaths in 2012.  \nCounty data shows the age-adjusted death rate for heart failure in the non-Hispanic Black community was higher than the overall San Diego County age-adjusted death rate for heart failure in 2022. \n“This year, as in years past, we are focusing on the areas disproportionately affected by heart disease, setting up free blood pressure screening sites for anyone to visit,” said Kimberly Giardina, DSW, County deputy chief administrative officer. “Knowing your blood pressure numbers and learning what they mean is a great first step to becoming more heart healthy.” \nIn the past several decades, data shows that three behaviors contribute to four chronic conditions resulting in nearly half of all deaths in San Diego County, also known as the 3-4-50 principle.  \n“For most people, a normal blood pressure is under 120/80. The first step is to know your numbers and know your risk factors,” said Dr. Jennifer Tuteur, the County’s Chief Medical Officer. “The second step is to talk with your trusted health provider about ways you can reduce your risk of dying from heart disease. Many are in your control, like walking after meals and stopping smoking.” \nKnowing your numbers and making small changes to your daily life, including diet and exercise, are important in the prevention of heart disease, cardiac arrest and stroke. Learn more about what your numbers mean, and resources to get healthy at LoveYourHeartSD.org. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250210.13.41.46"}