{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Keep It Up San Diego – Vote Safer, Vote Early", "description": "With just over a week left to vote, the Registrar’s office reports more than 725,000 San Diego County voters have already cast their ballots in the Nov. 3 Presidential General Election.", "datePublished": "2020-10-26T16:29:10-07:00", "url": "https://www.countynewscenter.com/keep-it-up-san-diego-vote-safer-vote-early/", "keywords": ["elections", "ballots returned", "fgg", "mail ballot", "nov. 3 presidential general election", "registrar of voters", "registrar of voters office", "vote safer san diego"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-10-26T16:47:36-07:00", "articleType": "article", "articleContent": "\nWith just over a week left to vote, the Registrar’s office reports more than 725,000 San Diego County voters have already cast their ballots in the Nov. 3 Presidential General Election. That’s 435,000 more than those returned as of this date for the November 2016 presidential election. And it’s more than a third of all 1.95 million mail ballots sent to voters this year.\nAs part of its COVID-19 Vote Safer San Diego campaign, the Registrar urges you to vote safer and vote early. Make voting decisions and complete your ballot from the safety of your home. Sign and date your return envelope, seal your completed ballot inside and return it to a trusted source.\nBallots received by the Registrar’s office throughout this week should be processed in time for the first release of Election Night results that are posted shortly after 8 p.m. The sooner you return your mail ballot, the sooner Registrar’s staff can process it into the count.\nIf you want to vote in-person that option is available, too. The Registrar urges you to avoid crowds and take advantage of early voting. You can do so:\n\nNow at the Registrar’s office, 8 a.m. to 5 p.m. daily.\nAt your assigned polling place, 8 a.m. to 5 p.m., starting Saturday, Oct. 31 through Monday, Nov. 2.\n\nAll will again be open on Election Day, Nov. 3, when the voting hours change to 7 a.m. to 8 p.m.\nDue to the COVID-19 pandemic, the Registrar’s office encourages older adults and people with underlying medical conditions to avoid long lines and crowded polling places by voting early.\nTo vote in person, be prepared. Wear your face mask, go to your assigned polling place and plan to maintain social distance. Your polling place has most likely changed so check the back of your sample ballot and voter information pamphlet for your assigned poll first before you head out to vote or you can look it up at sdvote.com.\nTo find out more about the upcoming election, visit sdvote.com or call (858) 565-5800.\n \n \n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201026.16.29.10"}