{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisor Vargas, Library Open County’s First Little Library in Chula Vista", "description": "County Supervisor Nora Vargas, Chula Vista city officials, County Library officials and others opened a new library at Lauderbach Park in Chula Vista Saturday — a “Little Library” for local families, one of 40 the County plans to help install around the county in the coming months.", "datePublished": "2021-09-04T11:15:52-07:00", "url": "https://www.countynewscenter.com/supervisor-vargas-library-open-countys-first-little-library-in-chula-vista/", "keywords": ["library", "books", "county library", "literacy", "little libraries", "lueg", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-09-04T11:15:52-07:00", "articleType": "article", "articleContent": "\nCounty Supervisor Nora Vargas, Chula Vista city officials, County Library officials, families and children opened a new library at Lauderbach Park in Chula Vista Saturday — a “Little Library” for local families, one of 40 the County plans to help install around the county in the coming months.\nLittle libraries look like large mailboxes, but they’re actually neighborhood book exchanges where people can freely borrow or leave books for others to read. The Little Library opened Saturday in Chula Vista was filled with age-appropriate books in different languages, including “The Thank You Book,” “Can I Play Too?” and “Dora La Exploradora.”\n“These (Little Libraries) are small neighborhood libraries that can be placed throughout our communities to allow anyone to have access to books closer to home,” Supervisor Vargas said at Saturday’s ribbon-cutting. “We as the County are committed to diversity, equity and inclusion. We want to inspire children and encourage everyone to read. Soon we will be opening other Little Libraries in the South Bay region, with locations in San Ysidro, Otay, and one in Paradise Hills.”\nLed by Vargas, the County’s Board of Supervisors voted in March to create a Little Libraries Initiative to boost literacy in low-income and communities of color by giving people and children living in those communities more opportunities to have and read books in their homes.\nVargas said then that the County Library had “been fantastic” in promoting and increasing literacy through its 33 branch libraries, digital and e-books, services and programs.\nHowever, she said families in some neighborhoods face obstacles, like lack of transportation, that keep them from taking advantage of the branch libraries, or financial constraints that hamper internet access and book-buying.\n\nLittle Libraries can help solve that by putting books in communities and promoting and encouraging reading at home — an important boost for literacy.\nIn 2020, the San Diego Council on Literacy reported that approximately 560,000 local adults read at an elementary school level, or not at all, and that 60% of low-income students have no books at home. Officials said Saturday that this disparity had been exacerbated by the coronavirus pandemic.\nVargas told the audience Saturday that she was heartbroken to learn when she served as a Southwestern College board member that it was taking community college students six years to transfer to four-year colleges because they needed extra language and literacy education.\nCounty Library Director Migell Acosta said research has shown that having as few as 20 books in a home can have a positive effect on a child’s level of education regardless of income. Library officials said the County has purchased 40 Little Libraries from the national Little Free Library Organization for roughly $28,000.\nThe County Library and the County’s Parks and Recreation department each plan to put up 20 of them in the coming months around the county. With the one opened in Lauderbach Park Saturday, the County has already put Little Libraries up in Chula Vista, Bonita and San Diego, and has plans for numerous other communities, including Borrego Springs, Campo, Julian, El Cajon, Lakeside, Vista and Oceanside.\nThe Library, through donations from the San Diego Council on Literacy, Words alive and the Children’s Initiative, will jump-start each of the Little Library collections with books.\nLibrary officials said they’ve also worked with other library jurisdictions, County departments, community-based organizations and volunteer groups on the Little Library Initiative.\nFor more information about the County Library and Little Free Libraries, go to the Library’s webpage.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210904.11.15.52"}