{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Microbusiness COVID-19 Grant Application Period Opens", "description": "“Microbusinesses” around San Diego County hurt by COVID-19 can now begin applying online for $2,500 grants.", "datePublished": "2022-02-15T10:03:22-08:00", "url": "https://www.countynewscenter.com/microbusiness-covid-19-grant-application-period-opens/", "keywords": ["government", "covid-19", "grant program", "microbusinesses", "small business"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-02-15T10:06:19-08:00", "articleType": "article", "articleContent": "\n“Microbusinesses” around San Diego County hurt by COVID-19 can now officially begin applying online for $2,500 grants.\nThe County Board of Supervisors last week approved making 1,550 grants totaling $3.8 million, funded in part by the California Office of the Small Business Advocate, to some of the smallest businesses in the county, like home businesses and sidewalk vendors.\nThe list could include home businesses like pet sitters, shoppers, cleaners and home health care workers, and sidewalk vendors like food cart operators.\nMicrobusinesses may be eligible for a $2,500 grant if their business:\n\nWas started before Dec. 31, 2019, is the owner’s primary source of revenue, and is currently operating or has a plan to reopen\nGenerated less than $50,000 in revenue in the 2019 tax year\nCurrently has five or fewer full-time employees and had five or fewer employees in 2019, 2020 and 2021\nWas significantly impacted by COVID-19\nHas not previously received any grant money from the California Small Business COVID-19 Relief Grant Program\n\nThe grants are planned to be distributed equally among the County’s five supervisorial districts, aided by outreach at events, farmer’s markets and libraries, and through community groups and door-to-door canvassing.\nState and County officials hope the grants will reach microbusinesses run by those that have historically faced barriers to obtaining capital, including women, minorities, veterans, limited English speakers, businesses in low- to mid-income rural areas and people without documentation.\nThe grant application page can be reached either through the County’s Microbusiness COVID-19 Relief Grant Program webpage or directly at the Small Business Development Center’s website.\nThe County has contracted with Southwestern College’s Small Business Development Center to collect and process online applications and to conduct outreach along with the Asian Business Association of San Diego, the Logan Heights Community Development Corporation, the South County Economic Development Council and the San Diego East County Economic Development Council.\nThe County’s grants must be distributed in 2022. The first application process will run from Feb. 15 to 5 p.m. on March 31. If there is grant money left after the first round, additional application periods will be held.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220215.10.03.22"}