{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Moves Forward to Create New Climate Action Plan", "description": "The County of San Diego moved forward Wednesday to start building a new Climate Action Plan but continue to follow 26 measures that cut 130,075 metric tons of greenhouse gases in 2019, nearly meeting all the County’s 2020 goals.", "datePublished": "2020-09-30T18:41:53-07:00", "url": "https://www.countynewscenter.com/county-moves-forward-to-create-new-climate-action-plan/", "keywords": ["environment", "climate action plan", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-10-01T14:46:38-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego moved forward Wednesday to start building a new Climate Action Plan but continue to follow 26 measures that cut 130,075 metric tons of greenhouse gases in 2019, nearly meeting all the County’s 2020 goals.\nThe County’s Board of Supervisors voted unanimously Wednesday to rescind the 2018 Climate Action Plan, after deciding in June not to further appeal a court ruling. That ruling and legal challenge, however, took no issue with the 26 measures the plan used to cut 130,075 metric tons of carbon dioxide in 2019 according to the 2019 progress report released last week. Metric tons of carbon dioxide are a standard way to measure greenhouse gas emissions.\nThe 26 measures to cut greenhouse gases included, among other actions, the installation of solar photovoltaic panels on existing homes to generate electricity; increasing renewable energy overall; diverting more trash away from landfills where it can decompose and create methane; conserving agricultural and open space; and improving access to sustainable transportation such as electric vehicles. The measures were created to meet state greenhouse gas reduction targets in the County’s unincorporated communities in 2020 and 2030.\nLast week’s progress report, which measured progress in 2019, stated that the County had reached 98% of the 2020 targets.\nSome of the specific accomplishments it reported:\n\nThe County’s Planning & Development Services department (PDS) has waived fees for and issued solar rooftop permits for 48,547 homes since the baseline year of 2014, 93% of the 2020 target of 52,273 homes. PDS processed 6,598 residential solar permits online in 2019.\nThe County generated 6.2% of the energy it used at County-owned facilities in 2019 through solar power, 62% of its 2020 goal of reaching 10%.\nThe County has helped install 7,795 discounted rain barrels, including 427 in 2019, to cut residential water consumption, working with the nonprofit Solana Center. Conserving water cuts greenhouse gas emissions by reducing the amount of energy it takes to pump and treat water.\nThrough 2019, the County has planted 17,591 trees, including 3,661 in 2019, exceeding its 2020 goal of 14,000 trees.\nThe County reduced its energy use intensity — the amount of energy used in a building per square foot — by 23% in 2019, more than doubling the 10% 2020 target. The County also cut the fuel emissions from the County’s fleet of vehicles by 13%, also exceeding the 2020 10% goal.\nThrough 2019, the County has acquired 4,897 acres of conservation land, including 1,269 acres in 2019, exceeding the 2020 target of 2,622 acres.\n\nOther notable County actions included:\n\nThe County Board of Supervisors approved an Electrical Vehicle Roadmap in October 2019 to encourage the use of electrical vehicles, a project that was honored with a 2020 Achievement Award by the National Association of Counties. The Roadmap identified six ways to invest in EV technology, including installing publicly available EV charging stations at County facilities; building out the EV charging infrastructure in the unincorporated County; and replacing more than 500 gas-powered County vehicles with electric vehicles by 2027.\nIn 2019, the County became the first jurisdiction in the region to offer residential solar energy battery-storage permits online. Installing a solar battery as part of a home solar energy system maximizes the household’s ability to use electricity generated by solar systems, often provides utility savings, and offers a back-up source of electricity during a power outage.\n\nWith the rescission of the 2018 CAP and EIR by the Board of Supervisors, the County will assess which aspects of its 2018 CAP and Environmental Impact Report (EIR) need to be redrafted and work in partnership with residents, business, and environmental groups to craft a new one.\nThat process is expected to take up to two years. As the court did not find fault with the 26 measures in the 2018 CAP, the County will also continue implementing sustainability measures to effectively reduce greenhouse gases as part of its ongoing commitment to the environment.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200930.18.41.53"}