{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans 12 and Older Should Get COVID-19 Boosters", "description": "Now that COVID-19 vaccine boosters are available for fully vaccinated people age 12 and up, County health officials are urging eligible San Diegans to get all the recommended doses.", "datePublished": "2022-01-12T18:48:37-08:00", "url": "https://www.countynewscenter.com/san-diegans-12-and-older-should-get-covid-19-boosters/", "keywords": ["health", "coronavirus", "covid-19 boosters", "emergency departments", "vaccination"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-01-12T18:53:13-08:00", "articleType": "article", "articleContent": "\nNow that COVID-19 vaccine boosters are available for fully vaccinated people ages 12 and up, County health officials are urging eligible San Diegans to get all the recommended doses.\nAccording to the Centers for Disease Control and Prevention, a booster shot helps to provide protection against the highly contagious Omicron variant, both in preventing the disease, lessening symptoms and decreasing the likelihood of hospitalization.\nTo date, 906,615 San Diegans have received booster shots. The CDC recommends a Pfizer or Moderna booster shot five months after their second dose. A Johnson & Johnson booster is recommended two months after the second dose. Pfizer boosters have been approved for everyone 12 years and older. Moderna and Johnson & Johnson boosters are only available for adults 18 years and older.\n“COVID-19 vaccinations are the best tool we have against the coronavirus and we need more San Diegans to be boosted,” said Wilma J. Wooten. M.D., M.P.H., County public health officer. “The vaccines help to prevent people from getting seriously ill or dying from COVID-19.”\n The region has plenty of COVID-19 vaccines and booster doses. With more than 400 vaccination sites that include pharmacies, medical providers, clinics and County locations; the region has the capacity to meet the demand. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\n Avoid Emergency Departments for COVID-19 Testing\nCounty health officials continue to ask San Diegans not to go to local emergency departments for COVID-19 testing.\nLocal hospitals are experiencing an increase in COVID-19 hospitalizations, as well as staff shortages due to the coronavirus and are preserving their resources for patients who are seriously ill.\n“Local hospitals and their emergency departments are under extreme stress due to COVID-19 patients, other seasonal viruses and diseases and employees calling out sick,” Wooten said.\nThe County recommends that people worried about COVID-19 infection and others seeking COVID-19 testing go to a hospital to be tested only if they have severe symptoms.\nThe region’s health care providers offer testing to members who meet each systems’ criteria. Many neighborhood pharmacies offer same day testing as do other locations on this list. The County has a network of no-cost testing public sites that are both walk-up and can take appointments.\nVaccination Progress:\n\nDoses administered: Over 6.38 million.\nReceived at least one shot: Over 2.81 million or 89.4% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Nearly 2.49 million or 79%.\nBoosters administered: 906,615.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n34 new deaths were reported since the last report on Jan. 5, 2022. The region’s total is 4,529.\n23 men and 11 women died between Aug. 15, 2021 and Jan. 10, 2022.\n14 were age 80 or older, eight were in their 70s, seven were in their 60s, two were in their 50s, two were in their 40s and one was in their 30s.\nSix of the people who died were fully vaccinated and 28 were not fully vaccinated.\n27 had underlying medical conditions, two did not and five had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n14,734 COVID-19 cases were reported to the County on Jan. 11, 2022. The region’s total is now 550,639.\n85,659 COVID-19 cases were reported last week (Jan. 5 through Jan. 11, 2022) compared 45,017 cases identified the previous week (Dec. 29, 2021 through Jan. 4, 2022).\nDuring the 30-day period between Nov. 30 to Dec. 29, there were 574 COVID-19 hospitalizations; 424 people were not fully vaccinated and 150 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 71.1 overall, 15.3 for fully vaccinated people and 180.3 for not fully vaccinated San Diegans.\n46,885 tests were reported to the County on Jan. 11, 2022, and the percentage of new positive cases was 31.4%.\nThe 14-day rolling percentage of positive cases among tests is 26.4%.\n\nCommunity Setting Outbreaks:\n\n39 new community outbreaks were confirmed in the past seven days (Jan. 5, 2022 through Jan. 11, 2022): Eight in business settings, five in government settings, four in retail settings, four in daycare/preschool/child care settings, four in TK-12th grade settings, three in health care settings, two in restaurant/bar settings, two in distribution/warehouse settings, one in a restaurant setting, one in a food/beverage distribution setting, one in community-based setting, one in a day camp setting, one in social club setting, one in an emergency services setting and one in a hotel/resort/spa setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220112.18.48.37"}