{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Establishes New Child and Family Well-Being Department", "description": "The San Diego County Board of Supervisors has approved a reimagined department to support children and families. The new Child and Family Well-Being Department will integrate multiple child and family serving systems, including First 5 San Diego, Child Welfare Services, and other Health and Human Services Agency (HHSA) departments, under one umbrella to deliver both prevention and safeguarding services. ", "datePublished": "2023-02-28T15:00:56-08:00", "url": "https://www.countynewscenter.com/county-establishes-new-child-and-family-well-being-department/", "keywords": ["families", "child well-being", "cws", "foster"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-02-28T15:00:56-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors has approved a reimagined department to support children and families. The new Child and Family Well-Being Department will integrate multiple child and family serving systems, including First 5 San Diego, Child Welfare Services, and other Health and Human Services Agency (HHSA) departments, under one umbrella to deliver both prevention and safeguarding services. \nAdopted unanimously, the new department will allow the County to better address equity and improve outcomes for children and families in a more holistic way by focusing its effort and budget on child and family strengthening programs and community partnerships. \n“Equity and the safety of our community’s children have always been at the core of our efforts,” Kim Giardina, director of Child Welfare Services said. “This transformation allows us the flexibility to respond to the changing landscape and needs of our neighbors to best support them now and many years into the future.” \nThis work is designed to reduce the impact of trauma, adverse childhood experiences, and child maltreatment in our community, and to do so with a focus on racial equity and reducing the disproportionate number of African American, Native American, and Hispanic children in foster care. \nThe data supports this shift.  \nSince 1998, the number of children in CWS care decreased from almost 7,000 to fewer than 2,000, a 71% reduction over 25 years through family-strengthening programs and enhanced engagement. \nThe reimagination of services, which has been under development for more than a year, is expected to continue the reduction of children in foster care and reduce the unnecessary child protective actions that have historically harmed and separated families. If further intervention is needed to keep children safe, social workers will work with families to ensure well-being of the children and to place family’s voice at the center of our work.   \nThe new Child and Family Well-Being Department will consist of the Office of Child and Family Strengthening, which will include First 5 San Diego, coordination of local childcare system, and other prevention and strengthening services, and the Office of Child Safety, which will continue to provide all services currently administered through Child Welfare Services. The Child and Family Strengthening Advisory Board will oversee the overarching organizational change and monitor the department’s work. \nThe new Child and Family Well-Being Department will begin this multi-year transition in July 2023. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230228.15.00.56"}