{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Urged to Be Patient to Get Vaccinated Against COVID-19", "description": "The County has opened four vaccination super stations and operates 15 smaller community points of dispensing, or PODs. While combined they have the capacity to vaccinate 20,000 people daily, the County doesn’t have access to that many daily doses yet to be able vaccinate everyone who wants one.", "datePublished": "2021-02-03T17:51:26-08:00", "url": "https://www.countynewscenter.com/san-diegans-urged-to-be-patient-to-get-vaccinated-against-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "vaccinations", "vaccinations rural areas"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-04T16:34:26-08:00", "articleType": "article", "articleContent": "\nThe number of San Diegans wanting to be vaccinated against the novel coronavirus significantly exceeds the total doses that have been shipped to the region to date.\nThat’s why County health officials are urging San Diegans to be patient and get vaccinated when it’s their turn.\nThe County has opened four vaccination super stations and operates 15 smaller community points of dispensing, or PODs. While combined they have the capacity to vaccinate 20,000 people daily, the County doesn’t have access to that many daily doses yet to be able vaccinate everyone who wants one.\n“Due to the limited number of COVID-19 vaccine doses in the region, County community clinics are continuing to vaccinate only health care professionals and people 65 and older,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We’re asking San Diegans to be patient and to get vaccinated when more doses are available. Vaccination appointments are only available for the number of doses we have on hand or we know are coming.”\nDoctors, pharmacies, community clinics and other health care providers are also working to provide vaccinations to San Diegans in the priority groups.\nCOVID-19 Vaccines Also Available in Rural Areas\nTo make the COVID-19 vaccine available to more people who qualify, local paramedics and emergency medical technicians are administering vaccinations in rural communities.\nThese rotating vaccination clinics are part of Operation Collaboration, an effort involving about two dozen fire and emergency services agencies including CAL FIRE and San Diego County Fire Protection District. Fire agencies are also helping to vaccinate people in long-term care facilities.\nThe clinics, which started this week, will take place in rural communities such as Ramona, Julian and Jamul.\nAll County vaccination super stations and PODs require appointments and can be made at vaccinationsuperstationsd.com.\nA COVID-19 vaccination is administered at the Grossmont Center Vaccination Super Station.\nPeople 75 and over and who do not have access to a computer or someone to assist them may dial 2-1-1 for appointment assistance.\nAlso, County-funded community health workers, known as promotoras, will be reaching out to people 75 and older directly to help them make vaccination appointments.\nThe Metropolitan Transit System is offering free rides to people with proof of a vaccination appointment.\nTo date, more than 586,000 COVID-19 doses have been delivered to the region. Of those, more than 357,000 have been administered, including more than 58,000 San Diegans who have received two doses and 10.2 percent of the population over age 16 who have received at least one dose. More information about vaccine distribution can be found on the County’s vaccination dashboard.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 42.5 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 10.5%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 14% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 9.\n\nCommunity Setting Outbreaks:\n\n11 community outbreaks were confirmed Feb. 2: three in business settings, one in a faith-based setting, one in a retail setting, one in social club setting, one in a construction setting, one in a restaurant setting, one in hotel/resort/spa setting, one in a government setting and one in an adult day care setting.\nIn the past seven days (Jan. 27 through Feb. 2), 60 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n19,794 tests were reported to the County on Feb. 2, and the percentage of new positive cases was 5%.\nThe 14-day rolling average percentage of positive cases is 7.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 19,197.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n968 cases were reported to the County on Feb. 2. The region’s total is now 241,018.\n10,382 or 4.3% of all cases have required hospitalization.\n1,468 or 0.6% of all cases and 14.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n54 new COVID-19 deaths were reported on Feb. 2. The region’s total is 2,683.\n31 men and 23 women died between Dec. 20 and Feb. 1.\nOf the 54 new deaths reported that day, 23 people who died were 80 years or older, nine people were in their 70s, 11 people were in their 60s, four were in their 50s, three were in their 40s and four were in their 30s.\n49 had underlying medical conditions, two did not and three had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210203.17.51.26"}