{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Health Lab Celebrates Grand Opening", "description": "The County’s new state-of-the-art Public Health Lab officially opened its doors after a ribbon-cutting ceremony at the County Operations Center (COC) in Kearny Mesa on Thursday.", "datePublished": "2025-05-29T16:53:55-07:00", "url": "https://www.countynewscenter.com/county-public-health-lab-celebrates-grand-opening/", "keywords": ["health", "county operations center", "office consolidation", "public health lab", "public health lab ribbon cutting", "public health services"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-05-29T17:13:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County’s new state-of-the-art Public Health Lab officially opened its doors after a ribbon-cutting ceremony at the County Operations Center (COC) in Kearny Mesa on Thursday.\nThe two-story facility measures 52,000 square feet, three times larger than the old, cramped and outdated building on Rosecrans.  Once a shopping center and dating back to 1965, it hadn’t been designed to house a lab. The structure was closed due to its aging infrastructure.\nThe new facility creates space for nearly 90 employees and contractors who will test for infectious diseases like COVID-19, Respiratory Syncytial Virus known as RSV, flu and other diseases.\nThey will also test for food and water safety, animal rabies and dangerous pathogens like anthrax.\nIn addition to these services, the expanded lab will conduct whole genome sequencing and test for tuberculosis.\nCounty microbiologists and other staff worked with builders to make sure the lab would meet their needs, and state and federal guidelines.\nAs a result, the new building provides a safe, secure facility with improved workflows, flexible spaces for large pieces of equipment, storage and the ability to scale up for any future public health emergencies.\nThe structure includes a:\n\nBiosafety-Level (BSL) 3 Bioterrorism Lab\nTuberculosis (TB) Prep and BSL-3 TB Labs\nGenome Sequencing Lab\nTraining Lab\nRabies Lab\nSurge Lab to scale up response\n\nThe lab expects to conduct about 50,000 tests annually.\nThe new facility will also serve as the Centers for Disease Control and Prevention Laboratory Response Network Lab for San Diego and Imperial Counties.\nPath to Construction  \nA survey on space needs at the COC campus led the way to construction.\nRecognizing that COVID-19 changed the way some people work, the survey looked at teleworking schedules, hoteling spaces and future growth of the existing campus departments. Results showed staff could be consolidated into three of the four existing office buildings.\nWith careful planning and some remodeling work, 12 departments consolidated into three office buildings.\nThe reshuffling allowed 570 Public Health Services employees who were formerly at the Rosecrans building to move into the vacant four-story, 150,000-square-foot building on campus.\nIn avoiding the $150 million cost of building a replacement for the health services complex, the County was able to construct the public health lab and a six-level parking garage nearby.\nThe $32.5 million parking structure was completed last year, adding 725 spaces and 237 electric vehicle charging stations. Roof solar panels were installed to offset part of the lab’s energy use.\nThe lab’s groundbreaking took place in October 2023. The facility reflects the architecture on the rest of the campus but differs slightly to differentiate it from the other buildings. Like each building, the site features its own public art and artifact displays.\nSustainability\nThe lab was built to platinum LEED standards which stands for Leadership in Energy and Environmental Standard Design. The structure is expected to become the County’s 71st LEED certified building.\nThe building features solar panels, saves energy with natural lighting, conserves indoor and outdoor water use, and saved landfill space through the recycling of demolition and construction waste materials.\nConstruction also reduced embodied carbon by 23% and refers to emissions made in the manufacture, transport, use and disposal of building materials. In this case, the building used low-carbon concrete, steel and metal panels.\nThroughout the region, the County has achieved several sustainability milestones:\n\n11 Zero Net Energy buildings that produce more energy than the building consumes in a year\n16 MW of solar energy installed at County sites – providing 20% of the County’s total electricity demand\n47% reduction in greenhouse gases from County operations since 2010\n\nCounty Operations Center Master Plan \nThe lab and the parking structure mark the sixth phase of the COC Campus Master Plan. In 2008, the Board of Supervisors authorized the plan to rebuild and centralize a wide range of County operations in one place – the 47-acre campus in Kearny Mesa.\nSince that time, campus buildings that had outlived their useful lives were destroyed and replaced with new, modernized and environmentally friendly facilities.\nSee below for the list of major campus construction projects:\n\nCentral Plant\nFour office buildings\nThree parking structures\nCampus Center/Public Hearing Chambers\nEmergency Operations Center\nMedical Examiner’s Office\nRegistrar of Voters building\nFleet Facility\nSheriff’s Technology Information Center\nSheriff’s Crime Lab\nPublic Health Lab\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250529.16.53.55"}