{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Newest Green Street Project to Improve Water Quality in the Unincorporated Area", "description": "County Supervisors have agreed to move forward in securing a construction contract for a project to improve water quality in the unincorporated area.", "datePublished": "2024-08-28T16:54:38-07:00", "url": "https://www.countynewscenter.com/newest-green-street-project-to-improve-water-quality-in-the-unincorporated-area/", "keywords": ["environment", "environmental protection", "health", "sustainability", "water quality"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-08-28T16:54:38-07:00", "articleType": "article", "articleContent": "\nReading Time:  1 minuteCounty Supervisors have agreed to move forward in securing a construction contract for a project to improve water quality in the unincorporated area.\nThe Green Street project is located in Fallbrook, along South Mission Road, between Grand Tradition Way and Pepper Tree Lane. Green Streets support the County’s commitment to watershed protection and sustainability by filtering stormwater. The goal is to reduce or remove trash and pollutants before they can enter bodies of water like creeks, rivers and the ocean.\nContracted work will include the installation of a trash capture device beneath the road and a biofiltration basin that improves the landscaping above it. The trash capture device will remove trash, sediment and debris. The biofiltration basin will remove bacteria and nutrients from stormwater that would enter the San Luis Rey River.\nIn 2022, the Department of Public Works (DPW) published the Green Streets Clean Water Plan. The plan’s primary goal is to protect the environment and improve water quality.\nThrough the plan, the County chose South Mission Road (North Segment) out of 30 ranked projects as a Green Street. The decision was based on potential water quality, environmental and community benefits, as well as cost-effectiveness.\nThe County uses a variety of tools to prioritize stormwater improvement projects in underserved areas. When completed, the project will help improve the County’s water quality by reducing bacteria, trash and other pollutants.\nThe project is in step with the County’s sustainability goals of protecting and promoting natural resources. It also improves the natural environment for residents, visitors and future generations to enjoy.\nThe total project cost is estimated at $3 million. Construction is scheduled to begin in late 2024 and be completed in the summer of 2025.\nFor more information about the County’s upcoming and previously completed green infrastructure projects, visit DPW’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240828.16.54.38"}