{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Valley Fire Survivors May Apply for Federal Aid to Help With Losses", "description": "Homeowners or renters affected by the Valley Fire in September can now apply for a Federal Emergency Management Agency grant through Dec. 15. The grants are designed to help with serious disaster-related expenses not covered by insurance such as rent, home repair or replacement, medical or dental costs, transportation or other personal property losses.", "datePublished": "2020-10-23T15:04:20-07:00", "url": "https://www.countynewscenter.com/valley-fire-victims-may-apply-for-federal-aid-to-help-with-losses/", "keywords": ["public safety", "emergency", "fema", "recovery", "sba", "valley fire"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-10-23T15:18:05-07:00", "articleType": "article", "articleContent": "\nHomeowners or renters affected by the Valley Fire in September can now apply for a Federal Emergency Management Agency grant through Dec. 15. The grants are designed to help with serious disaster-related expenses not covered by insurance such as rent, home repair or replacement, medical or dental costs, transportation or other personal property losses.\nResidents or businesses can also apply for a low-interest loan from the U.S. Small Business Administration.\nDue to the pandemic, FEMA has put its assistance process online and has a telephone helpline. For those requiring in-person assistance, FEMA will have staff present as the Rancho San Diego Library on Thursday, Oct. 29 from 10 a.m. to 6 p.m. and on Saturday, Oct. 31 from 10 a.m. to 2 p.m. The library is located at 11555 Via Rancho San Diego in El Cajon.\nTo begin the grant application process, residents must first register with FEMA either by visiting DisasterAssistance.gov, downloading the FEMA app on your smartphone or tablet or calling the FEMA Helpline at 1-800-621-3362 (TTY 800-462-7595) between 7 a.m. and 10:30 p.m. everyday. The helpline has specialists who speak various languages.\nGrant applicants will be asked to give the need for funding and the following information:\n\nSocial Security number\nAddress of the damaged primary residence\nDescription of the damage\nInformation about insurance coverage\nA current contact telephone number\nAn address where they can receive mail\nBank account and routing numbers for direct deposit of funds\n\nFEMA grants do not have to be repaid. FEMA assistance is nontaxable and will not affect eligibility for Social Security, Medicaid or other federal benefits.\nRegistering for federal aid through FEMA is required, even if homeowners, renters or business owners have registered for assistance with other disaster-relief organizations such as the American Red Cross. Residents should register even if they have insurance since FEMA may be able to assist with underinsured losses after the claims are settled.\nThe U.S. Small Business Administration is also offering low-interest disaster loans and has established a virtual Disaster Loan Outreach Center staffed from 5 a.m. to 5 p.m. seven days a week. A customer service representative can answer questions about the loan program, explain the application process and help residents and business owners complete their electronic loan application.  To contact the SBA representatives, either email them at FOCWAssistance@sba.gov or call 1-800-659-2955 (TTY 1-800877-8339).\nFor more information about the disaster loan program, potential applicants may also email disastercustomerservice@sba.gov or visit SBA.gov/disaster.\nMore Valley Fire disaster assistance information is available at sdcountyrecovery.com or by emailing ValleyFireRecovery@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201023.15.04.20"}