{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Youth Challenge Invites Submissions from Artistic San Diegans", "description": "Young San Diegans are invited to help raise awareness about opioid overdoses and the dangers of counterfeit and illicit opioids using their video and art skills.  ", "datePublished": "2023-05-09T14:47:10-07:00", "url": "https://www.countynewscenter.com/youth-challenge-invites-submissions-from-artistic-san-diegans/", "keywords": ["health", "fentanyl", "naloxone", "national fentanyl awareness day", "opioid", "youth"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-05-09T14:48:35-07:00", "articleType": "article", "articleContent": "\nYoung San Diegans are invited to help raise awareness about opioid overdoses and the dangers of counterfeit and illicit opioids using their video and art skills.  \nThe County’s current Scoop from You(th) Challenge focuses on the opioid crisis and will accept submissions from San Diegans ages 12 to 25 from May 9, in recognition of National Fentanyl Awareness Day, through July 11, in three categories: \n\nTik Talk – Provide an overview on a topic related to the opioid crisis, such as illicit fentanyl or naloxone. Submissions must be 10 minutes or less and feature at least one resource for the community. \nFast Facts – Create an original handcrafted or digitally designed piece of visual art that highlights at least one fact specifically about illicit opioids or naloxone. \nReal Reel – Create a 15 to 90 second video that provides a personal testimonial or public service announcement related to the opioid crisis. Submissions must provide a clear call to action. \n\nThe challenge, sponsored by Live Well San Diego partner Rescue Agency, will award one winner $1,200 and the opportunity to have their submitted content featured in awareness campaigns on County communication channels.  \nSix more age group winners will also receive gift card awards of $400 and $100 along with a signed certificate. \nTo see complete contest rules and enter to win, visit the LiveWellSD.org/ScoopFromYouth.  \nMay 9 is National Fentanyl Awareness Day   \nThe launch of this summer’s Scoop from You(th) Challenge coincides with National Fentanyl Awareness Day, which encourages everyone to get informed about the dangers of illicitly manufactured fentanyl, spread the word, and be prepared. \nIllicit fentanyl is a synthetic opioid that can be lethal in tiny amounts, the size of three grains of salt, which users may be unaware is present in their pills.  \nCounty-wide in 2021, illicit fentanyl was a cause of death in 814 accidental overdoses, according to the Medical Examiner.  \nThe County is making efforts to distribute naloxone, a lifesaving nasal spray that can reverse the effects of an opioid overdose, including those induced by fentanyl. The County’s Naloxone Distribution Program aims to disseminate 33,000 naloxone kits by June 30 in part through direct community outreach and even vending machines.  \nNaloxone is available for pick-up at all of the County’s Public Health centers and carried at many pharmacies.  \nMore information about illicit fentanyl, including how to speak to youth about its risks, and a list of where to find naloxone near you is available on Up2SD.org.  \nSubstance use treatment resources are also available by calling the County’s Access and Crisis Line at (888) 724-7240, calling 9-8-8 or 2-1-1. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230509.14.47.10"}