{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Fire’s Emergency Medical Services Office Recognized for Leadership", "description": "The Hospital Association of San Diego and Imperial Counties awarded San Diego County Fire’s Emergency Medical Services Office with a Community Leadership Award.", "datePublished": "2022-11-30T15:36:11-08:00", "url": "https://www.countynewscenter.com/county-fires-emergency-medical-services-office-recognized-for-leadership/", "keywords": ["public safety", "brian christison", "county ems", "county fire", "health services capacity task force", "hospital association of san diego and imperial counties", "san diego county fire", "san diego county fire director jeff collins"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-12-01T08:41:02-08:00", "articleType": "article", "articleContent": "\nThe Hospital Association of San Diego and Imperial Counties awarded San Diego County Fire’s Emergency Medical Services Office with a Community Leadership Award.\nThe award, presented at the association’s 2022 annual meeting, recognizes the EMS office for organizing a regional Health Services Capacity Task Force. The Health Services Capacity Task Force provides leadership to collaboratively address challenges experienced in the entire continuum of care, from first responders to hospital to outpatient and rehabilitation to community care.\nBrian Christison, San Diego County Fire EMS Program Coordinator\nThe award was accepted by San Diego County Fire Director Jeff Collins and Brian Christison, County EMS program coordinator. In accepting the award, Christison recognized the dedication and collaborative spirit displayed by the Task Force members, healthcare providers, and the hospital association during this unprecedented situation.\nThe award is inscribed with the following: “With appreciation for your leadership to inform policy and support disaster response strategies to collectively preserve the health and safety of our region.”\nCreated in 1997, the task force ensures a planned, systematic response to prehospital and hospital capacity stresses stemming from influenza. Since then, it has evolved to emphasize “all-hazard” event management using an evidence-based approach with newly available metrics, enhanced data markers, and optimized sector-specific actions. This task force remained deeply engaged throughout the COVID-19 pandemic to ensure all-community access to needed services and care.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221130.15.36.11"}