{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Active TB Cases Reported on Certain Trolley and Bus Lines", "description": "The Tuberculosis Program in County Public Health Services (PHS), in collaboration with Metropolitan Transit System (MTS), is working to notify riders who used certain Trolley Blue and Green lines between February 16, 2023 and August 15, 2023, and bus riders and drivers who used Route 901 between April 22, 2023 and July 15, 2023, that they were potentially exposed and are at risk for tuberculosis (TB) infection.", "datePublished": "2023-10-11T11:00:07-07:00", "url": "https://www.countynewscenter.com/active-tb-cases-reported-on-certain-trolley-and-bus-lines/", "keywords": ["health", "dr wooten", "mts", "phs", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-10-11T11:00:07-07:00", "articleType": "article", "articleContent": "\nThe Tuberculosis Program in County Public Health Services (PHS), in collaboration with Metropolitan Transit System (MTS), is working to notify riders who used certain Trolley Blue and Green lines between February 16, 2023 and August 15, 2023, and bus riders and drivers who used Route 901 between April 22, 2023 and July 15, 2023, that they were potentially exposed and are at risk for tuberculosis (TB) infection.\nThe lines and routes impacted are:\n\nTrolley Blue Line between Balboa Ave Transit Center and Old Town Transit Center, and on the Green Line between Fashion Valley and Old Town roughly between the hours 6 a.m. to 12 p.m. Monday to Sunday\nBus Route 901 from Iris Avenue Transit Center to Palm Ave., and 8th Street between the hours 10 a.m. to 11 a.m. and 6 p.m. to 8 p.m.\n\nTrolley exposures did not occur on a specific schedule. As such, large numbers of people may have had exposures, but the likelihood that any particular rider had long cumulative exposure times is low.\nThe chance of TB infection is highest for people with many hours of cumulative indoor exposure to a person who is sick with TB. Brief interactions with an ill rider are less likely to lead to TB infection than are prolonged or repeated exposures. However, the risk from more limited exposures may be of particular concern to riders with compromised immune systems, from medical conditions such as HIV or from medications that weaken the immune system, such as those taken by people with autoimmune conditions or who have received transplants.\nCounty and MTS are providing this information so that immunocompromised riders in particular are aware and can make the best decisions for their own health alongside their medical provider.\nPeople with active tuberculosis are often unaware they have the disease and may be contagious for several months before being diagnosed. Once the County is made aware, typically through a test result reported by a medical provider, communicable disease investigators conduct extensive interviews with the person with TB to determine the length of time they may have been contagious and locations where exposures may have occurred.\nWhile MTS follows CDC recommended sanitation practices, TB is airborne and not spread by touch, so cleaning practices do not impact the risk of tuberculosis in transit vehicles or stations.\nOther MTS riders with TB have been previously reported in August and September 2022, and in February 2023. At this time the County of San Diego Health and Human Services Agency does not have any evidence directly linking the rider(s) most recently diagnosed with TB to the other MTS riders. Additional lab tests will be conducted to determine if there may be linkages between any of these riders.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with TB will become ill in the future, sometimes even years later, if their latent TB infection is not treated. Blood tests and skin tests are effective to determine whether someone has been infected.”\nPeople who test positive for TB but who don’t have symptoms of active tuberculosis should get a chest x-ray and talk to a medical provider, as they likely have latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from ever getting sick.\nIt is important for individuals with symptoms of active TB and those who are immunocompromised to see a medical provider to rule out active tuberculosis and to discuss treatment.\nIndividuals who would like more information on this potential exposure should call the County TB Control Program at 619-692-5565.\nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 cases in 2020 and 201 people reported with active disease in 2021. In 2022, 208 people were reported with active TB disease in San Diego County. An estimated 175,000 people in San Diego County have latent TB infection and are at risk for developing active TB without preventive treatment.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231011.11.00.07"}