{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Probation Chief Brings Expertise and Diversity", "description": "The San Diego County Probation Department has a new Chief to lead the department's transformation and support the successful transition of people back to the community.", "datePublished": "2022-01-11T13:39:05-08:00", "url": "https://www.countynewscenter.com/new-county-probation-chief-brings-expertise-and-diversity/", "keywords": ["public safety", "probation", "probation chief", "psg", "public safety group", "tamika nelson"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-01-11T15:13:01-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Probation Department has a new Chief to lead the department’s transformation and support the successful transition of people back to the community.\nTamika Nelson is the first woman to lead the County’s probation department.  She recently served as the Assistant Chief Probation Officer in San Joaquin County, managing a department with more than 350 sworn and non-sworn personnel.  In her position with San Joaquin County, Assistant Chief Nelson helped deploy evidence-based case management approaches to increase public safety and reduce recidivism.\nShe also helped expand transitional services such as behavioral health services, community-based support services and educational services to youth and families to improve the lives of justice-involved clients.\nNelson led a committee to reduce racial and ethnic disparities in San Joaquin County.\n“I’m humbled and honored by this opportunity to serve the community of San Diego as the Chief Probation Officer,” Nelson said. “I’m excited to bring my experience with nurturing collaborative relationships, evidenced-based practices, and data-driven decision making to a highly motivated and innovative team. I’m looking forward to further collaborations with stakeholders and the community to do our part in pursuing public safety.”\nNelson will lead the Probation Department in its mission to provide the highest quality of service through a continuum of services, family and community engagement, restorative practices, and employee-focused enrichment. The San Diego County Probation Department includes 1,009 employees with a budget of $236 million and is a part of the County’s Public Safety Group.\n“Everyone deserves a second chance, especially young people who have taken a wrong turn in life,” said Nathan Fletcher, Chair of the San Diego County Board of Supervisors. “We are reimagining the services we provide to youth, opening new facilities that align with our goals, and we’ve hired new leadership to help us drive change in the probation department. I look forward to working closely with our new Chief Probation Officer Tamika Nelson, her background, experience rehabilitating justice-involved youth, and values align with the new direction we are taking our county.”\nTamika Nelson attended the University of California, San Diego and earned her Juris Doctor from the Humphreys School of Law in Stockton.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220111.13.39.05"}