{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Nears 10,000 Monoclonal Antibody Treatment Milestone", "description": "Nearly 10,000 San Diegans diagnosed with COVID-19 have received monoclonal antibody treatments since these intravenous infusions became available in the region in February of last year. Monoclonal antibodies are laboratory-made proteins that mimic the immune system’s ability to fight viruses.", "datePublished": "2022-05-26T17:50:35-07:00", "url": "https://www.countynewscenter.com/?p=208644", "keywords": ["health", "covid-19", "marc", "monoclonal antibody treatment"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-05-27T09:50:01-07:00", "articleType": "article", "articleContent": "\nCounty health officials urged San Diegans diagnosed with COVID-19 to seek the treatments now available, as they gathered to mark a milestone in fighting the disease.\nNearly 10,000 San Diegans diagnosed with COVID-19 have received monoclonal antibody treatments at the Monoclonal Antibody Regional Centers (MARCs) since these medications became available in the region in late 2020.\nMore recently, antiviral pills were introduced, and are now recommended as a first option. Both antiviral pills and monoclonal antibodies are available at the MARCs.\n“We know treatments work and can lower the risk of severe illness and hospitalization by nearly 90 percent,” said Jennifer Tuteur, M.D., County deputy chief medical officer. “If you test positive for COVID, please isolate from others and seek treatment as soon as you can if you develop symptoms and are at high risk.”\nTreatment can prevent a person from progressing to more severe illness, therefore cutting down on need for hospitalizations and risk of dying from COVID. The antiviral pills are available at multiple locations and community pharmacies across San Diego, including Test to Treat sites (1-888-634-1123). Antiviral pills must be prescribed by a health care provider and started within five days of symptoms to be effective. Monoclonal antibodies must be started within seven days.\nTo determine which treatment is best for you, talk to your doctor or health care provider, or call 2-1-1 to find a provider.\nMARCs operate seven days a week with locations in Vista, Clairemont, Hillcrest, and Chula Vista. MARCs offer treatment with the antiviral pill Paxlovid and the monoclonal antibody Bebtelovimab, both of which are effective against the Omicron variant.\nYou can call (619) 685-2500 to schedule a no-cost appointment at the MARCs, regardless of health insurance or immigration status. A referral or prescription is not required.\nLearn more about all options on the County’s COVID-19 Treatment page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220526.17.50.35"}