{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Urged to Be Cautious About COVID-19 This Holiday Season", "description": "If you’re planning to celebrate Thanksgiving or other holiday events with family and friends, make sure they’re all vaccinated or take other measures to prevent getting and spreading COVID-19.", "datePublished": "2021-11-24T17:57:12-08:00", "url": "https://www.countynewscenter.com/san-diegans-urged-to-be-cautious-about-covid-19-this-holiday-season/", "keywords": ["health", "coronavirus", "covid-19", "thanksgiving", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-11-24T17:57:12-08:00", "articleType": "article", "articleContent": "\nIf you’re planning to celebrate Thanksgiving or other holiday events with family and friends, make sure they’re all vaccinated or take other measures to prevent getting and spreading COVID-19.\nCounty health officials says it’s fine to not use face masks at holiday gatherings provided everyone is vaccinated. The vaccine is the best protection there is against COVID-19.\n“The safest way to celebrate Thanksgiving and other holiday events is to do it with people who are fully vaccinated against COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “If you’re not sure whether someone is vaccinated, everyone should wear a mask and take other precautions to prevent getting sick and infecting others with COVID-19.”\nVaccination Progress:\n\nDoses administered: Almost 5.55 million.\nReceived at least one shot: Over 2.64 million or 84.0% of San Diegans ages 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.35 million or 74.7 %.\nBoosters administered: 414,814.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n24 new deaths were reported since the last report on Nov. 17, 2021. The region’s total is 4,325.\n15 men and nine women died between Sept. 17 and Nov. 19, 2021.\nNine were 80 years of age or older, six were in their 70s, five were in their 60s and four were in their 50s.\nEight of the people who died were fully vaccinated and 16 were not fully vaccinated.\n22 had underlying medical conditions and two did not.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n403 COVID-19 cases were reported to the County on Nov. 23, 2021. The region’s total is now 382,450.\n3,197cases were reported in the past week (Nov. 17 through Nov. 23) compared to 3,117 cases identified the previous week (Nov. 10 through Nov. 16)\nDuring the 30-day period between Oct. 12 to Nov. 10, there were 334 COVID-19 hospitalizations; 297 people were not fully vaccinated and 37 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 14.2 overall, 8.6 for fully vaccinated people and 23.9 for not fully vaccinated San Diegans.\n16,209 tests were reported to the County on Nov. 23, and the percentage of new positive cases was 2.5%.\nThe 14-day rolling percentage of positive cases among tests is 2.6%.\n\nCommunity Setting Outbreaks:\n\n25 new community outbreaks were confirmed in the past seven days (Nov. 17 through Nov. 23): six in TK-12 grade school settings, six in business settings, four in daycare/preschool/childcare settings, two in government settings, two restaurant/bar settings, two in restaurant settings, one in a hotel/resort/spa setting, one in an after-school program setting and one in a distribution/warehouse setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays. County offices will be closed Nov. 25 and 26 for Thanksgiving.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211124.17.57.12"}