{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on New Casa de Oro Library", "description": "County officials and community members broke ground Wednesday on a project that will bring a new library branch to Casa de Oro to meet the growing needs of the community.", "datePublished": "2025-02-19T17:00:41-08:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-new-casa-de-oro-library/", "keywords": ["library", "county library", "equity and access", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2025-02-24T08:54:44-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty officials and community members broke ground Wednesday on a project that will bring a new library branch to Casa de Oro to meet the growing needs of the community.\nThe new library will be located at 9610 Campo Road in Spring Valley near Spring Valley Academy.\nThe current facility is in a leased location and is 6,000 square feet. The new library will double in size to 12,000 square feet with an approximately 2,000 square foot Community Room. In 2022, nearly 30,000 customers visited the branch and checked out over 63,250 items.\nSome of the features of the new library will include:\n\nPublic computers plus laptops for checkout\nHigh speed internet access and Wi-Fi throughout the branch\nCommunity Room with after-hours access for community events\nTeen area with study rooms\nChildren’s area with early literacy play equipment\nPatio space and a Friends of the Library Bookstore\nDesignated parking lot\n\nThe library is being built on Zero Net Energy and LEED Gold standards. This means that the library’s solar panels will produce the electricity it needs to operate.\nThe County gathered community input and engaged residents, businesses and other stakeholders about their needs for the library. This feedback helped to shape the design and types of features planned for this location. County staff will continue to work with the community about future design concepts as the project moves forward and revisions are made.\nThis project supports the library’s mission to celebrate our communities and help you create your own story. The project is funded by the County of San Diego.\nThe construction phase will begin winter 2025 with the branch set to open spring 2026. For more information about the project, visit sdcl.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250219.17.00.41"}