{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Influenza Cases Continue to Increase in San Diego", "description": "Seventy lab-confirmed influenza cases were reported in the San Diego area last week, 28 more than the week before, the County Health and Human Services Agency announced today.", "datePublished": "2021-12-01T11:01:33-08:00", "url": "https://www.countynewscenter.com/influenza-cases-continue-to-increase-in-san-diego/", "keywords": ["health", "flu", "flu vaccination", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-01T12:10:02-08:00", "articleType": "article", "articleContent": "\nSeventy lab-confirmed influenza cases were reported in the San Diego area last week, 28 more than the week before, the County Health and Human Services Agency announced today.\nTo date, a total of 423 flu cases have been reported locally this season, compared to the prior five-year average of 401 cases by this point.\n“Influenza continues to spread in the region. San Diegans should get vaccinated and take other preventive measures to avoid getting sick,” Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “The flu vaccine is safe and effective, and you can get it at the same time as your COVID-19 booster.”\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Nov. 27, 2021, the report shows the following:\n\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 4% the previous week)\nLab-confirmed influenza cases for the week: 70 (compared to 42 the previous week)\nTotal influenza deaths to date: 0 (compared to 0 at this time last season)\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe flu vaccine is especially important for people at higher risk of having serious complications from the virus.\nThey include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe influenza vaccine is now available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nIn 2020, a total of 848 influenza cases were reported in San Diego, including two deaths. In 2019, a total of 108 San Diegans died from influenza and more than 20,700 flu cases were reported.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211201.11.01.33"}