{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Estrella Provides Nearly 100 units of Affordable Housing in San Marcos", "description": "Dozens of low-income people and families, who have up to 80% of area median income, are moving into Estrella, the newest affordable housing development in San Marcos. ", "datePublished": "2024-11-20T16:12:18-08:00", "url": "https://www.countynewscenter.com/estrella-provides-nearly-100-units-of-affordable-housing-in-san-marcos/", "keywords": ["housing", "equity", "estrella", "housing"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-11-20T16:12:18-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteDozens of people and families, all who have up to 80% of area median income, are moving into Estrella, the newest affordable housing development in San Marcos. \nPartnering with the City of San Marcos, Affirmed Housing Group and others, the County helped fund the project with $2.64 million from the HOME program, which allocates federal funds from the Department of Housing and Urban Development (HUD) to the County to support affordable housing developments. \n“The County is all in on increasing affordable housing across our region” said David Estrella, director of the County’s Housing and Community Development Services (no relation to the housing). “Having an affordable place to live in all parts of the region gives families the opportunity to live near their kids’ school and recreation areas, helping these families and North County thrive.” \nThe Estrella development sits on land that used to house the aging 70-unit Mariposa Apartments. The County worked with Affirmed Housing to demolish the old building and redevelop the site with two complexes, Alora and Estrella, offering a combined 196 affordable units. \nEstrella broke ground in April 2023. For waitlist information please call 1-800-801-8440, Ext. 7151. \nSince 2017, the County has invested more than $314 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal, and local funding sources administered by the County. Those funds have helped open doors to nearly 2,500 homes with 3,100 more on the way. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241120.16.12.18"}