{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Due to January Flood, All CalFresh Recipients Can Purchase Hot, Prepared Food For Limited Time", "description": "All CalFresh recipients and new Disaster CalFresh recipients can use their Electronic Benefit Transfer (EBT) Card to purchase hot and prepared food for a limited time due to the Presidential Major Disaster Declaration for the Jan. 22 storms and flooding.  ", "datePublished": "2024-03-08T14:34:33-08:00", "url": "https://www.countynewscenter.com/due-to-january-flood-all-calfresh-recipients-can-purchase-hot-prepared-food-for-limited-time/", "keywords": ["health", "disaster cal fresh", "ebt", "hot food"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-03-08T14:43:49-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteAll CalFresh recipients and new Disaster CalFresh recipients can use their Electronic Benefit Transfer (EBT) Card to purchase hot and prepared food for a limited time due to the Presidential Major Disaster Declaration for the Jan. 22 storms and flooding.  \nWith few exceptions, CalFresh EBT cards usually can only be used to purchase shelf-stable foods. Through April 3, 2024, all CalFresh recipients can purchase hot and prepared food at any authorized EBT retailer. \nThe temporary change was approved by Food and Nutrition Service (FNS) for San Diego County which is part of the U.S. Department of Agriculture. The agency allows the modification under conditions such as power outages, damage to homes, the displacement of residents, and other conditions that prevent households from purchasing and preparing food. \nFNS has notified all authorized San Diego County EBT retailers of the waiver and is encouraging stores to post notices alerting customers of the change. \nThis change comes on the heels of the Disaster CalFresh application opening from March 7-15 for those experiencing challenges from the January rainstorm and flooding. That program provides a one-time payment to buy food for themselves and their families. \nFor a list of authorized EBT retailers, visit fns.usda.gov. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240308.14.34.33"}