{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Over 2 Million San Diegans Now Fully Vaccinated", "description": "More than 2 million San Diegans are now fully vaccinated against COVID-19, placing the County closer to achieving its vaccination goal.", "datePublished": "2021-08-04T16:55:05-07:00", "url": "https://www.countynewscenter.com/over-2-million-san-diegans-now-fully-vaccinated/", "keywords": ["health", "2 million fully vaccinated", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-08-04T17:48:39-07:00", "articleType": "article", "articleContent": "\nMore than 2 million San Diegans are now fully vaccinated against COVID-19, placing the County closer to achieving its vaccination goal.\nThe County reached the milestone over the weekend and by Aug. 3, a total of 2,015,700, or 71.9%, of residents 12 and older had received two doses of the Pfizer or Moderna vaccine or one dose of the Johnson & Johnson shot.\n“Great job, San Diegans!” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The more people who get vaccinated the closer we will be to achieving our vaccination goal.”\nThe County had set a goal of vaccinating 75% of the 2.8 million residents who are eligible to get the vaccine, which comes out to 2,101,936 people. About 86,000 more San Diegans are needed to reach that target, which is five percentage points higher than the state and national goal.\n“We’re confident we’ll achieve that goal,” Wooten said, adding that there are more than 284,000 San Diegans who are partially vaccinated. “However, we must keep going if we want to prevent the spread of COVID-19, move the economy forward and get back to our pre-pandemic way of life.”\nThere’s plenty of COVID-19 vaccine in the region. You can find it at doctors’ offices, retail pharmacies, community clinics and County sites for people with no medical provider. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\nCounty Opens More COVID-19 Testing Sites\nGiven the increasing demand for COVID-19 testing, the County is opening six additional sites throughout the region this week.\nThe new sites are located at Cal State San Marcos, four at County clinics and one at San Diego State University which is scheduled to open later this week.\nSome of the new or existing sites require appointments. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\nVaccination Progress:\n\nDoses administered: More than 4.34 million.\nReceived at least one shot: About 2.3 million or 82.1% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Over 2.01 million or 71.9%.\nThe goal: vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 109.4% of the goal population has received at least one vaccine and 95.9% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nDeaths:\n\nSeven new deaths were reported since the last report on July 28. The region’s total is 3,805.\nFive men and two women died between July 15 and July 31, 2021.\nOn of the deceased was in their 70s, four in their 60s, one in their 50s and one was in their 30s.\nSix had underlying medical conditions and one did not.\n\nCases, Case Rate and Testing:\n\n908 COVID-19 cases were reported to the County on Aug. 3. The region’s total is now 301,100.\nSan Diego County’s overall case rate is 20.4 cases per 100,000 residents as of Aug. 3. The case rate among those who are not fully vaccinated is 40.0 per 100,000, which is more than ten times the rate among those fully vaccinated (3.6 per 100,000)\n11,748 tests were reported to the County on Aug. 3, and the percentage of new positive cases was 7.7%.\nThe 14-day rolling percentage of positive cases among tests is 7.8%.\n\nCommunity Setting Outbreaks:\n\n59 new community outbreaks were confirmed in the past seven days (July 28 through Aug. 3): 19 in restaurant/bar settings, 14 in business settings, five in faith-based settings, four in restaurant settings, four in daycare/preschool/childcare settings, three in TK-12 school settings, three in a hotel/resort/spa setting, two in emergency services settings, one in retail settings, one in a government setting, one in a health care setting, one in a construction setting and one in residence setting.\n\n\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m. on Wednesdays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210804.16.55.05"}