{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Grand Opening Held for Dianne Jacob Lakeside Equestrian Park", "description": "The County of San Diego opened the Dianne Jacob Lakeside Equestrian Park.", "datePublished": "2023-12-12T12:37:22-08:00", "url": "https://www.countynewscenter.com/grand-opening-held-for-dianne-jacob-lakeside-equestrian-park/", "keywords": ["parks and rec", "county parks", "dianne jacob", "dianne jacob lakeside equestrian park", "lakeside", "parks and recreation"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2023-12-12T12:38:03-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego opened the Dianne Jacob Lakeside Equestrian Park Sunday.\nOver 400 people attended the event featuring a ribbon-cutting, family-friendly activities and an arena show. The show included various equestrian performers showcasing dressage, jumping and reigning skills.\nThe park is named for Dianne Jacob who served as County Supervisor for 28 years. She was a steward for parks in San Diego County during her time in office.\n“Dianne has always been an advocate for parks and recreation – and for any program that engages families, especially youth, in healthy activities,” said County Parks Director Brian Albright. “During her time at the County, she had a hand in opening over 100 park features and facilities.”\nPlans for the nearly 14-acre park date back to 2012, with construction beginning in 2020. The park can host a variety of equestrian and livestock-related events.\nThe new park has a large, covered arena, an open arena, a maintenance building, a restroom building, a banquet hall, livestock corrals, a shade pavilion, picnic tables, parking and ADA access.\n“It’s one-of-a-kind and it’s going to bring in events from all over the state of California,” said Jacob. “This is going to put Lakeside on the map.”\nThe park is located at the northeast corner of Moreno Avenue and Willow Road. A day-use park located at the south end of Moreno Avenue will be open to the public daily, from sunrise to sunset, as soon as the operator is fully staffed. In addition, information is forthcoming on how to use other parts of the facility when not booked for special events. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231212.12.37.22"}