{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Take A Moment for your Mental Health at NAMIWalks and Wellness Expo Saturday ", "description": "San Diegans are invited to walk together for mental health at the annual San Diego NAMI Walks and Mental Wellness Expo this Saturday, April 27, 2024. This year’s theme is “I am NAMIWALKS.” ", "datePublished": "2024-04-25T16:50:12-07:00", "url": "https://www.countynewscenter.com/take-a-moment-for-your-mental-health-at-namiwalks-and-wellness-expo-saturday/", "keywords": ["health", "mental health", "mental health matters month", "namiwalks"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-04-25T16:50:12-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diegans are invited to walk together for mental health at the annual San Diego NAMI Walks and Mental Wellness Expo this Saturday, April 27, 2024. This year’s theme is “I am NAMIWALKS.” \nThe free event, organized by the National Alliance on Mental Illness in partnership with the County’s Health and Human Services Agency, kicks off Mental Health Matters Month which happens every May.   \nCommunity members are invited to join local organizations in raising awareness about mental health, addressing the stigma surrounding mental health topics and coming together to let others know they are not alone. \n“Every year, the NAMIWalks gives us an incredible opportunity for our communities to come together and take a moment to think about our mental health and how we can support one another,” said Dr. Luke Bergmann, Director of County Behavioral Health Services. “This weekend kicks off Mental Health Matters Month which reminds us that taking care of our emotional well-being is important every day.” \nThe day starts with a no-cost community walk around Preble Field in NTC Park at Liberty Station. The walk begins at 8:15 a.m. following opening remarks.  \nA Mental Wellness Expo is open from 7 a.m. to 11 a.m. and will feature more than 100 exhibitor booths offering resources for families, children, military members and veterans, and hands-on activities that can help improve mental health.   \nBooths hosted by the County include an affirmation potting station, stigma busting photo booth, Naloxone distribution, face painting, a children’s activity booth and Tai-Chi demonstrations.  \nTo register for the NAMIWalks and Mental Wellness Expo, visit the event website.  \nIf you or someone you know is experiencing a mental health challenge, call the Access and Crisis Line at 1-888-724-7240. More resources are also available on the County BHS Resources webpage and the It’s Up to Us SD website that also includes a list of other activities surrounding Mental Health Matters Months.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240425.16.50.12"}