{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Plans to Offer COVID-19 Vaccine to People 65 Years and Older", "description": "Gov. Gavin Newsom has announced that people 65 years of age and older are the next priority group for COVID-19 vaccination, and the County is planning to make the vaccine available to them as soon as possible.", "datePublished": "2021-01-13T17:40:07-08:00", "url": "https://www.countynewscenter.com/county-plans-to-offer-covid-19-vaccine-to-people-65-years-and-older/", "keywords": ["health", "65 and older", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-13T17:40:07-08:00", "articleType": "article", "articleContent": "\nGov. Gavin Newsom has announced that people 65 years of age and older are the next priority group for COVID-19 vaccination, and the County is planning to make the vaccine available to them as soon as possible.\nThe region is currently vaccinating the 620,000 health care professionals and other priority groups in Phase 1A. Vaccinations to the more than 600,000 people in Phase 1B will begin to be available later this month, provided there are COVID-19 vaccination doses available.\nHowever, some San Diegans in this age group might be able to get vaccinated if their health care providers have doses available. The County has asked local providers to give priority to people 65 and older with underlying medical conditions.\n“It would be ideal if we could vaccinate everyone who wants to be immunized at the moment, but unfortunately we don’t have enough COVID-19 vaccine to do so,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We understand people are anxious to get vaccinated and they will get to do it when more vaccine arrives in the region.”\nWhen County sites begin vaccinating San Diegans 65 years and older, the public will be informed in a number of ways, including on coronavirus-sd.com.\nThe region is expecting the arrival of more COVID-19 vaccine doses, but a figure and a date have not been released by the California Department of Public Health and Centers for Disease Control and Prevention.\nStarting in February, the County will begin to open three more vaccination super stations in other parts of the region.\nA nurse prepares a COVID-19 vaccine to be administered at Petco Park.\nTo date, about 242,000 COVID-19 vaccine doses have been shipped to the region – an amount that does not include doses shipped to vaccinate people in long-term care facilities, multi-county entities and military and veterans’ hospitals.\nThrough Jan. 12, a total of 92,305 COVID-19 doses have been administered to San Diegans; 79,607 to people who have received their first dose and 12,698 to people who have received both doses of the vaccine. The totals only include vaccine doses that have been recorded in the San Diego Immunization Registry and it is likely the number of those vaccinated is higher. The California Department of Public Health has asked vaccine providers to enter vaccinations administered into the registry within 24 hours.\nCOVID-19 Cases Surpass 200,000 as Deaths Near 2,000 \nThe number of COVID-19 cases reported in the region has surpassed more than 200,000 infections.\nAn additional 3,261 were reported Jan. 12 and the region’s total is now 201,580.\nFurthermore, an additional 54 COVID-19 deaths were reported in San Diego County for a total of 1,952, one of the highest daily totals recorded since the pandemic began.\n“The high number of cases and deaths we are seeing shows that the virus is everywhere,” Wooten said. “People should be taking every precaution necessary, including getting vaccinated if they’re in a priority group that is currently being immunized.”\nWooten continues to urge San Diegans to do the following:\n\nWash your hands\nWatch your distance around others\nWear a mask\nWhen sick, stay home and get tested\n\nFor more information about COVID-19, testing locations and vaccine distribution, visit www.coronavirus-sd.com.\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed on Jan. 12: three in business settings, one in a daycare/preschool/childcare, one in a distribution warehouse setting, one in a faith-based setting and one in a hotel/resort/spa setting.\nIn the past seven days (Jan. 6 through Jan. 12), 46 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n14,636 tests were reported to the County on Jan. 12, and the percentage of new positive cases was 22%.\nThe 14-day rolling average percentage of positive cases is 14.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 25,805.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n6,475 or 3.2% of all cases have required hospitalization.\n1,275 or 0.6% of all cases and 19.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nOf the 54 new deaths reported Jan. 12, 30 people who passed away were 80 years or older, 15 people were in their 70s, four people were in their 60s, three people were in their 50s, one person was in their 40s and one person was in their 30s.\n51 had underlying medical conditions and three had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210113.17.40.07"}