{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Vaccination Totals Include Children Ages 5 and Older, Boosters", "description": "The number of children ages 5 through 11 who have received a COVID-19 vaccine and the total number of people who have gotten a booster shot will now be reflected in the local COVID-19 vaccination reports and dashboards.", "datePublished": "2021-11-10T17:50:58-08:00", "url": "https://www.countynewscenter.com/county-covid-19-vaccination-totals-include-children-ages-5-and-older-boosters/", "keywords": ["health", "boosters", "child vaccinations", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-11-10T18:27:08-08:00", "articleType": "article", "articleContent": "\nThe number of children ages 5 through 11 who have received a COVID-19 vaccine and the total number of people who have gotten a booster shot will now be reflected in the local COVID-19 vaccination reports and dashboards.\nThrough Nov. 9, a total of 279,293 San Diegans had received a COVID-19 booster and 7,320 children ages 5 through 11 had received their first shot of the Pfizer vaccine, the only one approved for this age group.\n“It’s great that San Diegans are getting their booster shots and that parents are vaccinating their children. This will help to reduce the spread of COVID-19 as we enter the holiday season and into 2022,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The more people who are vaccinated, the better off we’ll be at putting this pandemic behind us.”\nCOVID-19 vaccines for all eligible ages and booster shots are available at health care providers, retail pharmacies, clinics and other medical providers. Appointments can be made at myturn.ca.gov or by calling (833) 422-4255.\nChange in COVID-19 Vaccination Percentages\nThe County has added children ages 5 to 11 to the number of San Diegans who are eligible to get the COVID-19 vaccine.\nThat new total of eligible residents for the COVID-19 vaccine is 3,147,936 .\nAs a result, the percentages of San Diegans who have received at least one dose of the COVID-19 vaccine and of those who are fully vaccinated dropped by about nine percentage points each compared to last week.\nAlso, the County Health and Human Services Agency will no longer be producing COVID-19 case data on weekends. Moving forward, the COVID-19 statistics page will be updated Monday through Friday—except holidays—around 5 p.m. at coronavirus-sd.com.\nA child gets vaccinated against COVID-19 at Rady Children’s Hospital.\nVaccination Progress:\n\nDoses administered: Almost 5.3 million.\nReceived at least one shot: Over 2.57 million or 81.7% of San Diegans 5 and older are partially vaccinated.\nFully vaccinated: Over 2.32 million or 73.8%.\nBoosters administered: 279,293.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n31 new deaths were reported since the last report on Nov. 3, 2021. The region’s total is 4,272.\n20 men and 11 women between Aug. 23 and Nov. 4, 2021.\nEight were 80 years of age or older, five were in their 70s, eight were in their 60s, three were in their 50s, three were in their 40s, three were in their 30s and one was in their 20s.\nNine of the people who died were fully vaccinated and 22 were not fully vaccinated.\n29 had underlying medical conditions, one did not and one had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n447 COVID-19 cases were reported to the County on Nov. 9, 2021. The region’s total is now 376,114.\n3,431 cases were reported in the past week (Nov. 3 through Nov. 9) compared to 3,359 cases identified the previous week (Oct. 27 through Nov. 2)\nIn the past 30 days (Oct. 11 through Nov. 9), there were 259 COVID-19 hospitalizations; 235 people were not fully vaccinated and 24 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 14.6 overall, 8.4 for fully vaccinated people and 24.8 for not fully vaccinated San Diegans.\n15,965 tests were reported to the County on Nov. 9, and the percentage of new positive cases was 2.8%.\nThe 14-day rolling percentage of positive cases among tests is 2.7%.\n\nCommunity Setting Outbreaks:\n\n32 new community outbreaks were confirmed in the past seven days (Nov. 3 through Nov. 9): 10 in TK-12 grade school settings, nine in business settings, three in daycare/preschool/childcare settings, two in college/university settings, two in construction settings, one in a grocery setting, one in a restaurant/bar setting, one in a faith-based setting, one in a community-based setting, one in a hotel/resort/spa setting and one in an emergency services setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211110.17.50.58"}