{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "SDSU Cases Jump, Students Need to Stay Home", "description": "With the Labor Day weekend beginning, the County of San Diego is reporting 120 additional confirmed and probable COVID-19 cases among San Diego State University’s undergraduate students, bringing the total number of cases at SDSU to 184 since Aug. 24.", "datePublished": "2020-09-04T15:58:57-07:00", "url": "https://www.countynewscenter.com/sdsu-cases-jump-students-need-to-stay-home/", "keywords": ["health", "coronavirus", "coronavirus case rate", "covid-19", "emergency"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2020-09-05T14:03:23-07:00", "articleType": "article", "articleContent": "\nWith the Labor Day weekend beginning, the County of San Diego is reporting 120 additional confirmed and probable COVID-19 cases among San Diego State University’s undergraduate students, bringing the total number of cases at SDSU to 184 since Aug. 24.\nThe number of cases includes multiple suspected outbreaks involving students living both on and off campus and is expected to increase. County health officials want students to remain in place this weekend to prevent the virus from spreading.\n“SDSU undergrads need to stay home within their living units this weekend,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We need your help to stop the spread within your campus community and our larger community. If you have been to parties and social events, you need to get tested, now. And quarantine yourself until you get results.”\nNone of the cases under investigation are related to on-campus educational activities, including classes or labs. They involve 14 distinct groups that have so far been identified within housing and gathering locations. Some of these groups may be determined to be outbreaks.\nCounty epidemiology teams continue to conduct on-site investigations of suspected outbreaks and speak personally with students.\nAll members of the SDSU undergraduate community who have attended gatherings or think they may have been exposed to the virus are urged to follow public health best practices. Those include:\n\nAvoiding parties and gatherings outside the household\nWearing face coverings\nSocial distancing\nPracticing good hygiene\n\nThe County is reporting 453 positive cases today, the most since 551 were reported on Aug. 7. Even without the SDSU cases, the number of cases is concerning, particularly since most of the infections took place before the most recent reopening of certain activities.\n“This news is a reminder that we all have a role in keeping the infection rate down,” said Dr. Wooten. “I’m asking San Diegans to take a look at their individual actions and, if necessary, adjust their behaviors to help ensure we remain safe and moving in the right direction.”\nCOVID-19 Testing Labor Day Weekend\nCOVID-19 testing will be available throughout the weekend and on Labor Day. Appointments are necessary for most County testing sites.\nTesting on Labor Day will be limited to three County sites that do not require an appointment. Walk-in testing will take place at Tubman Chavez Center and CSU San Marcos from 8:30 a.m. to 3 p.m., while the San Ysidro Border site will be open its regular hours of 6:30 a.m. to noon.\nFor more information on free COVID-19 testing, visit 211sandiego.org or call 2-1-1.\nNew State Metrics:\n\nUnder the new state monitoring metrics, San Diego County is currently in Tier 2, also referred to as the Red Tier.\nSan Diego County’s state-calculated case rate is 5.8 and the testing positivity percentage is 3.8%.\nThe state will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 8.\n\nCommunity Setting Outbreaks:\n\nSix new outbreaks were confirmed on Sept. 3: two in grocery stores, one in a restaurant, one in a business, one in a hotel/resort/spa and one in a hair salon/barbershop.\nIn the past seven days, 22 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\n Testing:\n\n7,554 tests were reported to the County on Sept. 3 and the percentage of new laboratory-confirmed cases was 6%.\nThe 14-day rolling average percentage of positive cases is 4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,009.\n\nCases:\n\n453 new cases were confirmed among San Diego County residents on Sept. 3 for a total of 39,899.\n3,194 or 8.0% of cases have required hospitalization.\n768 or 1.9% of all cases and 24.05% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nOne new COVID-19 death was reported in San Diego County on Sept. 3. The region’s total is now 701.\nA woman in her late 60s died.\nShe had underlying medical conditions.\n\nMore Information:\nMore detailed data summaries can be found on the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200904.15.58.57"}