{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19, Affordable Housing Among Top 10 CNC stories in 2022", "description": "There was a lot going on in San Diego County in 2022, from the continuing fight against the COVID-19 pandemic, to working to end homelessness, create more affordable housing and the 2022 elections.", "datePublished": "2023-01-06T12:14:28-08:00", "url": "https://www.countynewscenter.com/?p=210443", "keywords": ["government", "covid-19", "mpox", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-01-06T12:14:28-08:00", "articleType": "article", "articleContent": "\nThere was a lot going on in San Diego County in 2022, from the continuing fight against the COVID-19 pandemic, to working to end homelessness, create more affordable housing and the 2022 elections.\nHere’s a glimpse of the Top 10 most viewed topics and stories from our County News Center over the past year. All the hard news and unusual stories that caught your eyes.\nCOVID-19\nThe COVID-19 pandemic continued to be the most important and widely watched story in 2022. The County’s Health and Human Services Agency (HHSA) continued to provide vaccinations including the bivalent booster, treatments and weekly updates as COVID-19 cases continued. As 2023 begins, COVID-19 cases and emerging variants continue to be detected and County health officials continue to urge people to get vaccinated or boosted if they haven’t been already.\nToday, more than 80% of all San Diegans have received their primary series of COVID-19 vaccinations and more than 20% have been boosted with the bivalent vaccine. And cases and the rates of hospitalizations and deaths have decreased from the surges in January and summer 2022. Here’s some of the County News Center’s continuing coverage.\nMpox\nPublic health was definitely the biggest story of the year for the County. As January 2023 begins, County residents are still dealing with a triple threat of illnesses, including COVID-19, a difficult flu season and a spike in “RSV”―respiratory syncytial virus. But before that triple threat, starting in the summer of 2022, the region and U.S. also dealt with an outbreak of the Mpox virus. An outbreak of hundreds of local cases prompted the County to declare a local emergency and provide thousands of vaccinations.\nMEHKO (Micro Enterprise Home Kitchens)\nEconomic opportunities came knocking for aspiring local chefs in February 2022 when the County officially opened its application process for people looking to turn their homes or apartments into mini restaurants. County supervisors unanimously approved a two-year pilot program the month before to let people countywide operate mini restaurants out of their homes―allowed to serve up to 30 in-person, take-out or delivery meals a day, up to 60 meals a week.\nNew district boundaries\nMore than 1 million San Diego County residents ― three out of every 10 ― woke up in a new supervisorial district in January 2022. That was because the boundaries of their County districts were revised by an independent redistricting commission that worked more than a year with public input in a series of 49 meetings. Redistricting is done once every 10 years, using U.S. Census data to ensure that voting districts contain roughly the same number of people. The new boundaries marked the first time they were created by an independent commission.\nAffordable housing\nAffordable housing was a huge story for San Diego County in 2022. The County Board of Supervisors spent millions of dollars and worked with numerous other cities and organizations to build housing to help people with low-incomes, people experiencing homelessness, seniors and veterans. There were affordable housing communities in City Heights, in Carlsbad, Vista, and in downtown San Diego. In a first of its kind project for the County, it used its own surplus property to begin transforming an empty lot into a site for low-income affordable housing. Since 2017, the County has leveraged about $1 billion in federal and state funding by investing more than $175 million on 44 affordable housing projects in 24 communities, many completed, others under construction and more on the way.\nRSV\nRespiratory Syncytial Virus, known as RSV, is a common respiratory virus that usually causes mild, cold-like symptoms. But a wave of cases, first detected here locally at a high school in October, became part of a triple threat viral wave with COVID-19 and the flu that threatened to overwhelm hospital emergency rooms.\nHurricane\nYou don’t often hear “hurricane” and San Diego County in the same sentence. So when you do, it draws a lot of attention. In September 2022, Hurricane Kay, forming off the coast of Mexico, generated a storm of concern that San Diego County would indirectly suffer big rains, big winds, and oddly, high temperatures. All that generated lots of interest in free County sandbags!\nElection\nElection years always generate lots of interest for County News Center viewers, from the flawlessly run primary in June to the general election in November.\nSummer movies, Parks and Library\nHey, living in San Diego County has its perks! And our residents are always interested in going to our parks and libraries!\nNaloxone\nThe fentanyl crisis, called the single deadliest drug threat the U.S. has ever faced by the Drug Enforcement Agency, has been deeply felt in San Diego County. Naloxone, or Narcan is an FDA approved medication designed to rapidly reverse an opioid overdose. And it is a key part of the County’s strategy to fight opioid and fentanyl overdose deaths―whether that’s working to expand its distribution, creating “leave behind” kits, or even installing naloxone vending machines around the county.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230106.12.14.28"}