{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Won’t Take Labor Day Off", "description": "Memorial Day came. People felt they needed to celebrate. As a result, COVID-19 cases rose dramatically in the following weeks.", "datePublished": "2020-09-04T10:16:22-07:00", "url": "https://www.countynewscenter.com/covid-19-wont-take-labor-day-off/", "keywords": ["health", "coronavirus", "covid-19", "emergency"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-09-04T10:16:22-07:00", "articleType": "article", "articleContent": "\nMemorial Day came. People felt they needed to celebrate. As a result, COVID-19 cases rose dramatically in the following weeks.\nRestaurants, gyms and other businesses reopened in mid-June and the same thing happened. Fourth of July came and went, and the local case count remained high. Ordered by the state, businesses closed indoor activities and cases went down.\nWith Labor Day right around the corner and some businesses reopened, County health officials are asking residents to please take the recommended precautions to prevent the spread of COVID-19.\n“Most people won’t be working over the long holiday period, but COVID-19 will not be taking the day off,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The more people go out and the more they interact with people outside their household, the more likely they are to contract the virus.”\nSan Diegans should take the following precautions to prevent the spread of COVID-19:\n\nDon’t host or attend private holiday parties.\nAvoid crowded places to decrease your risk of exposure.\nMaintain physical distance from others.\nIf you need to be in public, you must use a face covering if you are close to people outside your household. The coverings help prevent asymptomatic carriers of the virus from spreading it.\nIf you’re sick, stay home and isolate yourself from others.\nWash your hands properly and regularly or use a hand sanitizer.\nIf you’re out and about and notice that a business is not following the health guidance, report them to your local police department by calling the non-emergency number.\n\n“During normal times, people feel the need to get together with family and friends on holiday weekends,” Wooten said. “But these are not normal times and indoor gathering and celebrations increase the possibility of COVID-19 spread.”\nThe only way to prevent the spread of COVID-19 is with San Diegans’ help and cooperation. That’s what helped the County get off the state’s County Monitoring List and placed it in Tier 2 of the state’s new system of measuring risk.\n“We need to continue protecting ourselves and others to prevent the spread of COVID-19,” Wooten said. “We must do all we can to keep our county from taking a step back because that would force businesses that just reopened to close again.”\nCOVID-19 Testing Labor Day Weekend\nCOVID-19 testing will be available throughout the weekend and on Labor Day. Appointments are necessary for most County testing sites.\nTesting on Labor Day will be limited to three County sites that do not require an appointment. Walk-in testing will take place at Tubman Chavez Center and CSU San Marcos from 8:30 a.m. to 3 p.m., while the San Ysidro Border site will be open its regular hours of 6:30 a.m. to noon.\nFor more information on free COVID-19 testing, visit 211sandiego.org or call 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200904.10.16.22"}