{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Justice-Involved Youth Celebrated Positive Support People", "description": "In recognition of Mother’s Day, San Diego County Probation juveniles got to invite and celebrate a person or people that have offered them positive support.", "datePublished": "2025-05-13T14:23:40-07:00", "url": "https://www.countynewscenter.com/justice-involved-youth-celebrated-positive-support-people/", "keywords": ["public safety", "county probation", "youth transition campus"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-05-13T14:23:40-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteIn recognition of Mother’s Day, San Diego County Probation juveniles got to invite and celebrate a person or people that have offered them positive support.\nProbation collaborated with the San Diego County Office of Education to host the family engagement event Friday at the Youth Transition Campus. The event drew 117 parents or other supportive adults and allowed young people to reconnect and share a meal with them.\n“Probation staff and leadership are proud to host engagement events that uplift the voices of our youth and honor those who stand by them during their journey of transformation,” said Mike Whatley, a Probation division chief. “By fostering supportive relationships and celebrating family engagement events, opportunities like this help build the emotional foundation necessary for successful reintegration and long-term personal development.”\nProbation also recognizes the invaluable role that positive support people play in the lives of our justice-involved youth. The person, or persons, invited may have been a parent, guardian, mentor or other meaningful figure.\nParticipating youth welcomed their chosen positive support person to the facility and had an opportunity to express their gratitude to them with a framed portrait of themselves, a rose, and a hand-written appreciation card, said Whatley.\nThe Probation and San Diego County Office of Education collaboration exemplify a shared commitment to restorative practices and youth rehabilitation.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250513.14.23.40"}