{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Update on Restaurant Salmonella Outbreak", "description": "To date, the County has recorded 37 probable and confirmed cases of people who have gotten sick with Salmonella after dining at the Aladdin Mediterranean Café in the Clairemont San Diego area between April 25 to May 1.  ", "datePublished": "2025-05-08T17:24:46-07:00", "url": "https://www.countynewscenter.com/update-on-restaurant-salmonella-outbreak/", "keywords": ["health", "outbreak", "salmonella", "san diego"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-08T17:26:09-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteTo date, the County has recorded 37 probable and confirmed cases of people who have gotten sick with Salmonella after dining at the Aladdin Mediterranean Café in the Clairemont San Diego area between April 25 to May 1.  \nThe restaurant voluntarily closed on May 1. Operators have since been working closely with the County’s Environmental Health and Quality Department (DEHQ) along with Public Health Services on the investigation into the outbreak.  \nThe ages of those impacted range from 1 to 90 years old, with nine people hospitalized. The source of the Salmonella outbreak has not been identified and the investigation is ongoing. \nThe County continues to work closely with the restaurant operator. The restaurant will remain closed until it is safe to operate, and when its management is ready to reopen. \nSalmonella causes an infection called Salmonellosis. Symptoms include nausea, vomiting, diarrhea that might have blood or mucous, abdominal cramps and fever. Symptoms generally begin 12 to 72 hours after eating contaminated food. Illness from salmonella can last 4 to 7 days. Most people recover without treatment.  \nPeople who dined at Aladdin Mediterranean Café between April 25 and May 1, 2025 and feel ill with any of the symptoms listed should contact a healthcare provider as needed.   \nPeople who are still ill or have recovered after dining at Aladdin Mediterranean Café can report their illness to DEHQ by calling (858) 505-6814 or through this form if on a desktop or laptop device and by emailing it to fhdepi@sdcounty.ca.gov. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250508.17.24.46"}