{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Law Enforcement and Children Celebrate the Holidays Early at Shop with a Cop 2024", "description": "San Diego County Probation hosted this year’s Shop with a Cop Dec. 7 as a way to spread holiday magic to more than 300 children selected by area schools to participate in the festive annual event.", "datePublished": "2024-12-09T13:53:21-08:00", "url": "https://www.countynewscenter.com/law-enforcement-and-children-celebrate-the-holidays-early-at-shop-with-a-cop-2024/", "keywords": ["public safety", "county probation", "district attorney", "sheriff", "shopwithacop"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-12-09T13:58:09-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesSan Diego County Probation hosted this year’s Shop with a Cop Dec. 7 as a way to spread holiday magic to more than 300 children selected by area schools to participate in the festive annual event.\n“As the Probation Chief, I can tell you our officers and staff participate in this event every year because it brings them so much joy to be part of this special day for the children in our communities,” San Diego Chief Probation Officer Tamika Nelson said. “Our department really enjoyed hosting this year’s event and I want to thank all the officers, staff, and elves who helped raise funds and organize the event, and, of course, our generous donors.”\nA Probation officer shops with a girl at the Shop with a Cop event.\nThe event, which started in 1994, includes more than 300 officers from over 30 local, state and federal law enforcement agencies in San Diego County. All the officers and law enforcement staff volunteer to take part in the fun event.\nThe event is sponsored by local law enforcement agencies, SeaWorld, Target, and STAR/PAL.\nChildren are paired with law enforcement officers and taken to SeaWorld, where they are treated to breakfast and a special dolphin show put on just for them. Afterward, the children and their law enforcement “partners” caravan to Target, where each child is given a $200 gift card to shop for themselves and their families. Volunteers also help make the holidays enjoyable by wrapping gifts for the children to share with their loved ones.\nA San Diego County District Attorney’s Office investigator proudly show off the shopping haul.\nA San Diego Sheriff deputy helps his student partner spend his $200 gift card.\nSanta even made an appearance and was available for visits and photos.\n“We thought Probation did an absolutely amazing job as the host agency for Shop with a Cop! Their organization, dedication, and enthusiasm truly made the event special for the kids and the community,” said Andy Wiese, Interim CEO for STAR/PAL, a not-for-profit San Diego organization that builds relationships between youth and law enforcement through various leadership and mentoring programs.\nProbation passed the hosting duties to El Cajon Police Department for 2025.\nThe San Diego County District Attorney’s Office investigators pose with their Shop with a Cop partners at Sea World.\nThe San Diego Sheriff’s Office participated in this year’s Shop with a Cop event.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241209.13.53.21"}