{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Animal Services Welcomes New Director", "description": "The County has appointed Vaughn Maurice as its new Animal Services Director.  Mr. Maurice brings a wealth of experience in animal welfare, strategic planning, executive leadership, financial management, and emergency response to his new role.", "datePublished": "2024-08-23T13:06:58-07:00", "url": "https://www.countynewscenter.com/animal-services-welcomes-new-director/", "keywords": ["public safety", "animal services director", "animal welfare", "collaboration", "ethical conduct", "inclusive organizational culture", "interim dcao andrew strong", "strong relationships", "vaughn maurice"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-08-23T13:29:36-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County has appointed Vaughn Maurice as its new Animal Services Director.  Mr. Maurice brings a wealth of experience in animal welfare, strategic planning, executive leadership, financial management, and emergency response to his new role.\nVaughn Maurice is a seasoned animal services professional, known for his commitment to animal care and advocacy. Most recently, as the Executive Director at the Stanislaus Animal Services Agency, he led a successful initiative that increased animal adoptions by 10 percent year-over-year while simultaneously reducing employee turnover—a testament to his effective leadership and dedication.\n“In his previous role, Director Maurice excelled in building strong relationships and fostering a positive, inclusive organizational culture characterized by collaboration and ethical conduct”, said Interim Deputy Chief Administrative Officer Andrew Strong. “We are confident that Vaughn’s unique blend of skills, experience and values will be a tremendous asset to Animal Services the community we serve.”\nCommenting on his new role, Vaughn Maurice expressed his enthusiasm for the opportunity to lead County Animal Services, “I am excited to join such a dedicated team and community, all working towards the shared goal of ensuring that every animal receives the care and compassion they deserve.  Together, we can make a real difference in the lives of our furry friends and strengthen the bond between pets and people.”\nThe County conducted an extensive nationwide recruitment for the job. Prior to Stanislaus Animal Services, Director Maurice has also held key leadership positions at the Humane Society of Utah and the wildlife advocacy organization WildCare, further solidifying his reputation as a leader in the field of animal welfare.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240823.13.06.58"}