{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Be Water Safe is the Message Behind National Drowning Prevention Month", "description": "Summer is just around the corner and San Diegans will be spending more time in and around the water. To encourage everyone to be water safe, the County and the Drowning Prevention Foundation teamed up today in Valley Center to promote National Drowning Prevention Month and Wear Your Life Jacket to Work Day.", "datePublished": "2023-05-19T14:19:28-07:00", "url": "https://www.countynewscenter.com/be-water-safe-is-the-message-behind-national-drowning-prevention-month/", "keywords": ["health", "accidental drowning", "drowning", "drowning prevention", "water safety"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-05-22T11:01:11-07:00", "articleType": "article", "articleContent": "\nSummer is just around the corner and San Diegans will be spending more time in and around the water. To encourage everyone to be water safe, the County and the Drowning Prevention Foundation teamed up today in Valley Center to promote National Drowning Prevention Month and Wear Your Life Jacket to Work Day.\nDrowning is the number one cause of unintentional injury deaths for children ages 1-4, and the second leading cause of death for children under 14. It is a silent killer and can happen in seconds. Children who do survive a “near drowning” often suffer permanent brain damage and long-term disabilities from lack of oxygen.\n“The tragedy of a child’s accidental drowning is a heart-wrenching reality nobody wishes to confront,” said Jim Desmond, San Diego County Supervisor. “To ensure a summer filled with joy and safety, let us remain vigilant in closely supervising our children near water, fostering an environment where everyone can relish in the delights of the season.”\nFormal swim lessons reduce the likelihood of childhood drowning by 88%. However, no child is ever water safe. The goal of swim lessons is to make children safer in, on, and around water.  They still need close and constant supervision when they are near water, including bathtubs.\n\nWhile children are at the highest risk, anyone can drown. The Centers for Disease Control estimates an average of 11 people drown each day. The CDC recommends avoiding alcoholic beverages before or during swimming, boating, or other water activities. Drinking alcohol impairs judgment, balance, and coordination.\nDrowning can be prevented through water safety education, swim instruction, and learning how to provide CPR with rescue breaths. For more information about swim resources visit the Prevent Drowning Foundation of San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230519.14.19.28"}