{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Fentanyl, Prescription Drug Deaths Increase in San Diego County", "description": "The number of unintentional fentanyl deaths increased by 64% from 2018 to 2019, while at the same time prescription drug deaths rose nearly 12%.", "datePublished": "2020-11-05T14:25:35-08:00", "url": "https://www.countynewscenter.com/fentanyl-prescription-drug-deaths-increase-in-san-diego-county/", "keywords": ["health", "fentanyl", "heroin", "prescription drugs", "report card"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-06T08:33:06-08:00", "articleType": "article", "articleContent": "\nThe number of unintentional fentanyl deaths increased by 64% from 2018 to 2019, while at the same time prescription drug deaths rose nearly 12%.\nThis is according to the 2020 San Diego County Prescription Drug Abuse Task Force  Report Card released today. The report card provides a variety of data to measure the prescription drug misuse problem in the region by looking at multiple factors and data points over the last five years in San Diego County.\nIn 2019, a total of 645 people died of an unintentional overdose caused by prescription and illicit drugs, as well as alcohol. Those include:\n\n151 fentanyl deaths compared to the 92 reported the previous year. The number continued to increase in 2020. Fentanyl is a synthetic opioid primarily coming from Mexico that is 50 to 100 times more potent than morphine and 25 to 50 times stronger than heroin.\n275 deaths due to prescription drugs—opioids and non-opioids—up from 245 in 2018.\n124 heroin deaths, up from the 105 reported the year before.\n\nIn addition to deaths, the report card tracks additional key indicators of opioid misuse in the region. It also shows the following (most recent years for which numbers are available vary by statistic):\n\n6,162 visits to local emergency rooms in 2018, compared to 6,607 in 2017. Data for last year won’t be available until 2021.\nFewer 11th graders reported prescription drug use in 2019 than in 2015.\nNearly half of adults arrested reported misusing prescription drugs in 2019.\n\nTreatment is Available\nThe County funds prevention and treatment services throughout the region. Preventing drug misuse and getting people into treatment is one of the goals of the County’s Live Well San Diego vision, which aims to improve the health and safety of residents in the region.\nTreatment is available by calling the County’s Access and Crisis Line at (888) 724-7240.\nEleven years ago, the County and its partners ramped up efforts to address the prescription drug misuse problem in the region. In 2008, the County Board of Supervisors established the Prescription Drug Abuse Task Force, which includes the County Sheriff’s Department, the District Attorney, the Health and Human Services Agency, the U.S. Drug Enforcement Administration, and multiple other key partners, including local law enforcement, treatment and health and prevention organizations.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201105.14.25.35"}