{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccine Boosters: Where You Can Get Them", "description": "All available vaccines against COVID-19 now offer boosters for everyone 18 years and older.", "datePublished": "2021-12-08T16:43:10-08:00", "url": "https://www.countynewscenter.com/covid-19-vaccine-boosters-where-you-can-get-them/", "keywords": ["health", "boosters", "coronavirus", "covid-19", "vaccine boosters"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-08T16:43:10-08:00", "articleType": "article", "articleContent": "\nAll available vaccines against COVID-19 now offer boosters for everyone 18 years and older.\nTo date, 528,256 San Diegans have gotten a COVID-19 booster shot.\nSo where can you get yours?\nYou have several options to find a COVID-19 vaccination or booster shot at a site near you. They are available through:\n\nHealth care providers\nmyturn.ca.gov\nvaccines.gov\ncoronavirus-sd.com/vaccine\n211sandiego.org\n\nMy Turn and  vaccines.gov include pharmacies.\nPeople who were vaccinated with two doses of Pfizer or Moderna COVID-19 vaccine are eligible for a booster shot at 6 months or more after their initial series.\nSan Diegans who got the Johnson & Johnson COVID-19 vaccine are eligible for the booster two months after the one dose.\nCounty vaccination sites have the Pfizer, Moderna and Johnson & Johnson vaccines. Supply may vary at other sites.\nYou should make an appointment before visiting a vaccination site to avoid having to wait. Walk-ins are being accommodated daily until capacity is reached.\n“The COVID-19 vaccine is available to everyone age 5 and older. Also, people who qualify should get a vaccination booster now,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The booster shot will help you from getting sick and making others ill, especially during the holidays when people tend to gather indoors.”\nVaccine supplies remain plentiful, for those seeking initial doses and boosters for people who are eligible. More COVID-19 vaccine information is available at coronavirus-sd.com.\nVaccination Progress:\n\nDoses administered: Over 5.75 million.\nReceived at least one shot: Over 2.69 million or 85.5% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Nearly 2.39 million or 75.9 %.\nBoosters administered: 528,256.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n23 new deaths were reported since the last report on Dec. 1, 2021. The region’s total is 4,369.\n12 women and 11 men died between Aug. 12 and Dec. 5, 2021.\nSeven were age 80 or older, seven were in their 70s, three were in their 60s, three were in their 50s and three were in their 30s.\nEight of the people who died were fully vaccinated and 15 were not fully vaccinated.\n21 had underlying medical conditions and two did not.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n562 COVID-19 cases were reported to the County on Dec. 7, 2021. The region’s total is now 390,947.\n5,418 cases identified the previous week (Dec. 1 through Dec. 7) compared to 2,955 cases were reported in the past week (Nov. 24 through Nov. 30).\nDuring the 30-day period between Oct. 26 to Nov. 24, there were 398 COVID-19 hospitalizations; 290 people were not fully vaccinated and 108 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 14.2 overall, 8.3 for fully vaccinated people and 24.8 for not fully vaccinated San Diegans.\n18,673 tests were reported to the County on Dec. 7, and the percentage of new positive cases was 3.0%.\nThe 14-day rolling percentage of positive cases among tests is 3.5%.\n\nCommunity Setting Outbreaks:\n\n16 new community outbreaks were confirmed in the past seven days (Dec. 1 through Dec. 7): five in TK-12 grade school settings, three in business settings, two in government settings, two in restaurant/bar settings, one in a distribution warehouse setting, one in a hotel/resort/spa setting, one in a daycare/preschool/childcare setting and one in a construction setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211208.16.43.10"}