{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More Beach Activities Can Start June 2", "description": "Sitting and sunning at local beaches will be allowed starting tomorrow. However, County health officials are reminding residents they must maintain physical distancing or wear a face covering when close to others.", "datePublished": "2020-06-01T17:16:34-07:00", "url": "https://www.countynewscenter.com/more-beach-activities-can-start-june-2/", "keywords": ["health", "beach sunning", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-02T08:20:16-07:00", "articleType": "article", "articleContent": "\nSitting and sunning at local beaches will be allowed starting tomorrow.\nHowever, County health officials are reminding residents they must maintain physical distancing or wear a face covering when close to others.\nPeople headed to beaches can bring their own chairs and towels to relax and sunbathe but must remain with members of their own household.\nOnly passive activities will be allowed and no gatherings or sports such as football and volleyball will be permitted. Parking lots will remain closed.\nWhile these new activities are now allowed, it’s up to individual beach jurisdictions to determine if they want to proceed with the new guidance and how they’re going to enforce it.\nCounty Waiting to Move Further into Stage 3\nThe County continues to wait for word from Gov. Gavin Newsom on guidance for reopening additional sectors of the economy, as well as schools, and move further into Stage 3.\nOnce the new guidance is available, the County will review it and determine which businesses and activities can reopen or occur. They include youth sports, gyms, nail salons, community pools and sporting events with no spectators.\nHealth officials encouraged San Diegans to be patient and continue practicing social distancing, wearing a face covering when in public and near others, and washing their hands regularly.\n“We must continue to be vigilant and maintain strategies to decrease the spread of COVID-19, as we have reopened businesses and increased activities,” said Wilma Wooten, County public health officer.\nFace coverings are required in public and within six feet of someone who is not a household member.\nTesting Site in San Ysidro Opens\nA COVID-19 testing site is opening in San Ysidro starting June 2.\nThe state-run site will offer free testing from 7 a.m. to 7 p.m. at the San Ysidro Civic Center located at 212 W. Park Ave. in San Ysidro.\nAppointments will be required and can be made at https://lhi.care/covidtesting or by calling (888) 634-1123.\nTesting in Rural Communities Continues\nCAL FIRE and the San Diego County Fire Authority continue to be offer testing in rural communities.\nDrive-up testing sites will be available from 9 a.m. to 2 p.m. in five communities. An appointment is necessary, and you can make one by calling 2-1-1. The sites will be on:\nJune 2:             San Diego County Library, 1275 Main St., Ramona, CA 92065\nJune 3:             San Diego County Library: 31466 Hwy 94, Campo, CA 91906\nJune 4:             Pauma Valley School, 33158 Cole Grade Rd., Pauma Valley, CA 92061\nJune 5:             San Diego County Library, 3407 Hwy 78, Julian, CA 92036\nJune 6:             CAL FIRE Monte Vista HQ, 2249 Jamacha Rd., El Cajon, CA 92019\nCOVID-19 testing is now more widely available in the region. Testing options include calling your doctor or medical provider to schedule an appointment, signing up on the state website or calling 2-1-1.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,655 tests were reported to the County on May 31 and 73 or 2% were positive.\n2.9% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n73 new cases were reported for a San Diego County total of 7,554.\n1,331 or 17.6% of the total cases have required hospitalization.\n385 or 5.1% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nNo COVID-19 deaths were reported today, and the region’s total remains at 269.\n\nThe number of active outbreaks, deaths and cases are:\n\n79 active outbreaks; 54 at congregate living facilities and 25 in community settings.\n1,549 cases, including 135 deaths in congregate living facilities.\n340 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200601.17.16.34"}