{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, City of San Diego Pass Resolution to Create 10,000 Affordable Homes", "description": "During a historic housing summit, the County and City of San Diego approved a resolution to expand the affordable housing supply by 10,000 homes using government land by 2030.", "datePublished": "2022-10-03T15:29:54-07:00", "url": "https://www.countynewscenter.com/county-city-of-san-diego-pass-resolution-to-create-10000-affordable-homes/", "keywords": ["housing", "affordable housing", "chair fletcher", "council president sean elo-rivera", "county/city resolution", "county/city summit", "global policy leadership academy", "san diego foundation", "san diego housing commission"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-10-03T15:45:09-07:00", "articleType": "article", "articleContent": "\nDuring a historic housing summit, the County and City of San Diego approved a resolution to expand the affordable housing supply by 10,000 homes using government land by 2030.\nThe formal County/City Council meeting was the first in more than 22 years between the two entities and was held Monday at San Diego State University.\nCounty Board Chair Nathan Fletcher and Council President Sean Elo-Rivera led the summit. Both cited the importance of working together to act on the region’s critical housing shortage.\n“We know that housing is foundational to life, it is the most basic thing that you need in order to be able to live a fulfilled and thriving life,” said County Chair Nathan Fletcher. “We also know that in San Diego County, we have some of the least affordable housing anywhere in the country.”\n“Stable housing is the foundation of opportunity, and instability w/respect to housing has profound impacts…,” said Council President Sean Elo-Rivera. “We have a responsibility to make housing stable and fulfilling that responsibility will require collaboration.”\nThe resolution calls for supporting four major actions:\n\nStreamlining permitting to accelerate housing production\nBuilding 10,000 affordable homes on government-owned land near transit lines, that also support climate action goals and offer construction workers good paying jobs\nLeveraging public, private and other funds to speed up the availability of affordable housing\nIncreasing density on properties owned by the San Diego Housing Commission or its nonprofit affiliate\n\nThe vote came after presentations from several organizations who also cited the critical need for housing.\nThe Global Policy Leadership Academy’s Jennifer LeSar told government leaders that San Diego is noted nationally for tackling affordability but there is still more work to do. Figures showed that 81% of earned low-income households in the county are paying more than half their income on housing costs. And that puts a number of households at risk for homelessness. For those already experiencing homelessness, the Point in Time count found 8,427 people. From that total, 4,321 are sheltered but 4,106 are unsheltered.\nThe San Diego Foundation is developing a GIS mapping tool of open parcels on public land in the cities of San Diego and Chula Vista, the County and excess state lands that could be developed for affordable housing. The parcels are judged on quality of life, the ease of building housing, land use, transit and more.\nThe foundation’s presentation also included details on its Housing Impact Fund and its $10 million commitment to raise an additional $90 million to address housing needs.\nThe San Diego Housing Commission has 22,000 units in service but is exploring ways to add more to the 4,120 properties it owns while keeping in mind climate goals, equity, a variety of housing types and income levels plus childcare.\n“We have a long way to go but everyone that you see here before you today is really committed to doing this work …  and working through all these challenges to make sure we see real progress,” said Chair Fletcher. “As County government…, we pledge the County government will be more active and more engaged than at any point in history.”\nCouncil President Elo-Rivera said we must make sure the resolution is not just symbolic and called for an accountability check early next year.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221003.15.29.54"}