{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Vaccination Numbers Grow, But Keep Up Mask Wearing, Social Distancing", "description": "As an increasing number of San Diegans get vaccinated against COVID-19, the County of San Diego Health and Human Services Agency is reminding the community that it is too soon to stop the use of face coverings and social distancing.", "datePublished": "2021-02-05T10:50:54-08:00", "url": "https://www.countynewscenter.com/vaccination-numbers-grow-but-keep-up-mask-wearing-social-distancing/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-02-05T11:17:59-08:00", "articleType": "article", "articleContent": "\nAs an increasing number of San Diegans get vaccinated against COVID-19, the County of San Diego Health and Human Services Agency is reminding the community that it is too soon to stop the use of face coverings and social distancing. These measures will be necessary for the foreseeable future to slow the spread of the virus.\nWhile the two FDA-authorized vaccines have shown promising results in clinical trials, it takes several weeks for the immunizations to become fully effective. In addition, it is yet unknown whether a vaccinated person could potentially catch and spread COVID-19 to someone who has not been vaccinated.\n“Even if some of your older relatives and friends have received their vaccination, we urge you to postpone visits with them until later this year when you are fully vaccinated and protected as well,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The COVID-19 vaccines are safe and effective, but we can only end this pandemic once herd immunity is achieved.”\nHerd immunity refers to the stage in the pandemic when a majority of the population is immune to the virus, either because a person received the vaccine, or because they developed antibodies after a COVID-19 infection. Public health officials say we will need to vaccinate up to 80% of the U.S. population to achieve herd immunity.\nSo far, a little more than 10% of San Diegans age 16 and over have received at least one of the two shots required to develop antibody protection against the virus.\nUntil a majority of the region is fully protected, San Diegans should limit their interactions with people outside of their households. While small gatherings are currently allowed, they should be limited to no more than three households and the interactions must occur outdoors. People must also keep their distance and wear a face covering.\n“Ending this pandemic will require us to take advantage of all the tools available to us,” Wooten said. “For now, we need to be a little bit more patient and continue masking and social distancing, as well as getting a vaccination, so we can get back to normal as soon as possible.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210205.10.50.54"}