{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Human Relations Commission Elects Chair, Vice Chairs", "description": "The Leon L. Williams San Diego County Human Relations Commission, created by County supervisors to help reduce discrimination and intolerance, elected Ellen Nash as chair and Estela De Los Rios and Eleanor Evans as vice chairs in the commission’s May meeting.", "datePublished": "2023-05-31T14:35:34-07:00", "url": "https://www.countynewscenter.com/county-human-relations-commission-elects-chair-vice-chairs/", "keywords": ["government", "leon l. williams human relations commission", "office of ethics and racial justice"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-05-31T14:35:34-07:00", "articleType": "article", "articleContent": "\nThe Leon L. Williams San Diego County Human Relations Commission, created by County supervisors to help reduce discrimination and intolerance, elected Ellen Nash as chair and Estela De Los Rios and Eleanor Evans as vice chairs in the commission’s May meeting.\nNash, who was reelected as chair at the commission’s May 16 meeting, formerly worked as manager of human resources for both San Diego State University and UC San Diego’s Health System. She also has extensive volunteer work with the Urban League and the NAACP and is chair of the San Diego chapter of the Black American Political Association of California.\nVice Chair De Los Rios also serves as executive director of CSA San Diego County, a nonprofit that promotes social justice, public welfare, advocates for equal housing and against discrimination, hate crimes and human trafficking. De Los Rios also serves on a national executive council for human trafficking with World Without Exploitation and is president of the San Diego Regional Fair Housing Alliance.\nVice Chair Evans is a board member of the Oceanside Unified School School District, a longtime educator and former executive officer of the County of San Diego Urban League. Evans is also on the board of directors for the nonprofit Community Housing Works, was honored with a State Human Rights award in 2015 by the California Teachers Association and a lifetime achievement award from the North San Diego County NAACP in 2018.\nThe Commission\nCounty supervisors established the independent human relations commission in 2020 to promote positive human relations for all people and make recommendations to lessen discrimination and intolerance. Officials said the commission “celebrates how we are deeply connected to each other through our humanity.” The 31-member commission currently has 22 seated members.\nThe commission was named in honor of Leon L. Williams, a lifelong political and equal rights advocate in San Diego County, and the county’s first Black County supervisor and City of San Diego council member.\nThe commission serves as the Board of Supervisors’ resource on human rights and human relations issues. It does that by connecting with county residents and community groups to review and report on progress made to lessen hate crimes, bias, human rights violations and other matters.\nCommunity Liaison\nThe Commission held two public events earlier this year this talk about its mission and “to build a stronger community,” one in January in Oceanside and another in March in Bonita. The Commission intends to hold additional community events later this year.\nThe commission also holds regular public meetings on the third Tuesday of each month.\nFor more information about the commission, go to its website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230531.14.35.34"}