{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Back to School Giveaway at Super Saturday Community Event", "description": "It is back-to-school season and that means Child Support Services is giving away hundreds of backpacks filled with school supplies (while supplies last) to all families who attend its Super Saturday event.", "datePublished": "2023-08-08T13:17:40-07:00", "url": "https://www.countynewscenter.com/back-to-school-giveaway-at-super-saturday-community-event/", "keywords": ["families", "back to school", "child support services", "dcss", "super saturday"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-08-08T13:17:40-07:00", "articleType": "article", "articleContent": "\nIt is back-to-school season and that means Child Support Services is giving away hundreds of backpacks filled with school supplies (while supplies last) to all families who attend its Super Saturday event.\nThe community event will be held from 9 a.m. to 1 p.m., Aug. 12 at the Department of Child Support Services central office, 3666 Kearny Villa Road.\nEvery August, Child Support Services celebrates Child Support Awareness Month by helping families in the community and easing part of the back-to-school financial costs.\nThe backpacks and school supplies were made available through generous donations from Child Support staff, local businesses, community organizations, and a substantial donation from San Diego Padres pitcher Michael Wacha and his wife Sarah.\nThe new backpack and supplies can boost a child’s confidence and self-esteem as they start a new school year.\nChild Support Services recognizes local families may be experiencing the rising costs associated with basic living expenses.\nAt the special Super Saturday event, parents may also obtain services from an array of County departments and partner organizations who  will be at the event:\n\nLive Well on Wheels mobile bus to help with aid eligibility\nOffice of Emergency Services to provide disaster preparedness information\nCounty Department of Human Resources to offer job opportunities\nAnimal Services to help families adopt a pet (adoption fees waived in August)\nPublic Defender’s Fresh Start Program to help with criminal record relief\nAlso, various community-based organizations will provide employment, housing and legal assistance\n\nChild Support Services will also be available to share details on how to obtain a High School Diploma in partnership with the San Diego County Library, and the Parents Invest in Education and Youth with Dreams programs.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230808.13.17.40"}