{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Deer Mouse Tests Positive for Hantavirus", "description": "A deer mouse collected near Mount Laguna Aug. 24 during routine monitoring has tested positive for hantavirus. Hantavirus in wild rodents is relatively common in San Diego County. This is the seventh routine detection of hantavirus in the region for calendar year 2023.", "datePublished": "2023-09-05T11:06:04-07:00", "url": "https://www.countynewscenter.com/deer-mouse-tests-positive-for-hantavirus-3/", "keywords": ["health", "deer mouse", "hantavirus", "health"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-09-05T12:23:09-07:00", "articleType": "article", "articleContent": "\nA deer mouse collected near Mount Laguna on Aug. 24 during routine monitoring has tested positive for hantavirus.\nHantavirus in wild rodents is relatively common in San Diego County. This is the seventh routine detection of hantavirus in the region for calendar year 2023.  However, because wild rodents naturally avoid people, human exposure to the virus is rare. Still, County officials advise people should be careful around wild rodents as there is no cure or vaccine for hantavirus.\nPeople can be exposed to the virus when wild rodents invade their living areas— such as homes, garages and sheds. People should be particularly aware when doing activities around their homes such as cleaning garages, sheds and outbuildings.\nInfected rodents shed the hantavirus in their urine, feces and saliva. Once the matter dries, the hantavirus can be stirred into the air where people can inhale the virus.\nIf people find wild rodents, nests or other signs of rodents in their living spaces, they should always use “wet cleaning” methods—using bleach or other disinfectants, rubber gloves and bags. They should NOT sweep or vacuum, which could stir hantavirus into the air where it could be inhaled.\nSymptoms\nSymptoms of hantavirus usually develop between 1-8 weeks after exposure and include:\n\nSevere muscle aches.\nChills, fever or fatigue.\nHeadache or dizziness.\nNausea, vomiting or stomach pain.\nDifficulty breathing.\n\nIf you think that you may have been exposed to hantavirus, seek medical attention immediately.\nAvoiding Exposure to Hantavirus\n\nSeal up all external holes in homes, garages, and sheds larger than a dime to keep rodents from getting in.\nEliminate rodent infestations immediately.\nAvoid rodent-infested areas and do not stir up dust or materials that may be contaminated with rodent poop and urine.\nClean up rodent poop and urine using the “wet cleaning” methods described below.\n\nWet cleaning methods\n\nDo not sweep or vacuum infested areas.\nVentilate the affected area by opening doors and windows for at least 30 minutes before starting to clean.\nUse rubber gloves. Spray a 10% bleach solution or other disinfectants onto dead rodents, rodent poop, nests, contaminated traps and surrounding areas, then let the disinfectant stand for at least 15 minutes before cleaning.\nClean with a sponge or a mop that has been soaked in disinfectant.\nPlace disinfected rodents and debris into two plastic bags, seal them and discard them in the trash.\nWash gloves in a bleach solution, then soap and water, and dispose of them using the same double-bag method.\nThoroughly wash your hands with soap and water.\n\nFor more information, contact the County Department of Environmental Health and Quality (DEHQ) at (858) 694-2888 or visit the DEHQ hantavirus web page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230905.11.06.04"}