{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adopts New Budget", "description": "County Supervisors unanimously adopted a new $8.53 billion budget for Fiscal Year 2024-25 during a board meeting Tuesday. The budget will take effect July 1.", "datePublished": "2024-06-25T14:32:13-07:00", "url": "https://www.countynewscenter.com/county-adopts-new-budget/", "keywords": ["government", "2024-25 adopted budget", "adopted budget", "chairwoman nora vargas", "chairwoman of the board of supervisors", "county budget", "ebony shelton", "interim cao sarah aghassi"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-06-27T16:46:43-07:00", "articleType": "article", "articleContent": "\nReading Time:  7 minutesCounty Supervisors unanimously adopted a new $8.53 billion budget for Fiscal Year 2024-25 during a board meeting Tuesday. The budget will take effect July 1.\nThe adopted budget shows an increase of $364.5 million or 4.5% from last year. The new budget also adds 84 employees for a total of 20,471.25 staff years.\nPrior to the vote, Board Chairwoman Nora Vargas thanked newly appointed Chief Administrative Officer Ebony Shelton, the directors and the finance staff for their hard work, and for listening to the community in producing the final version of the budget.\nThe Chairwoman also thanked interim CAO Sarah Aghassi who presented the recommended budget and for her leadership as she led the County through a difficult time during the Jan. flood emergency.\nChairwoman Vargas said the new budget reflects our values as a County and serves the community and working families across the region.\n“We really centered equity in this budget to provide projects, programs and services for everyone, including recovery from the stormwater emergency, addressing homelessness, building community infrastructure, promoting environmental equity and expanding behavioral health service programs,” said Chairwoman Vargas. “At the same time, we need to be prudent of the outlook so we can balance our current needs and plan for the years ahead.”\nThe $8.48 billion recommended budget was released May 2 and was designed to maintain and improve the quality of life in our region while also helping those who need it most.\nThe recommended budget addressed County budget priorities to help those experiencing homelessness and behavioral health and substance use disorders. It did more to help people and families with housing, nutrition, health, financial and other needs.\nThe County put additional funding into affordable housing, roads, justice reform, public safety and environmental sustainability. The budget retained funding for core services like fire protection, libraries and parks.\nThe Board of Supervisors built on the $8.48 billion recommended budget to include additional increases for infrastructure, justice reform, homelessness and housing, support services, public safety, and other priorities.\nA revised budget posted on June 13 added $46.9 million or an increase of 0.6% percent to the May plan for the total of $8.53 billion. The revised budget also added another 12 positions.\nThe revised plan includes:\n\n$8.5 million to support the caseload in the District Attorney’s Office\n$6 million for lease payments, programs and services to clients at the North and South County Family Justice Centers.\n$13.1 million in one-time costs for the Migrant Transition Day Center to support onward travel for asylum seekers released from Department of Homeland Security custody.\n$7.5 million for increased construction costs for Calavo Park in Spring Valley.\n$2.2 million to the Sheriff’s Department to support Medi-Cal Transformation PATH, law enforcement services requested by the City of Encinitas, forensic testing equipment, off-highway vehicle training and equipment.\n$0.6 million for the Grantville Safe Parking site for those at risk or experiencing homelessness.\n\nThe revised budget also specifies the use for enterprise costs to address capital, IT, emergency response or other efforts:\n\n$1.3 million for updates to the Battery Energy Storage System.\n$0.5 million to extend the regional ¡Mas Fresco! Plus food program.\n$0.25 million for enhanced drowning prevention efforts.\n$0.25 million to extend no-cost transportation services for seniors.\n$0.25 million for the Workplace Justice Fund.\n$0.15 million for a pilot archery project at a County park.\n$0.059 million to help the Lake Hodges, Lake Sutherland and El Capitan reservoirs remain open.\n\nOverall, the adopted budget shows smaller budget increases than previous years, limits the growth of staffing and reduces spending on capital projects.\nCounty staff prepared the budget using community input collected throughout the year, an equity assessment to evaluate potential impacts to vulnerable populations and additional data.\nAfter the recommended budget’s release on May 2, departments gave budget presentations to the Board on May 14 and 16, the County held two community budget meetings on May 23 and 29, and two public hearings in early June.\nInvestment priorities in the adopted budget also include:\nInfrastructure: Roads, libraries, parks and other community enhancements\n\n$132.9 million total to provide new facilities and maintain existing ones to allow employees to continue providing excellent customer service.\n$480.8 million total for Public Works/Roads which builds and maintains roads and manages the region’s sanitation and flood control districts.\n\n$40.5 million increase for a total of $189 million for road safety including traffic signals, curb ramps, pedestrian crossings, guardrails and new sidewalks and bike lanes.\n$4.7 million to prevent storm flooding by keeping culverts, channels, levees and storm drains safe and clean.\n$4.5 million increase for a total of $65.5 million to maintain 2,000 miles of unincorporated roadways.\n\n\n$77.2 million total for Parks and Recreation to promote health and wellness, safe communities and civic pride through thousands of programs.\n\n$33.5 million total to operate 157 park facilities, 58,000 acres of parkland and 389 miles of trails.\n$20.2 million to conserve natural resources, protect habitat and species, and improve environmental conditions including in the Tijuana River Valley.\n\n\n$66.6 million total for County Library to offer a physical and virtual hub of education, entertainment and culture.\n\n$12.4 million to curate all library materials, digital and print.\n$569,000 increase to operate 33 branch libraries, 4 electric bookmobiles and 5 automated book kiosks.\n\n\n$22.8 million for a new Casa de Oro Library.\n\nBehavioral Health: Mental health and substance use support\n\nMore than $1.1 billion in total investments for Behavioral Health Services.\n\n$28 million increase for substance use residential and outpatient services.\n$25 million to expand and support the public behavioral workforce which includes the development of a new training and tuition program.\n$15 million increase to implement Senate Bill 43 for Involuntary Behavioral Health treatment.\nMore than $9 million to provide services in the new Tri-City Psychiatric Health Facility in Oceanside.\n$4 million increase for a total of $11.1 million to address the opioid crisis.\nMore than $4 million for youth suicide prevention.\n\n\n\nHomelessness: Access to shelter, housing and other services to ensure people have a safe place to live\n\n$71 million total for homeless services within the Department of Homeless Solutions and Equitable Communities including:\n\n$15 million for the Regional Homeless Assistance Program.\n$7.8 million increase to help those experiencing homelessness in the San Diego and Sweetwater riverbeds.\nA second safe parking site is expected to open this summer, expanding emergency housing options for the unincorporated communities.\n\n\n\nHousing: Housing opportunities to meet community needs\n\n$90.9 million total for Housing and Community Development Services to provide housing resources for vulnerable populations, develop affordable and supportive housing and help achieve self-sufficiency for families.\n\n$10.6 million in new funding for the Innovative Housing Trust Fund to help build affordable housing.\n$2.4 million increase to boost multifamily rental housing in the unincorporated area.\n\n\n$500-a-month rental subsidy continues for nearly 400 older adults who are at risk of homelessness, rent-burdened and in need of financial aid.\n$58 million total for Planning and Development Services to balance community, economic and environmental interests to ensure the highest quality of life for all in the region.\n$30.1 million to facilitate housing by creating affordable housing programs and removing barriers to housing through things like guaranteed plan review times for 100% affordable housing projects.\n\nSupport Services: Nutrition, health, financial and other programs to help vulnerable individuals and families\n\n$812.2 million for Eligibility/Self-Sufficiency Services to help provide access to food, health care, housing and general relief for people with no other means of support.\n$2 million increase to expand food security through community gardens, nutritional education, meals, food pantries and acceptance of EBT benefits at 18 certified farmers markets.\nOver $200 million for In Home Supportive Services to provide in-home assistance for vulnerable adults.\nA location in National City will serve as the future site of the South County Family Justice Center and offer local crime victims access to trauma recovery services in one place.\n$145 million investment in medical and mental health for incarcerated adults.\n$9 million investment in medical and mental health for youth in institutions.\n$2.2 million increase to help veterans who need long-term support to avoid institutionalization.\n$479 million for Child and Family Well Being to provide family strengthening and prevention services to keep families together, as well as child protection services.\n\nMore than $158 million for families supporting foster and adopted children.\n$2 million increase for child abuse prevention.\n$2 million increase to help youth leaving foster care with transitional housing.\nA new Prevention Hub to help families before they reach a point of crisis, with the ultimate goal of keeping families together.\n\n\n$11.3 million for Animal Services, including $1.3 million, three full-time employees and a mobile veterinary clinic for underserved areas in the unincorporated area.\n\nJustice Reform: Transforming the justice system to ensure equity and accountability\n\nMore than $230 million total investment in Alternatives to Incarceration to reduce jail populations and maintain public safety through prevention, diversion and reentry planning.\n\n$3.6 million for Community Care Coordination Reentry Support connecting justice-involved people with significant needs with care-based services like housing, mental health and substance use treatment, medical care and employment and education.\n$3.3 million for the Public Defender’s Holistic Services Unit that brings together clinicians, substance abuse assessors and housing navigators to assist clients.\n$2 million for the District Attorney’s Juvenile Diversion Initiative which helps keep youth and teens under 18 years of age out of the juvenile justice system while addressing the root causes of harmful behavior.\n$7 million and 43 full time employees for the Youth Development Academy to house, care and rehabilitate youth in the justice system.\n\n\n\nPublic Safety: Law enforcement and fire protection\n\nMore than $2.7 billion in total investments for Public Safety.\n\n$87.1 million for fire, emergency medical and ambulance services, which includes a $16 million increase for services in the unincorporated area.\n$4 million for the Medical Examiner to address an increased caseload of deaths due to fentanyl overdoses.\n$5 million to start replacing the 50-year-old Ramona Sheriff Substation.\n$400,000 for Ramona Fire Station 80 remodel and fire training tower.\n$500,000 for the Gun Violence Prevention Program.\n2 full-time employees added to the Economic Crimes Division at the District Attorney’s Office.\n$51 million to improve adult detention facilities.\n$6.3 million for East Mesa Juvenile Detention Facility improvements.\n\n\n\nPublic Health and Protection: Keeping communities healthy and preventing illness\n\n$291.8 million for Public Health Services to prevent epidemics and the spread of disease, encourage healthy behaviors, and assure access for all through Public Health Centers, home visit programs and pharmaceutical services.\n\nFunding and staff to deploy two new Live Well on Wheels vehicles.\n\n\nContinued funding in the capital budget to build a new $92 million state-of-the-art public health lab expected to open in 2025.\n$55.5 million for Environmental and Health Quality to protect environmental quality, promote environmental awareness and ensure compliance with local, state and federal environmental laws.\n\n$15.6 million total to inspect restaurants and other food facilities.\n$14.8 million total to regulate 14,000 hazardous material operations to prevent exposure to spills.\n$1.5 million total for testing and reporting beach and bay water quality.\n\n\n\nEnvironmental Sustainability: Protecting the natural environment to preserve it for future generations\n\n$18.2 million increase to protect the region’s watershed and for new green infrastructure projects.\n$16 million to preserve land to protect species as part of the Multiple Species Conservation Program.\n$2.5 million total to update the Climate Action Plan.\n$2 million to plant 4,000 new trees on County property to lower greenhouse gases.\n$1.8 million to install new electric vehicle charging stations for the public.\n$1 million for the Zero Carbon Portfolio Plan to reduce carbon emissions in County facilities by 90% by 2030.\n\nAdditional Highlights\n\n$9 million to advance broadband connectivity in the rural areas of the county.\n$4.9 million for the Office of Evaluation, Performance and Analytics to study County data to find patterns and trends that can help leaders improve programs, services and policies.\n$1.3 million for the Office of Labor Standards and Enforcement to work with communities and businesses to improve labor standards, ensure compliance and support for victims of wage theft.\n$500,000 to expand the Social Equity Program to address the disproportionate harm caused by the War on Drugs on communities of color by prioritizing access and equity in the cannabis industry.\n$500,000 to implement the Uplift Boys & Men of Color initiative to connect at-risk youth to wrap-around services, trauma support systems and workforce development opportunities.\n$300,000 for community programs to strengthen language access in the region.\n\nFind out more information by visiting the County’s Open Budget page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240625.14.32.13"}