{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "A Year Fighting COVID-19", "description": "On March 19, 2020, California became the first state in the country to issue a stay-at-home order in response to the COVID-19 pandemic. The months since have been filled with challenges, fear and grief, innovation and historic breakthroughs. Here is a look back at a year that San Diego was seized by a deadly threat and how the County fought back.", "datePublished": "2021-03-19T17:01:43-07:00", "url": "https://www.countynewscenter.com/a-year-fighting-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "stay at home order", "testing", "vaccinations"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2021-03-22T14:51:36-07:00", "articleType": "article", "articleContent": "\nOn March 19, 2020, California became the first state in the country to issue a stay-at-home order in response to the COVID-19 pandemic. The months since have been filled with challenges, fear and grief, innovation and historic breakthroughs. Here is a look back at a year that San Diego was seized by a deadly threat and how the County fought back.\n\nCounty Public Health Lab Now Able to Test for New Coronavirus\nFebruary 2020 – One week after the World Health Organization declares COVID-19 a pandemic and President Trump declares a national emergency; the County of San Diego issues a public health order and declares COVID-19 a health emergency. The Emergency Operations Center is activated and 12-hour workdays begin. An American evacuated from Wuhan, China to the Marine Corps Air Station Miramar tests positive for COVID-19 and is quarantined.\n\nCounty issues first COVID-19 public health order\nCounty Board Ratifies COVID-19 Emergency Declaration\n\n\nHotel Rooms Reserved for COVID-19 Recovery\nMarch 2020 – The County records its first positive COVID-19 case and first COVID-19 death. Store shelves are picked clean as San Diegans panic shop for toilet paper, canned goods and cleaning supplies. Demand soars for personal protective equipment. The County begins daily COVID-19 press briefings and the state of California issues a stay-at-home order. The County secures hotel rooms for positive COVID-19 patients who don’t have the ability to quarantine.\n\nSan Diego County’s First Positive COVID-19 Case Reported\nCounty Officials Give COVID-19 Update in Wake of Governor’s “Stay Home” Order\nFirst San Diego County Resident Dies from COVID-19\n\n\nPeople washing their hands at station in Balboa Park.\nCounty Nurses Give Hygiene Kits to Homeless\nApril 2020 – The County launches a #StayHomeSD campaign as COVID-19 deaths reach 100. Outreach teams connect with people experiencing homelessness and provide 360 handwashing stations. The Convention Center opens as a temporary shelter. All gatherings are prohibited and facial coverings are required in public places. The County implements its T3 strategy: testing, tracing and treatment.\n\nCounty COVID-19 Deaths Reach 45; #StayHomeSD Campaign Kicks Off\nTwo Alternate Care Facilities (Palomar Medical) Ready for Patients\nCounty Rolls Out Testing, Tracing, Treatment Strategy\n\n\nMay 2020 – On May 1, cloth face coverings are mandated in public places when people are within 6 feet of anyone who is not from their same household. The County’s COVID-19 response continues to expand with meals to homebound seniors and COVID-19 testing in rural areas.\n\nProtect Yourself and Others – Face Coverings Required in Public\n“Great Plates Delivered” to Send Free Meals to Seniors\nCOVID-19 Testing Ramps Up in Region\nCounty to Offer COVID-19 Testing in Rural Communities, Other Areas\nCounty, Rady Children’s to Test 2,000 Daily for COVID-19\n\n\nCounty employee Esma Al Sabag is doing contact tracing in English and Arabic.\nCOVID-19 Contact Tracers\nJune 2020 – Heading into the summer months, some reopening begins. The County creates a testing website to simplify appointments and hires COVID-19 contact tracers. Face masks become mandatory statewide and a new curfew requires all restaurants to close at 10:00 p.m. to stop the spread.\n\nNew County Website Helps Residents Locate, Schedule COVID-19 Testing\nSan Diego Restaurants to Close Nightly at 10 PM\n\n\nJuly 2020 – California reverses course and begins to shut back down. Local death numbers climb past 500 as the County steps up outreach to the hard-hit Latino population. The County is placed on the state Watchlist and all indoor business operations are shut down.\n\nDine-In Restaurants, Other Indoor Activities to Close in County\nCounty to Close Indoor Operations at Gyms, Nail Salons and Other Sectors\nCounty Intensifying COVID-19 Outreach to Latino Communities\nCounty COVID-19 Deaths Surpass 500, Cases Over 25K\n\n\nAugust 2020 – California releases a color-coded, tiered “Blueprint for a Safer Economy” and San Diego is placed in the Red Tier, indicating “substantial” spread of the virus. The County allocates $48.8 million in CARES Act Funds and continues to focus on the Latino community and their access to critical COVID-19 information and resources.\n\nBoard Creates Compliance Hotline, Allocates CARES Act Funds\n‘Promotoras’ Working in Latino Communities to Prevent Spread of COVID-19\nCounty to Open New COVID-19 Testing Site at Border\n\n\nSeptember 2020 – COVID-19 numbers continue to climb at local universities. College students are encouraged to follow safety protocols and wash their hands, wear a mask and watch their distance. New testing sites open and the County offers up to $3,000 in emergency rental assistance per eligible household.\n\nCounty Works with SDSU to Address Rising Cases on Campus\nSDSU Cases Jump, Students Need to Stay Home\nCounty to Offer Rotating, COVID-19 Testing at Mexican Consulate, Other Locations\nCounty Emergency Rental Assistance Available to 8,000 Households\n\n \nOctober 2020 – Health officials encourage vigilance heading into the holiday season to avoid a new wave of COVID-19 cases. The state introduces a Health Equity Metric to ensure the most vulnerable populations receive the resources they need to slow the spread. San Diego hangs on to the Red tier.\n\nNew, No-Appointment COVID-19 Test Site Opens in Chula Vista\nNew State Metric Focuses on Health Equity\nCOVID-19 Update to Board Highlights Health Equity Strategy \nIncreased COVID-19 Testing Helps to Keep County in Red Tier\n\n\nNovember 2020 – After weeks on the brink, San Diego falls into the most restrictive Purple Tier. The rental assistance program is expanded and more funds are available to suffering businesses. COVID-19 fatigue causes a spike in positive cases leading into Thanksgiving with the looming threat of even higher numbers after holiday gatherings.\n\nCounty Moves to Purple Tier; Restrictions to Start Nov. 14\nCounty Launches COVID-19 Case Rate Map as Cases Set Record\nCounty Rental Assistance Available to Additional 10,000 Households\nBoard Approves More Funds for Businesses Impacted by COVID-19\n\n\nThe first shipment of COVID-19 vaccine arrives at the County.\nDawn To Dusk COVID-19 Testing\nDecember 2020 – COVID-19 cases, hospitalizations and deaths spike while ICU space dwindles. San Diego falls under a state Regional Stay-At-Home Order. Hope arrives in the form of Pfizer and Moderna vaccines. The first doses make it to San Diego just as the first UK variant case is confirmed.\n\nStay Home Order Issued as Region’s ICU Capacity Drops Below 15%\n28K COVID-19 Vaccine Doses Arriving in San Diego\nSan Diego Man Tests Positive for UK Variant of COVID-19\n\n\nCounty of San Diego to Open First “Vaccination Super Station” in Partnership With UC San Diego Health, Padres and City of San Diego\nJanuary 2021 – The new year brings record numbers of positive cases, record deaths and dozens of COVID-19 variants. The County leads the state in opening the very first Vaccination Super Station. Other vaccination sites quickly open across the county and vaccinations shift into high gear.\n\n32 COVID-19 Variant Cases Identified in San Diego County\nCounty Opens Two COVID-19 Vaccination Clinics in South Bay\nCounty Opens New Vaccine Site at Tubman Chavez Community Center\nFirst North County Vaccination Super Station Opens\n\n \nCommon Questions About COVID-19 Vaccinations\nFebruary 2021 – New vaccination sites continue to pop up throughout the county, but supply shortages plague the distribution process. The County, its partners and health care providers plead for patience as demand for the vaccine far exceeds available supply. Meanwhile, renters and small businesses get financial support through County grants.\n\nCOVID-19 Vaccination Clinics Coming to La Mesa, San Ysidro\nCOVID-19 Vaccination Sites Open in Del Mar, San Marcos\nDelivery Shortfall Slows COVID-19 Vaccination Availability\nCOVID-19 Vaccination Clinics Coming to Lemon Grove, Otay Mesa\nCounty Ready to Distribute Over $100 Million in Rental Assistance\n80K COVID-19 Vaccine Doses Arriving in Region\n\nCounty Public Health Officer Dr. Wilma Wooten receives Johnson and Johnson’s Janssen COVID-19 vaccine.\nMarch 2021 – One year later, there is light at the end of the tunnel. Positive COVID-19 cases are on a steady decline and over 1 million vaccines have been administered. A third vaccine, the single-dose Johnson & Johnson, is now available in San Diego. The County is finally out of the Purple Tier and back in Red and all K-12 schools have the green light to reopen to in-class instruction.\n\n10 Percent Of County Residents Now Fully Vaccinated\nCounty Surpasses 1 Million COVID-19 Vaccinations\nJohnson & Johnson COVID-19 Vaccine Arrives in San Diego\nSan Diego Moves to Red\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210319.17.01.43"}