{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Paves Way for Taxation of Cannabis Businesses in the Unincorporated Area", "description": "The County Board of Supervisors voted today to set taxation rates for existing cannabis businesses in the unincorporated area.", "datePublished": "2023-01-24T17:11:37-08:00", "url": "https://www.countynewscenter.com/board-paves-way-for-taxation-of-cannabis-businesses-in-the-unincorporated-area/", "keywords": ["government", "cannabis", "cannabis business tax", "marijuana"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2023-01-24T17:11:37-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted today to set taxation rates for existing cannabis businesses in the unincorporated area.\nToday’s action only applies to the unincorporated area of the county, where five licensed cannabis businesses currently exist.\nThe new tax will apply to both medical and recreational operations and will be assessed based on the type of cannabis business. Cultivation businesses will be taxed based on square footage of growing area and lighting method, and all other types of cannabis businesses will be taxed based on a percentage of gross income.\nSupervisors voted in favor of imposing a 2 percent tax on all retail sales of cannabis products in the unincorporated area.\nToday’s Board vote is one of the initial steps the County is taking to implement Measure A, which San Diegans approved during the November 8, 2022 election.\nThe next step is for the Board to finalize approval of the rates during a second hearing scheduled for the end of February. Pending the second hearing, cannabis businesses would implement the new tax at the beginning of April and begin paying the County in July.\nThe Board is expected to take further action later this summer when Planning and Development Services and the Office of Equity and Racial Justice will introduce additional policy measures and proposed licensing requirements.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230124.17.11.37"}