{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Bolstering Aerial Fire Resources", "description": "The County Board of Supervisors voted unanimously Tuesday to strengthen aerial fire protection in the region by approving the purchase of a new twin-engine firefighting helicopter and adding two additional firefighting helicopters to a firefighting response agreement with San Diego Gas & Electric.", "datePublished": "2022-04-26T18:08:08-07:00", "url": "https://www.countynewscenter.com/?p=208273", "keywords": ["public safety", "emergency", "firefighting helicopter", "preparedness", "san diego sheriff s department", "sheriff"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-04-26T18:08:08-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted unanimously Tuesday to strengthen aerial fire protection in the region by approving the purchase of a new twin-engine firefighting helicopter and adding two additional firefighting helicopters to a firefighting response agreement with San Diego Gas & Electric.\nThe Bell 412 EPX helicopter will be the first twin-engine in the Sheriff’s fleet. A twin-engine helicopter is safer, can fly at night, hoist more weight, carry more water and reach more locations to pick up water.\n“The reality is we need a twin-engine firefighting helicopter in our county firefighting arsenal. This has been a long-desired goal of making sure as a region, we’re better prepared to fight wildfires,” said Board Chairman Nathan Fletcher at the meeting. “We know over time we will need more than one but moving forward now with one is the right step as we confront the realities of much more devastating risk of wildfires than we’ve seen in the past and we upgrade our fleet air support arsenal.”\nThe San Diego County Sheriff’s Department firefighting and search and rescue helicopter fleet now consists of three Bell 205 helicopters built in the 1960s and 1970s. During wildfires, CAL FIRE/San Diego County Fire Protection District staff the helicopters, except for the pilot, for water drops. Eventually, all the Sheriff helicopters will be replaced with twin-engine models.\n“It’s the next generation for ASTREA (Aerial Support to Regional Enforcement Agencies),” said Sheriff’s ASTREA Sgt. Gavin Lanning.\nAfter a purchase is made, it typically takes 18 months for it to be delivered.\nThe Board also voted to amend an agreement with San Diego Gas & Electric to provide an additional two firefighting helicopters, bringing to five the number of helicopters available from the utility company to fortify an initial fire response. The agreement states that SDG&E pays for the first two hours of a new fire and the County pays for another two hours. In the event they are needed longer, the jurisdiction may choose to pay additional hours. Both SDG&E and the County have a $150,000 annual contribution limit.\nThe SDG&E fleet includes two Sikorsky UH-60 Black Hawks, one Sikorsky S-64 Skycrane and one Airbus H145, with another Black Hawk to be added in 2023. All will be based in San Diego County and available to be assigned to local fires.\nThe County first entered into the agreement with SDG&E in 2009 and has renewed and expanded terms since then. In five years, the SDG&E helicopters have responded to 144 fires with 333 flight hours.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220426.18.08.08"}