{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Special Primary Election Results – When to Expect Them", "description": "Counting ballots takes time, even for a special election like the First Supervisorial District, Special Primary Election.", "datePublished": "2025-04-08T08:00:00-07:00", "url": "https://www.countynewscenter.com/special-primary-election-results-when-to-expect-them/", "keywords": ["elections", "april 8 special primary election", "county registrar of voters", "district 1", "fgg", "supervisorial district 1", "supervisorial special primary election"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-04-09T16:32:19-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounting ballots takes time, even for a special election like the First Supervisorial District, Special Primary Election.\nSo, what can you expect on election night?\nThe first set of unofficial election night results will come in shortly after 8 p.m. This update will include mail ballots received before Election Day and vote center ballots from early voting between March 29 – April 7.\nTo follow the latest results update on election night, you can visit sdvote.com or follow the Registrar’s office on X (formerly Twitter).\nAfter the first unofficial report, election night updates will only include vote center ballots cast on Election Day.\nThe Election Day ballots come in after the vote centers close at 8 p.m. There will be a gap in time for the next set of results due to poll workers packing up supplies and driving in from the vote centers.\nAfter arriving at the Registrar’s office, the vote center ballots will be scanned, and results will be periodically updated until all vote center ballots have been counted.\nThe final unofficial election night results may not come in until 10 p.m. or later and will only cover the ballots that could be counted immediately.\nThe counting of ballots does not end on election night.\nWhat’s left to count?\nMail ballots\n\nThese are the ballots dropped off at vote centers, official ballot drop boxes or picked up from the U.S. Postal Service on Election Day.\nBallots mailed right before or on April 8 have seven days to arrive if postmarked on or before Election Day.\n\nProvisional ballots\n\nPeople who missed the March 24 registration deadline may conditionally register and vote provisionally up to and on Election Day.\nOnce their voter registration is processed, the voter registration becomes active, and the provisional ballot is counted.\nThe Registrar’s office cannot predict how many residents who are not registered, but otherwise eligible, will take advantage of this.\n\nAfter election night, the next release of unofficial results is scheduled to be posted by 6 p.m. on Thursday, April 10, Friday, April 11 and Monday, April 14. Additional updates are at the discretion of the Registrar of Voters.\nElection results must be certified by May 8. For this special election, the Registrar expects certification to occur on an earlier date, while making sure every legally cast vote is added to the count in the most expeditious, yet careful manner available, ensuring accurate results. All updates will be posted on sdvote.com with the final certified results posted by May 8.\nLearn more about voting in the District 1 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250408.08.00.00"}