{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Monthly Mosquito Larvicide Application Done by Hand Crews This Week", "description": "County Vector Control crews will conduct their regular mosquito-fighting larvicide applications this week on dozens of local waterways — but by hand, rather than from the air, because the helicopter used is down for unscheduled maintenance.", "datePublished": "2021-08-02T11:40:48-07:00", "url": "https://www.countynewscenter.com/monthly-mosquito-larvicide-application-done-by-hand-crews-this-week/", "keywords": ["health", "larvicide", "mosquito prevention", "mosquito-borne illness", "west nile virus"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-08-02T12:27:41-07:00", "articleType": "article", "articleContent": "\nCounty Vector Control crews will conduct their regular mosquito-fighting larvicide applications this week on dozens of local waterways — but by hand, rather than from the air, because the helicopter used is down for unscheduled maintenance.\nThe County has used helicopters to drop batches of solid, granular larvicide on nearly 50 rivers, streams, ponds and other waterways in summer months since the early 2000s. The program keeps mosquito populations down and protects people from mosquito-borne illnesses like West Nile virus.\nThis week they’ll be doing the same thing, but without the helicopter.\nResidents in the areas covered may see County crews wearing Vector Control uniforms that clearly identify them applying larvicide by hand, or using equipment such as backpack leaf-blower-like applicators and some vehicle mounted applicators to disperse the larvicide. Some of the waterways will be accessed by crews in boats. The larvicide doesn’t hurt people, pets, or other animals but is deadly for mosquito larvae and keeps them from growing into biting adult mosquitoes.\nThe application is typically done over the course of two days by helicopter, roughly once a month from April through September or October. Because crews will be working from the ground this month’s application is expected to take approximately six days, starting Monday.\nWest Nile virus’s effect has been mild in San Diego County in recent years, with just one person testing positive for it in 2020 and three in 2019 — all of whom contracted the virus outside the county — with no fatalities. To date for 2021, there have been no local detections of the virus through routine surveillance activities.\nHowever, West Nile virus remains a potentially dangerous disease; 22 county residents tested positive for it in 2016 and two people died. Last year across California, 258 people tested positive and 11 people died.\nWest Nile virus is mainly a bird disease, but it can be transmitted to people and some animals like horses by mosquitoes that first feed on infected birds and then a person or animal.\nPublic has important role to play\nProtecting against mosquitoes has required more help from the public in recent years because of the appearance of a number of types of invasive Aedes mosquitoes that can potentially transmit diseases not naturally found here, including Zika, dengue and chikungunya. While native culex mosquitoes that can transmit West Nile virus breed in larger water bodies reached by the County’s larvicide drops, invasive Aedes mosquitoes prefer to live and breed around people’s homes and yards.\nCounty Vector Control officials said the best way people can protect themselves from mosquitoes is to follow their “Prevent, Protect, Report” guidelines.\nPrevent mosquito breeding\nSan Diego County residents may be more vulnerable to being bitten by mosquitoes around their homes now because many have been spending more time at home during the coronavirus pandemic. So, remember to dump out or remove any item inside or outside of homes that can hold water, such as plant saucers, rain gutters, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquito fish, available for free by contacting the Vector Control Program, may be used to control mosquito breeding in backyard water sources such as stagnant swimming pools, ponds, fountains and horse troughs.\nProtect yourself from mosquito bites\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nReport possible mosquito activity and dead birds\nReport increased mosquito activity, or stagnant, green swimming pools and other mosquito-breeding sources, as well as dead birds within 24 hours — dead crows, ravens, jays, hawks and owls — to the County Department of Environmental Health and Quality’s Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov. Also report if you are being bitten by mosquitoes during daylight hours, or if you find mosquitoes that look like invasive Aedes mosquitoes — small, black with white stripes on legs and backs — by contacting the Vector Control Program at (858) 694-2888.\nFor more information about mosquito-borne illnesses, go to San Diego County’s “Fight the Bite” website. Here are some tips to help you keep your yard from becoming a mosquito breeding ground.\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210802.11.40.48"}