{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Community Celebrates Start of County’s Calavo Park", "description": "County officials and community members broke ground last week on a new 9-acre park in Spring Valley.", "datePublished": "2024-09-16T13:16:42-07:00", "url": "https://www.countynewscenter.com/community-celebrates-start-of-countys-calavo-park/", "keywords": [], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-09-16T13:16:42-07:00", "articleType": "video.other", "articleContent": "\nReading Time:  < 1 minuteCounty officials and community members broke ground last week on a new 9-acre park in Spring Valley.\nCalavo County Park, located off Calavo Drive near Jamacha Boulevard, will feature an all-wheel park or skatepark, two playgrounds, nature play apparatus, a basketball and pickleball court, a soccer and baseball field, an off-leash dog park and more.\nOther amenities include 85 parking spots, including accessible parking, that will be built in the park to free up street parking. The new park is also adding more ‘green to the scene’ with an estimated 200 trees and 6,000 shrubs for shade. They will be drought-tolerant to align with County sustainability goals.\nOn-site maintenance and security have been built into the design plan, thanks to the addition of a volunteer pad where a live-on volunteer host will reside.  These volunteers stay overnight to keep watch over the park, help with cleanup and maintenance projects and even facilitate park programs in exchange for their stay.\nResidents had a chance to get involved in designing the park from the beginning. County Parks held public meetings, issued surveys, worked with focus groups and spoke with community planning groups to hear what residents wanted.\nA grand opening is expected in fall 2025.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240916.13.16.42"}