{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Flood Disaster Declaration Allows Impacted San Diegans to Get Disaster CalFresh Benefits", "description": "People impacted by the Jan. 22, 2024 storm flooding may be eligible for the Disaster CalFresh program. The program provides a one-time payment to buy food for themselves and their families.  ", "datePublished": "2024-03-04T11:49:11-08:00", "url": "https://www.countynewscenter.com/flood-disaster-declaration-allows-impacted-san-diegans-to-get-disaster-calfresh-benefits/", "keywords": ["health", "disaster calfresh", "january flood"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-03-04T12:09:45-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesPeople impacted by the Jan. 22, 2024 storm flooding may be eligible for the Disaster CalFresh program. The program provides a one-time payment to buy food for themselves and their families.  \nThe County of San Diego received funding for this program from the federal government for people to purchase healthy food through the Disaster CalFresh program. \nDue to presidential disaster declaration rules, San Diego County residents affected by the flood have between March 7-15, 2024 to apply. Residents already receiving CalFresh also may be eligible to receive a Disaster CalFresh supplement. \nTo apply for this one-time payment, you must: \n\nLive or work in the disaster area during the disaster. \nBuy or plan to buy eligible food.  \nBe experiencing challenges due to the disaster. \n\nThe County will review applications for: \n\nNet income, which is the total monthly take-home income after all payroll withholding and any liquid resources. \nDeductions for disaster-related expenses. \nWhether the total net income and deductions for disaster-related expenses are equal or less than the Disaster Gross Income Limit to receive the benefits. \n\nThe monthly income limit is based on the number of people in your household and the maximum amount of Disaster CalFresh benefits is outlined in the chart below. \n\nFor example, a family of three with a monthly income of $2,942 after deductions for flood expenses would be eligible for a $766 Disaster CalFresh benefit amount.  \nPeople impacted by the Jan. 22 flood can apply for these benefits in one of several ways: \n\nFilling out an application, CF 385 form, and submitting it online at benefitscal.com. \nCalling Access at 866-262-9881. \nGoing into any local Family Resource Center to fill out a CF 385 form. \nGoing to one of the two FEMA Disaster Recovery Centers. \n\nThe one-time benefit will be provided on an Electronic Benefit Transfer (EBT) card. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240304.11.49.11"}