{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Grant Bolsters County’s Fight Against Wage Theft", "description": "A new $750,000 grant will strengthen the County’s efforts to fight unscrupulous employers who cheat workers of their rightfully earned pay.", "datePublished": "2024-08-01T14:58:09-07:00", "url": "https://www.countynewscenter.com/new-grant-bolsters-countys-fight-against-wage-theft/", "keywords": ["government", "branden butler", "chairwoman nora vargas", "county counsel", "district attorney summer stephan", "fgg", "grant", "psg", "vice chair terra lawson-remer", "wage theft"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-08-01T16:18:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA new $750,000 grant will strengthen the County’s efforts to fight unscrupulous employers who cheat workers of their rightfully earned pay.\nThe two-year state grant will help support the salaries of a prosecutor, an investigator and a paralegal who can review wage theft cases for criminal or civil violations.\nThe District Attorney’s Office, County Counsel and the County’s Office of Labor Standards and Enforcement (OLSE) will work to help wage theft victims recover lost wages.\nPeople who earn low wages, women, people of color, non-English speaking and those who are foreign-born are particularly at risk. Many who lose their pay don’t know how to get help recovering their earnings.\n“Wage theft is a grave injustice that affects many in San Diego County, especially our most vulnerable workers,” said County Board Chairwoman Nora Vargas. “This grant empowers us to strengthen our efforts to protect workers’ rights and hold employers accountable for exploitation.”\nSan Diego County sees roughly $2 million in wage theft losses every year.\n“We are holding companies accountable that steal money from their workers and fail to pay the wages they have been promised,” said Board Vice Chair Terra Lawson-Remer. “We established the County’s Office of Labor Standards to protect workers and this new program to prosecute bad employers is a significant step forward. I am thankful California’s Labor Commissioner awarded us this funding, OLSE will put it to good use, and help as many people as possible.”\nThe County’s Office of Labor Standards and Enforcement was established in 2021 to educate employers and workers about employment laws, and workers’ rights.\nThe office administers the Workplace Justice Fund which has helped 34 victims of wage theft.\nThe DA’s Workplace Justice Unit was also created in 2021 and was one of the first in California to investigate and prosecute criminal wage theft cases.\n“Wage theft is oppressive and impacts the livelihood and dignity of hard-working people. This is why it has been a priority for our office to hold those who steal wages accountable through felony wage theft prosecutions,” said District Attorney Summer Stephan. “With this grant, we will be able to expand our efforts in partnership with our county partners and further protect workers. I want to thank California’s Labor Commissioner Lilia Garcia-Brower for her trust in us and awarding us this valuable grant.”\nThe DA’s office investigates criminal wage theft cases, County Counsel addresses violations of labor laws through civil enforcement actions and OLSE educates employers about labor laws and workers about their rights.\n“Wage theft victims in San Diego County are not alone. There is help.” said OLSE Director Branden Butler. “People have a right to the wages they’ve earned and we’re here to help workers recover the money they are owed.”\nFor more information on workers’ rights or wage theft, contact the Office of Labor Standards and Enforcement at 619-531-5129 or call the DA workplace justice hotline at 1-866-402-6044.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240801.14.58.09"}