{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Adoption Specials Present More Furry Best Friend Opportunities", "description": "The County animal shelters are nearly full, so the Department of Animal Services is offering its Full House Adoption Specials through July.", "datePublished": "2023-07-06T11:59:17-07:00", "url": "https://www.countynewscenter.com/adoption-specials-present-more-furry-best-friend-opportunities/", "keywords": ["animals", "adopt pets", "das"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-07-06T12:23:51-07:00", "articleType": "article", "articleContent": "\nThe County animal shelters are nearly full, so the Department of Animal Services is offering its Full House Adoption Specials through July.\nDogs that weigh 50 pounds and more are available for a $25 adoption fee. Additionally, the shelters have lots of sweet, fluffy kittens available for a $25 adoption fee – and they are also offering a buy one kitten, get another free bonus special because who doesn’t love to see two kittens playing?\nThe shelters continue to experience high numbers of medium- to large-size dogs seeking homes–and some have been waiting more than a year.\nAll cats, dogs and bunnies will be vaccinated, spayed or neutered, and microchipped. A dog license will be included as well.\nScientific studies have shown that animals have a beneficial effect on people’s physical and mental health–and while not noted, it surely has a beneficial effect on the adopted animal’s physical and mental health as well.\nFind your new best friend by browsing the County shelters’ animal inventory on the Adoptions page. Pick a second and third choice too, just in case your first choice is already adopted.\nWalk-in hours are from 1 to 4 p.m. Tuesday through Friday and from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad. People can save time by completing a pet adoption application in advance.\nThe County Department of Animal Services’ top priority is providing excellent care in its shelters while finding good homes for every healthy and treatable animal. While the goal is to find the right fit for animals and their permanent adopter to form a lasting and loving bond, animal fostering is another opportunity for animals to learn how to be in a home and socialize with people and other animals.\nThe Department of Animal Services protects the health, safety and welfare of people and animals. Animal Services envisions a safe, thriving community where all people and animals in San Diego County have access to essential animal care and support services.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230706.11.59.17"}