{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Seventh Influenza Death Reported in San Diego County", "description": "An 89-year-old North County woman is the seventh influenza death reported in the region this season, the County Health and Human Services Agency announced today.", "datePublished": "2022-05-25T11:42:44-07:00", "url": "https://www.countynewscenter.com/?p=208612", "keywords": ["health", "flu", "influenza", "seventh flu death"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-05-25T11:42:44-07:00", "articleType": "article", "articleContent": "\nAn 89-year-old North County woman is the seventh influenza death reported in the region this season, the County Health and Human Services Agency announced today.\nThe woman, who died May 9, had underlying medical conditions, had received a flu vaccination, and did not have COVID-19 when she died.\nHer death is the second influenza death recorded in the County during the month of May. Health officials note that deaths are uncommon this late in the season.\n“We are seeing a late spike of influenza cases in our region this season and it is not too late to get vaccinated against it,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “The same precautions we use for COVID-19 also help protect anyone who is at higher risk of complications from the flu.”\nThe County also reported an additional 196 lab-confirmed influenza cases in the region last week, a slight increase compared to the prior week, when 176 cases were recorded.\nAlthough the flu vaccine is recommended for nearly everyone six months and older, it is especially recommended for people at higher risk of developing complications from the flu. They include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe latest Influenza Watch Report from the County Health and Human Services Agency shows the following for the week ending May 21, 2022:\n\nEmergency department visits for influenza-like illness: 4% of all visits (compared with 4% the previous week).\nLab-confirmed influenza cases for the week: 196 (compared to 176 the previous week).\nTotal lab-confirmed cases to date: 3,274 (compared to 823 at the same time last season and a 11,686 prior 5-year average during the same week).\nInfluenza-related deaths reported to date: seven (compared to two last season).\n\nTips to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nDuring the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths. During the 2019-2020 flu season, more than 20,700 flu cases were reported and 108 San Diegans died from influenza.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220525.11.42.44"}