{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 9-26-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Sept. 25.", "datePublished": "2020-09-26T15:05:15-07:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-9-26-2020/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-09-26T15:05:15-07:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Sept. 25.\n\n\n\nNew State Metrics:\n\nUnder the new state monitoring metrics, San Diego County is currently in Tier 2, also referred to as the Red Tier.\nSan Diego’s state-calculated, adjusted case rate is 6.9. The testing positivity percentage is 3.8%.\nThe California Department of Public Health will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 29.\n\nCommunity Setting Outbreaks:\n\nFive new community outbreaks were confirmed on Sept. 25, three in business settings, one in a restaurant/bar and one in a government setting.\nIn the past seven days (Sept. 19 through Sept. 25), 18 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days. ​\n\nTesting:\n\n9,914 tests were reported to the County on Sept. 25 and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,561.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n330 new cases were confirmed among San Diego County residents on Sept. 25. The region’s total is now 46,331.\n16 of the 330 new cases, and one new probable, are connected to San Diego State University. In addition, 67 previously reported cases are now being associated with SDSU. The total number of cases connected to SDSU students is here.\n3,483 or 7.5% of cases have required hospitalization through Sept. 25.\n814 or 1.8% of all cases and 23.4% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported in San Diego County on Sept. 25. The region’s total remains at 775\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n\n\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200926.15.05.15"}