{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Fire Chief Motivates Young Men to Pursue First Responder Careers", "description": "Sixteen young men who are part of a joint County Probation and Fire training program dove into history to find inspiration from trail blazers in first responder careers.", "datePublished": "2025-02-28T13:34:24-08:00", "url": "https://www.countynewscenter.com/fire-chief-motivates-young-men-to-pursue-first-responder-careers/", "keywords": ["public safety", "county fire", "county probation"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-02-28T13:34:24-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesSixteen young men who are part of a joint County Probation and Fire training program dove into history to find inspiration from trail blazers in first responder careers.\nThree of the youth presented display boards featuring men and women who served in prominent roles in fire or law enforcement.\nSan Diego City Fire Chief Robert Logan, who is the City of San Diego’s third African-American fire chief, met with two Fire Fuel program academies of young men, and a group about to begin a third academy, to tell them about how he arrived at his career. The academies are a structured training program where in-custody youth learn skills for fire fuel and vegetation management.\n“I came from humble beginnings,” Logan said. “I always wanted to be a firefighter. I always wanted to help my community.”\nLogan told the group he was a hard worker, but he came to realize that what he lacked was education. To address that, he earned his associate’s degree. While in college, Logan says, he was surrounded with other like-minded people who wanted to improve themselves. When he earned his first degree, he liked how that felt. So, he decided to earn a bachelor’s degree. Not long after attaining that goal, Logan applied to get his master’s degree with a goal of a 4.0 grade point average (GPA). This decision would change his life.\nLater in Logan’s firefighting career, when the fire chief job opening was posted, the description said that the ideal candidate would have a master’s degree. Even though others of higher ranks applied for the chief position, Logan got the position because of his experience and education.\nSupervising Probation Officer Eduardo Calderon said all the students in the Fuel Crew training program are enrolled in online or in-person college courses.\nOne youth will be getting his associate’s degree in communications from a local community college in May with a 3.9 GPA.  He said he found it inspiring to hear that Chief Logan had taken the same steps in education that he was now focused on.\nAlthough the young man said the Fire Fuel program is great, he signed up for the academy “just to build character and take what I’m learning in this program and apply it to another avenue.”\nAnd he has done that. The youth was accepted at five different universities. He’s already decided to attend one outside of the county that has a support program for formerly incarcerated students.\nOther students are more serious about fire service. One youth wants to pursue it as a career. In listening to Logan, what really resonated with him was the part about how the people you spend time with influence your life choices.\n“Being in here, I’ve noticed that we all have the same focus and we’re all here just to better our lives,” a youth said. “It has inspired me to be more disciplined and focused in my other (outside) life.”\nCalderon said no one is considered for the program unless they are a high school graduate and have met the minimum expectations of their case-plan. All the youth are cleared for community service, and they do other projects unrelated to fire service, like helping pack and distribute food in the community.\nSan Diego County Fire Capt. Chris Capossere, who teaches the program coursework, has seen significant transformations in the youth in the program. He said he sees participants develop better communication skills and that they are well-positioned to apply leadership skills in the jobs they are trying to accomplish.\nFrom the first academy, one youth was referred to the Ventura Training Center, an 18-month fully sponsored fire training program. Another is being sponsored through his training process at a local fire department, Calderon said. Two more were accepted at a California Department of Corrections firefighting program.\n“It’s about educating ourselves, and educating others, which is what you did here. You are setting examples for others to come,” Probation Chief Tamika Nelson told the group. “I’m very proud of you.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250228.13.34.24"}