{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Accepts One-Year Congressional Grant to Fund Mobile Crisis Response Team Expansion", "description": "The Mobile Crisis Response Team (MCRT) program that supports people confronting mental health struggles is getting a multi-million-dollar boost. ", "datePublished": "2023-09-26T12:59:07-07:00", "url": "https://www.countynewscenter.com/county-accepts-one-year-congressional-grant-to-fund-mobile-crisis-response-team-expansion/", "keywords": ["health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-09-26T17:05:24-07:00", "articleType": "article", "articleContent": "\nThe Mobile Crisis Response Team (MCRT) program that supports people confronting mental health struggles is getting a multi-million-dollar boost. \nTuesday the County Board of Supervisors accepted $4.48 million in one-time Congressional Directive Spending grant funding to expand the MCRT program. \nThe grant will fund new MCRTs to support areas with higher call volumes, which most recent data shows as East County, and for a pilot team that will respond directly to schools. \nThe way it works is when a call about someone experiencing a mental health crisis is made, it can be routed to the MCRT service from several places, including 9-1-1, law enforcement and the 9-8-8 Suicide and Crisis Lifeline. \nRepresenting a shift from law enforcement being the principal responder to all behavioral health-related calls, the program’s clinicians have responded to more than 6,700 calls since its January 2021 launch. \n“About half of our clients contacted by our MCRT teams were stabilized in the field and connected with services, reducing the stress on law enforcement and other expensive services,” said Dr. Luke Bergmann, director of Behavioral Health Services. \nOnce a call has been received and evaluated, a team of behavioral health experts can be dispatched to meet someone in crisis where they are. Once MCRT arrives on-scene they assess the person, de-escalate any concerns, and connect them with services like counseling, case management, and substance use treatment. \nPreliminary regional call volumes show the East region responding to 445 calls this summer compared to 359 calls in the Central region. North Coastal received 297 calls, South received 272 and North Inland 187 from June to August. \nNearly 30% of all MCRT clients were under 25-years-old, emphasizing the need to expand support to youth in schools to connect students with behavioral health experts quickly. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230926.12.59.07"}