{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Drug Disposal Pilot Program Reaches Milestone", "description": "The County’s Drug Disposal Pilot Program has reached a milestone by distributing more than 1200 drug deactivating pouches. ", "datePublished": "2024-07-01T11:40:37-07:00", "url": "https://www.countynewscenter.com/county-drug-disposal-pilot-program-reaches-milestone/", "keywords": ["health", "community", "dr. tuteur", "drug pouches", "equity", "medical care services", "opioid", "opioid settlement"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-07-01T12:04:20-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County’s Drug Disposal Pilot Program has reached a milestone by distributing more than 1200 drug deactivating pouches. \nThe County teamed up with physicians, dentists, and pharmacists to provide the bags to patients in Central and East County who are prescribed opioids after a medical or dental procedure.  \nPatients were instructed to put any expired or leftover medications in the pouch, add warm water, then seal and shake the pouch. The warm water causes a chemical reaction that inactivates the medications, making them safe to throw away in the trash. \n“These pouches keep children safe and drugs out of the hands of anyone who could misuse and suffer from ingesting them,” said Caroline Smith, interim deputy chief administrative officer for the County’s Health and Human Services Agency. \nIn 2022, 857 people died from an opioid overdose in San Diego County, which is about a 115% increase from 2016.  \nThe pilot program was approved by the County’s Board of Supervisors in October 2023 and allotted $500,000 from a one-time Opioid Settlement Fund. \nMore information on the Drug Disposal Pilot is available on the Medical Care Services website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240701.11.40.37"}