{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mental Health for All at NAMIWalks San Diego", "description": "Coming together around mental health provides community members with a safe space for uplifting hope and healing. It is the goal of the annual NAMIWalks and Mental Wellness Expo this Saturday, April 26, 2025.  ", "datePublished": "2025-04-24T16:59:57-07:00", "url": "https://www.countynewscenter.com/mental-health-for-all-at-namiwalks-san-diego/", "keywords": ["health", "mental health", "mental health awareness month", "nami walk"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-04-24T16:59:57-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesComing together around mental health provides community members with a safe space for uplifting hope and healing. It is the goal of the annual NAMIWalks and Mental Wellness Expo this Saturday, April 26, 2025.  \nThe free event, organized by the National Alliance on Mental Illness in partnership with the County’s Health and Human Services Agency, kicks off Mental Health Matters Month which happens every May.    \nCommunity members are invited to join local organizations in raising awareness about mental health, addressing the stigma surrounding mental health topics and coming together to let others know they are not alone.  \n“The yearly NAMIWalks event is a powerful community gathering to show our support for each other and our collective mental health,” said Nadia Privara Brahms, acting director of County Behavioral Health Services. “We can all do more to support ourselves and people around us who may be struggling by learning about tools for coping and healing, understanding resources that are available, and through community connections.” \nThe day starts with a no-cost community walk around Preble Field in NTC Park at Liberty Station. The walk begins at 8:15 a.m. following the opening ceremony.   \nCommunity mental health resources will be available from 7 a.m. to 11 a.m. for families, children, military members and veterans, and there will be hands-on activities that can help improve mental health.    \nBooths hosted by the County include an affirmation potting station, stigma-free photo booth, face painting and a children’s activity booth. \nTo register for the NAMIWalks and Mental Wellness Expo, visit the event website.  \nIf you or someone you know is struggling emotionally, experiencing an issue with drugs or alcohol, or having a hard time, dialing 9-8-8 can help. This three-digit nationwide phone number can connect you to San Diego County’s Access & Crisis Line. Calling can connect you, a friend, or a family member to mental health services and referrals.  More resources are also available on the County BHS Resources webpage and the It’s Up to Us SD website that also includes a list of other activities surrounding Mental Health Matters Month.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250424.16.59.57"}