{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "4 New COVID-19 Deaths Reported; Testing Expanded", "description": "The number of local COVID-19 deaths went up by four and total cases increased by 152, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-23T17:50:53-07:00", "url": "https://www.countynewscenter.com/4-new-covid-19-deaths-reported-testing-expanded/", "keywords": ["health", "4 covid-19 deaths", "coronavirus", "testing expanded"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-24T12:02:49-07:00", "articleType": "article", "articleContent": "\nThe number of local COVID-19 deaths went up by four and total cases increased by a record 152, the County Health and Human Services Agency announced today.\nOne person died April 16 and three died April 21. The ages of the four people who died ranged from 68 to 79 years. Two were men and two were women. All of them had underlying medical conditions.\n“It’s very unfortunate that more people have died from COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Our regards and condolences go out to the families of the four deaths announced today and the loved ones of all the people who have lost their lives to this novel virus.”\nTo date, 100 San Diegans have died from complications of COVID-19. Of the people who have died, 88 were 60 years and older; 56 were men and 44 were women. Age, gender and ethnic/race breakdowns for cases and deaths are posted at coronavirus-sd.com.\nCounty COVID-19 Cases Reach 2,643\nOf the nearly 39,000 COVID-19 tests administered to San Diegans, 2,643 have been positive including 152 additional cases announced today, the highest one-day total for the region since 146 cases were announced April 2. Increase in cases are anticipated as the region expands its testing capacity.\nOf the local cases, 1,355 (51.3%) were men and 1,284 (48.6%) were women. The gender of four people is unknown. Of the reported cases, 634 (24%) have required hospitalization and 213 (8.1%) of the total number of people who tested positive had to be placed in intensive care. One hundred (3.8%) have died.\nCOVID-19 Testing in County\nBefore the County of San Diego can begin to ease some of the local restrictions, there needs to be a robust COVID-19 testing program in place in order to reduce the number of people who get sick and die from the novel virus.\nThe County has organized a Laboratory Testing Task Force of local hospitals, relevant clinics and commercial laboratory systems to expand testing, while ensuring the safety of testing personnel.\nThe task force, which will meet three times next week, will be responsible for:\n\nIdentifying the COVID-19 testing capacity and capability in the region\nFinding gaps and opportunities for increased testing to achieve the region’s capacity\nImplementing a countywide serology testing strategy\nImplementing quality assurance measures for pop-up testing clinics\n\n“We need to look at the local inventory so that we know exactly what the region’s COVID-19 testing capability is,” said Wilma Wooten, M.D., M.P.H., County public health officer. “This will help us to be able to provide timely and accurate testing to the people at higher risk of developing complications of from this novel virus.”\nThe regional testing capacity has been expanded to more than 3,400 tests per day. They include:\n\n1,000 plus at the County Public Health Lab\n2,000 plus at local hospitals\n400 plus private labs\n\nHowever, some local hospitals have indicated they could ramp up their testing capabilities should it be needed.\nBut to reach the local COVID-19 testing capacity, local hospitals and clinics need to have the capability and make sure they have enough of the following:\n\nSupplies such as swabs and reagents\nStaff to collect samples\nPersonal protective equipment for staff collecting samples\nCouriers and transport methods to get specimens to labs\nEnough microbiologists\n\nDoctor’s Referral Required for All Testing\nThe County is following current federal and state guidelines to determine priority for who should be tested for COVID-19 and has passed along those recommendations to the local medical community.\nHowever, the local health care system has flexibility when deciding who should be tested. Local hospitals can test patients outside the priority groups if they have the capability do it.\n“If patients with potential COVID-19 symptoms reach out to their doctor asking to be tested and they are not in the testing priority groups, it is up to doctors to determine if the patient should be tested based on their medical evaluation,” Wooten indicated.\nThe County is expanding the priority groups of who should be tested for COVID-19.\nOn-site testing is now available for residents and staff with or without symptoms at congregate facilities such as long-term care places, homeless shelters, treatment centers and correctional facilities. The County will start testing patients at facilities where outbreaks have been reported.\nCounty Microbiologist Jovan Shepherd prepares a specimen for testing of the novel coronavirus.\nAlso, the list of vulnerable populations has been expanded to include people – with or without symptoms – who are HIV positive, people experiencing homelessness, residents in low-income communities and rural areas, as well as older adults and members of various racial/ethnic groups, including Native Americans.\nStarting Monday, County testing sites will be operating in Escondido and Chula Vista and mobile testing sites will soon be in other parts of the region to accommodate the growing demand.\nHowever, everyone being tested needs to have a referral from their doctor. People without one can call 2-1-1 to be connected with a medical provider.\n“People need to contact their doctor to get a referral before being tested,” Wooten explained. “You should not show up to a testing location without a doctor’s order.”\nChanges to Health Officer Order\nWooten has also made some changes to her Health Officer Order. They include:\n\nChild daycare and childcare providers shall make best efforts to keep children in groups or 10 fewer and keep children in the same group each day. If more than one group of children is cared for at one facility, each group should be in a separate room. Employees shall wear face coverings and should remain solely with one group of children.\nHospitals and health care providers may authorize and perform non-emergency and elective surgeries, or procedures based on clinical need and supply capacity, and where consistent with state guidance.\n\nMore COVID-19 Information\nThe County is now reporting the rate of positive cases by ZIP code, which is a more accurate indicator when comparing data among groups of different sizes.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200423.17.50.53"}