{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Hosting Multiple Monkeypox Vaccination Events", "description": "More than 2,000 JYNNEOS vaccination appointments are available this week and next week for people at risk of getting sick with monkeypox (MPOX).  ", "datePublished": "2022-09-22T14:52:00-07:00", "url": "https://www.countynewscenter.com/?p=209563", "keywords": ["health", "monkeypox", "mpox", "vaccinations"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-09-22T14:52:00-07:00", "articleType": "article", "articleContent": "\nMore than 2,000 JYNNEOS vaccination appointments are available this week and next for people at risk of getting sick with monkeypox (MPOX).\nThe County is holding multiple vaccination events at the Balboa Park Golden Hill Community Clubhouse and has hundreds of appointments available per day. Vaccinations are also available at Public Health Clinics in all parts of the County.\nA list of where to get the vaccine by locations and dates is now available on the County MPOX website. People can sign up to receive their first or second dose of the vaccine.\nAppointments can be made by visiting myturn.ca.gov.\nWalk-ins are being accommodated on a limited basis at the Balboa Park Golden Hill Community Clubhouse vaccination events, with availability dependent on supply on a given day. People are still encouraged to sign up in MyTurn for an appointment.\n“It’s important that people who are eligible for the vaccine, get it, so we’ve added a large location and some flexibility” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “While we are seeing infection rates steadily decline, this is in part due to people getting the vaccine and being aware of risk factors.”\nLarge vaccination events are being held at the Balboa Park Golden Hill Community Clubhouse.\n \n \n \n \n \n \n \n \n \n \n \nThe JYNNEOS vaccine helps prevent MPOX and is available to those determined to be at high risk for the disease, including people who have been in close contact with someone with confirmed or probable MPOX and gay, bisexual, and other men who have sex with men with multiple partners. More information about who is eligible for the JYNNEOS vaccine is available on the County’s MPOX website.\nWhile supply for the JYNNEOS vaccine has been limited, recent increased allocations from the California Department of Public Health and the move to administer the vaccine intradermally several weeks ago, have made it possible to vaccinate more people.\nWith intradermal injections, a small portion of the vaccine is administered just below the skin. The JYNNEOS vaccine is being administered on the forearm. The intradermal injection method has allowed for up to five doses to be pulled from each JYNNEOS vial instead of just one dose with the previous subcutaneous injection technique.\nThe County has a total of 387 confirmed or probable MPOX cases since the first case was reported on June 15.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220922.14.52.00"}