{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Time Change Reminder to Check for Safety", "description": "Don’t forget to set your clocks back one hour early Sunday morning when Daylight Saving Time ends–and while you’re at it, consider doing five more things to keep your family safe.", "datePublished": "2023-11-03T12:10:48-07:00", "url": "https://www.countynewscenter.com/time-change-reminder-to-check-for-safety/", "keywords": ["public safety", "alertsandiego", "county fire", "daylight saving", "emergency", "home safety", "personal disaster plan", "sd emergency app", "smoke alarms"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-11-03T13:05:12-07:00", "articleType": "article", "articleContent": "\nDon’t forget to set your clocks back one hour early Sunday morning when Daylight Saving Time ends–and while you’re at it, consider doing five more things to keep your family safe.\n\nCheck all your home’s smoke and carbon monoxide alarms to ensure they are working, and check fire extinguishers to make sure they are not expired.\n\nAt most, it takes 10 minutes to check your devices and make sure they are functioning properly or not expired. Families stake their lives on these devices if and when a fire breaks out in the middle of the night.\nTypically, people just need to press a button to hear the alarm activate. If it beeps, the battery is still good. Safety experts recommend checking the battery in your smoke alarm monthly and replacing the battery annually.\nSome newer smoke alarms have a special battery that has a 10-year service life that is not replaceable. In this case, continue to test the battery monthly and replace the entire unit after 10 years.\nFor adults who may not be able to evacuate as quickly or who may need assistance, smoke alarms are particularly critical.\nIf you’re a senior without working smoke alarms, the Burn Institute wants to help with its Senior Smoke Alarm Program, which offers people over 62 who own their homes free smoke alarms and installation in San Diego County. Apply for the Senior Smoke Alarm Program online or call (858) 541-2277.\n\nCheck your emergency supplies kit and replace your food and stored water so it doesn’t go bad. Emergency officials recommend that people rotate water and food out of their emergency supplies kits every six months. Check batteries and medications too.\nPractice or at least review your home evacuation plan with the entire household. A guide for how to do this in the Personal Disaster Plan\nCreate or review your Personal Disaster Plan in the event of fire or carbon monoxide emergency.\nRegister your cell phone with AlertSanDiego to receive emergency notifications and download the County’s free SDEmergency app.\n\nAs we are in peak wildfire season, you can also learn more about how you can prepare the outside of your home to lessen the risk of an ember taking hold.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231103.12.10.48"}