{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Investigating Illnesses Linked to Imported Oysters", "description": "County health officials have linked 41 confirmed and probable cases of norovirus illness to raw oysters imported from a specific harvest location in Northwest Mexico.  ", "datePublished": "2024-01-11T14:18:15-08:00", "url": "https://www.countynewscenter.com/county-investigating-illnesses-linked-to-imported-oysters/", "keywords": ["health", "imported oysters", "mexico", "oysters"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-01-11T14:19:12-08:00", "articleType": "article", "articleContent": "\nCounty health officials have linked 41 confirmed and probable cases of norovirus illness to raw oysters imported from a specific harvest location in Northwest Mexico.  \nThe cases began in mid-December following dining on raw oysters from Sonora, Mexico. These implicated oysters have only been available through restaurants and wholesale locations. The County Health and Human Services Agency (HHSA) has asked restaurants to set aside “Rocky Point oysters” packed by GOLPAC located in Bahia Salina, Sonora, Mexico until further notice. Restaurants or others who purchased oysters from this location are asked to not use them while an investigation of this outbreak takes place. \nCases to date have been tied to oysters served at three locations of The Fish Shop (Pacific Beach, Point Loma, and Encinitas) restaurants and the Carlsbad Aquafarm. Other locations may emerge during this investigation. \nThese illnesses have been caused by norovirus, the leading cause of vomiting and diarrhea among people of all ages in the United States.  \nThe 41 people who got sick reported eating raw oysters a day or two in advance of symptoms. Cases range in age from 12 to 83 years old. Symptoms reported included nausea, vomiting, and diarrhea. None of the illnesses required hospitalization. \nSeveral household members, including children, who did not eat the oysters have subsequently become ill likely due to spread within the home. \n“The County recommends that people ask where oysters were harvested when eating out or getting food from wholesale locations to avoid consuming Rocky Point oysters from Bahia Salina, Sonora, Mexico,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “It’s also important for anyone who is sick to seek medical care. People who are ill, and those that live with them, should wash their hands frequently to avoid contaminating surfaces and foods that could further spread the infection.”  \nEating raw oysters has been linked to outbreaks with such germs as Vibrio, Shigella, and E. coli, in addition to norovirus. If you eat raw or undercooked oysters, germs that might be in the oyster can make you sick.  \nPeople infected with norovirus generally develop nausea, vomiting, diarrhea, stomach cramps, fever, and body aches approximately 12 to 48 hours after consuming contaminated foods. The illness typically lasts for 1-3 days. The vomiting and diarrhea can lead to dehydration requiring medical attention, especially in young children, older adults, and people with other illnesses.  \nHHSA is working closely with California Department of Public Health, including the Shellfish Program, to continue investigating illnesses associated with oysters.  \nPeople who have or develop symptoms should reach out to their healthcare provider.  To report illness to the County after dining out or purchasing from wholesale food locations call (858) 505-6814, or email fhdepi@sdcounty.ca.gov.  \nMore information on seafood and shellfish safety is available here, general information on norovirus is here, and prevention of norovirus spread in the home information is here. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240111.14.18.15"}