{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Have a Plan for Staying Cool", "description": "Extreme heat is in the forecast again for next week but the County offers some relief at nearly 100 Cool Zones available throughout the region.", "datePublished": "2022-09-23T16:31:04-07:00", "url": "https://www.countynewscenter.com/have-a-plan-for-staying-cool/", "keywords": ["health", "avoid the heat", "cool zone", "extreme heat"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-09-23T16:31:04-07:00", "articleType": "article", "articleContent": "\nExtreme heat is in the forecast again for next week but the County offers some relief at nearly 100 Cool Zones available throughout the region.\nThe National Weather Service has put an excessive heat watch in effect from Monday morning through Wednesday evening.  The hottest conditions will be expected Monday and Tuesday in the high 90s to 100 degrees in the valleys and up to the 90s in other areas including the coast.\nFor those who do not have air conditioning available and need to cool off, the County and its partners have 97 Cool Zones throughout the region. To find the nearest Cool Zone, people can enter an address once they navigate to the map and it will show several locations near them.\nResidents can also call 2-1-1 to request information about Cool Zones or schedule a free ride to a Cool Zone near them if they don’t have access to transportation.\n“A very high body temperature can be dangerous because it can damage the brain and other vital organs. Individuals of all ages are at risk but senior, young children and people with certain medical conditions are more likely to develop heat-related illness,” said Wilma J. Wooten, M.D., M.P.H., County public health officer.  “Check on anyone in your family or neighborhood who may need assistance.”\nCounty health officials offer the following tips to stay cool:\n\nStay in an air-conditioned area during the hottest hours of the day.\nWear light, loose-fitting clothing.\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty.\nTake cool showers.\nNever leave a child, elderly person, or pet unattended in a car.\nAvoid unnecessary hard work or activities outside during the hottest part of the day.\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun.\nAvoid using the oven to cook.\nAvoid being out during peak heat hours.\nPet owners can exercise their pets in early morning hours or early evening to avoid prolonged exposure to the heat. Make sure they have shade throughout the day and plenty of water.\nEven a few hours spent in air conditioning can help your body stay cooler.\nDo not rely on electric fans for cooling if temperatures exceed 90 degrees.\n\nIf someone is showing signs of heat-related illness, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature, and continuing cooling efforts, and\nDo not give the victim fluids to drink\n\nMore information about the signs and symptoms of emergencies like heat exhaustion and heatstroke, visit the County Health and Human Services Agency Extreme Heat webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220923.16.31.04"}