{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "All Registered Voters to Receive Mail Ballot for Gubernatorial Recall Election", "description": "The Registrar of Voters is alerting all active registered voters in San Diego County that they will receive a ballot in the mail for the Sept. 14 California Gubernatorial Recall Election.", "datePublished": "2021-07-08T13:57:53-07:00", "url": "https://www.countynewscenter.com/all-registered-voters-to-receive-mail-ballot-for-gubernatorial-recall-election/", "keywords": ["elections", "2021 recall election", "gubernatorial recall election", "in-person voting locations", "mail ballot", "mail ballot drop-off locations", "recall election", "sept. 14"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-07-09T10:45:38-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters is alerting all active registered voters in San Diego County that they will receive a ballot in the mail for the Sept. 14 California Gubernatorial Recall Election.\nBallots will be mailed the week of Aug. 16, giving voters nearly a month to mark their ballot and return it before Election Day. Voters can return their ballot in the mail, no postage necessary, or at one of many mail ballot drop-off locations around the county.\nWill there be in-person voting locations?\nYes. In-person voting locations will be open across the county for four days. From Saturday, Sept. 11 through Monday, Sept. 13 they will be open 8 a.m. to 5 p.m. On Election Day, the hours will change to 7 a.m. to 8 p.m. at both the in-person voting locations and the Registrar’s office.\nVoters can also take advantage of early voting starting Aug. 16 at the Registrar’s office. Hours will run from 8 a.m. to 5 p.m. Monday through Friday.\nWhat do you need to do?\nBe vote ready!\n\nCheck your voter registration information. Make sure your residence and, if different, your mailing address is up to date.\nHave you moved or changed your name? Whether you are new to San Diego County or just moved down the street you need to re-register to vote.\nAre you a first-time voter? If you want to participate in the upcoming election, you must be registered to vote – it takes less than 2 minutes.\n\nWhat is a recall?\nThe recall process allows voters to decide whether to remove elected public officials from office before their term is over.\nA recall ballot will ask voters two questions.\nIn this recall election, the first question will ask voters “yes” or “no” to remove the governor from office.\nIn the second part, voters will be asked to select a replacement candidate. If more than 50% of voters vote “yes” to recall the governor, the replacement candidate who gets the most votes is elected for the remainder of the term of office.\nIf a majority of voters vote “no” on the first question, then the recall has failed, and the governor will remain in office.\nTo learn more about voting in the gubernatorial recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210708.13.57.53"}