{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "$12 Million Available from County for Affordable, Supportive Housing Units", "description": "Housing and Community Development Services at the County Health and Human Services Agency has released a Notice of Funding Availability for $12 million for the acquisition, construction, and/or rehabilitation of multi-family affordable housing units for extremely low-income people and families.", "datePublished": "2022-07-06T13:00:08-07:00", "url": "https://www.countynewscenter.com/?p=208925", "keywords": ["housing", "12 million", "affordable housing", "affordable housing units", "arpa", "nofa"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-07-06T13:00:08-07:00", "articleType": "article", "articleContent": "\nIf you can acquire, build or rehabilitate affordable housing units, you may qualify for a loan from the County to help.\nHousing and Community Development Services at the County Health and Human Services Agency (HHSA) has released a Notice of Funding Availability for $12 million for the acquisition, construction, and/or rehabilitation of multi-family affordable housing units for extremely low-income people and families. Applications will be accepted for a three-month period, ending at 2 p.m. Sep. 30, 2022.\nThe NOFA includes $12 million from the American Rescue Plan Act (ARPA) and 120 Project Based Vouchers (PBV). All ARPA funds will be provided in the form of loans to successful applicants who agree to provide permanent supportive housing for extremely low-income households.\n“There is a tremendous need for affordable housing in the region, especially for residents with special needs,” said David Estrella, director of HHSA’s Housing and Community Development Services. “The new supportive housing units will provide some of our most vulnerable residents a permanent place to live.”\nThe units will be used to house extremely low-income people including those with physical or developmental disabilities, severe mental or substance use disorders, families, elderly, veterans and many others.\nApplications must be complete and in compliance with all the specified requirements set forth in the solicitation documents. A completed Project Summary and ARPA-PBV Application.\nFor more information, please visit the Housing and Community Development Services website or email at community.development@sdcounty.ca.gov .\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220706.13.00.08"}