{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Make Sure You’re Prepared with AlertSanDiego", "description": "In a disaster or local emergency, information can change quickly so you need to have an official source for the information you need to keep yourself and your family safe. While the County already offers a source of emergency information through a website, an app, social media, phone and text alerts, that emergency source is getting a new name, look and feel.", "datePublished": "2023-09-22T11:07:07-07:00", "url": "https://www.countynewscenter.com/make-sure-youre-prepared-with-alertsandiego/", "keywords": ["public safety", "alertsandiego", "emergency", "emergency preparedness", "national preparedness month", "readysandiego", "sd emergency"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-09-25T17:35:16-07:00", "articleType": "article", "articleContent": "\nIn a disaster or local emergency, information can change quickly so you need to have an official source for the information you need to keep yourself and your family safe. While the County already offers a source of emergency information through a website, an app, social media, phone and text alerts, that emergency source is getting a new name, look and feel.\nPreviously called ReadySD, those channels will now be called AlertSanDiego and come complete with a new logo. As part of National Preparedness Month, the County Office of Emergency Services wants people to note the change and feel assured that it remains a trusted and reliable source of information.\nAlertSanDiego provides hazard information, a disaster plan template, maps, recovery information and links to Facebook, X, Instagram and Threads social media handles while linking to an emergency information page that interfaces with the SD Emergency app. It features earthquake early warning, evacuation and shelter information, a mobile disaster plan with checklists and supply lists, and other hazard alert information.\nThe system can call both listed and unlisted landline phone numbers, but cell phones must be registered to receive the alerts. This is important because many people no longer have landline (hard-wired) phones at home or work, or may be away from a landline when an emergency alert comes in. In a fast-moving emergency like a wildfire, evacuation warnings and orders are often sent by phone or text – and if you receive an evacuation order, your life is in danger, and you must leave.\nThe new logo design resulted after meetings with various community user groups including multilingual groups and people with disabilities for input. The idea behind the rebranding was to streamline various brands and logos for better recognition and to refresh and reinvigorate the County’s goal to instill disaster preparedness in all our communities.\nA newly redesigned website will launch this fall at AlertSanDiego.org. In the meantime, if you haven’t already downloaded the SD Emergency App and/or registered your mobile phone to receive emergency alerts, you can do it from the current ReadySanDiego website.\nThe department’s social media handles and logos will also change over to the new logo. Be sure to follow AlertSanDiego and share preparedness messages with friends.\nThis year, the theme for National Preparedness Month is focused on preparing older adults for disasters and emergencies. It’s called “Take Control in 1, 2, 3” and can be done by having older adults: 1) Assess their needs; 2) make a plan; and 3) engage their support network to stay safe when disaster strikes.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230922.11.07.07"}