{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Smoke from Ship Fire Could Be Unhealthy for Sensitive Groups", "description": "The County Air Pollution Control District is monitoring the air quality in San Diego due to the fire on the USS Bonhomme Richard at Naval Base San Diego.", "datePublished": "2020-07-13T12:46:52-07:00", "url": "https://www.countynewscenter.com/smoke-from-ship-fire-could-be-unhealthy-for-sensitive-groups/", "keywords": ["health", "air quality", "naval ship fire"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-14T17:00:45-07:00", "articleType": "article", "articleContent": "\nEditor’s Note: To assist residents seeking relief from smoke from the USS BonHomme Richard fire, the County extended the hours at its Spring Valley cool zone at the Spring Valley Community Center starting Monday. The Spring Valley cool zone will be open from noon to 8 p.m. from Monday, July 13 to Thursday July 16.\nThe County Air Pollution Control District (APCD) is monitoring the air quality in San Diego due to the fire on the USS Bonhomme Richard at Naval Base San Diego.\nWhile localized smoke has occurred in some areas of San Diego, the air quality has been and continues to be good for the public in most areas of the region, depending on location and wind patterns, but could be unhealthy for sensitive groups. The elderly, children, and people with lung and heart disease are vulnerable to the effects of smoke.\n“Right now, we’re not seeing anything rise to a level of health concerns for the public. However, where smoke is present, San Diegans should limit physical activity and stay indoors, if possible, to limit exposure to particulate matter,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The situation could change as the fire is expected to be burning for a few days.”\nIn areas with heavy smoke, San Diegans should assume the air quality levels are unhealthy for sensitive groups and could be unhealthy for the public. In areas with minor smoke impacts, the air quality levels are likely to be moderate to unhealthy for sensitive groups.\n“APCD is working closely with County Public Health Services and the Department of Environmental Health, as well as the Navy, and will continue monitoring air quality in the region and advise the public if conditions change,” said Rob Reider, director of County Air Pollution Control District.\nAPCD has three stationary monitors in the community that evaluate conditions. The Navy has also been monitoring air quality in the area and found zero levels of volatile organic compounds.\nFor more information and to determine the air quality near you, visit the County Air Pollution Control District’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200713.12.46.52"}