{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego Woman Dies from Vaping-Related Lung Injury", "description": "A 76-year-old woman who died on May 24 is the first local fatality of e-cigarette or vaping-associated lung injury (EVALI), the County Health and Human Services Agency announced today. ", "datePublished": "2020-06-11T12:01:19-07:00", "url": "https://www.countynewscenter.com/san-diego-woman-dies-from-vaping-related-lung-injury/", "keywords": ["health", "evali", "vaping", "vaping-associated lung injury", "vaping-related death"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-11T12:35:05-07:00", "articleType": "article", "articleContent": "\nA 76-year-old woman who died on May 24 is the first local fatality of e-cigarette or vaping-associated lung injury (EVALI), the County Health and Human Services Agency announced today.\nThree other EVALI cases in young adults were confirmed in recent weeks and they are the first reports of the lung illness in San Diego County since 2019.\nAll the newly reported local cases tested negative for the novel coronavirus, which causes COVID-19, and they all reported recently vaping products containing tetrahydrocannabinoid (THC).\nThe California Department of Public Health recently recognized new reports of confirmed EVALI cases in persons vaping THC-containing products in April, after no cases had been reported since February 2020.\nSince July 2019, a total of 52 EVALI cases have been reported in San Diego County residents. All patients had to be hospitalized.\n“While our community is understandably focused on COVID-19, it is important to remember that lung injury from vaping is still a major public health concern,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People who vape, especially those using THC-containing products, are urged to stop.”\nIn January, the San Diego County Board of Supervisors voted to restrict the sale of flavored smoking products and e-cigarette and vaping devices in the County’s unincorporated areas. These restrictions were proposed as a response to the e-cigarette or vaping associated lung injury cases in the county and across the county. Enforcement of these restrictions will begin July 1.\nTHC containing e-cigarette or vaping products, particularly obtained from informal sources, are linked to most e-cigarette or vaping, lung injury cases. Vitamin E acetate has also been strongly linked to the outbreak and has been found in product samples from patients and in-patient lung fluid samples.\nThe Centers for Disease Control and Prevention (CDC) recommends that people not use THC-containing e-cigarettes or vaping products obtained from informal sources such as friends, family, pop-up shops or online sellers. Additionally, the CDC says that youth, young adults, or pregnant women should never use e-cigarette or vaping products.\nFor more information about lung injury associated with e-cigarettes or vaping visit the County EVALI webpage, the CDPH Tobacco Free California webpage or the CDC EVALI outbreak webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200611.12.01.19"}