{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Be Placed on Watchlist; Impacted Businesses Should Prepare", "description": "A record number of COVID-19 cases were reported today, and the state has notified the County it will be placed on its Monitoring List July 3, which is expected to result in the County closing or placing new restrictions on additional businesses next week.", "datePublished": "2020-07-02T15:30:08-07:00", "url": "https://www.countynewscenter.com/county-to-be-placed-on-watchlist-impacted-businesses-should-prepare/", "keywords": ["health", "community outbreaks", "coronavirus", "covid-19", "watchlist"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-03T08:36:41-07:00", "articleType": "article", "articleContent": "\nA record number of COVID-19 cases were reported today, and the state has notified the County it will be placed on its Monitoring List July 3, which is expected to result in the County closing or placing new restrictions on additional businesses next week.\nIn the past three days, the rate of COVID-19 cases in the region went up from 103.8 to 112.8, surpassing the state’s threshold of no more than 100 cases per every 100,000 residents. Here’s how the rate is calculated.\nGiven the continuing high number of daily cases, it is expected that the County will be on the state’s watchlist for the next three days and it could be forced to mandate more restrictive measures and additional closings based on guidance from the state.\nBusinesses on the state’s list should prepare to close or modify their operations since new restrictions could be effective as early as July 7 and would last for three weeks.\nIndoor activities could be restricted on the following businesses:\n\nDine-in restaurants (outdoor, pick up or drive-through can occur)\nWineries and tasting rooms\nMovie theaters, family entertainment centers and cardrooms\nMuseums and zoos\n\nCelebrate Fourth of July Safely\nAs residents prepare to celebrate the Fourth of July holiday, they should do it safely by not gathering in groups and staying with people in their own household.\nOutdoor picnics and barbecues should take place only  with household members to prevent the spread of the virus, and they should take place at home or close to home\nWhen outside the home, San Diegans should do the following to protect themselves and others:\n\nPractice good hand hygiene and sanitation\nKeep six feet apart\nWear a face covering\nAvoid crowded places\nStay home if they are sick\n\nCOVID-19 Triggers, Tests, Cases and Deaths\nCommunity Outbreaks and Other Triggers:\nThe County is monitoring 13 measures, or triggers, that could prompt revisions to the health order.\n\n10 new outbreaks were reported July 2: eight in restaurants/bars, one in a grocery and one in a business.\nIn the past seven days, 22 community outbreaks were identified which represent 100 laboratory-confirmed cases.\nThe number of community outbreaks far exceeds the seven in seven days trigger.\nA community outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\nThe County also reached the Case Investigation trigger because only 67% of investigations were initiated within 24 hours of notification over a 7-day period. The percentage should be at least 71%.\n\nTesting:\n\n\n8,510 tests were reported to the County July 1 and 7% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 4.9%. \n\nCases:\n\nA record 584 new cases were reported in San Diego County for a total of 15,207.\n1,821 or 12% of cases have required hospitalization.\n497 or 3.3% of all cases and 27.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFive new COVID-19 deaths were reported for a regional total of 377.\nThree men and two women died between June 26 and July 1, and their ages ranged from 51 to 93 years.\nAll had underlying medical conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200702.15.30.08"}