{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More than 5,000 San Diegans Have Died from COVID-19", "description": "San Diego has reached a somber milestone in the COVID-19 pandemic as local virus-related deaths have now surpassed 5,000.", "datePublished": "2022-02-23T18:28:43-08:00", "url": "https://www.countynewscenter.com/more-than-5000-san-diegans-have-died-from-covid-19/", "keywords": ["health", "5000 deaths", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-02-24T09:33:37-08:00", "articleType": "article", "articleContent": "\nSan Diego has reached a somber milestone in the COVID-19 pandemic as local virus-related deaths have now surpassed 5,000.\nOf the 5,002 San Diegans who have died from complications of COVID-19 since the first local case of the virus was identified in the region in March 2020, 60 percent were male and 40 percent were female.\n“Every death is tragic, and our condolences go out to the family and friends of all of the San Diegans who have lost their lives during this pandemic,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Vaccination continues to be our best defense against COVID-19 and associated hospitalizations. I urge anyone who is not up to date with their shots to get vaccinated.”\nWhere COVID-19 Vaccines Are Available\nThe region has plenty of COVID-19 vaccine supply. The county has more than 400 vaccination sites including pharmacies, medical providers, clinics, and County locations. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nDoses administered: More than 6.83 million.\nReceived at least one shot: Close to 2.92 million or 92.6% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.56 million or 81.4%.\nBoosters administered: 1,151,574 or 54.3% of 2,121,748 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n55 new deaths were reported since the last report on Feb. 16, 2022. The region’s total is 5,002.\n32 men and 23 women died between Jan. 16, 2022 and Feb. 17, 2022.\n22 were age 80 or older, 12 were in their 70s, 14 were in their 60s, two were in their 50s, two were in their 40s and three were in their 30s.\n19 of the people who died were fully vaccinated and 36 were not fully vaccinated.\n51 had underlying medical conditions, two did not and two had medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n659 COVID-19 cases were reported to the County on Feb. 22, 2022. The region’s total is now 734,656.\n6,383 cases were reported in the past week (Feb. 16 through Feb. 22) compared to 9,073 infections identified the previous week (Feb. 9 through Feb. 15).\nDuring the 30-day period between Jan. 11, 2022 and Feb. 9, 2022, there were 1,495 COVID-19 hospitalizations; 831 people were not fully vaccinated, 461 were fully vaccinated and 203 were fully vaccinated and boosted.\nSan Diego County’s case rate per 100,000 residents is 43.2 for people fully vaccinated and boosted, 52.6 for fully vaccinated people and 104.1 for not fully vaccinated San Diegans.\n9,368 tests were reported to the County on Feb. 20, 2022, and the percentage of new positive cases was 6.6%.\nThe 14-day rolling percentage of positive cases among tests reported through Feb. 20, 2022 is 6.8%.\n\nCommunity Setting Outbreaks:\n\n58 new community outbreaks were confirmed in the past seven days (Feb. 16, 2022 through Feb. 22, 2022): 25 in TK-12th grade school settings, 15 in daycare/preschool/childcare settings, four in business settings, four in college/university settings, two in government settings, two in healthcare settings, one in a distribution warehouse setting, one in an emergency services setting, one in a faith-based agency setting, one in a grocery setting, one in a residence and one in a restaurant/bar setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220223.18.28.43"}