{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Residents Urged to Take Precautions During Heat", "description": "The National Weather Service has issued a heat advisory until 6 p.m. Saturday. County health officials are encouraging San Diegans to take precautions to avoid heat-related illnesses. People should especially pay close attention to children, the elderly and pets.", "datePublished": "2020-04-24T13:31:40-07:00", "url": "https://www.countynewscenter.com/residents-urges-to-take-precautions-during-heat-advisory/", "keywords": ["health", "heat advisory"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-04-24T14:13:19-07:00", "articleType": "article", "articleContent": "\nWith high temperatures forecast over the next several days, County health officials are encouraging San Diegans to take precautions to avoid heat-related illnesses. People should especially pay close attention to children, the elderly and pets.\nThe National Weather Service has issued a heat warning for desert areas, including Borrego Springs, through 6 p.m. Sunday, with temperatures up to 105 degrees. A heat advisory is in effect through 6 p.m. Saturday, with expected highs in the 90s, for San Diego County Valleys including the cities of Escondido, El Cajon, San Marcos, La Mesa, Santee, and Poway.\nDue to the Public Health Order to prevent the spread of COVID-19, the County will not be operating the Cool Zones program this weekend but are looking at options for next week.\nThe County has some fans available but is still seeking donations of new fans to distribute to vulnerable individuals and households. If you’re interested in donating, email COVID19-Donations@sdcounty.ca.gov.\nTo avoid heat-related problems, health officials recommend the following nine strategies:\n\nIf available, stay in an air-conditioned area during the hottest hours of the day\nWear light, loose-fitting clothing\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty\nTake cool showers\nNever leave a child, elderly person, or pet unattended in a car\nKeep pets cool in hot weather\nAvoid unnecessary hard work or activities outside during the hottest part of the day\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun\nAvoid using the oven to cook\n\nAn extremely high body temperature (103 or higher), dizziness, nausea, confusion, and headache are signs of heatstroke or exhaustion. If someone shows these signs, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature and continue cooling efforts\nDo not give the victim fluids to drink\n\nElderly people (65 years and older), infants and children, and people with chronic medical conditions are more prone to heat stress. People with elderly neighbors should check in on their well-being. This can be done while adhering to social distancing recommendations in person or by phone or video conferencing if available.\nFor more information on extreme heat, visit the Centers for Disease Control and Prevention\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200424.13.31.40"}