{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Sites Rescheduling COVID-19 Vaccine Appointments Due to Continued Delivery Delays", "description": "Due to delays in Moderna vaccine shipments to San Diego, all County COVID-19 vaccination points of dispensing, or PODs, and the North County Super Station in San Marcos are currently only offering appointments for second doses.", "datePublished": "2021-02-18T18:35:31-08:00", "url": "https://www.countynewscenter.com/county-sites-rescheduling-covid-19-vaccine-appointments-due-to-continued-delivery-delays/", "keywords": ["health", "coronavirus", "covid-19", "update", "vaccine delay"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-02-18T19:24:10-08:00", "articleType": "article", "articleContent": "\nDue to national delays in vaccine shipments, all County COVID-19 vaccination points of dispensing, or PODs, and the North County Super Station in San Marcos are currently only offering appointments for second doses.\nPreviously scheduled appointments for first doses at these sites are being rescheduled into next week.\nIn addition, the vaccination super station at Petco Park is pausing all appointments tomorrow and Saturday. The closure may be extended to Sunday and Monday depending on when more vaccine doses arrive.\nThose affected by appointment cancellations are being notified via their UCSD MyChart accounts and should also check their email.\nThe Sharp vaccination super station sites at Chula Vista Center and Grossmont Center are still offering first and second dose appointments with Pfizer vaccine.\nThe County’s vaccination super station at the Del Mar Fairgrounds remains open and is honoring previously scheduled appointments.\nThe Centers For Disease Control and Prevention has advised that people can wait up to 42 days between doses and still achieve maximum immunity. Therefore, people who have received their first dose and are experiencing minor delays in second dose appointments need not be concerned. More information about the COVID-19 vaccine is available at www.vaccinationsuperstationsd.com.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 22.2 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 6.4%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 9.7% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 23.\n\nCommunity Setting Outbreaks:\n\nSix new community outbreaks were confirmed Feb. 17: two in construction settings, one in a business setting, one in a college/university setting, one in a distribution warehouse setting and one in a grocery setting.\nIn the past seven days (Feb. 11 through Feb 17), 33 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n19,845 tests were reported to the County on Feb. 17, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 5.2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 15,043.\n\nCases, Hospitalizations and ICU Admissions:\n\n810 cases were reported to the County on Feb. 17. The region’s total is now 254,990.\n12,381 or 4.9% of all cases have required hospitalization.\n1,554 or 0.6% of all cases and 12.6% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n36 new COVID-19 deaths were reported on Feb. 17. The region’s total is now 3,135.\n11 women and 25 men died between Dec. 11. and Feb. 17.\nOf the 36 deaths reported today, 16 people who passed away were 80 years or older, seven people were in their 70s, eight were in their 60s and five were in their 50s.\n33 had underlying medical conditions and three had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210218.18.35.31"}