{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Recommended Budget Hearing Begins Tuesday", "description": "A public hearing on the County’s recommended budget for Fiscal Year 2025-27 will get underway on Tuesday, June 3.", "datePublished": "2025-06-02T11:30:55-07:00", "url": "https://www.countynewscenter.com/countys-recommended-budget-hearing-begins-tuesday/", "keywords": ["government", "2025-27 recommended operational plan", "6/3/25 budget hearing", "fiscal year 2025-27", "recommended budget"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-06-02T11:30:55-07:00", "articleType": "article", "articleContent": "\nReading Time:  4 minutesA public hearing on the County’s recommended budget for Fiscal Year 2025-27 will get underway on Tuesday, June 3.\nIt will begin with a budget presentation at 9 a.m., followed by public comments on the budget before the Board of Supervisors’ regular legislative session gets underway.\nThe budget hearing will continue at 5:30 p.m., giving the public another opportunity to comment. Please note that people who would like to comment may speak at only one of the two budget sessions tomorrow. The evening session was originally scheduled for June 9, but the date changed to June 3.  For information on how to participate in person, by phone or online, visit the Clerk of the Board’s website.\nThe County released a balanced, $8.62 billion recommended budget on May 1 that prioritizes vital services and the region’s needs while addressing funding challenges.\nIt is an increase of $85.8 million or 1% over the Fiscal Year 2024-25 Adopted Budget.\nOngoing challenges include slowing tax revenues, rising costs, uncertainties about the economy and unknown changes in upcoming state and federal funding.\nDespite these uncertainties, the recommended budget is designed to protect core services for residents in the region and continues investments in issues important to San Diegans.\nThe balanced budget limits spending compared to recent years and prioritizes mandated programs as well responsibilities in the unincorporated area where the County delivers services similar to a city.\nThe operational plan shows a decrease in recommended staffing, 190 fewer positions or 0.9% less than last fiscal year for a total recommended staff of 20,281.25. The County reduced staffing through attrition, eliminating some vacant positions and streamlining some operations.\nThe budget continues to invest in housing, homeless solutions and behavioral health.\nIt leverages new funding opportunities to invest more than $100 million in behavioral health resources, supporting long-term recovery through community-based treatment, prevention and alternatives to jail and emergency rooms.\nAnd it helps more than 1 million San Diegans who need access to safety net programs that are critical to ensuring people and families have the food and support they need, programs such as CalWORKs, Medi-Cal and CalFresh.\nIt increases investments in public safety, with additional funding to provide care for youth and adults in our custody, deploy more ambulances and to support programs such as Alternatives to Incarceration and job training, mental health and substance use disorder treatment. It also establishes a Community Engagement Unit in the Office of Emergency Services.\nThe budget shows the County’s commitment to environmental sustainability. And the current recommended budget protects current hours and locations at parks and libraries.\nThe County budget touches nearly everyone in the region in some way and is shaped by public input throughout the year.\n\n \n \n \n \n \nRegionally, County government provides services like:\n\nSocial services and health programs\nCriminal prosecution, detention facilities and emergency preparedness\nFood and restaurant inspections, and beach and bay water monitoring\nElections\n\nIn the unincorporated area, County government provides things a city government would typically do like:\n\nLaw enforcement and fire protection\nRoads, parks and libraries\nBuilding permits\nAnimal shelters and protection\n\nSome cities also contract with the County to provide services.\nNearly half of the County’s funding comes from the state and federal government but that money must be used for certain programs. The rest comes from property taxes, fees for services and other sources.\nYou can learn more about the recommended plan by reviewing an executive summary or the full recommended budget plan.\nThe Revised Recommended Budget will be released June 12, incorporating feedback received from the budget hearings and community input. Budget deliberations and adoption are scheduled June 24.\nSee how you can watch, listen and participate.\nAttend a Meeting in Person\nThe meetings will take place in room 310 at the County Administration Center located at 1600 Pacific Highway, San Diego, CA 92101.\nSpanish language translation services for public speakers are available at Board meetings.\nArabic, Chinese (Mandarin), Korean, Persian (including Farsi, Dari), Somali, Spanish, Tagalog (including Filipino), and Vietnamese translations of the overall proceedings are also available upon request at least 72 hours prior to the meeting. Contact the Clerk’s office at (619) 531-5434 or email PublicComment@sdcounty.ca.gov.\nWatch Online\nThe live stream broadcast online may be delayed by 45 seconds or more depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nCounty News Center  \nCounty YouTube Channel (Closed captions available)\nVimeo\nFacebook\nX\n\nWatch on TV\n\nAT&T Channel 99\n\n\nCox South Channel 24 or Cox North Channel 19\nSpectrum channel 24 or 85\n\nListen on the Phone\n\nCall in to (619) 531-4716 for a listen-only line to the live Board meeting while it is in session.\n\nComment Online or by Phone\n\nOnline: Submit your feedback on the budget at Engage San Diego County’s budget page before public hearings formally end on June 12.\nBy phone: To speak during the live meeting by phone, fill out the Board of Supervisors tele-comments form and submit it before the meeting starts. After submitting the form, you will receive instructions on how to call in to the meeting.\n\nFor more information, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250602.11.30.55"}