{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Names Interim Health And Human Services Agency Director", "description": "County Chief Medical Officer Dr. Eric McDonald has been named to serve as interim Health and Human Services Agency director by Chief Administrative Officer Helen Robbins-Meyer.", "datePublished": "2023-06-05T12:29:56-07:00", "url": "https://www.countynewscenter.com/county-names-interim-health-and-human-services-agency-director/", "keywords": ["government"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-06-05T12:29:56-07:00", "articleType": "article", "articleContent": "\nCounty Chief Medical Officer Dr. Eric McDonald has been named to serve as interim Health and Human Services Agency director by Chief Administrative Officer Helen Robbins-Meyer.\nDr. McDonald is expected to hold the position into 2024 as the County conducts extensive local engagement about what the community is seeking in the next leader of HHSA. The agency oversees numerous programs and has nearly 8,000 employees who directly provide services to more than a third of the region’s residents.\n“Having worked with Dr. McDonald for more than 10 years, I have personally experienced his calm, insightful leadership,” said Robbins-Meyer. “He is community focused and inspires confidence as we undertake everyday activities and during emergencies like the COVID-19 pandemic. I am grateful he has agreed to step in and provide his vision as we chart the course for the Agency’s future.”\nThe appointment is to replace Director Nick Macchione, who announced his retirement on May 31, effective June 27.\nDr. McDonald’s selection was endorsed by County Board of Supervisors Chairwoman Nora Vargas.\n“The passion and commitment I have experienced with the HHSA team as we expand the delivery and availability of services has been inspiring,” said Chairwoman Vargas. “Dr. McDonald was instrumental in keeping our communities safe during our County’s COVID-19 response and I am excited to see him step in as interim leader. I’m eager to get to work with our community partners and my colleagues on the Board to support the CAO’s search for a future Agency director.”\nFollowing a distinguished 24-year career in the U.S. Navy, Dr. McDonald joined the County in 2010 as a deputy public health officer. In 2015, he became the medical director of Epidemiology and Immunization Services and was promoted in 2021 as the Agency’s chief medical officer and director of the newly established Medical Care Services Department.\n“I am very honored to accept this interim position as our Agency and the County experience leadership transitions on several fronts,” said Dr. McDonald. “My focus will be on ensuring the incredible positive momentum continues in the Agency’s work with the community to improve wellbeing for all San Diegans, delivering services and solving problems in an evidence-based way.”\nThe Health and Human Services Agency operates programs designed to help all 3.3 million San Diego County residents live well. Its eight service departments include Self-Sufficiency Services, Aging & Independence Services, Behavioral Health Services, Child Welfare Services, Public Health Services, Housing & Community Development Services, Homeless Solutions and Equitable Communities, and Medical Care Services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230605.12.29.56"}