{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Animal Shelters Near Capacity, Need Adopters, Fosters", "description": "Can you help? After a recent influx of cats and dogs, the County Department of Animal Services’ two shelters are nearly full, and they are asking the public to consider adopting or fostering an animal or two.", "datePublished": "2021-08-26T13:52:41-07:00", "url": "https://www.countynewscenter.com/county-animal-shelters-near-capacity-need-adopters-fosters/", "keywords": ["animals", "adopt pets", "adoption special", "das"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-08-26T14:14:55-07:00", "articleType": "article", "articleContent": "\nCan you help? After a recent influx of cats and dogs, the County Department of Animal Services’ two shelters are nearly full, and they are asking the public to consider adopting or fostering an animal or two.\nAnimal Services is offering several discounts currently: Adoption fees are waived for adult cats (six months and older), $25 adoption fees for kittens; and $25 adoption fees for pit bulls/pit mixes and huskies/husky mixes. Additionally, all animals who have been in the shelter for 30 days or more will have their adoption fees waived. All the adopted animals will be spayed or neutered and microchipped before they go home. Vaccinations will also be up to date on dogs and cats.\n“The department is committed to finding a home for every healthy and treatable animal that comes through our doors and that is why we are seeking the public’s help to adopt. We also have an urgent need for foster care,” said Kelly Campbell, Department of Animal Services director. “We will never euthanize for time or space, but our longer-stay animals would be so much happier in a home environment than in the shelters.”\nRecently, the department took in more than 50 cats from a single owner, Campbell said. This contributed to the shelter capacity issue, she said.\n“We were happy to step in and help,” Campbell said. “There are plenty of really lovely cats and some teenage kittens that would make great companions and some that just need a little time and a little love to come out of their shells.”\nOf those cats, two large male cats have vision impairment, one tabby is completely blind (but very friendly), and the other, a beautiful snowshoe Siamese, may still retain some vision. Campbell said blind cats can thrive really well in their home once they get acclimated in their environment to the point that most people wouldn’t even know they were blind.\nAs for dogs, Campbell said there are also plenty, and it is never an ideal situation for a dog to be sitting in a kennel for any length of time, since it can contribute to kennel stress or longer-term behavioral challenges.\nShe said if people are willing to adopt, a forever home is always the ideal situation, but if people are unable to do that but can provide temporary care and shelter for a dog or cat, that help is very welcome since animals do significantly better in a home environment compared to a shelter one. Learn more about the foster program here and you can change the quality of life for that one animal for the short-term.\nAs a third option, Animal Services is also seeking volunteers that can come into the shelters and help socialize animals or help with laundry or other tasks that allow animal care attendants to focus on the pets, or to train to become specialized disaster response volunteers, saving animals affected by disasters. Here is information on volunteering.\nSo, if you’re able to add a furry friend to your life, all the animals pictured here are available. Or you can visit the department’s adoptions page for more pets.\nAnimal Services continues to offer “touchless adoptions” for the safety of customers and staff. Contact the animal shelter and they will let you know if the animal is available and will set up an appointment for you to come to one of the two shelters. People still need to go through the normal adoption process of filling out an application and doing a matchmaking consultation with staff. Staff just want to make sure new owners are prepared to welcome an animal into their lives and set up for success.\nThe shelters are located at  animal care facilities in Bonita and Carlsbad, but please remember to make an appointment first so you’ll receive dedicated one on one attention from our team. The adoptions are on a first-come, first-served basis.\nFor more information about County Animal Services, visit sddac.com or call (619) 767-2675.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210826.13.52.41"}