{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Sheriff Mobile Hi-lo Siren System to Be Used in Emergency Evacuations", "description": "The San Diego Sheriff’s Department rolled out its new siren system built into patrol vehicles that will emit a high, then low repeating siren tone which warns communities that they need to evacuate due to immediate danger.", "datePublished": "2023-05-05T21:34:44-07:00", "url": "https://www.countynewscenter.com/sheriff-mobile-hi-lo-siren-system-to-be-used-in-emergency-evacuations/", "keywords": ["public safety", "emergency", "evacuation", "hi-lo", "sheriff"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-05-08T10:20:06-07:00", "articleType": "article", "articleContent": "\nThe San Diego Sheriff’s Department rolled out its new siren system built into patrol vehicles that will emit a high, then low repeating siren tone which warns communities that they need to evacuate due to immediate danger.\nThe San Diego Sheriff’s Department joined other law enforcement agencies and fire agencies May 4 to introduce the Hi-Low system to the public and explain how it will be used. The Hi-Lo siren is distinct from those used when emergency officials are responding to an emergency call.\n﻿\nEmergency agencies want people to associate the loud and distinct  siren with an urgent evacuation.\nThe Sheriff’s Department notes they will only use this critical warning system to inform communities of an evacuation order in the event of natural disasters, extreme emergencies or critical incidents such as wildfires, flash floods, tsunamis, terrorism, bomb threats. It will be used also for SWAT standoffs, gas leaks, hazmat spills and sinkholes that pose a danger to the community.\nLaw enforcement just started installing the Hi-Lo system in Sheriff’s patrol vehicles, but because it will be a new siren, officials wanted to make sure the public understands what it means and what they need to do if they hear it.\n“When you hear the Hi-Lo, it is time to go! Heed the warning and evacuate immediately because your safety depends on it,” it states in its public service announcement.\nThis will be one more emergency tool for the region. Traditional notification systems, such as AlertSanDiego phonecalls, loudspeaker announcement and door-to-door notification, will continue to be used.\nBeing prepared is key to staying safe. To learn more about preparing for emergencies and evacuations in an emergency, visit ReadySanDiego.org. Download the SD Emergency App to your smartphone to help you plan, prepare, get informed and recover from an emergency. The app is equipped with ShakeReadySD early earthquake warning. A mobile version of the County’s Personal Disaster Plan to guide people to prepare before various emergencies is included. A print version of the Personal Disaster Plan including versions in additional languages and one for those who may need additional assistance can be found on the ReadySanDiego site. Don’t forget to register your cell phone to receive AlertSanDiego emergency notifications. Landline numbers are automatically included in the 9-1-1 database and will be called in an emergency, but many residents only use cell phones as a main contact and the number needs to be registered to your address to get emergency notifications.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230505.21.34.44"}