{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is the Last Day to Vote", "description": "Tuesday, Sept. 14 is the deadline to cast your ballot in the California Gubernatorial Recall Election. You can do so now at one of 221 voting locations around the county or the Registrar’s office until 8 p.m.", "datePublished": "2021-09-14T08:00:26-07:00", "url": "https://www.countynewscenter.com/tuesday-is-the-last-day-to-vote-2/", "keywords": ["government", "2021 recall election", "election", "vote"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-14T15:33:01-07:00", "articleType": "article", "articleContent": "\nTuesday, Sept. 14 is the deadline to cast your ballot in the California Gubernatorial Recall Election. You can do so now at one of 221 voting locations around the county or the Registrar’s office until 8 p.m.\nIf you’re still holding onto your mail ballot, the Registrar’s office reminds you to return it promptly to one of 131 mail ballot drop-off locations or any voting location. Mail ballot locations will also be open until 8 p.m. on Election Day.\nAny voter who is in line at a voting location or drop-off location at 8 p.m. will be allowed to vote. However, no one can join the line to vote after the 8 p.m. deadline.\nAll in-person voters this election will use ballot marking devices. The voter uses a touch screen to make their selections. When finished, the voter will print out a paper official ballot with their selections. The voter can review the ballot and place it in the ballot box to be counted at the Registrar’s office election night. This device does not store, tabulate, or count any votes.\nBallot marking devices are fully compliant with the Americans with Disabilities Act, and in addition to English, voters have the ability to select a translated ballot in one of the County’s four federally covered languages: Spanish, Filipino, Vietnamese and Chinese.\nThe Registrar of Voters has put in place protocols to ensure the health and safety of election workers, voters and observers at the Registrar’s office, voting locations and mail ballot drop-off locations.\nAs in all elections, the Registrar’s office works collaboratively with local law enforcement agencies to ensure voting locations and mail ballot drop-off locations are safe and voters can cast their ballot free from any interference, disruption or intimidation from others.\nTo learn about voting in the recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210914.08.00.26"}