{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Citizens’ Law Enforcement Review Board Seeks Applicants", "description": "The County’s Citizens’ Law Enforcement Review Board (CLERB) is looking for applicants to fill an opening on its board.", "datePublished": "2024-04-24T10:22:16-07:00", "url": "https://www.countynewscenter.com/citizens-law-enforcement-review-board-seeks-applicants-2/", "keywords": ["government", "citizens law enforcement review board", "clerb", "clerb vacancy", "district 4"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-04-24T10:24:19-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutes\nIn Summary: \n• There is a vacancy on the Citizens’ Law Enforcement Review Board (CLERB) for a Supervisorial District 4 seat.\n• CLERB investigates citizen complaints against San Diego County Sheriff’s deputies and probation officers, along with deaths in connection with the actions of sworn deputies and officers.\n\nThe County’s Citizens’ Law Enforcement Review Board (CLERB) is looking for applicants to fill an opening on its board.\nEstablished in 1990, CLERB investigates citizen complaints against San Diego County Sheriff’s deputies and probation officers.\nThe current vacancy is in Supervisorial District 4, which includes the cities of Lemon Grove and La Mesa, parts of the City of San Diego, and unincorporated communities including Casa De Oro-Mount Helix, Rancho San Diego and Spring Valley.\nThe 11 members of CLERB include two from each of the five supervisorial districts. The eleventh is chosen at large from any of the five districts. The County Board of Supervisors appoints CLERB members for three-year terms that are staggered beginning on July 1 and ending on June 30.\nCLERB also investigates deaths in connection with the actions of sworn deputies and probation officers. The review board makes advisory findings on complaints and recommends policy and procedure changes to the Sheriff, Chief Probation Officer and the Board of Supervisors.\nApplicants:\n\nMust be a registered voter in San Diego County.\nCannot be a County employee.\nCannot be affiliated with the County.\nCannot currently hold a position as a sworn law enforcement officer.\nServe a three-year term for no more than two consecutive full terms.\nShould attend one CLERB meeting prior to applying for the vacancy.\nMust complete a training course within three months of the appointment.\n\nThe first review of applications will begin on Monday, June 3. People who submitted a CLERB application within the past 12 months still have their application on file with the Clerk of the Board of Supervisors and will be considered for the opening, so they do not need to reapply.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240424.10.22.16"}