{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Meets 4 of 5 Criteria for Reopening", "description": "The County is using five federal criteria and state recommendations to determine when and how to ease or lift some of the restrictions in the local Health Officer Order.", "datePublished": "2020-04-29T18:39:07-07:00", "url": "https://www.countynewscenter.com/county-meets-4-of-5-criteria-for-reopening/", "keywords": ["health", "coronavirus", "covid-19 testing", "federal criteria"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-30T17:21:27-07:00", "articleType": "article", "articleContent": "\nThe County is using five federal criteria and state recommendations to determine when and how to ease or lift some of the restrictions in the local Health Officer Order.\nThe County has met four of the five federal criteria – symptoms, cases and hospitals –and has made progress in the remaining testing criteria.\nFour Criteria Met\n\nThe County has experienced a 14-day downward trajectory in the number of people with influenza-like illness (ILI) at local emergency departments. From March 16 to April 15, the percent of emergency department visits for ILI dropped from 10% to 3%.\nThe County must register a downward trajectory of COVID-like syndromic cases reported within a 14-day period. This trend has varied but has been declining in recent days.\nThe number of positive cases of COVID-19 in comparison to the number of tests administered over a 14-day period is in a downward trajectory. Since April 6, the County has experienced a decreasing percentage in positive COVID-19 tests among San Diegans.\nThe local health care system has been able to handle the number of patients needing hospitalization for COVID-19 and other illnesses and diseases. Currently, hospital capacity remains stable.\n\n“We have met four of the federal criteria and will continue monitoring to make sure the trends continue,” Wooten said.\nData are preliminary and may change.\nProgress Made in Testing \nIn order to meet the fifth federal criteria, there also needs to be a robust testing program in place for at-risk health care workers, including emerging antibody testing.\nThe County and local hospitals have extended their testing capacity and can perform 3,400 tests daily.\nWhile four criteria have been met and significant progress has been made in the remaining fifth metric, the County will await guidance from the state before fully lifting the local stay-at-home order, which the County announced today would be extended indefinitely.\nMore People Being Tested\nNow that regional testing capacity has been expanded to about 3,400 tests per day and includes rapid testing, more people can be tested at local hospitals and County testing sites.\nToday, the County released a revised testing process to be able to test more people for COVID-19 and announced that testing will be available in Southeastern San Diego on Saturday from 10 a.m. to 2 p.m., at the Euclid Health Center, 292 Euclid Ave. A doctor’s referral and appointment through 2-1-1 are necessary.\nCounty offering testing for COVID-19 at drive-up sites.\nIf a person has symptoms or belongs to a specific group, COVID-19 testing is recommended.\nIf you have a cough or shortness of breath or difficulty breathing, call your medical provider to get tested. If you are experiencing two of the following symptoms – fever,  chills, muscle pain, headache, repeating shaking with chills, or new loss of taste or smell – it is also recommended that you call your doctor to be tested.\nIf you don’t have a medical provider, you can call 2-1-1 and ask to speak with a public health nurse to get tested at a County drive-through site.\nPeople with or without symptoms, who are part of the following groups should also be tested:\n\nHealthcare workers\nFirst responders\nPeople exposed to confirmed COVID-19 case\nPeople with underlying conditions\nCongregate living facility staff and residents\nEssential infrastructure occupations\nAdditional vulnerable groups\n\nPeople with HIV/AIDS\nPeople in rural areas\nNative Americans\nOlder adults\nPeople experiencing homelessness\nRacial/ethnic groups\n\n\n\n“These groups represent a large segment of the San Diego County population and we are confident that we will meet our testing goal,” Wooten said. \nCOVID-19 Cases, Deaths Up\nTo date, 120 COVID-19 deaths – 66 men and 54 women – have been reported in San Diego County, including two additional fatalities announced today.\nA man in his late 70s and a woman in her mid-80s died April 27. Both had existing medical conditions.\nAlso, another 118 COVID-19 cases were reported, bringing the region’s total to 3,432.\nThe County also updated the number of outbreaks at nursing homes and other congregate living facilities.\nCurrently, there are 43 active outbreaks, 29 of which are at congregate living facilities and 14 in community settings. There have been 700 cases and 63 deaths in congregate living facilities and 129 cases and four deaths in community settings.\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200429.18.39.07"}