{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Next Steps: County Chief Administrative Officer Interviews Begin Friday", "description": "The Board of Supervisors will continue its process to hire a new Chief Administrative Officer by conducting interviews with semifinalist candidates tomorrow.", "datePublished": "2024-05-02T10:07:03-07:00", "url": "https://www.countynewscenter.com/next-steps-county-chief-administrative-officer-interviews-begin-friday/", "keywords": ["government", "cao", "chief administrative officer", "hiring"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2024-05-02T10:32:39-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe Board of Supervisors will continue its process to hire a new Chief Administrative Officer by conducting interviews with semifinalist candidates tomorrow.\nThe County of San Diego is conducting a comprehensive nationwide search for its next Chief Administrative Officer, a position appointed by the Board of Supervisors to implement the Board’s vision and policies and direct the County’s daily operations. The County of San Diego is the fifth largest county in the nation, with more than 20,000 employees and an $8 billion budget that supports the community through diverse programs and services in the region.\nAfter the May 3 interviews, a panel made up of ten community members, two selected by each Supervisor, will interview candidates and provide feedback to the Board. The Board will then conduct final interviews on May 22. This selection process follows the direction provided by the current Board of Supervisors in December 2023.  Learn more about the process and timeline on the County’s website.\nThe new Chief Administrative Officer will replace Helen Robbins-Meyer, who retired in January after serving in the position since 2012. On Jan. 9, 2024, Sarah Aghassi was selected by the Board to begin serving as Interim Chief Administrative Officer while the recruitment process took place. She previously served as the Deputy Chief Administrative Officer for the Land Use and Environment group of departments.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240502.10.07.03"}