{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "146 Ballot Drop Boxes Open for March Presidential Primary Election", "description": "Starting Tuesday, Feb. 6, registered voters can return their mail ballot for the March Presidential Primary Election to any one of 146 official ballot drop boxes located around the county.", "datePublished": "2024-02-06T11:30:11-08:00", "url": "https://www.countynewscenter.com/146-ballot-drop-boxes-open-for-march-presidential-primary-election/", "keywords": ["elections", "ballot drop boxes open", "fgg", "march 5 presidential primary", "official ballot drop boxes", "registrar of voters", "san diego county registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-06T11:47:21-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesStarting Tuesday, Feb. 6, registered voters can return their mail ballot for the March Presidential Primary Election to any one of 146 official ballot drop boxes located around the county.\nMail ballots for the County’s 1.9 million registered voters are expected to arrive this week.\nWhat do the Registrar’s official ballot drop boxes look like?\nThe Registrar’s official ballot drop boxes are red, white and blue and feature the Registrar’s logo along with the County seal. All boxes are labeled “Official Ballot Drop Box” and made from high grade, heavy gauge stainless steel.\nEach official ballot drop box is designed to prevent physical damage and unauthorized access to mail ballots. The boxes feature double-locking access doors, anti-pry door jambs and other anti-theft construction measures. The Registrar’s ballot retrieval team is responsible for collecting ballots inside the box.\nHow do I return my ballot to an official ballot drop box?\nMark your ballot, seal your completed ballot inside your return envelope, date and sign your name on the return envelope, and return it in the mail or to one of the Registrar’s official ballot drop boxes around the county. Remember, your signature is required for your vote to count.\nOut of the 146 official ballot drop boxes, 103 are located outdoors and are open 24 hours a day until 8 p.m. on the final day of voting, March 5. Forty-three are located indoors and only available when the facility is open. Check the location list or the locator tool for each facility’s hours of operation before heading out to return your ballot.\nOn the final day of voting, March 5, all of the Registrar’s official ballot drop box locations will be open from 7 a.m. to 8 p.m.\nHow do I vote in person?\nEarly voting began Monday at the Registrar of Voters office located on the County Operations Center campus in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar’s office will be closed Monday, Feb. 19 in observance of Presidents Day. Due to major construction at the County Operations Center, those who wish to visit the Registrar’s office are encouraged to allow for extra time to find parking.\nIf you prefer to vote in-person, 39 vote centers will open daily from 8 a.m. to 5 p.m. starting Saturday, Feb. 24.\nOn Saturday, March 2, an additional 179 vote centers will open for a total of 218. The locations will be open daily from 8 a.m. to 5 p.m. through March 4. On the final day of voting, March 5, all vote centers and official ballot drop boxes will be open from 7 a.m. to 8 p.m.\nAvoid long lines by taking advantage of the early voting. You have the option of casting your ballot at any vote center around the county.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nIf you plan to vote for president, the Registrar urges voters to review each political party’s rules.\nLearn more about voting in the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240206.11.30.11"}