{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Register to Vote by March 24 for  District One Special Primary Election", "description": "If you live in the County of San Diego’s First Supervisorial District and want to vote in the April 8 special primary election, you must register by Monday, March 24, to receive a ballot in the mail.", "datePublished": "2025-03-21T10:01:48-07:00", "url": "https://www.countynewscenter.com/register-to-vote-by-march-24-for-district-one-special-primary-election/", "keywords": ["elections", "april 8 special primary election", "county registrar of voters", "deadline to register", "district 1 special election", "fgg", "first supervisorial district", "supervisorial district 1"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-03-21T10:01:48-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIf you live in the County of San Diego’s First Supervisorial District and want to vote in the April 8 special primary election, you must register by Monday, March 24, to receive a ballot in the mail.\nOtherwise, you will need to make a trip in person to a vote center in the district starting Saturday, March 29 to conditionally register and vote provisionally through April 8.\nThe person elected will fill the district’s vacant seat for the remainder of the current term that ends in January 2029. If no candidate receives a majority vote at the April 8 election, the top two vote-getters will move on to the special general election on July 1. Only those who live in the district can vote in the election.\n\nDistrict 1 runs from the Pacific Ocean to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The district includes the cities of Chula Vista, Imperial Beach, National City, and some communities within the City of San Diego, including Barrio Logan, East Village, Golden Hill and more. It also includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside and La Presa.\nIf you’re not sure if you reside in District 1, you can look it up at sdvote.com.\nRegistering to vote is quick and easy and can be done online at sdvote.com. You will need to register to vote if you:\n\nare not registered in San Diego County\nrecently moved\nchanged your name\n\nIf your signature is confirmed through records at the California Department of Motor Vehicles, your registration will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the form, sign it and return it to the Registrar’s office by 5 p.m. on March 24.\nRegistration forms must be postmarked or delivered to the Registrar’s office by March 24. Voters may also register online until midnight.\nIf you don’t have access to a computer, you may request a registration form by calling (800) 696-0136 or emailing rovmail@sdcounty.ca.gov.\nNot sure if you’re registered to vote? Check your registration status online at sdvote.com.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday. The Registrar’s office will be closed on Monday, March 31, in observance of Cesar Chavez Day.\nAdditional options to vote in person will begin Saturday, March 29, with the opening of seven vote centers. They will be open daily from 8 a.m. to 5 p.m. until the final day of voting, Tuesday, April 8, when 13 vote centers and the Registrar’s office will be open 7 a.m. to 8 p.m.\nYou can find a vote center or an official ballot drop box near you inside your voter information pamphlet, or you can look up your pamphlet online with the View Voter Information Pamphlet (Sample Ballot) tool at sdvote.com.\nLearn more about voting in the District 1 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250321.10.01.48"}