{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County and Cities Transition Flood Residents to Long-Term Housing Options", "description": "The Emergency Temporary Lodging Program to support those impacted by the January flooding ends tomorrow. The program is a cooperative effort between the County of San Diego, City of San Diego and other local cities and community partners to provide safe housing options to resident whose homes were damaged. With the end of the program, those residents will be moving back home or making other arrangements with their local housing authorities.", "datePublished": "2024-06-20T15:23:10-07:00", "url": "https://www.countynewscenter.com/county-and-cities-transition-flood-residents-to-long-term-housing-options/", "keywords": ["government", "chairwoman nora vargas", "david estrella", "emergency temporary lodging program", "fema", "housing and community development services", "jireh providers", "national city housing authority", "open hearts leaders", "red cross", "san diego housing commission", "supervisor monica montgomery steppe", "uber eats"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-06-21T11:35:07-07:00", "articleType": "article", "articleContent": "\nReading Time:  4 minutesThe Emergency Temporary Lodging Program to support those impacted by the January flooding ends Friday, June 21. The program is a cooperative effort between the County of San Diego, City of San Diego and other local cities and community partners to provide safe housing options to residents whose homes were damaged. With the end of the program, those residents will be moving back home or making other arrangements with their local housing authorities.\n“Thousands of San Diegans faced the devastating aftermath as floodwaters tore through their homes on Jan. 22,” said Board of Supervisors Chairwoman Nora Vargas. “In the wake of this disaster, our immediate focus was on providing essential shelter and support. Collaborating closely with the Red Cross, Community-Based Organizations, and local municipalities, together we mobilized to open shelters, yet the needs persisted far beyond initial expectations.”\nRecognizing the profound impact on families, Chairwoman Vargas said, “Many of those affected required ongoing assistance, prompting the County to launch the Emergency Temporary Lodging Program in early February. This initiative, made possible through strong community partnerships, ensured displaced families had access to temporary accommodations, meals, and crucial mental health services. It was a vital lifeline, offering a semblance of stability during such a tumultuous time, allowing families to begin the journey of recovery and rebuilding.”\nBoard of Supervisors Chairwoman Nora Vargas worked to secure a Presidential Emergency Declaration to bring needed federal and state resources to the County including financial assistance from FEMA, the Small Business Administration, and the California Governor’s Office of Emergency Services. Chairwoman Vargas and District Four Supervisor Monica Montgomery Steppe also led the Board of Supervisors to approve more than $33.7 million for community recovery efforts, including the Emergency Temporary Lodging Program.\nThe Emergency Temporary Lodging Program has been essential in keeping people sheltered, but many storm victims still need help repairing their homes or finding different places to live. The County collaborated with local community-based organizations and other partners to develop a transition plan for residents in the program. People impacted by the floods who still need assistance will now work with their local housing authorities, including the City of San Diego and National City.\n“No San Diegan should become homeless or permanently displaced from their community as a result of a natural disaster. The work to make good on that goal is far from over and will require the support of our entire community,” said San Diego City Council President Sean Elo-Rivera. “Building upon the $4.2 million in financial support from the County of San Diego, San Diego City Council has authorized an additional $3 million to support those who need assistance and will continue to partner with the inspiring community members who are working to support storm victims.  I encourage everyone who is able to volunteer and help get displaced San Diegans back into their homes.”\nFamilies in the City of San Diego can apply for help and get more information online at floodassistance.sdhc.org, by phone at 619-578-7792 or by email at floodrecovery@sdhc.org.\n“Thanks to the investments of the County and the City of San Diego, the San Diego Housing Commission has launched a three-pronged program to assist hundreds of displaced City of San Diego families in their recovery from the floods. We’re providing financial assistance for eligible families from the County’s Emergency Temporary Lodging Program. We’re helping to identify leads for families searching for a home. And we’re assisting with the repairs needed to make damaged homes habitable again,” San Diego Housing Commission President and CEO Lisa Jones said.\nThe National City Housing Authority received more than $360,000 in County funds to support residents from their community. National City residents can request assistance by calling 619-743-6420 or via email at housing@nationacityca.gov.\nThe County has its own housing authority, Housing and Community Development Services which  assists residents moving from the Emergency Temporary Lodging Program.\n“We have been working individually with each of the 29 households from the County’s Housing Authority’s jurisdiction in the Emergency Temporary Lodging Program to ensure everyone has a place to go,” said David Estrella, director of the County’s Housing and Community Development Services department. “It has been a long journey, and we look forward to assisting people as they transition to this next phase of their recovery from the Jan. 22 flood.”\nPeople living in the unincorporated areas can receive flood recovery support by contacting County Housing and Community Development Services at 858-694-4801 or by email at tsp.hhsa@sdcounty.ca.gov.\n“The Jan. 22 storms were an historical event that required an innovative approach to help residents recover. The County has coordinated a regional response, created new programs and supported recovery efforts in the Emergency Operations Center since January to care for those impacted by the flood.,” said County Chief Administrative Officer Ebony Shelton. “We will continue to work with government, non-profit and community partners to identify gaps and find unique solutions to help our communities recover from this and future emergencies.”\nAt its height, the County Emergency Temporary Lodging Program was supporting more than 2,200 people in nearly 900 households impacted by the Jan. 22 flood with hotel rooms, food through Uber Eats vouchers and mental health services through Open Hearts Leaders and JIREH Providers.\nDistrict Four Supervisor Monica Montgomery Steppe said, “The Emergency Temporary Lodging Program exemplified a shared commitment to compassion during challenging times. The floods have clearly demonstrated the necessity of collaboration between our community and government, and I’m proud that collaboration continues to strengthen. As the program concludes, I thank everyone who worked tirelessly to support those in need, and I remain committed to the ongoing recovery efforts of our community members.”\nFor more information about the County’s storm recovery efforts, visit AlertSanDiego.org/Recovery.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240620.15.23.10"}