{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Isolation Guidance Shortened from 10 to 5 Days", "description": "Most San Diegans who test positive for COVID-19 only have to isolate for five days, the County Health and Human Services Agency announced today.", "datePublished": "2021-12-28T12:59:54-08:00", "url": "https://www.countynewscenter.com/covid-19-isolation-guidance-shortened-from-10-to-5-days/", "keywords": ["health", "coronavirus covid-19", "new isolation guidance", "testing", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-28T14:23:35-08:00", "articleType": "article", "articleContent": "\nMost San Diegans who test positive for COVID-19 only have to isolate for five days, the County Health and Human Services Agency announced today.\nThe County is now following the new guidance from the Centers for Disease Control and Prevention which decreased the isolation period from 10 to five days for most people with no symptoms but who test positive for COVID-19. The California Department of Public Health also aligns with this guidance.\nIn addition to isolating for five days, COVID-19 patients with no symptoms must wear a mask for an additional five days when around other people. Health care personnel may have different criteria.\n“The County is following the CDC guidance because science shows the majority of SARS-CoV-2 transmission occurs early in the course of illness, typically 1-2 days prior to developing symptoms and the 2-3 days after,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “People with no symptoms can leave isolation after that, provided they wear an appropriate mask to decrease the risk to others.”\nBelow are additional changes made by the CDC:\n\nThe quarantine period for people exposed to COVID-19 is now 5 days followed by strict mask use for an additional 5 days for people who are unvaccinated or fully vaccinated but have not received their booster shot.\nIf a 5-day quarantine is not feasible, exposed people must wear a well-fitting mask at all times when around others for 10 days after exposure.\nPeople who have gotten their booster shot do not need to quarantine following an exposure but should wear a mask for 10 days after the exposure.\nPeople who are exposed to COVID-19 should get tested at day 5 after exposure.\nIf symptoms develop, people should immediately isolate until a negative test confirms it’s not COVID-19.\n\n“The new guidance also works to slow the spread of the Omicron variant, which has led to a significant increase in cases nationally and in San Diego County,” Wooten said.\nThe County is updating its web pages, communication materials and health orders, as well as communication to medical providers and sector partners.\nCOVID-19 Cases, Testing and Vaccinations\nThe County has reported a considerable increase in COVID-19 cases in recent days, with daily case counts reaching over 2,300 cases four out of the past six days, including 2,367 cases which will be reported later today.\nCounty health officials are urging San Diegans to take every precaution necessary to slow the spread of COVID-19 during the winter months.\nIn addition to the County testing sites, many neighborhood pharmacies offer same-day testing. Here’s a list of other locations where people can get COVID-19 tests. The overall testing system has the capacity to meet demand. However, testing traffic can surge and sites can be very busy.\nThe County is recommending for people not to  go to a hospital for COVID-19 testing, to contact their health care provider if they have symptoms and need testing, and to get CA Notify to receive alerts if they were in close contact with someone who tests positive for COVID-19. Rapid antigen tests, which are available at many local pharmacies, are a good option if a testing site is unavailable.\nAlso, the region now has plenty of COVID-19 vaccines and booster doses, which remain the best long-term protection against COVID-19 hospitalizations and deaths.\nThere are more than 400 vaccination sites that include pharmacies, medical providers, clinics and County locations; the region has the capacity to meet demand. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211228.12.59.54"}