{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Kindred Apartments Groundbreaking in Downtown San Diego", "description": "Kindred, a 126-unit affordable housing community on County surplus property, broke ground today at the site of the former County Family Court building in the Cortez Hill neighborhood.", "datePublished": "2025-04-29T15:49:16-07:00", "url": "https://www.countynewscenter.com/kindred-apartments-groundbreaking-in-downtown-san-diego/", "keywords": ["housing", "affordable housing", "cortez hill", "downtown", "innovative housing trust fund", "seniors", "surplus land"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-04-29T17:16:14-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesKindred, a 126-unit affordable housing community on County surplus property, broke ground today at the site of the former County Family Court building in the Cortez Hill neighborhood.\nThe mixed-use, intergenerational housing will provide stable homes for families and seniors at risk of homelessness and provide one, two and three-bedroom options. The $102 million development at the corner of Sixth Avenue and Beech Street in downtown San Diego will include 4,400 square feet of commercial retail space.\nCentrally located, Kindred is designed to be pedestrian friendly with easy access to the San Diego Trolley and MTS bus lines, connecting residents to job centers, schools, and other amenities. Markets, restaurants, a library, post office and parks are all within walking distance. Supportive services and affordable healthcare will be provided to residents onsite by San Ysidro Health.\nKindred was made possible through a public-private partnership that includes the County, the City of San Diego and BRIDGE Housing Corporation. The County is investing $4 million from its Innovative Housing Trust Fund, along with providing the land valued at $6.9 million.\nConstruction is expected to be finished by early 2027 and the homes will remain affordable to low-income households for a minimum of 99 years.\nKindred is the fourth affordable housing development to break ground on 11 County surplus properties. Already open are Levant Street Senior Cottages in Linda Vista on a former social services building site and the Paul Downey Senior Residence which is one of four affordable housing projects being built on property in Clairemont Mesa that was home of the former County crime lab. This summer, Kettner Crossing will open in Little Italy on property adjacent to a County parking structure. The remaining seven properties are all in various stages of planning and funding.\nMore information about Kindred and its affordable homes is available here.\nSince 2017, the County has invested more than $325 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal, and local funding sources administered by the County. Those funds have helped open doors to over 2,588 homes, 1,593 new units for seniors and families, with 3,292 more on the way.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250429.15.49.16"}