{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "First Human, Travel-Related West Nile Virus Case of 2020 Reported in County", "description": "A 61-year-old man from Alpine has been confirmed to be the first person in San Diego County in 2020 to test positive for West Nile virus, the County Health and Human Services announced today.", "datePublished": "2020-08-12T11:55:54-07:00", "url": "https://www.countynewscenter.com/first-human-travel-related-west-nile-virus-case-of-2020-reported-in-county/", "keywords": ["health", "human case", "west nile virus", "wnv"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-12T12:16:45-07:00", "articleType": "article", "articleContent": "\nA 61-year-old man from Alpine has been confirmed to be the first person in San Diego County in 2020 to test positive for West Nile virus, the County Health and Human Services announced today.\nThe man was hospitalized, tested and the California Department of Public Health confirmed the case Aug. 11. He has recovered.\nThe man said he had traveled to Yuma, Arizona where it is believed he contracted the virus.\nSince Jan. 1, 2020, there have been two West Nile virus positive detections in mosquitoes during routine trapping by the County Vector Control Program, one in the Del Mar Area and the other in the Black Mountain Ranch area.\nThere were only three human cases of West Nile virus in San Diego County in 2019 and two in 2018.\nWest Nile virus is mainly a bird disease but can be transmitted to people by certain species of native San Diego County mosquitoes that first feed on an infected bird or animal and then a bite a person.\nEighty percent of people who become infected with West Nile virus never know it and never suffer any symptoms. About one in five people who are infected develop a fever and other symptoms such as headache, nausea, fatigue, skin rash or swollen glands. About 1 out of 150 infected people could get extremely ill and die.\nCounty public health and environmental health officials say the best way for people to protect themselves against the virus is to follow the County’s Prevent, Protect, Report guidelines. These guidelines can also help county residents protect themselves from mosquitoes that transit West Nile virus as well as invasive Aedes mosquitoes that can transmit tropical diseases, including Zika, dengue and chikungunya, if they first bite an infected person and then bite non-infected people.\nPrevent mosquito breeding\n\nDump out or remove any item inside or outside of homes that can hold water, such as plant saucers, rain gutters, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquito fish, available for free by contacting the Vector Control Program, may be used to control mosquito breeding in backyard water sources such as unused swimming pools, ponds, fountains and horse troughs.\nProtect yourself from mosquito bites\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nReport possible mosquito activity\nReport increased mosquito activity, or neglected, green swimming pools and other mosquito-breeding sources, as well as dead birds — dead crows, ravens, jays, hawks and owls — to Environmental Health’s Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov. Also, report if you are being bitten by mosquitoes during daylight hours, or if you find mosquitoes that match the description of Aedes mosquitoes by contacting the Vector Control Program at (858) 694-2888.\nFor more information about mosquito-borne illnesses, go to San Diego County’s “Fight the Bite” website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200812.11.55.54"}