{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Help Build San Diego County", "description": "The community is invited to learn about the County’s upcoming building projects in the region, give their input and have a little fun at the same time", "datePublished": "2024-11-12T16:56:39-08:00", "url": "https://www.countynewscenter.com/help-build-san-diego-county/", "keywords": ["government", "capital plan", "fgg", "general services", "infrastructure", "open house", "public works", "public works capital plan"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-11-12T16:56:39-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe community is invited to learn about the County’s upcoming building projects in the region, give their input and have a little fun at the same time.\nThe County is holding an open house on the 2025-30 Capital and Public Works Plans. The event will take place from 6 to 7 p.m. on Thursday, Nov. 14 at the County Operations Center Chambers at 5520 Overland Ave. in Kearny Mesa.\nThe County provides facilities and infrastructure all over the region. For example: libraries, parks, behavioral health centers, fire stations, roads and much more.\nPeople can learn about projects that may be planned for their neighborhoods. County department representatives will be on hand to answer questions and residents can give their input.\nVisitors will also find some opportunities for family fun. You can meet live hawks and owls, CAL FIRE’s mascot and his fire engine display, see a Sheriff’s Office armored vehicle and a K9 narcotics detection demonstration. Attendees can spin the “Check Your Mood” prize wheel, play life-size games and check out other activities.\nVisit our Engage Hub to dig into the 2025-30 Draft Capital and Public Works Plans. You can also submit comments at the site, register for the event and request interpretation services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241112.16.56.39"}