{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Health Advisory Task Force Seeking Public Input On Social Services In June", "description": "A County advisory board task force is inviting people to help the County improve how it connects people to social services that help them get food, housing and health care by sharing their program experiences in four special webinars this month.", "datePublished": "2021-06-11T12:42:40-07:00", "url": "https://www.countynewscenter.com/county-health-advisory-task-force-seeking-public-input-on-social-services-in-june/", "keywords": ["health", "calfresh", "calworks", "general relief", "medi-cal", "webinar"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-06-11T12:42:40-07:00", "articleType": "article", "articleContent": "\nA County advisory board task force is inviting people to help the County improve how it connects people to social services that help them get food, housing and health care by sharing their program experiences in four special webinars this month.\nSupervisor Terra Lawson-Remer and the “Outreach, Accessibility, and Enrollment Ad-hoc Task Force,” a subcommittee of the County’s Social Services Advisory Board, are holding four listening session webinars in June. The webinars are part of a larger process to find ways to improve social services, increase participation in them, and report recommendations to the County Board of Supervisors this fall.\nThe services the webinars are focusing on are:\n\nCalFresh: Also called SNAP or food stamps, which provides people with EBT cards with funds to buy groceries\nMedi-Cal: Also referred to as Medicaid, which provides free or no-cost health insurance\nCalWORKS: Also called TANF, Temporary Assistance for Needy Families, which provides temporary cash assistance on EBT cards.\nGeneral Relief: The program that offers temporary cash assistance on EBT cards\nCash Assistance Program for Immigrants (CAPI) – The program that offers monthly cash benefits to elderly, blind and disabled non-citizens ineligible for SSI/SSP because of their immigration status.\n\nWho’s Invited\nThe webinars are inviting people who have ever applied for, considered applying for, or been denied access to those programs to share their stories. Specifically, the task force wants to hear how people feel the programs worked for them, what could be done better, how they feel about their experience applying for and using them, and to identify obstacles that may keep people from enrolling in them.\nWebinars \nThe times, dates and topics of the webinars, and links to register to take part in them are:\n\nJune 15, noon to 2 p.m.: General Relief/CalWORKs\nRegister by clicking here or at http://bit.ly/GRCalWorks-1\nJune 15, 4 p.m. to 6 p.m.: Calfresh/Medi-Cal\nRegister here or at http://bit.ly/MediCalFresh-1\nJune 21, noon to 2 p.m.: Calfresh/Medi-Cal\nRegister here or at http://bit.ly/MediCalFresh-2\nJune 22, 4 p.m. to 6 p.m.: General Relief/CalWORKs\nRegister here or at http://bit.ly/GRCalWorks-2\n\nTaking part is as easy. Just register online for one or more of the meetings on the webinar links. Then, join in by clicking the meeting link that will be included in the confirmation email that will be sent to you.\nWebinar participants can join in on their iPhones, Droid devices, personal computers or Macs, and people can share their experiences in small break-out groups at the webinars rather than in front of large audiences.\nEach of the sessions will be introduced by Supervisor Lawson-Remer; members of the task force will provide presentations about the social services and facilitate the public discussion in the smaller break-out groups. The task force will also conduct a survey with the break-out groups to gather their input, and then work with a consultant to create recommendations to improve services to bring to the Board of Supervisors.\nThe webinars in June are solely for the public. The task force also plans to hold additional webinars with other stakeholder groups: community-based organizations that help people apply for social services, County workers and County Health and Human Services Agency leaders.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210611.12.42.40"}