{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "“Microbusinesses” Could Receive $2,500 COVID-19 Relief Grants", "description": "Microbusinesses across San Diego County hurt by COVID-19 could soon be getting $2,500 boosts after County supervisors approved a grant program Tuesday funded in part by the California Office of the Small Business Advocate.", "datePublished": "2022-02-08T12:19:58-08:00", "url": "https://www.countynewscenter.com/microbusinesses-could-receive-2500-covid-19-relief-grants/", "keywords": ["government", "covid-19 relief", "grant program", "microbusinesses", "small businesses"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-02-08T12:20:44-08:00", "articleType": "article", "articleContent": "\n“Microbusinesses” across San Diego County hurt by COVID-19 could soon be getting $2,500 boosts after County supervisors approved a grant program Tuesday funded in part by the California Office of the Small Business Advocate.\nSupervisors unanimously approved giving the $2,500 grants to help up to 1,550 microbusinesses, defined as earning less than $50,000 in 2019, being the owner’s primary source of income and having five or fewer employees, currently and in 2019, 2020 and 2021. The list could include home businesses like pet sitters, shoppers, cleaners and home health care workers, and sidewalk vendors like food cart operators.\nApplications can be submitted online starting Feb. 15.\nBoard Chair Nathan Fletcher said even though COVID-19 restrictions and limitations on businesses ended last summer, the grant program would help small businesses that are still feeling the pandemic’s effects.\n“There’s always more we can do,” Fletcher said. “So … this small business COVID-19 grant program will help get about $3.8 million out to some of the smallest businesses, often family-run businesses, to help them purchase equipment, invest in working capital, apply for and renew permits, pay off any debts accrued due to the pandemic and offset costs resulting from the pandemic.”\nThe application page can be reached indirectly through the County’s Microbusiness COVID-19 Relief Grant Program webpage or directly at the Small Business Development Center’s website.\nThe grants are planned to be distributed equally among the County’s five supervisorial districts, aided by outreach at events, farmer’s markets and libraries, and through community groups and door-to-door canvassing.\nState and County officials hope the grants will reach microbusinesses run by those that have historically faced barriers to obtaining capital, including women, minorities, veterans, limited English speakers, businesses in low- to mid-income rural areas and people without documentation.\nMicrobusinesses may be eligible for the $2,500 grant if their business:\n\nWas started before Dec. 31, 2019, is the owner’s primary source of revenue, and is currently operating or has a plan to reopen\nGenerated less than $50,000 in revenue in the 2019 tax year\nCurrently has five or fewer full-time employees and had five or fewer employees in 2019, 2020 and 2021.\nWas significantly impacted by COVID-19\nHas not previously received any grant money from the California Small Business COVID-19 Relief Grant Program\n\nThe County has contracted with Southwestern College’s Small Business Development Center to collect and process online applications and to conduct outreach along with the Asian Business Association of San Diego, the Logan Heights Community Development Corporation, the South County Economic Development Council and the San Diego East County Economic Development Council.\nThe County’s grants must be distributed in 2022. The first application process will run from Feb. 15 to 5 p.m. March 31. If there is grant money left after the first round, additional application periods will be held.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220208.12.19.58"}