{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Protect Yourself, Family and Friends from the Flu this Holiday Season", "description": "As flu cases continue to increase, County public health doctors are reminding San Diegans to take care of themselves and loved ones this holiday season. ", "datePublished": "2024-12-13T12:58:38-08:00", "url": "https://www.countynewscenter.com/protect-yourself-family-and-friends-from-the-flu-this-holiday-season/", "keywords": ["health", "flu", "health", "holidays", "influenza", "sick"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-12-13T12:58:54-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAs flu cases continue to increase, County public health doctors are reminding San Diegans to take care of themselves and loved ones this holiday season. \nThis week the County reported 761 new flu cases, up from 468 cases the week before. This week-to-week increase is the biggest so far this flu season, which happens during fall and winter \nTo date, seven people have died from the flu this season. Most were people aged 65 years and older. \nOlder adults and young children are at greatest risk of getting seriously sick from the flu or dying. During last flu season, 60 people died including two infants. \n“We are seeing flu cases go up each week as we approach the holidays,” said Dr. Ankita Kadakia, County interim public health officer. “This is concerning because historically we see spikes directly following big holiday gatherings. That is why it is important that everyone takes some extra precautions to reduce the spread of the flu virus.” \nStay Healthy This Holiday Season   \nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot yearly. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The COVID-19 vaccine does not work against the flu or vice versa.  \nThe flu vaccine can help keep those most at risk of getting really sick from the flu from ending up in the hospital.  \nThose who should make vaccination a priority include:  \n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control  \nPregnant women  \nPeople aged 65 years and older  \nPeople who live with or care for others who are at higher risk  \n\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.  \nIn addition to getting vaccinated, people should also do the following to avoid getting sick:  \n\nWash hands thoroughly and often  \nUse hand sanitizers, if unable to wash hands \nStay away from sick people \nAvoid touching your eyes, nose, and mouth \nClean commonly touched surfaces \nIf you are sick, stay home and avoid contact with others \n\nCounty Health and Human Services Agency publishes the Respiratory Viruses Surveillance report, which tracks key flu, COVID-19, and RSV indicators and summarizes respiratory virus surveillance in the region.  \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241213.12.58.38"}