{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Will Soon Make Overdose Reversal Medication Available To Anyone", "description": "A COVID-19 related spike in overdose deaths in San Diego County has fueled a behavioral health crisis. In 2020, the County reported 457 fentanyl-related overdose deaths. This is a 202% increase in one year, from 151 recorded deaths in 2019.", "datePublished": "2021-05-21T14:59:17-07:00", "url": "https://www.countynewscenter.com/county-will-soon-make-overdose-reversal-medication-available-to-anyone/", "keywords": ["health", "behavioral health", "fentanyl", "hhsa", "naloxone", "opioid abuse", "opioid deaths", "overdose deaths"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2021-05-24T09:20:19-07:00", "articleType": "article", "articleContent": "\nA COVID-19 related spike in overdose deaths in San Diego County has fueled a behavioral health crisis. In 2020, the County reported 457 fentanyl-related overdose deaths. This is a 202% increase in one year, from 151 recorded deaths in 2019.\nTo help save lives, the County will begin offering nasal Naloxone to the general public at several community-based locations and clinics throughout the region. Naloxone is a medication designed to rapidly reverse an opioid overdose and quickly restore normal respiration and alertness.\nCounty Public Health Officer, Dr. Wilma Wooten M.D., M.P.H., in partnership with Chair Nathan Fletcher and County Director of Behavior Health, Luke Bergmann, signed a Naloxone Standing Order allowing community organizations to distribute nasal Naloxone. The overdose reversal drug will be available at no cost and without a prescription to any person at risk of an overdose or to a family member or friend willing to administer the drug. The expanded distribution is part of a harm reduction strategy that will be introduced at the Board of Supervisors meeting next month.\nThe County made Naloxone available to law enforcement many years ago, but like CPR, time is critical as overdose patients need immediate intervention to improve their chances of survival. In some situations the overdose patient needs immediate intervention to survive. An overdose from opioids may take hours to cause death, but other drugs such as fentanyl can cause death in a matter of minutes.\nNasal Naloxone is a prefilled, needle-free device that requires no assembly and is sprayed into one nostril while patients lay on their back. Centers for Disease Control and Prevention says to look for these signs if you suspect someone is overdosing from heroin or prescription opioid pain medications:\n\nSmall, constricted “pinpoint pupils”\nLimp body\nPale, clammy skin\nBlue fingernails or lips\nVomiting or gurgling sounds\nUnable to speak or be awakened, loss of consciousness\nSlow breathing or slow heartbeat\n\nThe County offers numerous prevention and treatment programs across the region. People seeking help should call the San Diego County Access and Crisis Line 888-724-7240 or 2-1-1 San Diego. These resources are available 24 hours a day, seven days a week.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210521.14.59.17"}