{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "McClellan Palomar Airport to Hold Disaster Drill Thursday Morning", "description": "County airport staff, working with Carlsbad police and firefighters, are scheduled to hold a major disaster exercise Thursday morning at McClellan Palomar Airport in Carlsbad. County officials said people living in the surrounding areas should not be startled by the activities, which will run from 9 a.m. to 11 a.m. and could include sirens and fire engines.", "datePublished": "2022-10-31T09:42:09-07:00", "url": "https://www.countynewscenter.com/?p=209920", "keywords": ["public safety", "county airports", "disaster preparedness", "mcclellan-palomar airport"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-10-31T09:43:06-07:00", "articleType": "article", "articleContent": "\nCounty airport staff, working with Carlsbad police and firefighters, are scheduled to hold a major disaster exercise Thursday morning at McClellan Palomar Airport in Carlsbad.\nCounty officials said people living in the surrounding areas should not be startled by the activities, which will run from 9 a.m. to 11 a.m., Thursday, Nov. 3, and could include sirens and fire engines.\nThe airport is required to hold a disaster exercise every three years. The drill is designed to ensure that airport rescue crews can respond immediately in emergencies with backup from the city of Carlsbad’s fire and police departments, and that the airport fully complies with Federal Aviation Administration (FAA) standards.\nMcClellan-Palomar airport does not currently have commercial airline service, but has in the past and is required to meet FAA safety requirements.\nThursday’s exercise will simulate a scenario—complete with people made up to look like injured survivors—of a 30-passenger jet aircraft running off the left side of the runway.\nEmergency responders will drill to put out fires, rescue, triage and treat survivors, and transport them for hospitalization.\nMcClellan-Palomar Airport is one of eight airports operated by the San Diego County Department of Public Works.\nMembers of the media who want to observe the exercise should contact McClellan-Palomar Airport Manager Olivier Brackett at (760) 966-3281.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221031.09.42.09"}