{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "14 Public Health Champions Honored by County Leaders", "description": "The Health and Human Services Agency’s 2025 Live Well San Diego Public Health Champion Awards Ceremony was held on Friday, April 11. This year, 14 local people and organizations were honored for their extraordinary achievements in to promote and protect the health of all San Diegans.", "datePublished": "2025-04-14T14:34:28-07:00", "url": "https://www.countynewscenter.com/14-public-health-champions-honored-by-county-leaders/", "keywords": ["health", "awards ceremony", "organizations", "partners", "public health champions", "public health week"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-04-14T15:45:49-07:00", "articleType": "article", "articleContent": "\nReading Time:  6 minutesThe Health and Human Services Agency’s 2025 Live Well San Diego Public Health Champion Awards Ceremony was held on Friday, April 11. This year, 14 local people and organizations were honored for their extraordinary achievements in promoting and protecting the health of all San Diegans.\nThe Public Health Champions awards ceremony is held each year during National Public Health Week, a time when communities nationwide emphasize the importance of improving overall public health. Over its last 24 years in San Diego, the awards ceremony has recognized nearly 500 Public Health Champions.\nKimberly Giardina, deputy chief administrative officer for the County’s Health and Human Services Agency, kicked off this year’s event, along with Dr. Ankita Kadakia, Interim Public Health Officer and Elizabeth Hernandez, P.H.D., Public Health Director.\n       \nThis year’s theme was “It Starts Here,” focusing on the places we live, work, and play. From clean air and water to strong relationships and safe communities, public health is about creating a foundation for healthier lives.\nThe five areas of priority that support this year’s theme are It Starts Here: Your Health is Our Mission, Climate Action Starts Here: Championing Resilience for Health, Health Equity Starts Here: Optimizing Health for All, Advocacy Starts Here: Amplifying Voices for Public Health and The Future of Public Health Starts Here: Strengthening the Public Health Workforce.\nThe Public Health Champions award categories included Director’s Awards; Public Health Services Awards for individuals and organizations; and Aging and Independence Services, Medical Care Services and Regional Awards.\nThe ceremony was designed to showcase the strength of local public/private partnerships in achieving the best health and wellness outcomes for the region’s diverse population.\n      \nDirector’s Award  \nSharia’s Closet\nSharia’s Closet is a San Diego-based nonprofit that has provided since 2013 free, emergency clothing and hygiene products to nearly 50,000 individuals and families in immediate need because of a financial hardship or crisis.\nFoundation for Senior Care\nBased in Fallbrook, the Foundation for Senior Care has been committed to supporting the physical and mental well-being of the community since 1979, with a focus on older adults and adults living with disabilities in rural San Diego. The Foundation’s Senior and Disabled Transportation program provides 5,000 rides annually to older adults and adults living with disabilities in the greater Fallbrook area.\nPublic Health Services Awards\nVeronica Whitehorse\nRegistered Nurse Veronica Whitehorse is a 20- year healthcare professional and a lifeline to the American Indian and Alaska Native community in San Diego County. As an Indigenous nurse and advocate, she embodies culturally competent care, ensuring patients not only receive medical attention but are also seen, heard, and valued in their traditions, identities, and lived experiences. Whitehorse is committed to public health, disease prevention, and community wellness.\nDr. Antoinette Marengo\nDr. Antoinette Marengo is a dedicated advocate for health equity and has spent 20 years as a physician providing accessible, quality reproductive health care for women in San Diego, Riverside and Imperial counties. Dr. Marengo leads mentorship and training programs in clinical care excellence, and is chair-elect for the American College of OBGYNs, the largest organization of OBGYN physicians in the country. Dr. Marengo also served as a staff obstetrician and gynecologist at Navy Medical Center San Diego.\nOrganization – DHA Immunization Healthcare Division, Pacific Region Team\nThe Defense Health Agency Immunization Healthcare Division, Pacific Region Team, supports all military-related immunization care in California, Oregon, Washington, Alaska, Hawaii, Guam, Japan and South Korea, with a special focus on San Diego County. The DHA team supports the safe transportation, delivery, storage, handling, preparation, administration, documentation, and follow-up of the more than 20,000 vaccines administered monthly at more than 40 military immunization clinics in San Diego.\nTheme – April A. Fernandez\nApril Fernandez has spent 30 years in public health management with a focus on Binational Border Health at the California Department of Public Health. She has been a driving force in advancing cross-border health initiatives by connecting public health agencies, non-profits, academia and local communities to address the unique health challenges of border populations. Fernández’ work has strengthened cross-border partnerships, enhancing public health strategies in both nations.\nDepartment Awards\nMCS – Sarah St. John \nSarah St. John is a dental hygienist and passionate advocate for oral health equity. She is the founder of AllSmiles, a portable preventative dental hygiene service dedicated to reaching underserved communities, including military spouses and the unhoused. With a mission to address dental disparities, St. John provides essential oral healthcare to schools, individuals experiencing homelessness, and those with limited access to traditional care.\nAIS – Amy Abrams\nAmy Abrams is committed to enhancing the lives of older adults through her experience in public health and social work. Abrams co-founded a home health agency to support people living with chronic conditions and their caregivers. She also started a Memory Café to support people and families living with dementia and is currently working with 9-1-1 dispatch, hospitals, and local care facilities to develop protocols to reduce unnecessary emergency room visits for older adults and those with cognitive impairments.\nRegional Awards\nNorth Coastal – Gaby B. Love\nGabriela “Gaby” Beas Love has spent more than 29 years serving vulnerable communities and is currently providing academic support, social services and leadership opportunities for students and their families at MiraCosta College. Love is dedicated to helping marginalized communities realize their potential, encouraging them to access higher education and discover all that is available to them via certificate and vocational programs, Associates of Arts (AA) degrees, and beyond.\nNorth Inland – Backcountry Communities Thriving\nBackcountry Communities Thriving is a nonprofit organization dedicated to building partnerships with groups and organizations to bring services to San Diego’s rural, agricultural and unincorporated communities.  BCT ensured a North Inland food pantry received food deliveries and has coordinated presentations on Alzheimer’s disease, disaster and wildfire preparedness, as well as CPR training and fentanyl awareness. BCT also established the Rural Roundtable to unite community-based organizations in Julian, Ranchita, Borrego Springs, Warner Springs and Valley Center.\nEast County – David R. Shorey\nDavid Shorey is a dedicated public health leader who has mobilized diverse groups to advance environmental justice, human rights, and substance use prevention to improve the quality of life for vulnerable populations. His work directly influences policies, systems, and community practices to create safer, healthier environments. Shorey also serves on the LGBTQ Advisory Council for the County Sheriff’s office, advocating for equity and inclusion in public safety.\nNorth Central – San Diego Military Family Collaborative\nThe San Diego Military Family Collaborative (SDMFC) supports and strengthens the military community through education, advocacy, communication and engagement. SDMFC works to make critical programs, resources, and information easy to navigate and access, and provides a network of support for active duty, reservists, veterans, their families. First established in 2010, the collaborative has grown from six organizations to more than 200 public, private, faith-based, military, and governmental organizations with 400 representatives.\nSouth County – Karen Clay\nKaren Clay created a nonprofit dedicated to food recovery and distribution. Clay partners with food generators, distribution organizations and kitchens to recover and redistribute edible food to hungry residents. Since 2020, Clay’s nonprofit has received and distributed over 3.8 million pounds of food and has prepared and delivered over 111,000 meals. It has also helped distribute USDA Farm to Families food boxes and coordinated the weekly plating, distribution, and delivery of 600 fresh fish meals through the Fish to Families program.\nCentral San Diego – Fern Street Community Arts\nFern Street Circus is a transformative organization serving families and enriching neighborhoods through the performance and teaching of circus arts. Fern Street Circus brings together professional artists and community members to co-create circus performances in local settings and break cultural and linguistic barriers. By merging the physicality of circus with theatrical skills, Fern Street Circus fosters social change and community through collaborative art.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250414.14.34.28"}