{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "‘Great Plates’ to Continue Delivering Meals to Seniors", "description": "More than 1,400 older adults in the “Great Plates Delivered” program will continue to receive three free and healthy meals a day until July 10, the County Health and Human Services Agency Announced today.", "datePublished": "2020-06-10T18:15:43-07:00", "url": "https://www.countynewscenter.com/great-plates-to-continue-delivering-meals-to-seniors/", "keywords": ["health", "coronavirus", "covid-19", "great plates"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-11T08:23:02-07:00", "articleType": "article", "articleContent": "\nMore than 1,400 older adults in the “Great Plates Delivered” program will continue to receive three free and healthy meals a day until July 10, the County Health and Human Services Agency Announced today.\nLaunched in mid-May, the program was set to expire June 10, but the federal government decided to expand it for 30 days.\nThe initiative is a collaboration between the County and local restaurants to help older adults, who are at a higher risk of developing complications from COVID-19, avoid going out to restaurants or the grocery store to get food.\nCurrently, 31 local restaurants are delivering meals to enrolled seniors throughout San Diego County. The County is reimbursing restaurants for the cost of food, labor and incidentals, using a combination of funding provided by FEMA, the state and the County.\nThose currently receiving assistance from other state or federal nutrition assistance programs, such as CalFresh or Meals on Wheels, are not eligible for the Great Plates Delivered program. Participants must also fall within a specific income range.\nFor more details on criteria or to sign up, call the County Aging and Independence Services at (800) 339-4661 or visit www.aging.sandiegocounty.gov/greatplates. You can also call 2-1-1 San Diego.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n3,854 tests were reported to the County on June 9 and 108 or 3% were positive.\nThe 14-day, rolling average percentage of positive tests is 3.1%.\n\nCases:\n\n108 new cases were reported for a San Diego County total of 8,837.\n1,447 or 16.4% of the total cases have required hospitalization.\n410 or 4.6% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nFour new COVID-19 deaths were reported today, bringing the region’s total deaths to 305.\nTwo men and two women died between June 3 and 8. Their ages ranged from 27 to 88 years.\nAll had underlying medical conditions.\n\nThere are currently 56 active outbreaks in skilled-nursing facilities and other congregate and community settings:\n\n22 outbreaks with 808 cases, including 86 deaths in skilled nursing facilities.\n23 outbreaks with 937 cases, including 67 deaths in other congregate settings.\n11 outbreaks with 404 cases, including six deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200610.18.15.43"}