{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "With Tiers Gone, County Reopens", "description": "With COVID-19 vaccinations high and infection rates low, the state and the county reopened today after 15 months of closures.", "datePublished": "2021-06-15T16:30:49-07:00", "url": "https://www.countynewscenter.com/with-tiers-gone-county-reopens/", "keywords": ["health", "coronavirus", "county reopening", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-06-15T16:41:23-07:00", "articleType": "article", "articleContent": "\nWith COVID-19 vaccinations high and infection rates low, the state and the county reopened today after 15 months of closures.\nThe disappearance of the state’s tier system brings no capacity limits or physical distancing restrictions for the public in most businesses and activities in the region. Essentially, all sectors of the economy can return to pre-pandemic capacity levels.\n“The tiers are gone but the pandemic is not,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should continue getting vaccinated so that cases go down even further.”\nCertain COVID-19 guidance will remain in place for large-scale event settings. People who attend “mega events” indoors will be required to show proof of vaccination or a negative COVID-19 test.\nAll County offices and facilities are now open to the public. Hours of operation may vary at different departments and people are recommended to check ahead.\n\nMasks Not Mandated in Most Places\nMask mandates for fully vaccinated people will disappear in most places. However, face covering requirements will remain in effect after in June 15 in nine settings: on public transit, indoors in K-12 schools and in child care settings, in health care settings, long-term care facilities, detention centers, homeless shelters, emergency shelters and cooling centers.\nUnvaccinated San Diegans will still be required to wear masks indoors.\nThe state Beyond the Blueprint guidance will remain in place until at least October 1.\nHow COVID-19 Data Will Be Reported\nToday, the County gave its final, regularly scheduled briefing on COVID-19. Any future briefings will be provided as needed.\nDaily news releases with COVID-19 data will be replaced by a weekly news update. Other news releases will be issued as needed.\nData on the COVID-19 in San Diego page and dashboards will continue to be published at their current frequency, except the Daily Status Update, which will be replaced by a weekly report. The County already publishes the weekly COVID-19 Watch report which is issued every Tuesday afternoon. Specific reports and their publishing frequency will continue to be evaluated and may be revised in the future.\nVaccination Progress:\n\nDoses delivered: Close to 4.25 million.\nDoses administered: Nearly 3.9 million.\nReceived at least one shot: Over 2.11 million or 75.5% of San Diegans 12 and older.\nFully vaccinated: Over 1.76 million or 62.9%.\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people.\nTo date, 100.6% of the goal population has received at least one vaccine and 83.9% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed June 14 in a daycare/preschool/childcare setting.\nIn the past seven days (June 8 through June 14), three community outbreaks were confirmed.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nTesting:\n\n7,605 tests were reported to the County on June 14, and the percentage of new positive cases was 0.8%.\nThe 14-day rolling average percentage of positive cases is 0.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 9,131.\n\nCases, Hospitalizations and ICU Admissions:\n\n61 COVID-19 cases were reported to the County on June 13. The region’s total is now 281,313.\n15,476 or 5.5% of all cases have required hospitalization.\n1,712 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new deaths were reported June 14. The region’s total is 3,770.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210615.16.30.49"}