{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Don’t Delay! Vote Early for 80th Assembly District Election", "description": "The April 5 election for the 80th Assembly District is just days away. If you’re an eligible voter and have been holding onto your mail ballot, act now and vote from the comfort of your home.", "datePublished": "2022-04-01T10:38:09-07:00", "url": "https://www.countynewscenter.com/?p=208103", "keywords": ["elections", "2022 special primary election", "80th district assembly election", "april 5", "april 5 special primary election", "fgg", "registrar of voters office", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-04-04T10:16:24-07:00", "articleType": "article", "articleContent": "\nThe April 5 election for the 80th Assembly District is just days away. If you’re an eligible voter and have been holding onto your mail ballot, act now and vote from the comfort of your home. Sign and date your return envelope, seal your completed ballot inside and return it to a trusted source.\nYou can return it by mail, no postage needed, as long as it is postmarked on or before April 5 and received by the Registrar’s office by April 12. Or you can return your ballot at one of many ballot drop box locations around the district. Be sure to check sdvote.com for hours of operation before heading out to return your ballot.\nOnly those who live in the state’s 80th Assembly District under the 2011 district boundaries can vote in the election. The district covers portions of southern San Diego County and includes parts of the cities of Chula Vista, National City and San Diego. If you’re not sure whether you were in the 2011 district boundary, you can look it up at sdvote.com.\nIf you want to vote in-person, that option is available, too. Five vote centers are open daily from 8 a.m. to 5 p.m. On Election Day, Tuesday, April 5, four more vote centers will open for a total of nine locations and the hours will change to 7 a.m. to 8 p.m.\nYou can find a complete list of vote center or ballot drop box locations inside your voter information pamphlet. Or you can look it up online at sdvote.com.\nAll in-person voters can mark their ballot on a ballot marking device. This device does not store, tabulate or count any votes. After the voter makes their selection on the device, the voter will print the ballot, review it, and place it in the ballot box to be counted at the Registrar’s office.\nLearn more about voting in the 80th Assembly District Special Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220401.10.38.09"}