{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands Coronavirus Testing Locations; Limited Holiday Schedule", "description": "The County of San Diego is expanding free COVID-19 testing, with a new site now open in National City and the Tubman-Chavez Community Center being the region’s first County-operated, no-appointment, coronavirus testing location.", "datePublished": "2020-07-02T13:35:18-07:00", "url": "https://www.countynewscenter.com/county-expands-coronavirus-testing-locations-limited-holiday-schedule/", "keywords": ["health", "coronavirus covid-19", "no appointment", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-02T14:43:52-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is expanding free COVID-19 testing, with a new site now open in National City and the Tubman-Chavez Community Center being the region’s first County-operated, no-appointment, coronavirus testing location.\nOpen seven days a week (July 4 excepted), people seeking tests should arrive between 8:30 a.m. and 4:30 p.m. at Tubman-Chavez, 415 Euclid Avenue, where they will walk in to receive a free, zero-copay test conducted by a County nurse. Tests take 5-10 minutes, wait times will vary and testing is limited to 150 people per day.\nIn National City, the state testing site that used to be run from Tubman-Chavez has been relocated to the Kimball Senior Center, 1221 D Avenue. It will be open Monday to Friday, 7 a.m. to 7 p.m. Advance appointments are required.\n“Testing people, particularly in areas with high numbers of COVID-19 cases, is a critical part of our public health efforts to contain the pandemic until we have a vaccine,” said Wilma Wooten, M.D., M.P.H., County public health officer. “By identifying people who are positive, we can get them into isolation, and help prevent the spread of the virus.”\nCOVID-19 tests are used to evaluate your health for COVID-19 infection and help public health agencies control the virus’s spread. Testing also helps identify specific areas and groups with higher rates of infection. Understanding these patterns is important to protect the public’s health and continue safely reopening the County.\nTesting will be limited over the Fourth of July weekend. See schedule. You can also visit 211sandiego.org.\nIf you feel you are experiencing symptoms, including fever, chills, cough, or shortness of breath, contact your health care provider. If you do not have a health care provider, call 2-1-1. If you have serious symptoms, like difficulty breathing, call 9-1-1.\nHealth plans are required to cover COVID-19 tests at no cost to the enrollee, even if you are asymptomatic. It is recommended that you first contact your health care provider for a COVID-19 test.\nIf you are unable to get a test from your health care provider, the County has coordinated free diagnostic COVID-19 testing at many locations.\nAppointments are required (except at Tubman-Chavez Center). To make an appointment online, visit 211sandiego.org or call 2-1-1 (toll free). Appointments can be made up to one week in advance.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200702.13.35.18"}