{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "2 Flu Deaths and Nearly 1,400 Cases Reported Last Week", "description": "Two additional flu deaths were reported in the region, bringing this season’s total to 10, the County Health and Human Services Agency announced today.", "datePublished": "2020-01-02T09:02:07-08:00", "url": "https://www.countynewscenter.com/2-flu-deaths-and-nearly-1400-cases-reported-last-week/", "keywords": ["health", "flu deaths", "flu vaccine", "influenza deaths", "thomas coleman"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-02T09:09:34-08:00", "articleType": "article", "articleContent": "\nInfluenza cases reported last week in San Diego County rose to a season high of 1,390 cases, the County Health and Human Services Agency announced today.\nTwo additional flu deaths were identified in the region, bringing this season’s total to 10.  A 77-year-old man died Dec. 24, and a 75-year-old man died Dec. 21. Both died from influenza A, and both had underlying medical conditions.\n“The significant jump in new cases indicates that influenza is widespread in the county, just like it is in the state and throughout most of the nation,” said Thomas R. Coleman, M.D., M.S., acting County public health officer. “Our condolences go out to the families and friends of those who died from influenza this year.”\nThe number of lab-confirmed cases rose 643 last week when 1,390 cases were reported, compared to 747 cases the previous week.\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Dec. 28, 2019, the report shows the following:\n\nEmergency department visits for influenza-like illness: 8% of all visits (compared to 5% the previous week, which was revised downward from 7% from the prior report)\nTotal influenza deaths to date: 10 (compared to 9 at this time last season)\nTotal lab-confirmed cases to date: 3,838 (compared to 1,729 last season)\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nFlu vaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nThe flu vaccine is available at doctors’ offices and retail pharmacies. If you don’t have medical insurance, you can go to a County public health center to get vaccinated. For a list of locations, visit www.sdiz.org or call 211 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200102.09.02.07"}