{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Animal Services Reports for Animal Heroes Duty", "description": "At the height of the now 95 percent contained Airport Fire, County Animal Services answered a mutual aid request to help evacuate animals and work at a shelter where families with animals had been evacuated in Riverside County.", "datePublished": "2024-09-25T11:28:35-07:00", "url": "https://www.countynewscenter.com/county-animal-services-reports-for-animal-heros-duty/", "keywords": ["animals", "animal evacuations", "das", "emergency", "emergency prepardness"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-09-25T12:17:32-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAt the height of the now 95 percent contained Airport Fire, County Animal Services answered a mutual aid request to help evacuate animals and work at a shelter where families with animals had been evacuated in Riverside County.\n“We are deeply committed to supporting both animals and the people who love them during challenging times. By coming together as a community, we ensure that no one faces these crises alone. Just as we are here to help when others are in need, we know they would extend the same care and support to us in our time of need,” said County Animal Services Director Vaughn Maurice.\nThe department sent both  animal control officers and animal care attendants. Two officers helped evacuate and transport animals from affected areas, so their owners could focus on their own safety.\nMeanwhile, animal attendants Manny Salazar and Portia Peters were stationed at a Red Cross Shelter at Temescal Canyon High School providing care for the displaced pets and their distressed families.\nSalazar, who has worked for the County for 15 years, reported to the Lake Elsinore shelter on Sept. 12 where he lived and worked for the next three days. He helped people with their pet care and did his best to keep animals feeling calm and safe.\n“The (evacuated residents) looked tired, worried and devastated. The last thing they wanted to do was to worry about their pets,” Salazar said. “I wanted to do anything to help.”\nHe worked the graveyard shift helping take dogs for walks, feeding them and letting them socialize when possible.\n“I was dealing with scared dogs. They would eventually go to sleep, but the cats were the most upset,” he said. “At one point, the cats were keeping the dogs up at night crying. I’m a huge cat person so I felt so bad for the cats.”\nSalazar moved their crates into his tent and “positioned them so they could see me and put on an audiobook for them. I would keep my fingers in their crate and let them rub their cheeks on me as a way to soothe them.”\nHe started with 15 dogs and cats, and when Salazar was released from his duties on Monday, they were down to 8 and were getting ready to close the shelter in the next few days.\nWildfires are a year-round threat in San Diego County, visit County Animal Services for information on pet emergency preparedness. County Animal Services’ top priority is to protect the health, safety and welfare of people and animals.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240925.11.28.35"}