{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bring Home a New Best Friend Saturday, Adoption Fees Waived", "description": "Unleash your love and find your new family member on the first annual California Adopt-a-Pet Day. Overcrowding continues to affect the County’s shelters and shelters throughout the United States. In response, we are asking for the community’s support to make a lifesaving impact on the homeless pet population.", "datePublished": "2024-05-30T11:53:03-07:00", "url": "https://www.countynewscenter.com/bring-home-a-new-best-friend-saturday-adoption-fees-waived/", "keywords": ["animals", "adopt pets", "das", "free pet adoptions"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-05-30T12:51:17-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteUnleash your love and find your new family member on the first annual California Adopt-a-Pet Day. Overcrowding continues to affect the County’s shelters and shelters throughout the United States. In response, we are asking for the community’s support to make a lifesaving impact on the homeless pet population.\nAdoption fees are waived for all pets adopted on Saturday, June 1 at the County’s two animal shelters in Bonita and in Carlsbad. All pets will be vaccinated, spayed or neutered, and microchipped.\nCalifornia Adopt-a-Pet Day is more than an annual event; it celebrates the beautiful bond between humans and animals. It’s a day where the possibility of countless moments of laughter and love converge, waiting eagerly for you to be a part of them.\nAdoption fees will be paid for by the American Society for the Prevention of Cruelty to Animals (ASPCA) in partnership with CalAnimals.\nIf you live in the County service area and adopt a dog, a license is included too.\nFind your new best friend by browsing the County shelters’ online animal listings. You will find loveable cats, dogs, bunnies, a tortoise, a guinea pig and pigs available on the Adoptions page.  Due to the popularity of this adoption special, Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already adopted.\nCan’t make it to the shelter on the June 1?  Adoption fees are always waived for senior adopters, senior pets and pets that have been waiting for their forever home for 30 days or more.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240530.11.53.03"}