{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting Saturday, 39 Vote Centers Open for Nov. General Election", "description": "You don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at 39 vote centers starting Saturday, Oct. 29.", "datePublished": "2022-10-28T14:24:21-07:00", "url": "https://www.countynewscenter.com/starting-saturday-39-vote-centers-open-for-nov-general-election/", "keywords": ["elections", "election", "fgg", "nov. 8 statewide general election", "san diego county registrar of voters", "vote centers open"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-10-28T15:36:04-07:00", "articleType": "article", "articleContent": "\nYou don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at 39 vote centers starting Saturday, Oct. 29. The centers are around the county and will be open daily from 8 a.m. to 5 p.m.\nOn Saturday, Nov. 5, another 179 locations will open for a total of 218 vote centers open daily from 8 a.m. to 5 p.m. All will be open again on Election Day, Nov. 8, when voting hours change to 7 a.m. to 8 p.m.\nYou can visit any vote center around the county. Find a location near you at sdvote.com.\nVote centers replace polling places and provide more services. You can:\n\nVote in-person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selections on ballot marking devices. When finished, the voter will print out the official ballot with their selections. The voter can review the ballot and place it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box location is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or measure on the ballot. Additionally, an individual may not circulate any petitions, including for initiatives, referenda, recall, or candidate nominations.\nVoters can still mark their ballot from home. Be sure to sign and date the return envelope, seal your completed ballot inside and return it to one of the Registrar’s official ballot drop boxes or vote centers. Or return your ballot through the U.S. Postal Service as long as it’s postmarked by Nov. 8.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nLearn more about voting in the Nov. Statewide General Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221028.14.24.21"}