{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "4 Wild Mice Collected in Campo Area Test Positive for Hantavirus", "description": "County officials are reminding people they should never sweep or vacuum up after rodents if they find them in living spaces like homes, garages, sheds and cabins, after four wild mice collected in routine monitoring tested positive for hantavirus.", "datePublished": "2020-07-02T15:25:25-07:00", "url": "https://www.countynewscenter.com/4-wild-mice-collected-in-campo-area-test-positive-for-hantavirus/", "keywords": ["health", "hantavirus", "vector control"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-07-03T09:57:37-07:00", "articleType": "article", "articleContent": "\nFour wild mice collected in routine monitoring in open space in the Campo area have tested positive for hantavirus.\nCounty officials are reminding people they should never sweep or vacuum up after rodents if they find them in living spaces like homes, garages, sheds and cabins, but instead use “wet-cleaning” methods.\nHantavirus is potentially deadly, and people are exposed to it when the virus, shed by wild rodents in urine, feces and saliva, dries, is stirred into the air and inhaled. There is no cure or vaccine for the virus.\nHantavirus is not uncommon in San Diego County. The four wild mice collected in Campo brought the number of rodents testing positive for hantavirus this year around the county to 22.\nEven so, people are unlikely to be exposed to the virus because the viruses’ carriers, wild rodents, wild mice in particular, generally want to live and nest away from people.\nStill, County officials said people should be careful to use wet cleaning methods, with bleach, disinfectants, rubber gloves and bags if they find rodent droppings or other signs that wild rodents have gotten into living spaces and they must clean.\nThe mice collected in the open space in Campo included two California mice, one deer mouse, and one brush mouse.\nHere are tips for people to prevent being exposed to wild rodents and hantavirus, and how to use wet-cleaning methods.\nAvoid Exposure to Hantavirus\n\nSeal up all external holes in homes, garages and sheds larger than a dime to keep rodents from getting in.\nEliminate rodent infestations immediately.\nAvoid rodent-infested areas and do not stir up dust or materials that may be contaminated with rodent droppings and urine.\nClean up rodent droppings and urine using the wet cleaning method described below.\n\nUse “Wet-cleaning” Methods to Prevent Inhaling the Virus\n\nDo not sweep or vacuum infested areas.\nVentilate affected area by opening doors and windows for at least 30 minutes.\nUse rubber gloves. Spray a 10 percent bleach solution or other disinfectants onto dead rodents, rodent droppings, nests, contaminated traps, and surrounding areas and let the disinfectant stand for at least 15 minutes before cleaning.\nClean with a sponge or a mop that has been soaked in disinfectant.\nPlace disinfected rodents and debris into two plastic bags, seal them and discard in the trash.\nWash gloves in a bleach solution, then soap and water, and dispose of them using the same double-bag method.\nThoroughly wash your hands with soap and water.\n\nFor more information, contact the County Department of Environmental Health (DEH) at (858) 694-2888 or visit the DEH hantavirus web page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200702.15.25.25"}