{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Behavioral Health Experts Urge San Diegans to Check Their Mental Well-being", "description": "May is Mental Health Matters Month and County behavioral health officials say there’s no better time than now to take stock of your mental health and the mental well-being of those you care about.", "datePublished": "2022-05-04T16:19:28-07:00", "url": "https://www.countynewscenter.com/?p=208413", "keywords": ["health", "behavioral health", "may is mental health month", "mental health", "mental health month"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-05-04T16:45:13-07:00", "articleType": "article", "articleContent": "\nMental health has a powerful influence on people’s quality of life. Experts say it affects how people feel about themselves, how they handle stress, make choices and relate to others. San Diegans’ mental health should be as important as their physical, but, too often, it gets overlooked or ignored.\nMay is Mental Health Matters Month and County behavioral health officials say there’s no better time than now to take stock of your mental health and the mental well-being of those you care about.\nThroughout May, the County and its many partners are asking San Diegans to help raise awareness about the importance of mental health. By doing that, you will help to reduce the stigma associated with mental illness which is what keeps people from getting the help they need. A list of organizations and activities taking place in May is available here.\n“The sooner people reach out for help, the better off they will be. It’s important for everyone to observe and check their emotional well-being and to share with friends and loved ones how they’re feeling,” said Dr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency. “Taking good care of our minds and engaging in self-care activities is a good exercise to improve our behavioral health and improve our overall quality of life.”\nBergmann says San Diegans should use the Mental Health Matters Month resources as an opportunity to promote community awareness of mental health and check in with people who may be struggling or recovering from a mental health condition.\nIn the past few years, the County has made significant increases in investment and funding to provide better access to behavioral health services.\nPeople needing immediate behavioral health assistance should call 9-1-1. Help is also available by calling the County’s Access and Crisis Line at (888) 724-7240 or 2-1-1 San Diego or by visiting www.Up2SD.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220504.16.19.28"}