{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Disaster CalFresh Applications Illustrate Unprecedented Need", "description": "Disaster CalFresh applications related to the Jan. 21-23 flooding in San Diego County ended on Friday, March 22, 2024. More than 12,800 applications were approved and more than $5.7 million in benefits was provided to people and families to buy food. ", "datePublished": "2024-03-28T13:44:22-07:00", "url": "https://www.countynewscenter.com/disaster-calfresh-applications-illustrate-unprecedented-need/", "keywords": ["health", "disaster calfresh", "food", "january flood"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-03-28T13:44:22-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDisaster CalFresh applications related to the Jan. 21-23 flooding in San Diego County ended on Friday, March 22, 2024. More than 12,800 applications were approved and more than $5.7 million in benefits was provided to people and families to buy food. \nThe program’s application period was extended a week to ensure those affected by the flooding could enroll. \nEligible households had to meet the below criteria: \n\nLive or work in the disaster area during the disaster. \nBuy or plan to buy eligible food. \nBe experiencing challenges due to the disaster.\n\nDisaster CalFresh was activated after the presidential disaster was declared to provide food for people and their families affected by the disaster. The County of San Diego received funding for this program from the federal government to provide the one-time payment. \nAll CalFresh recipients and new Disaster CalFresh recipients can use their Electronic Benefit Transfer (EBT) Card to purchase hot and prepared food until April 10, 2024. This one-week extension came on the heels of the Disaster CalFresh application period extension. \nWith few exceptions, CalFresh EBT cards usually can only be used to purchase shelf-stable foods. The temporary change was approved by Food and Nutrition Service (FNS) for San Diego County which is part of the U.S. Department of Agriculture.  \nThe agency allows the modification under conditions such as power outages, damage to homes, the displacement of residents, and other conditions that prevent households from purchasing and preparing food.  \nFNS has notified all authorized San Diego County EBT retailers of the waiver and is encouraging stores to post notices alerting customers of the change.  \nTraditional CalFresh enrollment numbers are also at a record high. As of March 1, 2024 more than 389,400 were enrolled in CalFresh, which is the highest in San Diego County’s history. Compared to last year, it is a 4.4% increase. \nPeople can learn more about applying for CalFresh here. \nFor a list of authorized retailers that accept Electronic Benefits Transfer (EBT) cards, which is how CalFresh benefits are distributed, visit fns.usda.gov. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240328.13.44.22"}