{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Storefront Model Improves Access for Food, Medical, Other Assistance", "description": "The County Health and Human Services Agency Centre City Family Resource Center is now one of the busiest locations where residents can get access to food, medical and other assistance programs and services.", "datePublished": "2022-06-30T11:21:09-07:00", "url": "https://www.countynewscenter.com/?p=208903", "keywords": ["families", "centre city family resource center", "family resource center", "frc", "storefront"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-06-30T14:50:47-07:00", "articleType": "article", "articleContent": "\nEasier access and shorter wait times.\nThat is what has led the County Health and Human Services Agency Centre City Family Resource Center (FRC) to become one of the busiest locations where residents can get access to food, medical and other assistance programs and services.\nWith an overhaul born of COVID-19 necessity, the FRC at 1255 Imperial Ave. has been remodeled to include four walk-up windows where people can apply for and find out if they qualify for Self-Sufficiency Services such as CalFresh (food stamps), Medi-Cal and General Relief programs.\nThese services are now available in a one-stop storefront, in what was formerly an outside eating area at the Metropolitan Transit System building. Prior to the remodel, customers had to go into the building, be screened by security by going through a metal detector and take the elevator to the fifth floor where the rest of the FRC was located.\n“With these improvements the County is providing easier access and faster service to our customers, most of whom are vulnerable residents without a stable place to live and who are struggling with a mental illness and/or substance use issues,” said Self-Sufficiency Services Director Rick Wanne.\nSince the storefront opened about 18 months ago, it has received over 110,000 customer visits, averaging approximately 250 per day with a typical wait time of less than 15 minutes. Additionally, the FRC storefront has issued more than 24,000 electronic benefit transfer or EBT cards.\nQuickly established 18 months ago to provide in-person services to the public during COVID-19, this new way of providing walk-up, triage, and quick transaction services has proven so successful that the County is exploring plans to implement this model at the other 11 FRCs.\n“We expect this service delivery model to effectively support our customers at all locations moving forward,” said Wanne.\nCurrently, there are 367,000 San Diegans receiving CalFresh benefits, 42,000 on CalWorks, 967,000 getting Medi-Cal and 3,000 receiving General Relief assistance.\nResidents can apply for Self-Sufficiency programs online, at a County Family Resource Center or via the Customer Service Call Center at (866) 262-9881.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220630.11.21.09"}