{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: New Grant to Help More San Diegans Get Online", "description": "The County is expanding its campaign to help more San Diegans get online.", "datePublished": "2023-06-29T09:56:58-07:00", "url": "https://www.countynewscenter.com/new-grant-to-help-more-san-diegans-get-online/", "keywords": [], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-06-29T09:56:58-07:00", "articleType": "video.other", "articleContent": "\nThe County is expanding its campaign to help more San Diegans get online. \nThese new efforts will be rolled into the regionwide outreach efforts, allowing expansion thanks to a $500,000 grant from the Federal Communications Commission to tell people about the Affordable Connectivity Program (ACP).\nThe ACP provides qualifying households a discount of $30 a month toward their internet bill. People living on tribal lands are eligible for up to $75 toward their internet bill. Eligible households can also receive a one-time discount of up to $100 to purchase a laptop, desktop computer, or tablet from participating providers.\nThe San Diego Association of Governments (SANDAG) reports that more than 453,000 local households meet the criteria for the Affordable Connectivity Program. \nThe new grant was awarded to the County’s Department of Homeless Solutions and Equitable Communities. Along with funding outreach, it will allow Community Health Workers who are trained in using culturally sensitive and multilingual approaches to directly enroll people who are eligible. \nOutreach teams also will work with community partners, with a special focus on rural and urban areas with low rates of internet connectivity. A portion of the grant will be allocated for contracted outreach efforts.\nEligibility for the ACP includes: \n\nHouseholds whose income is at or below 200% of Federal Poverty Guidelines \nFederal Pell Grant recipients  \nHousehold members who participate in a government program like free and reduced school lunch or breakfast, CalFresh, MediCal, federal housing assistance programs or Supplemental Security Income (SSI), WIC, Veterans Pension or Survivor Benefits \nParticipants of assistance programs like Bureau of Indian Affairs General Assistance, Tribal TANF, Food Distribution Program on Indian Reservations and Tribal Head Start (income based) who live on Qualifying Tribal lands\n\nFull qualifying guidelines are online at getinternet.gov/apply.  \nDoing More to Get San Diegans Online \nBeyond the expanded enrollment outreach, the County has already taken steps to improve internet access across the County including: \n\nA new Comprehensive Broadband Plan, finalized in January, identifies access and infrastructure opportunities in the unincorporated area. Learn more at engage.sandiegocounty.gov/broadband \nThe County partners with SANDAG on its Get Connected Campaign to advance affordable internet service and digital literacy programs.\n\nThe County Housing and Community Development Services will be sharing ACP information with Public Housing residents, households receiving assistance through the housing choice voucher program, and those on waitlists.\n\nThe County’s Aging & Independence Services Digital Inclusion program provides eligible older adults and adults with disabilities with data enabled iPads, technical trainings and/or digital skill support to set-up the tablet and access resources to maintain safety and stay socially engaged from home.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230629.09.56.58"}