{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Active Tuberculosis Reported in Transit Rider", "description": "A passenger using the Metropolitan Transit System has been diagnosed with infectious pulmonary tuberculosis according to San Diego County Health and Human Services Agency.", "datePublished": "2022-09-28T18:31:34-07:00", "url": "https://www.countynewscenter.com/?p=209632", "keywords": ["health", "mts", "tb", "tuberculosis", "tuberculosis testing"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-09-29T08:35:46-07:00", "articleType": "article", "articleContent": "\nA passenger using the Metropolitan Transit System (MTS) has been diagnosed with infectious pulmonary tuberculosis (TB) according to San Diego County Health and Human Services Agency (HHSA).\nHHSA is working with Metropolitan Transit System (MTS) officials to notify individuals who were possibly exposed. Riders using the following routes between Feb. 16, 2022, and Aug. 16, 2022 were potentially exposed and are at risk for infection:\n\nTrolley Blue Line from San Ysidro to 12th and Imperial station Monday through Friday from 6 a.m. to 6:30 a.m.\nTrolley Orange Line from 12th and Imperial to Lemon Grove Monday through Friday from 6:30 to 7 a.m.\nTrolley Orange Line from Lemon Grove to 12th and Imperial Monday through Friday roughly between 4:45 p.m. and 5:15 p.m.\nTrolley Blue Line from 12th and Imperial to San Ysidro Monday through Friday roughly between 5:15 p.m. and 5:45 p.m.\n\nPotentially affected passengers are advised to consult with their medical provider or contact Public Health to arrange testing.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. Some who become infected with tuberculosis will become ill at some point in the future, sometimes even years later. Blood tests and skin tests are effective to determine whether someone has been infected.”\nPeople who are infected, and people at high risk of becoming ill quickly after an infection such as those with an immunocompromising condition, should discuss treatments with a medical provider, as antibiotics can prevent people with TB infection from becoming sick.\nIndividuals who would like more information on this potential exposure are asked to call the County TB Control Program at (619) 692-8621.\nThe number of annual TB cases in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 264 cases reported in 2019, 192 cases in 2020 and 201 cases of tuberculosis disease reported in 2021. Through the end of August, 97 cases have been reported to date in 2022.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220928.18.31.34"}