{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supervisors Reelect Chairwoman for 2024", "description": "The County Board of Supervisors voted unanimously to select Supervisor Nora Vargas as the chairwoman for 2024.", "datePublished": "2024-01-09T13:18:11-08:00", "url": "https://www.countynewscenter.com/county-supervisors-reelect-chairwoman-for-2024/", "keywords": ["government", "2024 organizational meeting", "board of supervisors chair", "chair pro tempore joel anderson", "chair vargas reelected", "vice chair terra lawson-remer"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-01-09T16:20:40-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted unanimously to select Supervisor Nora Vargas as the chairwoman for 2024.\nChairwoman Vargas served as board chairwoman last year. The chair acts as the voice of the county.\nDuring Tuesday’s organizational meeting, Supervisor Terra Lawson-Remer was reelected as vice chair and Supervisor Joel Anderson as chair pro tempore.\nAfter the vote, Chairwoman Vargas thanked her colleagues for their support.\nShe recognized all the hard work the Board had accomplished in the last year, including passing an $8.1 billion budget that addressed key issues and maintained core County services.\nThe Chairwoman acknowledged the Board faces challenges in the year ahead as budgets tighten around the state. She said the Board must be diligent with their resources to prioritize the health and safety of residents, and support local businesses, so they have an opportunity to thrive.\n“The work ahead will not be easy, but I have no doubt with compassionate, deliberate work, and collaborative spirit, that we’re going to able to once again move the county forward and our communities forward and do the great things we are meant to do as your elected officials and representatives,” said Chairwoman Vargas.\nAfter the selection of the new chair, Board members were appointed to various boards, commissions and committees around the region.\nThe County also has a wide variety of boards, commissions and committees. If you have an interest in health or social issues, criminal justice, the elderly, planning and land use, parks, libraries, housing or human relations, you can make a difference by volunteering your time.\nTo find out more, visit the Clerk of the Board’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240109.13.18.11"}