{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "All San Diego Emergency Departments now Officially Senior-friendly", "description": "Officials from the County’s Health and Human Services Agency, local hospitals and healthcare agencies gathered Thursday to celebrate the county becoming the first in the nation to earn a regionwide “senior-friendly” emergency department accreditation for all 18 of its hospitals.", "datePublished": "2022-08-11T16:31:28-07:00", "url": "https://www.countynewscenter.com/?p=209215", "keywords": ["health", "aging roadmap", "emergency rooms", "hospitals", "seniors"], "author": [{"type": "@Person", "name": "José Eli Villanueva", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José Eli", "familyName": "Villanueva"}], "dateModified": "2022-08-11T16:38:18-07:00", "articleType": "article", "articleContent": "\nOfficials from the County’s Health and Human Services Agency, local hospitals and healthcare agencies gathered Thursday to celebrate the county becoming the first in the nation to earn a regionwide “senior-friendly” emergency department accreditation for all 18 of its hospitals.\nThe geriatric emergency department accreditation means that emergency room visits will be more effective and less stressful for local seniors. Elderly patients make nearly one-third of all local emergency room visits. The geriatric emergency departments are designed to treat and care for seniors and the unique medical complications they may present when they come to emergency rooms. Those include frailty and mobility issues, dementias and the use of multiple medications for chronic medical conditions.\nThe ERs also feature staff trained and dedicated to emergency care for older adults including nurses, case managers and social workers. The accreditation means 100% of seniors in the county will have access to senior-friendly emergency room care. Officials said only about 15% of seniors have that access nationwide.\nThe regional geriatric emergency department accreditation effort was part of the San Diego Senior Emergency Care Initiative, a first-of-its kind public-private partnership spearheaded by the County of San Diego and West Health at the end of 2019 as part of the County’s inaugural Aging Roadmap.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220811.16.31.28"}