{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Indoor Movie Theaters Can Reopen June 12", "description": "Indoor movie theaters join a growing list of businesses that can begin to reopen this Friday.", "datePublished": "2020-06-09T17:46:01-07:00", "url": "https://www.countynewscenter.com/indoor-movie-theaters-can-reopen-june-12/", "keywords": ["health", "business reopenings", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-06-10T11:07:38-07:00", "articleType": "article", "articleContent": "\nIndoor movie theaters join a growing list of businesses that can begin to reopen this Friday. Businesses must follow state guidelines and are required to fill out a Safe Reopening Plan before resuming operations.\nMovie theater operators must limit the number of attendees in each theater to 25% of theater capacity or a maximum of 100 guests, whichever number is lower. They must also ensure employees and customers practice good hand hygiene, use face coverings when not eating or drinking, maintain physical distancing and are screened for symptoms.\n“Several communities across the nation have seen a spike in case numbers after reopening their economies,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “We need to remain vigilant and continue to use the measures that have slowed the spread of COVID-19.”\nThe following businesses can also begin to reopen June 12:\n\nGyms\nBars and wineries\nSwimming pools, including condominium and community pools\nHotels and other rental properties for tourism and individual travel\nCard rooms, racetracks and satellite wagering facilities\nFamily entertainment (bowling alleys, batting cages)\nZoos, galleries, museums and aquariums\nFilm/TV production\nProfessional sports without spectators\n\nSteps for business owners to follow and guidance are on the County’s Safe Reopening page.\nThe following activities are not permitted until further notice:\n\nNail and facial salons\nTattoo parlors\nTherapeutic massage businesses\nConventions\nConcerts\n\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,963 tests were reported to the County on June 8 and 110 or 3% were positive.\n3.1% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n110 new cases were reported for a San Diego County total of 8,729.\n1,441 or 16.5% of the total cases have required hospitalization.\n408 or 4.7% of all cases had to be admitted to the intensive care unit.\nThe median age of county residents infected with COVID-19 is 44 years.\nThe age of all individuals with cases ranges from 0 to 102 years.\n\nDeaths:\n\nFive new COVID-19 deaths were reported today, bringing the region’s total deaths to 301.\nThe median age for deaths among county residents is 78 years.\nThe ages of those who died from COVID-19 in the region is 23 to 101 years of age.\n\nThere are currently 56 active outbreaks in skilled-nursing facilities and other congregate and community settings:\n\n21 outbreaks with 805 cases, including 86 deaths in skilled nursing facilities.\n23 outbreaks with 846 cases, including 66 deaths in other congregate settings.\n12 outbreaks with 402 cases, including six deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200609.17.46.01"}