{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "TB Exposures Possible at Two Community Colleges, Bus Route", "description": "Two unrelated tuberculosis cases have been reported in the region and people may have been exposed to the bacteria at Southwestern College, San Diego City College and on Metropolitan Transit System Bus Route 12.", "datePublished": "2020-01-17T08:29:32-08:00", "url": "https://www.countynewscenter.com/tb-exposures-possible-at-two-community-colleges-bus-route/", "keywords": ["health", "city college", "mts", "southwestern college", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-17T09:41:17-08:00", "articleType": "article", "articleContent": "\nTwo unrelated tuberculosis cases have been reported in the region and people may have been exposed to the bacteria at Southwestern College, San Diego City College and on Metropolitan Transit System Bus Route 12, the County Health and Human Services Agency (HHSA) announced today.\nHHSA is working with officials from both community colleges and MTS to notify people who may have had close and prolonged contact with the infected individuals, and therefore may have been exposed to TB.\nThe periods of possible exposure were:\n\nSouthwestern College: Aug. 26, 2019 to Dec. 10, 2019\nSan Diego City College: July 26, 2019 to Aug. 5, 2019 and Aug. 19, 2019 to Dec. 16, 2019\nBus Route 12: July 26 to Aug. 5, 2019 and Aug. 19 to Dec. 16, 2019, Monday through Friday—Departing from Skyline Hills between 7:59 and 8:47 a.m. to City College Transit Center. Departing from City College Transit Center between 7:04 and 8:04 p.m. to Skyline Hills.\n\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County public health officer. “However, most people who are exposed to tuberculosis do not develop the disease.”\nTuberculosis can be treated and cured with medication. People who have TB symptoms or are immuno-compromised are encouraged to see their medical health care provider to rule out TB.\nFree TB testing will be available at the following locations:\nSouthwestern College\nStudent Health Services, 900 Otay Lakes Rd., Student Center, Room 67A-102, Chula Vista, CA 91910. Hours: Mon. – Thur. from 8 a.m. to 6:30 p.m. and Fri. from 8 a.m. to 3 p.m.  SWC employees will be tested by Occupational Health.\nSan Diego City College\nCity College students can contact HHSA TB Control Program to arrange for testing or visit the Student Health Clinic reopening Feb. 3. City College employees will be tested by Occupation Health. Student Health Clinic is at 1313 Park Blvd., A building Room 180, San Diego, CA 92101. Testing at the college begins Feb. 3. Clinic hours are Mon. and Thurs. from 8:30 a.m. to 4:30 p.m., Tue. and Wed. from 10 a.m. to 6 p.m., and Fri. from 8:30 a.m. to 12:30 p.m.\nMetropolitan Transit System\nPassengers are advised to consult with their medical provider or contact HHSA to arrange for TB testing. MTS employees identified will be tested by Occupational Health.\nFor more information on these potential exposures, call:\n\nSouthwestern Students Health Services (619) 482-6354\nSan Diego City College Student Health Clinic Director Dotti Cordell (619) 388-3903\nCounty TB Control Program at (619) 692-8621\n\nThe number of tuberculosis cases in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 237 cases reported in 2017 and 226 in 2018. A total of 265 cases were reported in 2019.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200117.08.29.32"}