{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two Dead Crows Test Positive for West Nile Virus", "description": "Two dead crows recently collected in routine monitoring from Lemon Grove tested positive for West Nile virus, prompting County environmental health officials to remind people to protect themselves from mosquitoes that can transmit the virus to people.", "datePublished": "2025-05-16T10:05:44-07:00", "url": "https://www.countynewscenter.com/two-dead-crows-test-positive-for-west-nile-virus/", "keywords": ["health", "lueg", "mosquito prevention", "prevent", "protect", "report", "west nile virus"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2025-05-16T10:05:44-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesTwo dead crows recently collected in routine monitoring from Lemon Grove tested positive for West Nile virus, prompting County environmental health officials to remind people to protect themselves from mosquitoes that can transmit the virus to people.\nThe positive tests mark the first detections of West Nile virus in the county this year. There have been no reported human cases in San Diego County this year.\nHowever, West Nile virus remains a potentially deadly threat. And County officials said people should continue to follow the County’s “Prevent, Protect, Report” guidelines to protect themselves from mosquitoes. Those include finding and dumping out standing water around homes to keep mosquitoes from breeding.\nWest Nile virus is mainly a bird disease, but it can be transmitted to humans by several types of mosquitoes if they feed on an infected bird and then bite people.\nSome people who become infected can suffer symptoms including headache, fever, nausea, fatigue, skin rash, or swollen glands. But in rare cases, West Nile virus can make people extremely ill and even kill them.\nProtecting against mosquitoes is always important in San Diego County.\nCounty officials said people can help protect themselves from mosquito-borne illnesses by following the County’s “Prevent, Protect, Report” guidelines.\nPrevent mosquito breeding\nDump out or remove any item inside or outside of homes that can hold water—whether from rain or landscape irrigation. Those things can include plant saucers, rain barrels, buckets, garbage cans, toys, old tires and wheelbarrows. Mosquito fish, available for free by contacting the Vector Control Program, may be used to control mosquito breeding in backyard water sources such as stagnant swimming pools, ponds, fountains and horse troughs.\nProtect yourself from mosquito bites\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, para-menthane-diol, 2-undecanone or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nReport possible mosquito activity and dead birds\nReport increased mosquito activity, unmaintained green swimming pools, and other mosquito-breeding sources, as well as dead birds—crows, ravens, jays, hawks and owls—to the County Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov.\nGo to San Diego County’s  “Fight the Bite”  website to learn how to prevent and protect against West Nile virus and mosquitoes.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250516.10.05.44"}