{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Gyms, Hotels, Bars, Other Businesses to Open June 12", "description": "Gyms, hotels, bars and wineries are part of the long list of businesses and industries that can begin to reopen June 12, provided they follow appropriate guidance.", "datePublished": "2020-06-08T17:36:48-07:00", "url": "https://www.countynewscenter.com/gyms-hotels-bars-other-businesses-to-open-june-12/", "keywords": ["health", "coronavirus", "covid-19", "stage 3", "temperature screenings"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-09T09:17:53-07:00", "articleType": "article", "articleContent": "\nGyms, hotels, bars and wineries are part of the long list of businesses and industries that can begin to reopen June 12, provided they follow appropriate guidance.\nCounty health officials have reviewed the guidance and the following businesses can also open:\n\nSwimming pools, including condominiums and community pools (See local guidance)\nHotels and other rental properties for tourism and individual travel\nCard rooms, racetracks and satellite wagering facilities\nFamily entertainment (bowling alleys, batting cages)\nZoos, galleries, museums and aquariums\nFilm/TV production\nProfessional sports without spectators\n\nBefore businesses reopen, they must fill out a Safe Reopening Plan, share it with their employees and display it where customers and patrons can see it.\nThey must also make sure employees and customers get a temperature or symptom screening, use face coverings when not eating or drinking, maintain physical distancing and practice good hand hygiene.\nOver the weekend, day camps, campgrounds, RV parks, and outdoor recreation such as sports fishing and charter boats could begin reopening. Tomorrow, coastal cities can reopen parking lots at beaches.\n“As we reopen more businesses, we must continue to be vigilant and take preventive measures,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Each of us is responsible and has a role to play to make sure cases do not increase.”\nThe following businesses must remain closed until further notice:\n\nNail and facial salons\nTattoo parlors\nTherapeutic massage businesses\nConventions\nConcerts\n\nIf You Protest, Get a Test\nCounty health officials are recommending that everyone who participates in a protest, consider being tested for COVID-19 because they are at higher risk of contracting the virus.\nLarge gatherings and people being close to each other increase the risk of contracting COVID-19 because people can transmit the virus when chanting, screaming or talking, especially if they are not wearing a face covering.\n“It is likely that we will see cases in people who have participated in the recent protests,” Wooten said. “People should be tested and be on the lookout for symptoms.”\nResidents without symptoms wishing to get a COVID-19 test should check first with their health care provider. They can also get tested at a state or County site where tests are administered for free.\nPeople showing symptoms of COVID-19 should contact their health care provider and arrange for testing. If you don’t have a health care provider, call 2-1-1 and ask for a public health nurse who will give you a referral.\nEveryone who wants to get tested needs an appointment.\n\nFor County site appointments, call 2-1-1.\nFor state sites, make an appointment online or call 888-634-1123. State sites are in Escondido, El Cajon, Chula Vista, San Ysidro and Southeastern San Diego.\n\nCounty public health nurse administers a COVID-19 test.\nCAL FIRE and the San Diego County Fire Authority continue to schedule free testing in rural communities through 2-1-1.\nDrive-up testing sites will be available from 9 a.m. to 2 p.m. in three communities. An appointment is necessary, and you can make one by calling 2-1-1. The sites will be on:\nJune 9:     CAL FIRE Warner Springs Station 52, 31049 Highway 79, Warner Springs\nJune 10:     Jacumba Hot Springs – SD County Library, 44605 Old Highway 80, Jacumba\nJune 11:       Ramona – SD County Library, 1275 Main Street, Ramona CA 92065\nAll are diagnostic tests, which take about 5-10 minutes. Results generally come back in 3-5 days.\nIf you make an appointment for a COVID-19 test in any location, it’s important that you keep it so that the spot does not go unused.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n3,844 COVID-19 tests were reported to the County June 7, and 143 or 4% were positive.\nThe 14-day rolling average percentage of positive tests is 3.1%.\n\nCases:\n\n143 new cases were reported yesterday, bringing the region’s total to 8,619.\n1,429 or 16.6% of cases have required hospitalization.\n403 or 7% of all cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo additional COVID-19 deaths have been reported today. The countywide total remains at 296.\n\nThere are currently 54 active outbreaks in skilled-nursing facilities and other congregate and community settings:\n\n19 outbreaks with 802 cases, including 85 deaths in skilled nursing facilities.\n24 outbreaks with 857 cases, including 67 deaths in other congregate settings.\n11 outbreaks with 386 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200608.17.36.48"}