{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Couples Take the Leap, Get Married on Leap Day", "description": "Dozens of couples tied the knot Thursday at the County Clerk’s wedding venues for Leap Day.", "datePublished": "2024-02-29T17:18:39-08:00", "url": "https://www.countynewscenter.com/couples-take-the-leap-get-married-on-leap-day/", "keywords": ["government", "assessor/recorder/county clerk", "leap day weddings", "marriage licenses"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-03-01T09:35:58-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteDozens of couples tied the knot Thursday at the County Clerk’s wedding venues for Leap Day.\nA parade of wedding dresses, flowers, relatives and other well-wishers crowded the hallways of one of the more popular wedding sites, the County Administration Center downtown.\nCouples could opt for indoor ceremonies or take the happy event outside to the Waterfront Park.\nThe Assessor/Recorder/County Clerk’s Office offered appointments at all four of their locations. The other three are in Chula Vista, San Marcos and Santee.\nMany couples made appointments beforehand but those who decided to get hitched at the last minute could also say “I do.” Walk-ins were welcome.\nCounty Board Chairwoman Nora Vargas got caught up in the wedding festivities. She officiated at a marriage ceremony at the CAC/Waterfront Park.\nThe County Clerk’s issued 136 marriage licenses and performed 106 wedding ceremonies this Leap Day. More than 160 were made by appointment and there were over 15 walk-ins.\nLeap Year comes around about every four years. The month of February is extended a day to stay in step with the seasonal calendar. February 29 is known as Leap Day.\nFor the newly married, the question remains whether they will celebrate their anniversary every four years. Or if they will remember their special day every year.\nSome do both. A small celebration every year and then a bigger one on Leap Years.\nThe County Clerk’s office issues nearly 25,000 marriage licenses and performs more than 11,000 weddings each year.\nFor more information on how to get a marriage license or reserve a date for a civil wedding ceremony, visit the Marriage License & Civil Ceremony website.\nFor pictures of some of the newlyweds at the County Administration Center, see below.\n\n\n\n\n\n\t\t\t\tTania DE La Cruz and Rogerio Yamassaki Teixeria Barbosa\n\t\t\t\t\n\n\n\n\n\t\t\t\tAngelica Reyes and Eugenio Gonzales III \n\t\t\t\t\n\n\n\n\n\t\t\t\tJohn Vicent Viado De Jesus and Niki Demetri Francia Feria \n\t\t\t\t\n\n\n\n\n\t\t\t\tChairwoman Nora Vargas, Sandra Milena Rivas Agudelo and Daniel Alberto Ayala\n\t\t\t\t\n\n\n\n\n\t\t\t\tSandra Milena Rivas Agudelo and Daniel Alberto Ayala\n\t\t\t\t\n\n\n\n\n\t\t\t\tAmanda Neal and Caitlin McCormick \n\t\t\t\t\n\n\n\n\n\t\t\t\tIsabel Luty and Colin Picard \n\t\t\t\t\n\n\n\n\n\t\t\t\tSalvador Montalvo and Mia Ivory House\n\t\t\t\t\n\n\n\n\n\t\t\t\tJennefer Hernandez and Scott Wesley Hall Jr. \n\t\t\t\t\n\n\n\n\n\t\t\t\tOlivia Antonio and Rekkhear Salazar\n\t\t\t\t\n\n\n\n\n\t\t\t\tYarden Amira and Riley Shae Anenberg\n\t\t\t\t\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240229.17.18.39"}