{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation to Host Fundraiser for Shop with a Cop", "description": "San Diego County Probation is hoping for a homerun at a softball fundraiser to support this year’s Shop with a Cop event. that will give children from around the County a happier holiday season.", "datePublished": "2024-08-15T15:33:08-07:00", "url": "https://www.countynewscenter.com/probation-to-host-fundraiser-for-shop-with-a-cop/", "keywords": ["public safety", "county probation", "shopwithacop"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-08-16T10:10:54-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County Probation is hoping for a homerun at a softball fundraiser to support this year’s Shop with a Cop event. that will give children from around the County a happier holiday season.\nShop with a Cop is an annual event sponsored by local law enforcement agencies, Sea World, Target and STAR/PAL, a not-for-profit organization to help provide children with happy holidays and build positive relationships between youth and law enforcement. It’s been a tradition since 1994, and this year’s event on Dec. 7 will give children selected from local schools will spend a day at Sea World and receive a $200 holiday shopping spree at Target.\nThe softball tournament players hope to raise enough funds to sponsor 300 youth countywide.\nSan Diego Sheriff’s Department 2023 Coed Softball Champions\nTwenty-one law enforcement teams are playing in the tournament starting at 7:30 a.m. Saturday, Aug. 17 through Sunday, Aug. 18 at the Sportsplex USA, 9951 Riverwalk Drive in Santee. Last year’s softball champions were a Chula Vista Police Department men’s team and a San Diego Sheriff’s Department coed team.\nDepartments participating this year include, County Probation, San Diego County Sheriff’s, Santee Fire, Chula Vista Police, Oceanside Police, San Diego Police, Lakeside Fire, El Cajon Police, U.S. Marshals, National City Police, and Carlsbad Police.\nThe community is invited to come cheer on their favorite team. It’s a $5 fee to attend for those 16 and older, which includes a $3 token towards a beverage. You can also support Shop with a Cop by purchasing event t-shirts designed by Deputy Probation Officer Natalia Lopez, as well as challenge coins, lapel pins and raffle tickets. Donations are being accepted. Please indicate that you want it to support Shop with a Cop.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240815.15.33.08"}