{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Reach 96", "description": "The number of local COVID-19 deaths increased to 96 after nine additional deaths were reported in the region, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-22T17:13:41-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-reach-96/", "keywords": ["health", "9 covid-19 deaths", "coronavirus", "rate of cases"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-22T17:41:42-07:00", "articleType": "article", "articleContent": "\nThe number of local COVID-19 deaths increased to 96 after nine additional deaths were reported in the region, the County Health and Human Services Agency announced today.\nFive people died April 17, one April 19 and three April 20. The ages of the nine people who died ranged from 38 to 99 years. Six were men and three were women. All of them had underlying medical conditions.\n“Unfortunately, San Diegans are still dying from complications of COVID-19,” said Eric McDonald, M.D., M.P.H., medical director of the County Epidemiology and Immunization Services branch. “It is imperative that people continue to stay at home to keep the virus from spreading, especially to people at high risk of developing complications from the disease.”\nEighty-four of the 96 people who have died from COVID-19 were 60 years and older; 54 were men and 42 were women. Age, gender and ethnic/race breakdowns for cases and deaths are posted at coronavirus-sd.com.\nCounty COVID-19 Cases Up by 57\nOf the nearly 36,500 COVID-19 tests administered to San Diegans, 2,491 have been positive including 57 additional cases reported yesterday.\nOf the local cases, 1,271 (51%) were men and 1,214 (48.7%) were women. Of the reported cases, 611 (24.5%) have required hospitalization and 206 (8.3%) of the total number of people who tested positive had to be placed in intensive care. Ninety-six (3.9%) have died.\nThe County is now reporting the rate of positive cases by ZIP code, which is a more accurate indicator when comparing data among groups of different sizes.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200422.17.13.41"}