{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board of Supervisors Elects New Chair", "description": "The County Board of Supervisors voted unanimously Tuesday to select Supervisor Nora Vargas as the new Chair of the Board for 2023.", "datePublished": "2023-01-10T14:41:58-08:00", "url": "https://www.countynewscenter.com/?p=210458", "keywords": ["government", "2023 organizational meeting", "board chair nora vargas", "chair pro tempore joel anderson", "new board chair", "vice chair terra lawson-remer"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-01-10T15:59:04-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted unanimously Tuesday to select Supervisor Nora Vargas as the new Chair of the Board for 2023.\nChair Vargas succeeds Supervisor Nathan Fletcher who served as chair for the last two years. The chair acts as the official voice for the board. The chair also presides over its meetings and nominates other supervisors to various committees.\nDuring Tuesday’s organizational meeting, Supervisor Terra Lawson-Remer was  elected as vice chair and Supervisor Joel Anderson as chair pro tempore.\nChair Vargas was the first Latina elected to the Board of Supervisors in 2020 and is now the first Latina selected as board chair.\nChair Vargas gave her remarks in both English and Spanish. She emphasized that everyone must work together to make change happen.\n“It’s been tough because at times our chambers have been polarizing but today is a new day and our communities really deserve better… I really strongly believe that we must work together to increase public participation in these meetings, we have to have different voices,” said Chair Vargas. “When we bring different voices to the fold, we can assure that we are serving all communities in the ways that they deserve.”\nChair Vargas expects disagreements when tackling difficult problems, but she hopes they are discussed in a civil manner saying that’s how we find real solutions and that’s what democracy is all about.\nChair Vargas wants to work toward giving residents a good quality of life that includes access to clean air and health care, help for small businesses and families that need childcare. She sees future investments in public transit opportunities, parks and open spaces to help create positive environmental and economic impacts to our region.\n“We have a lot of work ahead of us, and that is why I invite everyone who is listening or watching to join us and participate in these proceedings. This is your county, these are your chambers, and I want you to know that when you come before this board, I hear you,” said Chair Vargas. “I look forward to continuing to work with our veterans and our community organizations, our seniors, our small businesses, our faith communities, our labor unions and all who care deeply about building a better county for all.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230110.14.41.58"}