{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "​​County of San Diego​ Awarded Grant for Bicycle and Pedestrian Safety Program from the Office of Traffic Safety", "description": "The ​County of San Diego​ announced today that it received a ​$125,000​ grant from the California Office of Traffic Safety (OTS) to support its Bicycle and Pedestrian Safety Program.", "datePublished": "2023-11-29T08:24:59-08:00", "url": "https://www.countynewscenter.com/county-of-san-diego-awarded-grant-for-bicycle-and-pedestrian-safety-program-from-the-office-of-traffic-safety/", "keywords": ["health", "bicycle safety", "grant"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-11-29T08:24:59-08:00", "articleType": "article", "articleContent": "\n The ​County of San Diego​ announced today that it received a ​$125,000​ grant from the California Office of Traffic Safety (OTS) to support its Bicycle and Pedestrian Safety Program. This grant will allow the County’s Department of Homeless Solutions and Equitable Communities to promote safe practices for pedestrians and bicyclists and provide education about the importance of sharing the road. \n​​“All San Diegans should be able to commute, pick up groceries or enjoy a bike ride without the fear of getting hurt,” said San Diego County Health and Human Services Agency Community Operations Officer Barbara Jiménez.​ “Education is how we bridge the gap to a sustainable and safer future.”  \n“Everyone deserves a safe environment to travel, regardless of how people get to places,” OTS Director Barbara Rooney said. “The safety of people walking and biking on our roads is a high priority. Education plays a pivotal role in creating a strong road safety culture that prioritizes traffic safety, especially for our most vulnerable road users.” \nGrant funds will support a variety of activities focused on bicycle and pedestrian safety, including:  \n\nSocial media campaign to engage an expanded audience on safety and active transportation topics. \nParticipation in state and national campaigns, such as National Walk to School Day and California’s Pedestrian Safety Month.\nPresentations at community and senior centers and schools on safe bike/walking practices with a focus on the benefits active transportation provides on health, community and climate change. \n“Open Streets” events encouraging biking and walking.\nProviding bicycle and scooter skills training courses on safe riding behaviors. \nWalking field trips with older adults and disabled residents to identify walking hazards and provide information on safe active transportation techniques.  \nPresentations at stakeholder meetings focused on active transportation to share best practices and increase collaboration. \n\nThe grant program will run through September 2024. \nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231129.08.24.59"}