{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Offer Rotating, COVID-19 Testing at Mexican Consulate, Other Locations", "description": "Starting Sept. 14, San Diegans wishing to get a COVID-19 test have a new option:  the Mexican Consulate in Little Italy.", "datePublished": "2020-09-11T14:47:40-07:00", "url": "https://www.countynewscenter.com/county-to-offer-rotating-covid-19-testing-at-mexican-consulate-other-locations/", "keywords": ["health"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-09-11T15:12:21-07:00", "articleType": "article", "articleContent": "\nStarting Sept. 14, San Diegans wishing to get a COVID-19 test have a new option:  the Mexican Consulate in Little Italy.\nEach Monday, the County will offer free, no-appointment tests from 8:30 a.m. to 3:30 p.m.  on the patio of the Mexican Consulate, located at 1549 India St. in San Diego.\n“The Consulate is proud to be part of the efforts to encourage testing and diagnosis among the Latino community,” said Mexican Consul Carlos González Gutiérrez at a news conference in Little Italy. “We know that part of what is necessary for our community to reach out to testing sites is for them to feel safe and understand that they can access public health services regardless of their migratory status.”\nThe Mexican Consulate site will officially kick off a 14-day rotating program of COVID-19 testing in hard-hit communities, including those with larger Latino and immigrant populations. Other locations to be announced next week will be in community and faith-based organizations that are helping the County with its testing efforts.\n(l-r) Nancy Maldonado from the Chicano Federation, Sup. Nathan Fletcher, Mexican Consul González Gutiérrez, Barbara Jiménez and Nich Macchione, HHSA director.\n“I am confident that the testing at this trusted location will allow us to reach a very important population,” said Barbara Jiménez, general manager of the Central and South regions of the County Health and Human Services Agency. “Until we have a widely available vaccine, testing will remain an absolutely critical part of our public health response.”\nThe first new site at the Consulate is one of seven locations throughout the region that offer free COVID-19 tests without an appointment.\nThe other six sites are located at:\n\nCalifornia State University San Marcos – Viasat Engineering Pavilion\nUniversity of San Diego Parking Lot (Moving to a building on Tuesday, Sept. 15.)\nSan Diego State University Parking Lot 17-B (Moving to the Alumni Center on Monday, Sept. 14.)\nTubman-Chavez Community Center\nMar Vista High School (Drive-up site)\nSan Ysidro Port of Entry PedEast\n\nAppointments are necessary at other County testing sites. To make an appointment, visit www.211sandiego.org or call 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200911.14.47.40"}