{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Summer is Almost Here, and Influenza is Not Gone", "description": "Summer is just around the corner, but influenza continues to sicken San Diegans.", "datePublished": "2022-06-08T10:15:50-07:00", "url": "https://www.countynewscenter.com/?p=208714", "keywords": ["health", "flu", "flu shots", "flu vaccinations", "influenza", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-06-08T10:15:50-07:00", "articleType": "article", "articleContent": "\nSummer is just around the corner, but influenza continues to sicken San Diegans.\nA total of 195 lab-confirmed influenza cases were reported last week, a figure similar to flu totals identified in recent weeks and far greater than the sums detected at this time in previous seasons.\nDuring the same week last year, the County Health and Human Services Agency announced five influenza cases, and during the past five seasons, the same time period had an average of 18 flu infections.\nInfluenza-related deaths remain at seven for the 2021-2022 season.\n“Influenza isn’t easing up,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “The same precautions we take for COVID-19 work for the flu, too. And it’s not too late this season to get your flu shot.”\nThe flu vaccine is recommended for nearly everyone six months and older, but it is especially important for people at higher risk of developing complications from the flu. They include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe latest Influenza Watch report from the County Health and Human Services Agency shows the following for the week ending June 4, 2022:\n\nEmergency department visits for influenza-like illness: 5% of all visits (up from 4% the previous week).\nLab-confirmed influenza cases for the week: 195 (down from 206 the previous week).\nTotal lab-confirmed cases to date: 3,675 (compared to 835 at the same time last season and a 11,731 prior 5-year average during the same week).\nInfluenza-related deaths reported to date: seven (compared to two last season).\n\nTips to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The COVID-19 vaccine does not work against influenza and vice versa.\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nDuring the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths. During the 2019-2020 flu season, more than 20,700 flu cases were reported and 108 San Diegans died from influenza.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220608.10.15.50"}