{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Special Ceremony Honors Abused and Neglected Children", "description": "The County’s Child Welfare Services and its partners held a moment of silence and a special flag raising ceremony Friday to honor the more than 1,700 children who die in the U.S. each year as a result of abuse, violence and neglect.", "datePublished": "2022-04-22T13:57:15-07:00", "url": "https://www.countynewscenter.com/?p=208242", "keywords": ["health", "abuse", "child welfare services", "children s memorial day", "neglect", "polinsky"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-04-22T13:57:15-07:00", "articleType": "article", "articleContent": "\nThe County’s Child Welfare Services and its partners held a moment of silence and a special flag raising ceremony Friday to honor the more than 1,700 children who die in the U.S. each year as a result of abuse, violence and neglect.\nThat’s an average of five children per day, and the numbers have steadily increased over the last two decades. In addition to the deaths, more than 3 million cases of child abuse are reported in the U.S. each year.\nThe annual flag raising event at the Polinsky Children’s Center coincides with Children’s Memorial Day, which is part of National Child Abuse Prevention Month. The event is intended to provide the community with tools that help recognize the warning signs of abuse and neglect.\n“Child abuse prevention starts with each one of us,” said Kimberly Giardina, Child Welfare Services director. “I encourage everyone in our community to educate themselves about the signs of child abuse, so we can collectively work towards preventing tragedies involving children.”\nPolinsky Children’s Center provides temporary emergency shelter to children who must be separated from their families for their own safety. Partners at Friday’s ceremony included representatives from the County’s Behavioral Health Services, the San Diego County Office of Education, the San Diego Juvenile Court, Probation, Rady Children’s Hospital, Promises 2 Kids, and the YMCA.\nThe County Administration Center will be lit in blue Saturday in honor of National Child Abuse Prevention Month.\nIf you have reason to believe a child you know is experiencing abuse or neglect, contact the County’s Child Abuse Hotline at 858-560-2191 or 800-344-6000. You can also call 2-1-1 San Diego, or check this website for a variety of resources related to child abuse prevention.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220422.13.57.15"}