{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Hundreds of County Employees Donate During Blood Drive", "description": "Hundreds of County of San Diego employees from across the region donated blood throughout the month of April during the annual County Blood Drive.", "datePublished": "2023-06-01T13:24:09-07:00", "url": "https://www.countynewscenter.com/hundreds-of-county-employees-donate-during-blood-drive/", "keywords": ["health", "blood bank", "blood drive", "dr. mcdonald", "public health"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-06-01T14:23:02-07:00", "articleType": "article", "articleContent": "\nHundreds of County of San Diego employees from across the region donated blood throughout the month of April during the annual County Blood Drive. \nOrganized in partnership with the San Diego Blood Bank at 16 County locations, the event saw nearly 500 employees take part, with 128 employees donating for the first time. Altogether County employees donated enough blood to save the lives of over 1,300 people. \n“For 39 years County employees have donated blood to save the lives of trauma patients, new mothers, and others in need,” said Eric McDonald, MD, MPH, Chief Medical Officer. “I want to thank them for benefitting people like my mother who needed a blood transfusion after a gastrointestinal bleed a couple of years ago. I am grateful that she is still with us today because of the generosity of blood donors.” \nThe blood bank credited County employees for their contributions while noting the demand for donations is ongoing. \n“We are grateful to the many County employees, including a number of first-time donors, who came out to donate blood and save lives again this year,” Doug Morton, CEO of the San Diego Blood Bank said. “We still need donations of all blood types and encourage people to take the time to donate at a San Diego Blood Bank donor center or mobile blood drive in their neighborhood. It is important for San Diegans of all backgrounds to give, to provide more matches to those in need.” \nTo help spur donations from businesses and organizations regionwide, the County partnered in 2022 with the San Diego Blood Bank, a Live Well San Diego partner, to create the Community Guardians Program. The project is dedicated to promoting and expanding blood donations.   \nThe County of San Diego drive remains one of the largest and most successful collection events organized by the San Diego Blood Bank. Schedule an appointment to donate blood today. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230601.13.24.09"}