{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adds Hefty Air Asset to Firefighting Capabilities", "description": "CAL FIRE San Diego acquired an exclusive-use SIKORSKY CH-54A Type 1 helicopter to add to the region’s resources in the event of a wildfire.", "datePublished": "2022-08-05T17:23:39-07:00", "url": "https://www.countynewscenter.com/?p=209166", "keywords": ["public safety", "county fire", "firefighting helicopter"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-08-08T20:48:03-07:00", "articleType": "article", "articleContent": "\nCAL FIRE San Diego acquired an exclusive-use SIKORSKY CH-54A Type 1 helicopter to add to the region’s resources in the event of a wildfire.\n“The new Type 1 helicopter significantly bolsters our local air attack arsenal.  It can drop about seven times as much water as the existing County firefighting helicopters,” said Jeff Collins, San Diego County Fire director.\nA Type 1 is the most powerful helicopter in County Fire’s air assets. CAL FIRE/San Diego County Fire has a cooperative agreement to use the Sheriff’s Bell 205 Type 2 initial attack helicopters and they have a 375-gallon capacity. The SIKORSKY CH-54A has a capacity to carry 2,650 gallons of water.\n“This is a tremendous amount of water available in one drop,” said fire Capt. Frank LoCoco, CAL FIRE San Diego. “It allows us to fight these fires aggressively and keep them small.”\nThe SIKORSKY CH-54A arrived in the County on Aug. 1 and is an exclusive use contract with CAL FIRE to respond as needed. It will operate out of the Ramona Airport.\nIn total, the region will have up to nine staffed firefighting helicopters and three planes, which are provided by the County, CAL FIRE, U.S. Forest Service, the City of San Diego and San Diego Gas & Electric. The partnership between County Fire, the Sheriff’s Department and CAL FIRE, along with the coordination with regional partners, adds substantial fire suppression from the air to assist ground resources.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220805.17.23.39"}