{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Health Emergency Declaration Ending, County COVID-19 Response Continues", "description": "With the County’s 3-year-long COVID-19 local emergency proclamation and local health emergency declarations and weekly County News Center updates coming to an end, the County’s Public Health Officer reiterated a continuing message this week. County response to the ongoing pandemic continues. The virus is still circulating. And people should continue to protect themselves by getting up to date with vaccinations, including getting a bivalent booster if they haven’t yet.", "datePublished": "2023-02-23T16:12:32-08:00", "url": "https://www.countynewscenter.com/local-health-emergency-declaration-ends-county-covid-19-response-continues/", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19", "local emergency", "local health emergency", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-02-23T17:08:00-08:00", "articleType": "article", "articleContent": "\nWith the County’s 3-year-long COVID-19 local emergency proclamation and local health emergency declarations, and weekly County News Center updates coming to an end, the County’s Public Health Officer reiterated a continuing message this week.\nThe County response to the ongoing pandemic—testing, treating and vaccinating—will continue. The virus is still circulating. And people should continue to protect themselves by getting up to date with vaccinations, including getting a bivalent booster if they haven’t yet.\n“Our declaration of a local health emergency and local emergency proclamation will end Feb. 28, matching the end of the state’s declarations,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “But make no mistake, this is not the time to let your guard down. The virus is still circulating throughout the community. People are still being hospitalized and dying. So protect yourself, your family and friends. We strongly urge people to get current with their COVID-19 vaccinations, including the bivalent booster.”\nIn addition to the Feb. 28 end of the COVID-19 local and health emergencies, County officials said the Feb. 23 County News Center article would be the last regular update of its kind.\nThe County will continue to publish COVID-19 articles and social media posts when it has new information to share with the public. The County’s COVID-19 web pages will continue to be updated weekly. And people can subscribe to the County’s Respiratory Virus Surveillance report to get continued weekly COVID-19 data reporting.\nSince the beginning of the pandemic, the County has published more than 570 County News Center stories and videos that registered more than 27.2 million views, providing San Diegans with the most up-to-date information about COVID-19, testing, treatments and vaccinations.\nThe County’s response to the pandemic will continue in strength, providing the services needed to protect the public including surveillance, testing, tracing, treatment, vaccinations and public engagement.\nBoth COVID-19 vaccinations and treatment remain widely available throughout San Diego County. COVID-19 primary series vaccines and bivalent boosters, as well as flu vaccines, are available at local pharmacies, medical providers’ offices and County vaccination sites. People can check online for the days and hours sites are open.\nStudies continue to report that the bivalent COVID-19 boosters add protection against new COVID-19 variants that make up most new cases in  San Diego County, and these vaccines protect against COVID-19 infections that continue to cause hospitalizations and deaths. The Centers for Disease Control and Prevention (CDC) and California Department of Public Health recommend a bivalent booster for everyone six months of age and older. Previous CDC studies have reported that people who have not been vaccinated run much higher risks of dying from COVID-19 than those who have been vaccinated.\nPreventive Measures   \nIn addition to getting vaccinations and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19 and other seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often.\nStaying away from sick people.\nWearing a facial covering, especially in crowded indoor settings.\nRegularly cleaning commonly touched surfaces.\nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County’s COVID-19 testing webpage.\n\nCOVID-19 Vaccination Progress \n\nMore than 2.69 million or 80.7% of San Diegans have received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 576,531 or 22.9% of 2,514,949 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators.\nCOVID-19 Data \nFor the week ending Feb. 18, 2023, the report shows:\n\n1,774 COVID-19 cases were reported to the County in the past seven days. The region’s total is now 983,031.\nThe 1,774 cases reported in the past week were lower compared to the 1,989 infections identified the previous week.\nNine additional deaths were reported in the week ending Feb. 18, 2023. The region’s total is 5,768.\nEight of the people who died were 65 or older.\nSix of the people had been vaccinated and three were unvaccinated or had not completed the primary vaccine series.\nAll nine people had underlying medical conditions.\n\nInfluenza Data \nFor the week ending Feb. 18, 2023, the report shows the following:\n\nNo additional flu deaths were reported; the season’s total is 40.\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 4% the previous week).\nLab-confirmed influenza cases for the week: 70 (compared to 61 the previous week).\nTotal lab-confirmed cases to date: 20,949 (compared to 1,577 at the same time last season and a 8,424 prior 5-year average during the same week).\n\nMore Information\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230223.16.12.32"}