{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Active Tuberculosis Reported in Chula Vista Elementary School District", "description": "Students and staff in the Chula Vista Elementary School District (CVESD) may have been exposed to tuberculosis (TB) while attending Fred H. Rohr Elementary School during summer and fall 2022 sessions, the San Diego County Health and Human Services Agency (HHSA) announced today.", "datePublished": "2022-11-09T15:01:31-08:00", "url": "https://www.countynewscenter.com/active-tuberculosis-reported-in-chula-vista-elementary-school-district/", "keywords": ["health", "tuberculosis"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-11-09T15:01:31-08:00", "articleType": "article", "articleContent": "\nStudents and staff in the Chula Vista Elementary School District (CVESD) may have been exposed to tuberculosis (TB) while attending Fred H. Rohr Elementary School during summer and fall 2022 sessions, the San Diego County Health and Human Services Agency (HHSA) announced today.\nThe Chula Vista Elementary School District was made aware of the exposure to students at Rohr Elementary during the week of November 7.\nHHSA Public Health Services and Chula Vista Elementary School District officials have worked in close collaboration to identify and notify those with a higher risk of exposure to tuberculosis and will be providing no-cost testing to individuals at increased risk for infection. The period of potential exposure is from June 27, 2022, to August 26, 2022, at Fred H. Rohr Elementary School.\nTuberculosis is an airborne disease that is transmitted from person to person through inhalation of the bacteria from the air. Chances of infection are higher for people with frequent and prolonged indoor exposure to a person who is sick with TB.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. Some who become infected with tuberculosis will become ill at some point in the future, sometimes even years later. Blood tests and skin tests are effective to determine whether someone has been infected. All those notified of a high risk of exposure are encouraged to receive no-cost testing.”\nTreatments are available that are effective in preventing people infected with tuberculosis from getting sick and in curing people who are sick from active TB. It is especially important for individuals with symptoms of active TB and those who are immune-compromised to see their medical provider to rule-out active tuberculosis, and after excluding active TB, to discuss preventative treatment.\nIndividuals who would like more information on this potential exposure should call:\n\nChula Vista Elementary School District (619)425-9600\nCounty TB Control Program at (619) 692-8621\n\nThe number of annual TB cases in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 201 cases reported in 2021 and 192 in 2020. As of the end of September, a total of 126 cases have been reported for this year so far.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221109.15.01.31"}