{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Safe Gun Storage Ordinance Takes Effect February 25", "description": "The County of San Diego ordinance requiring that all guns be safely stored takes effect Feb. 25, 2022. It requires all guns in homes or structures near a home to either be secured with a trigger lock or be locked away in a container. The only exception is if the firearm is within the immediate control of an authorized person.", "datePublished": "2022-02-11T11:57:20-08:00", "url": "https://www.countynewscenter.com/safe-gun-storage-ordinance-takes-effect-february-25/", "keywords": ["public safety", "ghost guns", "gun", "gun storage"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-02-11T14:56:52-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego ordinance requiring that all guns be safely stored takes effect Feb. 25, 2022. It requires all guns in homes or structures near a home to either be secured with a trigger lock or be locked away in a container. The only exception is if the firearm is within the immediate control of an authorized person.\n“Safe firearm storage saves lives and prevents gun violence,” said Nathan Fletcher, Chair of the San Diego County Board of Supervisors. “Last year we introduced the measure. Earlier this year the rules were finalized, and now we’re delivering on our promise. The common-sense, safe storage guidelines that go into effect in our unincorporated areas will keep families safe, especially children.”\nActing Sheriff Kelly Martinez said, “Gun locks are an important safety measure that can provide critical time between someone having an impulse and taking action.”\nSafe gun storage helps protect San Diegans.\nClose up of 38 caliber revolver hand gun with safety trigger lock.\nData from the Centers for Disease Control and Prevention shows 117 children and teenagers were unintentionally killed with firearms, and more than 1,160 children and teenagers took their own lives by using firearms in the United States in 2019. In that same year, 54 children and teens died by suicide in California due to the use of firearms. Studies have demonstrated the risk of suicide is higher in homes where a firearm is kept loaded or unlocked.\nThe ordinance applies to all unincorporated areas of San Diego County.\nThe safe storage of guns was part of an ordinance passed Jan. 25, 2022 that also regulates non-serialized firearms and non-serialized pre-cursor firearm parts commonly known as ghost guns.\nAn open gun safe showing weapons inside.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220211.11.57.20"}