{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Awarded Grant for Bicycle and Pedestrian Safety Program", "description": "The County Health & Human Services Agency, Department of Homeless Solutions and Equitable Communities has received a $125,000 grant from the California Office of Traffic Safety to improve the safety of bicyclists, pedestrians and scooter riders.", "datePublished": "2021-11-15T15:52:00-08:00", "url": "https://www.countynewscenter.com/county-awarded-grant-for-bicycle-and-pedestrian-safety-program/", "keywords": ["health", "bike grant", "ots", "pedestrian safety", "scooter grant"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-11-15T15:55:47-08:00", "articleType": "article", "articleContent": "\nThe County Health & Human Services Agency, Department of Homeless Solutions and Equitable Communities has received a $125,000 grant from the California Office of Traffic Safety (OTS) to improve the safety of bicyclists, pedestrians and scooter riders.\n“Our roads are increasingly riskier for people who walk or ride their bike,” OTS Director Barbara Rooney said. “The goal of this funding is to reverse the growing trend of bicyclist and pedestrian-involved crashes by educating the public on safe road behaviors.”\nGrant funds will pay for a comprehensive safety program that will teach valuable skills for all types of road users. They include:\n\nEducation and outreach social media campaign to engage an expanded audience on safety and active transportation topics.\nParticipation in State and National campaigns, such as National Walk to School Day and California’s Pedestrian Safety Month.\nCommunity, senior center, and school education presentations on safest bike/walking practices, with a focus on the benefits active transportation provides on health, community, and climate change.\nWalking Field Trips that educate youth and older adults on safe walking habits.\nParticipation in “Open Streets” events promoting alternate transportation options.\nBicycle and scooter skills and training courses that educate on safe riding behaviors.\nPresentations at stakeholder meetings focused on active transportation to share best practices and increase collaboration.\n\nThe services, which will run through Sept. 30, 2022, will be provided by Circulate San Diego.\nThis safety campaign aligns with Live Well San Diego, the County’s vision for healthy, safe and thriving residents and communities.\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\nFor more information, contact Colin Parent from Circulate San Diego at 619-567-6856.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211115.15.52.00"}