{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Get a COVID-19 Vaccine for a Shot at Padres Tickets", "description": "San Diegans who get vaccinated against COVID-19 can get a shot at winning a pair of tickets to attend a Padres game.", "datePublished": "2021-06-02T15:57:39-07:00", "url": "https://www.countynewscenter.com/get-a-covid-19-vaccine-for-a-shot-at-padres-tickets/", "keywords": ["health", "coronavirus", "covid-19", "padres", "ticket drawings", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-06-03T11:49:16-07:00", "articleType": "article", "articleContent": "\nSan Diegans who get vaccinated against COVID-19 can get a shot at winning a pair of tickets to attend a Padres game.\nThe County is teaming up with the baseball team to award 100 pairs of tickets to San Diegans. For a chance to win, you need to get vaccinated at a designated County mobile vaccination site June 3 through the end of June.\nYou can identify the clinics at coronavirus-sd.com/vaccine by the baseball logo next to the event and by following the County on social media.\nVaccines will also be provided to the public and Padres fans at Gallagher Square, formerly known as Park at the Park, on June 12 and June 26. People can sign up for the ticket drawing during the 15-minute wait period after vaccinated.\nTicket drawings will occur weekly. Winners will have the option to attend a Padres game in July or August.\nSan Diegans who get vaccinated before June 15 will also get a $50 gift card and an opportunity to win other prizes from state drawings taking place June 4, 11 and 15. Visit the state’s Vax for the Win for complete details.\nCounty Expected to Move to Yellow Tier\nThe County is expected to have a case rate of less than two cases per 100,000 people for two consecutive weeks. Doing so would allow it to move into the Yellow Tier for activities June 9, one week before the state’s tier system is retired.\nWhen the tier change goes into effect additional restrictions will be lifted. Here’s a complete list of activities allowed under the Yellow Tier.\nA teenager gets vaccinated the San Diego State University clinic.\nVaccination Progress:\n\nDoses delivered: Nearly 4.1 million.\nDoses administered: Close to 3.7 million.\nReceived at least one shot: Over 1.95 million or 69.7% of San Diegans 12 and older.\nFully vaccinated: More than 1.54 million or 55.1%.\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people.\nTo date, 92.9% of the goal population has received at least one vaccine and 73.5% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 1.7 cases per 100,000 residents, placing the County in the Yellow Tier for one week.\nThe County needs to have two weeks with a case rate of less than two cases per 100,000 residents to fully move into the Yellow Tier.\nThe testing positivity percentage is 1.3% and the County is in the Yellow Tier.\nThe health equity metric is 1.5%, placing the County in the Yellow Tier.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, June 8.\n\nCommunity Setting Outbreaks:\n\nTwo new community outbreaks were confirmed June 1 in restaurant/bar settings.\nIn the past seven days (May 26 through June 1), 11 community outbreaks were confirmed.\nThe community outbreaks trigger is seven or more in seven days.\n\nTesting:\n\n6,305 tests were reported to the County on June 1, and the percentage of new positive cases was 0.7%.\nThe 14-day rolling average percentage of positive cases is 0.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,700.\n\nCases, Hospitalizations and ICU Admissions:\n\n42 COVID-19 cases were reported to the County on June 1. The region’s total is now 280,346.\n15,412 or 5.5% of all cases have required hospitalization.\n1,706 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFour new deaths were reported June 1. The region’s total is 3,760.\nThree men in their 60s with underlying medical conditions died on May 29 and one man in his 30s with no existing medical conditions died May 31.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210602.15.57.39"}