{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Polling Place Site Managers Needed for Nov. 3 General Election", "description": "The Registrar of Voters is seeking temporary full-time site managers to operate  assigned polling places for the Nov. 3 General Election. Site managers can earn $20 per hour.", "datePublished": "2020-08-28T08:30:24-07:00", "url": "https://www.countynewscenter.com/polling-place-site-managers-needed-for-nov-3-general-election/", "keywords": ["elections", "coronavirus", "covid-19", "nov. 3 presidential general election", "paid site managers", "polling place", "registrar of voters", "san diego county registrar of voters", "site managers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-08-28T08:55:17-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters is seeking temporary full-time site managers to operate assigned polling places for the Nov. 3 General Election. Site managers can earn $20 per hour.\nDue to the COVID-19 pandemic, polling places will be open for four days instead of one. The Registrar’s office will hire election workers rather than use volunteers because training is more extensive for the expanded time period.\nSite managers will be required to train and lead a staff while representing the Registrar of Voters in a professional, nonpartisan manner. The Registrar is seeking people who are team players, exhibit strong leadership skills and display flexibility, patience and the highest level of integrity at all times.\nSite managers are required to attend a paid five-day training program to learn how to run a polling place and train their election worker staff.\n\nFrom Sept. 28 to Nov. 2, site managers must work 8 a.m. to 5 p.m. Monday through Friday. The managers may be required to work more than eight hours a day during the week and may need to work some weekends during peak periods leading up to Election Day.\nOn Election Day, Nov. 3, site managers must work from 5:30 a.m. to 10 p.m.\n\nThe Registrar’s office is working with Public Health Services to ensure the health and safety of election workers and voters. Personal protective equipment and sanitation supplies will be provided to workers so they can conduct the election process safely.\nEnglish speakers who are bilingual in Spanish, Filipino, Vietnamese or Chinese are also needed. If you are fluent in one of these languages, be sure to indicate it on your application.\nSite manager applications are available online at sdvote.com. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200828.08.30.24"}