{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "3 San Diegans Die Daily from Opioid, Other Drug Overdoses", "description": "Since the onset of the COVID pandemic, rates of drug related overdose deaths in San Diego County have increased. In July and August numbers of overdose deaths were more than 50% higher than in February and March of 2020, with an average of about three people dying per day in the County.", "datePublished": "2020-09-25T16:03:34-07:00", "url": "https://www.countynewscenter.com/3-san-diegans-die-daily-from-opioid-other-drug-overdoses/", "keywords": ["health", "drug abuse", "fentanyl", "opioids", "overdoses"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-09-25T16:18:33-07:00", "articleType": "article", "articleContent": "\nSince the onset of the COVID pandemic, rates of drug related overdose deaths in San Diego County have increased. In July and August numbers of overdose deaths were more than 50% higher than in February and March of 2020, with an average of about three people dying per day in the County.\nCounty health officials are warning San Diegans of the dangers of using drugs and encouraging them to know what do to when an overdose occurs.\nIf you suspect someone has overdosed, the first thing to do is call 9-1-1. But when an overdose occurs and you are present, there is something else you can do: administer naloxone.\nWhat is naloxone?\nAccording to the Centers for Disease Control and Prevention (CDC), drug overdose continues to be the main cause of death among drug users.\nData from the CDC shows that in 2018, a total of 67,367 drug overdose deaths occurred in the United States. Opioids were involved in 46,802 overdose deaths in that same year, and two out of three opioid-involved overdose deaths involve synthetic opioids. \nThe problem appears to be getting worse. Preliminary data from the CDC show that rates of drug overdose death in 2019 were not only higher than in 2018, but around 5% higher than in 2017, which had been a record year for overdose deaths during the country’s ongoing opioid epidemic.\nGiven the opioid epidemic in the nation, many states across the U.S., including California, now have laws that allow pharmacists to dispense naloxone without a prescription.\nNaloxone is a potent life-saving medication that can rapidly reverse the effects of an opioid overdose and naloxone is available in many local pharmacies in San Diego County.\n“If you spend time with someone who uses drugs or are a drug user, the County strongly encourages you to carry naloxone with you,” said Dr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency.\n\nFentanyl Killing San Diegans\nBergmann in particular warned the public about illicit drugs in San Diego County being laced with the highly potent and often deadly drug fentanyl. According to local law enforcement, fentanyl can be found in all illicit drugs, including pills and powders sold as cocaine.\n“Given the presence of fentanyl in local drug supplies, San Diegans should avoid drugs purchased from the streets,” said Bergmann. “But if you’re using illicit drugs or pharmaceutical medications that weren’t prescribed to you by a doctor, make sure there is someone with naloxone nearby to administer it in case you overdose.”\nIn 2019, San Diego County recorded 152 fentanyl-related overdose deaths. Through the first week of August of this year, 233 fentanyl-related deaths have already been noted. The deaths this year are nearly three times the 79 deaths that occurred at the same time last year due to fentanyl toxicity.\nCurrent local trends in fentanyl overdose deaths may be compounded by stressors related to the COVID-19 pandemic, including restricted access to care, disruptions in usual drug supply routes and economic stressors leading to increased drug misuse.\nCounty health officials have asked the local medical community to increase access to naloxone to prevent fentanyl-related deaths. They’ve also stressed that medication assisted treatment, such as methadone and buprenorphine, is the most effective treatment for opioid use disorder and is recommended to reduce the risk of overdose.\nDrug Treatment Works\nThe County has inpatient and outpatient treatment services available throughout the region that can help San Diegans with substance use disorders.\n“People can and do recover from substance use disorder,” Bergmann said. “If you can get access to a phone, you can get access to treatment.”\nPeople seeking help should call the San Diego County Access and Crisis Line 888-724-7240 or 2-1-1 San Diego. Both resources are available 24 hours a day, seven days a week.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200925.16.03.34"}