{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens More Cool Zones in Rural Areas", "description": "The County has opened additional cool zones in rural areas to help residents beat the heat.", "datePublished": "2021-06-15T16:28:16-07:00", "url": "https://www.countynewscenter.com/county-opens-more-cool-zones-in-rural-areas/", "keywords": ["health", "avoid the heat", "cool zones", "heatwave"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-06-16T08:39:16-07:00", "articleType": "article", "articleContent": "\nThe County has opened additional cool zones in rural areas to help residents beat the heat.\nNine cool zones are now open in County libraries and community centers, some of which include extended and weekend hours.\nThe high temperatures are expected to last through the end of the week.  Residents, particularly in desert communities, are advised to stay cool, avoid activities that may cause overheating.\nHot temperatures can be particularly dangerous for seniors, and they are advised to stay home\nPlease note that regardless of vaccination status, anyone who enters a cool zone must wear a facial covering inside. This is in adherence to guidance from the Centers for Disease Control and Prevention.\nHealth officials recommend people do the following to avoid overheating:\n\nIf available, stay in an air-conditioned area during the hottest hours of the day\nWear light, loose-fitting clothing\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty\nTake cool showers\nNever leave a child, elderly person, or pet unattended in a car\nKeep pets cool in hot weather\nAvoid unnecessary hard work or activities outside during the hottest part of the day\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun\nAvoid using the oven to cook\n\nAn extremely high body temperature (103 or higher), dizziness, nausea, confusion, and headache are signs of heatstroke or exhaustion. If someone shows these signs, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature and continue cooling efforts\nDo not give the victim fluids to drink\n\nFor more information on extreme heat, visit the Centers for Disease Control and Prevention. For more information on the Cool Zones program as well as tips to stay cool at home, visit www.coolzones.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210615.16.28.16"}