{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Ballots Go Out to Registered Voters for  District One Special General Election", "description": "Over 370,000 ballots are on their way to registered voters in the County of San Diego’s First Supervisorial District for the July 1 special general election.", "datePublished": "2025-05-30T10:08:20-07:00", "url": "https://www.countynewscenter.com/ballots-go-out-to-registered-voters-for-district-one-special-general-election/", "keywords": ["elections", "d1 special general election", "election", "first supervisorial district", "july 1 special general election", "registrar of voters", "supervisorial district 1"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-05-30T10:08:20-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesOver 370,000 ballots are on their way to registered voters in the County of San Diego’s First Supervisorial District for the July 1 special general election.\nRegistered voters should receive their ballot the week of Monday, June 2. Some voters may receive theirs this weekend. The official ballot packet will also include an “I Voted” sticker.\nThe person elected will fill the district’s vacant seat for the remainder of the current term that ends in January 2029. Only those who live in the district can vote in the election.\nDistrict 1 runs from the Pacific Ocean to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The district includes the cities of Chula Vista, Imperial Beach, National City, and some communities within the City of San Diego, including Barrio Logan, East Village, Golden Hill and more. It also includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside, La Presa and parts of Spring Valley.\nIf you’re not sure if you live in District 1, you can look it up at sdvote.com.\n\nEarly voting begins Monday, June 2 at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m., Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nYou can vote from home and return your ballot through the mail – no postage needed – or to any of the Registrar’s official ballot drop boxes around the district starting Tuesday, June 3 through the final day of voting Tuesday, July 1.\nRemember to sign and date your return ballot envelope. You must sign your return envelope for your vote to be counted.\nVoters who return their ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nAdditional options to vote in person will begin Saturday, June 21, with the opening of seven vote centers. They will be open daily from 8 a.m. to 5 p.m. until the final day of voting, Tuesday, July 1, when 13 vote centers will be open 7 a.m. to 8 p.m.\nYou can find a vote center or an official ballot drop box near you inside your voter information pamphlet, or you can look up your pamphlet online with the View Voter Information Pamphlet (Sample Ballot) tool at sdvote.com.\nLearn more about voting in the District 1 special general election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250530.10.08.20"}