{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground to Build New Courts, Dog Park at Waterfront Park", "description": "County Board Chairwoman Nora Vargas and Parks and Recreation officials gathered Wednesday to break ground on some sporty additions to the Waterfront Park—a basketball court, pickleball courts, a dog park, exercise station, table tennis and more.", "datePublished": "2023-08-31T12:59:46-07:00", "url": "https://www.countynewscenter.com/county-breaks-ground-to-build-new-courts-dog-park-at-waterfront-park/", "keywords": ["parks and rec", "basketball", "pickleball", "recreation", "sports", "waterfront park"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-08-31T13:08:23-07:00", "articleType": "article", "articleContent": "\nCounty Board Chairwoman Nora Vargas and Parks and Recreation officials gathered Wednesday to break ground on a sporty new look for the County’s popular Waterfront Park—the additions of a basketball court, pickleball courts, a dog park, exercise station, table tennis and more.\nVargas said she was very excited to be at the groundbreaking and that the County had engaged the community to add new recreational opportunities that they would use and enjoy. She said she was personally excited about the addition of the dog-park and talked about the importance of parks to society overall.\n“I think that so many folks are on social media every day and people are looking at their phones…” Vargas said. “We need to talk to people more. We need to build more community. Because that’s the way we get to know each other and get to really work together. And I think that’s why parks are so important.”\nConstruction on the $3 million additions have already begun and the plan is to have the new amenities open for the public sometime in the spring of 2024.\nThe new facilities are being built on a lesser-used portion of the park. They will give big kids and adults the opportunity to join in the healthy fun that the Waterfront Park already offers families and younger children.\nIn addition to the basketball and pickleball courts and table-tennis area, the new features will include an off-leash dog zone with agility equipment, a five-feature outdoor exercise station, lighting and shaded seating.\nAt the same time, County Parks and Recreation Director Brian Albright said, the south portion of the park would continue to feature its existing garden, and three Torrey Pines trees there would be moved to the garden portion.\nVargas and Albright said the new amenities would continue to support the County’s goal of emphasizing equity. The new equipment and features would be free to all, including people who may not be able to afford gym memberships or local sports programs.\nThe County opened the $50 million Waterfront Park in 2014. The project transformed a longtime parking lot and a few old buildings into 12 acres of beautiful, tree-filled civic green space and recreational facilities that created an immensely popular attraction for local residents and tourists alike.\nThe park features a spectacular 830-foot-long water fountain where families and children play. The fountain runs the length of the park and includes 31 jets that shoot water arcs 10-feet-high into the air. The park’s southeast side also features lots of recreational equipment for families and youngsters, including slides, swings, a huge rope climbing ball, interactive art, picnic tables and more.\nFor more information about the County’s park system, go to the Department of Parks and Recreation’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230831.12.59.46"}