{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Program Sends Healthcare Help to Patients in Rural San Diego County", "description": "San Diego County Fire and Medical Care Services join forces to deliver healthcare to patients after they are discharged from Sharp Grossmont Hospital in rural communities.", "datePublished": "2023-10-06T16:21:44-07:00", "url": "https://www.countynewscenter.com/program-sends-healthcare-help-to-patients-in-rural-san-diego-county/", "keywords": ["government", "cal fire", "community", "county fire", "equitable", "grossmont healthcare district", "medical care services", "mountain empire school district", "public health nurse", "rural health discharge program", "san ysidro healthcare", "sharp grossmont hospital"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-10-06T16:27:06-07:00", "articleType": "article", "articleContent": "\nSan Diego County Fire and Medical Care Services join forces to deliver healthcare to patients after they are discharged from Sharp Grossmont Hospital in rural communities. The Rural Health Discharge Program provides a County Fire/CAL FIRE Paramedic Captain paired with a Public Health Nurse to provide care for patients returning home after hospitalization, with the goal of reducing hospital readmissions.\nResidents in more rural areas face increased challenges regarding access to healthcare.  In addition to having fewer primary care resources in the backcountry, the travel time from rural homes to healthcare facilities can be a barrier. To address this, a healthcare team visits recently discharged patients in their homes. The team provides services including:\n\nPatient education regarding their condition\nReview of discharge medications and how to take them\nAssistance coordinating healthcare appointments and follow up care\nReferrals to health and social care programs, like health insurance registration, food and transportation, and medical supplies\nSupplying no-cost smoke detectors, Knox boxes and providing vegetation clearance\nCompanionship and support for general well-being\n\nThe team follows patients for up to 30 days after they are discharged from the hospital to reduce the need for emergency transport and readmission to the hospital. By performing patient education and support in the home, patients’ conditions can be managed and issues are resolved at home.\nThe team is currently enrolling qualified patients who are discharged from Sharp Grossmont Hospital, and following them with visits to their home, or in some cases, to a skilled nursing facility. The program currently serves the communities of Boulevard, Campo, Descanso, Guatay, Jacumba, Pine Valley, Potrero and Tecate.\nCounty Fire, CAL FIRE, and Medical Care Services have teamed up with East County advocate groups including Sharp Grossmont Hospital, Grossmont Healthcare District, San Ysidro Healthcare, Mountain Empire School District, local tribes, and others to develop a program that addresses disparity of care in rural communities. The program is a pilot partially funded by the Grossmont Healthcare District and County Medical Care Services in collaboration with the County. The goal is to reduce hospital readmissions within the first 30 days while providing an equitable level of care as those living closer to the hospital and healthcare providers.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231006.16.21.44"}