{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Encouraged to Feel the Beat During ‘Love Your Heart’ Week of Action", "description": "The County of San Diego is joining forces with regional officials and community partners to ask San Diegans to check their blood pressure and take a step toward better heart health.", "datePublished": "2022-02-11T12:16:43-08:00", "url": "https://www.countynewscenter.com/san-diegans-encouraged-to-feel-the-beat-during-love-your-heart-week-of-action/", "keywords": ["health", "blood pressure checks", "live well san diego", "love your heart"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-02-11T12:16:43-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego is joining forces with regional officials and community partners to ask San Diegans to check their blood pressure and take a step toward better heart health. They held a virtual news conference today to promote the Love Your Heart Week of Action, which runs Feb. 12 through Feb. 20.\nNow in its 11th year, the Love Your Heart campaign uses the period around Valentine’s Day to encourage people to understand their blood pressure numbers and take steps to prevent hypertension.\nHeart disease is one of the leading causes of death in the United States, and hypertension is the most common comorbidity in people who have died from COVID-19 in San Diego County. Death certificates for nearly half of the COVID-19 deaths in the region listed hypertension as an underlying condition.\n“The impact of pre-existing heart disease has really come to the forefront in a very significant way during COVID-19,” said Chair Nathan Fletcher, County Board of Supervisors. “We have seen that people who are sickest with COVID-19 tend to have underlying health issues, with the most prevalent being high blood pressure.”\nHigh blood pressure is known as the “silent killer” because it may show no symptoms. However, hypertension puts people at an increased risk for heart disease and stroke, two of the top causes of death in the region. More than 4,000 San Diegans die annually from complications of hypertension.\n“The older you get, the greater your chances of developing high blood pressure,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Race, physical inactivity, obesity, a family history of hypertension, and smoking also put you at a higher risk of high blood pressure.”\nThis year, due to the ongoing COVID-19 pandemic, the number of sites offering blood pressure screenings will be more limited than in years past, but free educational and interactive heart health events will be available throughout the region and across the border in Mexico.\nSelect San Diego County Library branches and CVS pharmacy locations are offering onsite blood pressure screenings throughout the Love Your Heart Week of Action. The County and its partners also distributed 1,000 blood pressure monitors to San Diegans in communities where hypertension is most prevalent.\nLove Your Heart aligns with Live Well San Diego, the County’s vision for healthy, safe and thriving residents and communities.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220211.12.16.43"}