{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Up by Four; 65 New Cases Reported", "description": "Forty-four San Diegans have died from complications of COVID-19 after four more deaths were reported, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-10T17:06:26-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-up-by-four-65-new-cases-reported/", "keywords": ["health", "coronavirus", "four covid-19 deaths", "four deaths", "stay home"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-11T08:46:56-07:00", "articleType": "article", "articleContent": "\nForty-four San Diegans have died from complications of COVID-19 after four more deaths were reported, the County Health and Human Services Agency announced today.\nLike most of the people who have died from COVID-19, the four had underlying medical conditions. Two of the new fatalities were women and two were men.\n“Our sympathy and condolences go out to the family and friends of the four new victims, as well as to the loved ones of all of the people who’ve died from COVID-19,” said Eric McDonald, M.D., M.P.H., medical director of HHSA’s Epidemiology and Immunization Services branch. “People should continue to wash their hands frequently, stay home as much as possible, and wear a face covering when in public for essential tasks.”\nThe age, gender and race and ethnic breakdown of the 44 COVID-19 deaths reported is:\nAge:\n\n80 and older: 22\n70 to 79: 13\n60 to 69: 3\n50 to 59: 4\n20 to 29: 2\n\nGender:\n\n26 Men\n18 Women\n\nRace and Ethnicity:\n\n21 White\n10 Hispanic\n2 Asian\n1 Multiple races\n10 Unknown\n\nCounty COVID-19 Cases Now at 1,693\nSixty-five new COVID-19 cases were announced today, bringing San Diego County’s total to 1,693.\nOf San Diego County’s cases, 867 (51.2%) were men and 821 (48.5%) were women. The gender of five people is unknown. Of the reported cases, 374 (22.1%) have required hospitalization and 140 (8.3%) of the total number of cases had to be placed in intensive care. Forty-four (2.6%) have died.\nOther measures and resources to deal with COVID-19 include:\n\nMore than 23,000 tests have been administered to San Diegans.\n\n\nThe County has distributed more than 1.95 million personal protective equipment items to local health care providers, including nearly 800,000 N-95 respirators, nearly 377,000 surgical face masks and over 716,000 gloves.\nA total of 2,011 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,564 rooms for County Public Health Services use, 195 are occupied by 208 guests.\nOf the 447 rooms assigned to the Regional Task Force on the Homeless, 195 are being occupied by 321 people who are at higher risk of developing complications from COVID-19.\n\nFlattening the Curve Saves Lives\nCounty health officials urged San Diegans to continue heeding the public health guidelines to help flatten the pandemic curve and keep people from getting the virus and overwhelming the local health care system.\nPeople are not allowed to get together in groups at home or in public, if they don’t live in the same household. Officials indicated people should stay home and keep their distance from others to avoid getting sick and infecting friends or family.\n“What flattening the curve really means is we’re saving lives,” McDonald said.\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data will also be broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200410.17.06.26"}