{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "48 Ballot Drop Boxes Open for Nov. 7 Special Election", "description": "Starting Tuesday, Oct. 10, registered voters in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District and Rainbow Municipal Water District can return their mail ballot at any one of 48 official ballot drop boxes located around the districts.", "datePublished": "2023-10-10T11:08:51-07:00", "url": "https://www.countynewscenter.com/48-ballot-drop-boxes-open-for-nov-7-special-election/", "keywords": ["elections", "county registrar of voters", "fgg", "nov. 7 special election", "official ballot drop boxes", "runoff election nov. 7"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-10-10T11:08:51-07:00", "articleType": "article", "articleContent": "\nStarting Tuesday, Oct. 10, registered voters in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District and Rainbow Municipal Water District can return their mail ballot at any one of 48 official ballot drop boxes located around the districts.\nMail ballots are enroute to nearly 600,000 registered voters for the Nov. 7 special election and are expected to arrive this week. Only the voters who live in each of those districts can vote in their respective elections. If you’re not sure whether you reside in one of the following districts, you can look it up at sdvote.com.\nWhat do the Registrar’s official ballot drop boxes look like?\nThe Registrar’s official ballot drop boxes are red, white, and blue and feature the Registrar’s logo along with the County seal. All boxes are labeled “Official Ballot Drop Box” and constructed from high grade, heavy gauge stainless steel.\nEach ballot drop box is designed to prevent physical damage and unauthorized access to mail ballots. The boxes feature double-locking access doors, anti-pry door jambs, and other anti-theft construction measures. The Registrar’s ballot retrieval team is responsible for collecting ballots inside the box.\nHow do I return my ballot to an official ballot drop box?\nMark your ballot, seal your completed ballot inside your return envelope, date and sign your name on the return envelope, and return to one of the Registrar’s 48 official ballot drop boxes around the districts, or you can return it in the mail. Remember, your signature is required for your vote to count.\nThirty-nine official ballot drop boxes are located outdoors and are open 24-hours a day until 8 p.m. on the final day of voting, Nov. 7. Nine are located indoors and only available when the facility is open.  Check the location list or the locator tool for details.\nOn the final day of voting, Nov. 7, all of the Registrar’s official ballot drop box locations will be open from 7 a.m. to 8 p.m.\nHow do I vote in person?\nEarly voting began Monday at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nIf you prefer to vote early in person and avoid the possibility of long lines, select vote centers will open on Saturday, Oct. 28. You can vote at any vote center around the county.\nThe vote centers will be open daily from 8 a.m. to 5 p.m. until the final day of voting, Tuesday, Nov. 7, when 22 vote centers and the Registrar’s office will be open from 7 a.m. to 8 p.m.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online and get additional details at sdvote.com. You can also contact the Registrar of Voters at (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231010.11.08.51"}