{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands Pilot Shallow Rental Subsidy Program for Older Adults", "description": "The County is expanding a pilot shallow rental subsidy program for older adults to support an additional 160 older adults at risk of homelessness.  ", "datePublished": "2024-05-21T16:45:04-07:00", "url": "https://www.countynewscenter.com/county-expands-pilot-shallow-rental-subsidy-program-for-older-adults/", "keywords": ["housing", "older adult housing", "senior housing", "shallow rental subsidy program"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-05-21T16:58:18-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County is expanding a pilot shallow rental subsidy program for older adults to support an additional 160 older adults at risk of homelessness.  \nThe County of San Diego Department of Homeless Solutions and Equitable Communities’ program will provide at-risk San Diego County residents over 55-years-old with a $500 monthly rental subsidy for 18 months. The money will go directly to participants’ landlords. \nApplications can be submitted starting tomorrow, May 22. The participants will be selected at random. Those selected will join 222 households previously chosen for the original pilot program in early 2023, which was subsequently approved for expansion by the County Board of Supervisors. \n“We are grateful the County Board of Supervisors prioritized our seniors and allocated additional funds to ease the burden of our county’s older adults and grandparents,” said Barbara Jiménez, Community Operations Officer for the County’s Health and Human Services Agency. “This is an important part of the puzzle to prevent vulnerable populations from falling into homelessness.” \nThe County’s Aging Roadmap forecasts that San Diego’s 60 years or older population will grow to more than 910,000 people by 2030. The population 55 and older is expected to surpass 1.1 million. \nAccording to the 2023 We All Count Point-in-Time Count, people over the age of 55 make up 29 percent of the region’s unsheltered population. \nTo apply for the Shallow Rental Subsidy Program, you must: \n\nBe a San Diego resident 55 years or older at risk of homelessness. \nHave a household income at or below 50% of the Area Median Income. \nBe severely rent burdened, paying more than 50% of your income toward housing costs. \nHave a lease or rental agreement in your name and a landlord willing to participate in the program. \nNot be receiving funds from another rental subsidy program. \nSign consent forms to participate in the program and an evaluation. \n\nPeople who have questions about the program should email their full name and contact information to AHHSseniorprogram@equitablesolutions.com or call (619) 780-3684. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240521.16.45.04"}