{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Holiday Magic Needed to Help Houdini the Husky Disappear From the Shelter … And Reappear in a Special Dog Owner’s Home", "description": "Houdini, a 3-year-old neutered male husky, is looking for the best gift of all this holiday season: a forever home.", "datePublished": "2020-12-11T09:29:32-08:00", "url": "https://www.countynewscenter.com/holiday-magic-needed-to-help-houdini-the-husky-disappear-from-the-shelter-and-reappear-in-a-special-dog-owners-home/", "keywords": ["animals", "adopt pets", "das", "spirit fund"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-12-11T09:29:32-08:00", "articleType": "article", "articleContent": "\nHoudini, a 3-year-old neutered male husky, is looking for the best gift of all this holiday season: a forever home.\nDon’t just look at his handsome face and get mesmerized by his ice-blue eyes. That has happened too many times for him, seven times in fact – when people came in, fell in love with his looks and then returned him when they were unable to meet his needs as an active dog.\n“He just needs a patient, compassionate new owner that is willing to commit to addressing his special needs,” said Kelly Campbell, Director of the Department of Animal Services. “We here at the County of San Diego Department of Animal Services would like to find the perfect adopter or foster family for Houdini. It would have to be a person or persons who are active, experienced with the breed, experienced with dog training and willing to be dedicated to helping Houdini become the best dog that he can be.  We truly believe he has the potential to be an amazing addition to the family, if he could only find his perfect, devoted companion.”\nSo, what is his story? He earned his name at DAS after the first family to take him in, returned him for his uncanny ability to escape. He’d even jump out of a second story window taking the screen down with him. Houdini’s adventurous nature may also have given some of his previous owners the wrong impression. He had been returned several times because  he seemed unable to quickly form a bond with his new owner. But to be fair to Houdini, many of his adoptions were relatively short, most of them a matter of days Having been through six previous families, it is entirely possible Houdini viewed his adoptions as a mini adventure and his “home” as the shelter.\nDonald Davis, a supervising animal attendant who works with Houdini regularly, said he is not the same dog who jumped out of the window. Davis said he has mellowed out some since that occurred, but Houdini still has a lot of energy. Animal services officers call him an “extreme” husky, meaning he exhibits all his breed-specific traits which include being vocal, having a high energy level, having limited patience, and shedding a lot. His high energy level would be perfect for a running companion or someone with a large, fully enclosed and very secure backyard. He understands and responds to commands and would be trainable with the right person.\nIn fact, DAS has a trainer who has evaluated his personality and is willing to work with whoever adopts or fosters him at no cost to the adopter through the Spirit Fund,  which helps animals with veterinary or behavioral needs.\nDue to COVID-19 precautions, DAS is offering touchless adoptions. If you would like to submit your application to be considered to adopt or foster Houdini, please visit the DAS website www.sddac.com and follow the instructions to complete and submit an adoption or foster care application. Houdini’s digits are Kennel 51, Tag Number 969 and Animal Identification Number A1868183.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201211.09.29.32"}