{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Influenza Activity Slows as Flu Season Nears End", "description": "The County Health and Human Services Agency is reporting 136 new lab-confirmed influenza cases in the region, bringing the total case count for this season to 2,351.", "datePublished": "2022-04-20T10:52:48-07:00", "url": "https://www.countynewscenter.com/influenza-activity-slows-as-flu-season-nears-end/", "keywords": ["health", "flu", "flu update", "influenza"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-04-20T10:52:48-07:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is reporting 136 new lab-confirmed influenza cases in the region, bringing the total case count for this season to 2,351.\nNo new flu deaths have been reported. Influenza-related deaths remain at four for the 2021/2022 season.\n“Influenza activity appears to be slowing down, which is in line with the typical end of flu season in the region in April or May,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “However, people who are at higher risk of having serious complications from the flu should continue to take precautions to stay safe, including getting a flu shot, if they haven’t received one.”\nIndividuals at Higher Risk Include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe County will stop producing this season’s regular flu updates after next week, with the final report scheduled to be published on April 27.\nThe latest Influenza Watch Report from the County Health and Human Services Agency shows the following for the week ending April 16, 2022:\n\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 3% the previous week).\nLab-confirmed influenza cases for the week: 136 (compared to 120 the previous week).\nTotal lab-confirmed cases to date: 2,351 (compared to 773 at the same time last season and a 11,469 prior 5-year average during the same week).\nInfluenza-related deaths reported to date: 4 (compared to 2 at the same time last year).\n\nTips to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nDuring the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths. During the 2019-2020 flu season, more than 20,700 flu cases were reported and 108 San Diegans died from influenza.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220420.10.52.48"}