{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Board of Supervisors Approve Anti-Tobacco Grant Funding", "description": "Strengthening efforts to prevent youth smoking, today the San Diego County Board of Supervisors approved the acceptance of more than $1.6 million in funding from the California Department of Justice Tobacco Grant Program. The grant will fund enforcement-related activities ensuring businesses in unincorporated San Diego County follow the proper protocols required to maintain their license to sell tobacco products.", "datePublished": "2023-04-04T12:03:50-07:00", "url": "https://www.countynewscenter.com/san-diego-county-board-of-supervisors-approve-tobacco-grant-funding/", "keywords": ["health", "health", "smoking", "tobacco"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-04-04T12:30:51-07:00", "articleType": "article", "articleContent": "\nStrengthening efforts to prevent youth smoking, today the San Diego County Board of Supervisors approved the acceptance of more than $1.6 million in funding from the California Department of Justice Tobacco Grant Program. The grant will fund enforcement-related activities ensuring businesses in unincorporated San Diego County follow the proper protocols required to maintain their license to sell tobacco products. \nThe funds will be distributed over three years, ultimately reducing the opportunity for kids to illegally purchase tobacco products. The money will allow more staff to conduct decoy operations to test tobacco retailers, ensuring they do not sell to youth or sell flavored tobacco products. It will also provide educational outreach to businesses. \n“This funding is vital to continue work to reduce smoking and protect the next generation of San Diegans,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Smoking is one of three behaviors that lead to a significant number of deaths in our community, and we want to do everything in our power to keep children and others from becoming addicted.” \nAll eligible businesses were visited at least once during fiscal year 2021-2022 and more than 80% were out of compliance at the first visit. More than half sold tobacco products to an underage decoy and nearly a third sold prohibited items or were not following the minimum price or minimum pack size requirements. \nThe funding will also go toward developing a new data management system to track license applications, payments and level of compliance. It will also be used to create a multi-agency tobacco retail licensing task force to identify and address local enforcement issues. \nThe funding comes as smoking is the leading cause of preventable death in the United States, including in California. In 2022 the County of San Diego lost 4,000 people to smoking-related illnesses. This is one of three behaviors that contribute to four chronic conditions resulting in nearly half of all deaths in San Diego County, also known as the 3-4-45 principle. This is a significant stride compared to 20 years ago. To date, and due in part to the County’s efforts, the region has seen a 17 percent reduction in the percentage of deaths associated with preventable death threats. Tuesday’s approval is another step toward building a healthier San Diego where everyone has the opportunity to Live Well. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230404.12.03.50"}