{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Issues New EBT Chip Cards to Avoid Fraud", "description": "The County’s CalFresh, CalWORKs, and General Relief recipients will receive new security-enhanced benefit cards.", "datePublished": "2025-02-18T16:43:49-08:00", "url": "https://www.countynewscenter.com/state-issues-new-ebt-chip-cards-to-avoid-fraud/", "keywords": ["government", "chip", "ebt", "equity", "rick wanne", "self sufficiency"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2025-02-18T16:43:49-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s CalFresh, CalWORKs, and General Relief recipients will receive new security-enhanced benefit cards.\nApproximately 405,000 County residents are eligible to use Electronic Benefit Transfer (EBT) cards. The most common ways benefits are stolen with the existing cards are skimming and scamming. Nearly 23,000 thefts were reported last year in San Diego County and hundreds of thousands statewide. \nThe new chip and other enhanced security features make the cards much less accessible to thieves and more difficult to steal benefits or reprint and use a fraudulent card elsewhere.\n“We are excited the State has made this change to protect our customers,” said Rick Wanne, director of County Self Sufficiency Services. “These benefits are essential for San Diegans on their path to self-sufficiency.” \nThe state is asking EBT recipients to check their mailboxes starting Feb. 25, 2025. When the new card arrives, activate it as soon as possible by using it at an eligible retailer. New cards must be activated within 180 days of receipt. \nAll recipients are encouraged to use their new EBT card by tapping or inserting the chip side of the card into a card reader when making a purchase, rather than sliding it. All benefits will automatically be transferred to the new card. Personal information and the pin number will remain the same. Be sure to destroy the old EBT card after receiving the new one. \nOther changes on the new chip EBT card include: \n\nAll personal information has been moved to the back side of the card. \nAn expiration date and Card Security Code have been added to increase security. \n\nThe expiration date is only for the card, not related to benefits. \n\n\n\nIf you have questions, please call the State’s EBT customer service helpline: (877) 328-9677. \nCalFresh customers use their EBT card to buy fresh produce and nutritious food at a variety of stores across the state. CalWORKs and General Relief customers use the cash aid to help them become more self-sufficient, whether that is paying for food, housing, clothes or other basic necessities. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250218.16.43.49"}