{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s the Most Recyclable Time of the Year!", "description": "It’s the most — recyclable — time of the year! Think about it. The holiday season brings all kinds of recyclable things into our homes, from wrapping paper and packages, to yes, even our Christmas trees if you’re using a real one.", "datePublished": "2021-12-17T08:22:45-08:00", "url": "https://www.countynewscenter.com/its-the-most-recyclable-time-of-the-year/", "keywords": ["environment", "lueg", "recycle", "recycling", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-12-17T08:22:45-08:00", "articleType": "article", "articleContent": "\nIt’s the most — recyclable — time of the year!\nThink about it. The holiday season brings all kinds of recyclable things into our homes, from wrapping paper and packages, to yes, even our Christmas trees if you’re using a real one.\nAnd these days, having blue bins for recyclable materials right at home, recycling is a snap. With that in mind and in keeping with the holiday spirit, the County’s Department of Public Works would like to give everyone a gift — some handy recycling tips, what to recycle and what not to put into your blue bins!\nRemember, don’t take a holiday from recycling!\nChristmas Trees\nIf you have a real Christmas tree, you’ll eventually have to bid it goodbye. The County urges you to recycle it the right way. Check with your waste hauler to find out if they offer curbside pickup; many do. You can also cut your real tree up and put it in your green organics bin or go to the County’s recycling and hazardous waste database WastefreeSD.org to find Christmas tree drop-off sites near you. Make sure to remove all ornaments, garland, lights, nails, tree bags, tree stands (metal or plastic) and tinsel before recycling.\nReal tree wreaths can also be recycled by placing them in your green organics bin. Leaving them lying in your backyard can turn them into fire hazards. Properly recycled trees and wreaths can be turned into mulch that will improve soil health and help soil retain moisture at our parks, farms, home gardens and landscapes.\nKnow What Packaging Can — and Can’t — be Recycled\nGift-giving and online shopping typically means collecting lots of packaging. Not all packaging can be recycled. For example, cardboard boxes can be recycled; just break them down and put them into your recycling bin. And non-metallic wrapping paper can go into your blue bin. But other items can’t — manila envelopes, padded plastic mailers and cushioning material, and traditional gift-wrapping materials including ribbons, bows, twine, tissue paper and cellophane. So please do not put them in your blue recycling bins; consider re-using them instead. Here’s a link to learn more about how to Recycle Right, during the holidays and every day.\nChristmas and Holiday Card Recycling\nLike packaging materials, not all holiday cards should be added to your recycling bin. Simple paper cards and envelopes can be added to your blue bins. But cards that have glitter, foil, metallic inks (inks made with tiny metal flakes) or other adornments can’t. If there’s a glitzy front and plain paper backing, tear the cards in two. Recycle the backs and put the glitzy fronts into the trash.\nHoliday Light Recycling\nPlease — don’t put old holiday lights in your recycling bins. They can tangle up recycling equipment and they also pose a danger to workers in those recycling centers. For recycling options, please visit WasteFreeSD.org, or contact a scrap metal or e-waste recycler.\nHere’s a pictorial list of what — and what not — to put in your blue recycling bins.\nSo there you have it. Remember, if you have other questions about what can and can’t be recycled, go to DPW Recycling’s webpage or to DPW Recycling’s Facebook page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211217.08.22.45"}