{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Alternatives to Incarceration Report Released, Your Input Needed", "description": "The County wants to hear from you on a new report with recommendations for programs and services to redirect people contacted for low level charges away from jails when there is not a threat to public safety.", "datePublished": "2023-04-27T11:32:23-07:00", "url": "https://www.countynewscenter.com/alternatives-to-incarceration-report-released-your-input-needed/", "keywords": ["government", "a data-driven approach to protecting public safety", "alternatives to incarceration", "homeless", "justice-involved", "sobering services", "virtual community listening session"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-04-27T11:32:23-07:00", "articleType": "article", "articleContent": "\nThe County wants to hear from you on a new report with recommendations for programs and services to redirect people contacted for low level charges away from jails when there is not a threat to public safety. A virtual community listening session on the report will take place on May 4, 2023 at 5:30 p.m. There are a number of other ways to comment including via comment card and or through public comment on the report during the May 23 Board of Supervisors meeting when the final report will be presented to the Board.\nOn April 25, 2023, the San Diego Association of Governments (SANDAG) released its final report outlining “A Data-Driven Approach to Protecting Public Safety,” the fifth and final installment of a project that aims to identify alternatives to incarceration in San Diego County.  The report looks at booking trends in County jails, analyzes data to answer the question of why the jail population dropped during the pandemic and interviews community stakeholders to assess how to meet the needs of at-risk individuals. The final report summarizes all information compiled for this project since 2021 and outlines 52 final recommendations drawn from data analysis and input from the project advisory group, working group and community members.\nSome recommendations made in the report include:\n\nIncrease the array of housing options for justice-involved individuals experiencing homelessness and reduce barriers to access, while ensuring that additional needs can be met concurrently.\nConsider additional booking alternatives that increase connection to services and resources for individuals who have contact with law enforcement and for those exiting detention facilities.\nBuild capacity for expansion and regionalization of sobering services.\nEnsure individuals are released from custody in ways that support successful reentry.\nWork to meet the health, behavioral health, and housing needs of the most vulnerable individuals both during and after incarceration.\nNurture an environment where there is an openness to objectively evaluate statistics and a constant desire for program improvement.\n\nA link to the full report can be found on the Alternatives to Incarceration project site.\nCommunity input is critical to informing the direction of the Alternatives to Incarceration project and will help the County ensure that the ongoing project responds to the needs of the community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230427.11.32.23"}