{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Hears from More Than 2,100 People on Impacts of Tijuana River Valley Sewage", "description": "A federal survey asking San Diegan who live, work or play around the Tijuana River Valley and South San Diego County closed with more than 2,150 responses received, exceeding the goal of 2,000 participants.  ", "datePublished": "2024-11-25T15:03:37-08:00", "url": "https://www.countynewscenter.com/county-hears-from-more-than-2100-people-on-impacts-of-tijuana-river-valley-sewage/", "keywords": ["health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-11-25T16:46:18-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA federal survey asking San Diegan who live, work or play around the Tijuana River Valley and South San Diego County closed with more than 2,150 responses received, exceeding the goal of 2,000 participants.  \nThe Assessment of Chemical Exposures (ACE) survey covered how the pollution impacted people’s lives. Results will be compiled by the federal Agency for Toxic Substances and Disease Registry and shared in the coming months. \nThe information collected within the surveys includes anecdotal stories about changes to everyday life, along with to physical and mental health, and will be used to determine what steps can be taken to address the sewage crisis with local, state and federal partners.  \n“The information from the survey is important to informing what needs to be done to address the sewage crisis,” said Dr. Ankita Kadakia, County Interim Public Health Officer. “We are so grateful to everyone who took the time to share their stories. It’s clear that not only physical health but also mental health has been impacted by these ongoing sewage issues.”  \nThe County opened the ACE survey on Oct. 21 in partnership with the Agency for Toxic Substances and Disease Registry which is a federal public health agency within the Centers for Disease Control and Prevention (CDC). It followed the CDC’s Community Assessment for Public Health Emergency Response or CASPER, a household survey focused on the Imperial Beach and Nestor communities that took place the weekend of Oct. 17.   \nTo generate interest in the survey, County teams did outreach at community events, through social media and newsletters, and with its partners in schools, businesses, health centers and community organizations.  \nMore information about the Tijuana River Valley sewage crisis is available on the County website, health information surround odors and water contamination and a report that shows recent trends of gastrointestinal illness and asthma or chronic obstructive pulmonary disease symptoms in the South San Diego area.  \nMental health resources are available for anyone feeling emotionally affected by the Tijuana River Valley sewage crisis through the San Diego Access Crisis Line by calling 1-888-724-7240 or 988.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241125.15.03.37"}