{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "One-Time $4,000 Grant Program Opens Monday For  Low Income Families Hurt By COVID-19", "description": "A couple thousand low-income San Diego County families and seniors hurt by the COVID-19 pandemic could receive $4,000 in cash to help them recover, County and Jewish Family Service leaders announced Friday.", "datePublished": "2023-05-05T12:35:00-07:00", "url": "https://www.countynewscenter.com/one-time-4000-grant-program-opens-monday-for-low-income-families-hurt-by-covid-19/", "keywords": ["families", "covid-19", "hhsa", "jewish family service"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-05-08T10:15:36-07:00", "articleType": "article", "articleContent": "\nA couple thousand low-income San Diego County families and seniors hurt by the COVID-19 pandemic could receive $4,000 in cash to help them recover, County and Jewish Family Service leaders announced Friday.\nThe one-time, $4,000 allocations are intended to help low-income people who live in the 39 county zip codes hit the hardest by COVID-19, particularly families and seniors who are at risk of becoming homeless.\nCounty Board Chairwoman Nora Vargas, County Health and Human Services Agency officials and leaders from Jewish Family Service of San Diego announced the application period for the “RAFT” funds open Monday, May 8, at a press conference at the County Administration Center Friday.\n“I noted in my State of the County Address in February,” Vargas said, “that at the height of the pandemic, I heard firsthand about the hardships people were going through as they tried to make ends meet and stay in their homes. We know that struggle continues for many. We want this money to help people overcome those hardships.”\nThe Recovery Action Fund for Tomorrow (RAFT) program was developed by Jewish Family Service and funded by the County with federal American Rescue Plan Act funds. To be eligible, people and families must earn less than 200% of the federal poverty level, which ranges from $29,160 a year for a single person to $60,000 for a family of four.\nFamilies and people can apply for the funds from May 8 through midnight, Sunday, May 21. Officials said 2,250 families or people will be selected randomly from the pool of applicants by Jewish Family Service to receive the money.\nThose who receive the $4,000 allocations can use them as they see fit on their most urgent needs and they do not have to pay the money back. The money can be electronically transferred directly into people’s bank accounts, Venmo/PayPal accounts or gig work platforms.\n“At Jewish Family Service we are already seeing immense benefits from a similar program we launched last year,” said Khea Pollard, director of Economic Mobility And Opportunity for Jewish Family Service. “We know that direct cash assistance programs are a very effective and efficient way to reduce poverty and increase equity in our communities and we look forward to working on RAFT with the County.”\nApplicants will need to submit documents to show they are eligible, including their identification and proof of household income levels. Documents can include driver’s licenses, passports, green cards or state ID’s, 2020 or 2021 tax returns, social security documents or enrollment paperwork for assistance programs like CalFresh or Temporary Assistance for Needy Families (TANF). People can get full information about the program, find out if they are eligible and apply on the Jewish Family Service web page starting Monday.\nNick Macchione, director of the County’s Health and Human Services Agency, said the County hopes the RAFT funding can be a lifeline.\n“This one-time cash payment can be life changing for those recovering from the pandemic,” Macchione said. “This can help families, seniors, and our most vulnerable neighbors secure permanent housing, invest in reliable transportation, or get over an economic hurdle.”\nFor more information about the program, go to the Jewish Family Service website starting Monday, May 8.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230505.12.35.00"}