{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More than 5,000 Run or Walk to Build Better Health at Live Well San Diego 5K", "description": "More than 5,000 participants ran and walked through and around the County Waterfront Park Sunday morning for the Live Well San Diego 5K, and Kids 1-Mile Fun Run presented by San Diego County Credit Union and in partnership with 211 San Diego. ", "datePublished": "2022-09-18T14:36:17-07:00", "url": "https://www.countynewscenter.com/more-than-5000-run-or-walk-to-build-better-health-at-live-well-san-diego-5k/", "keywords": ["health", "5k", "live well san diego"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-09-18T14:36:17-07:00", "articleType": "article", "articleContent": "\nMore than 5,000 participants ran and walked through and around the County Waterfront Park Sunday morning for the Live Well San Diego 5K, and Kids 1-Mile Fun Run presented by San Diego County Credit Union and in partnership with 211 San Diego.  \nThe free annual event, on in-person hiatus for the past two years due to the pandemic, saw its largest participation ever today, doubling previous years’ numbers.  \nRunners, walkers and participants of all ages enthusiastically hit the pavement off the starting line, some pushing strollers or joined by their four-legged best friend.  \nThe Live Well San Diego 5K encourages everyone to get outside and move as part of Live Well San Diego’s visions for a region that is Building Better Health, Living Safely, and Thriving. \n“It’s amazing to see so many people out here today who share a common goal,” said Nick Macchione, Agency Director, County Health and Human Services Agency. “We want everyone to be able to lead a life of health and wellness and everyone participating today is helping to set an energetic pace for all 3.3. million in San Diego County.” \nAwards were presented to top finishers and every participant received a finishers medal and commemorative t-shirt.  \nA community expo following the race featured food and coffee trucks, kids’ activities and yard games and dozens of exhibitors featuring informational and resource booths for community members.  \nTo learn more about Live Well San Diego, visit the website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220918.14.36.17"}