{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "May is CalFresh Awareness Month!", "description": "May is CalFresh Awareness Month in California and the County of San Diego County and our community partners are celebrating. ", "datePublished": "2023-05-01T09:37:54-07:00", "url": "https://www.countynewscenter.com/may-is-calfresh-awareness-month-2/", "keywords": ["health", "calfresh", "health", "nutrition", "self sufficiency", "snap"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-05-01T09:37:54-07:00", "articleType": "article", "articleContent": "\nMay is CalFresh Awareness Month in California and the County of San Diego, with our community partners, are celebrating. \nSeveral community events are scheduled throughout the month of May to provide people with information about CalFresh and offer free, in-person eligibility and application help to determine if they are eligible. A full list of the free events is available online on the County’s CalFresh website. \n“CalFresh is a safety net for many of our neighbors and we see how it helps people every day,” said Rick Wanne, director of San Diego County Self Sufficiency Services. “We are seeing more families enroll as they navigate inflation and the housing crisis. We want to make sure everyone eligible signs up and receives this nutritious benefit.” \nCalFresh is California’s federal food assistance program, California’s version of the U.S. Department of Agriculture’s Supplemental Nutrition Assistance Program (SNAP). It is designed to increase access to fresh and healthy food. The program also aligns with the County’s Live Well San Diego commitment to healthy, safe and thriving communities. Over the past decade enrollment to CalFresh has climbed 68% and as of April 2023 it was serving 375,928 San Diegans. \nPeople can find out if they qualify for CalFresh anytime by calling call 2-1-1 or applying online at GetCalFresh.org or www.mybenefitscalwing.org. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230501.09.37.54"}