{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches Leave No Veteran Homeless Initiative", "description": "The County of San Diego has teamed up with regional, state and federal partners to develop a plan to achieve functional zero for veteran homelessness in the county. ", "datePublished": "2023-07-06T13:04:03-07:00", "url": "https://www.countynewscenter.com/county-launches-leave-no-veteran-homeless-initiative/", "keywords": ["veterans", "leave no veteran homeless", "veteran", "veterans"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-07-06T15:54:31-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego has teamed up with regional, state and federal partners to develop a plan to achieve functional zero for veteran homelessness in the county. \nThe launch of the Leave No Veteran Homeless initiative comes in response to a unanimous vote by the County Board of Supervisors on February 7th affirming the desire to lead a regional effort to house veterans across San Diego County.  \n“This will be a lifeline to many of our veterans who are experiencing homelessness,” San Diego County Board Chairwoman Nora Vargas said. “In February I was very proud to bring this policy to the County Board of Supervisors to create a plan to end regional veterans’ homelessness.”\nThe new strategic plan aims to achieve “Functional Zero”, a milestone associated with the national Built for Zero movement. The milestone is defined as a time when veteran homelessness is rare, brief and non-reoccurring. At functional zero every unhoused veteran has the opportunity and support to gain permanent housing.  \n“We’ve seen success in the built for zero model across the country and here in California,” said Dr. Eric McDonald, interim director of County of San Diego’s Health and Human Services Agency. “We are committed to getting our veterans the help they need to get back on their feet and provide the opportunity for them to live well.” \nWhile many veterans experiencing homelessness receive case management and rental assistance they report struggling to compete in the tight rental market. To help address this challenge, landlords with vacant units are encouraged to register their interest in providing a rental to a homeless veteran at Help End Homelessness – 211 (211sandiego.org). To learn more about incentives for landlords and other resources available to veterans searching for housing visit NoVeteranHomeless.org. \nThe County is also encouraging municipalities to allocate resources to support the outreach, engagement, shelter and permanent housing. This could include contributing to the regional Flexible Housing Pool to help veterans secure permanent housing. \nAnd community members can support these efforts by learning more about the resources available to veterans, advocating to your landlord to rent to a voucher-holding veteran and encouraging their city to support the Flexible Housing Pool. \nLead by the County’s Department of Homeless Solutions and Equitable Communities, the initiative leverages coordinated and collaborative regional, state and federal partnerships to maximize available resources. The collaborative effort includes County departments like the Department of Homeless Solutions and Equitable Communities, Office Military and Veterans Affairs, Housing and Community Development Services along with regional, state and federal partners like the Regional Task Force on Homelessness, U.S. Department of Veterans Affairs, San Diego Housing Commission, City of San Diego, City of Oceanside, Veterans Village of San Diego, 211, People Assisting the Homeless (PATH), Adjoin, San Diego Veterans Coalition, Courage to Call, Interfaith Community Services, Brilliant Corners and others.  \n“Together we are simplifying pathways to housing, leveraging resources and collecting data to ensure we reach functional zero”, said Tamera Kohler, CEO of the Regional Task Force on Homelessness (RTFH). “To do that we need the help of our community, especially landlords who can open their doors to our heroes.”  \n“With initiatives such as this dedicated community effort, we will continue to move ahead in addressing this pressing need and challenge,” said Dr. Frank Pearson, CEO and director of the VA San Diego Health Care. “We look forward to working with dozens of partners to achieve functional zero veteran homelessness throughout San Diego and the surrounding area.” \nThe VA helped Veteran Fred Otto find housing, with support from the County’s Housing and Community Development Services.\n “The joy of knowing that if other homeless veterans, if they want it, they can get help,” Otto said. “My cats and I are very happy and thankful to the VA and to the housing commission for giving me my life.”\nTogether the partners developed a comprehensive framework that establishes desired outcomes and the key actions needed to achieve them. This initiative is also closely aligned with the County’s core values of integrity, belonging, excellence, access, sustainability, and equity and supports County’s Framework for Ending Homelessness.  \nIn the last few years, the region has seen success in reducing veteran homelessness, with the number of unhoused veterans dropping 27% from 2020-2022, according to RTFH. Despite these successes, the County and its partners recognize that a more comprehensive and urgent approach is needed to accomplish the goal of ending veteran homelessness.  \nDespite their dedication to our country, many veterans experience challenges and difficulties, like processing trauma from their time in service and re-adjusting to society.  \nYou can join the County and its partners in these efforts in many ways.  Learn more at NoVeteranHomeless.org. Get involved or learn more on the Leave No Veteran Homeless Engage San Diego County page.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230706.13.04.03"}