{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday Last Day to Return Mail Ballot in Fallbrook Union High School District Special Election", "description": "Tuesday, Sept. 19 is the final day to return your mail ballot in the Fallbrook Union High School District Special Election.", "datePublished": "2023-09-18T08:32:16-07:00", "url": "https://www.countynewscenter.com/tuesday-last-day-to-return-mail-ballot-in-fallbrook-union-high-school-district-special-election/", "keywords": ["elections", "fallbrook union high school district special election", "fallbrook union high school district trustee area one", "fgg", "registrar of voters", "sept. 19 special election"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-09-18T12:32:21-07:00", "articleType": "article", "articleContent": "\nTuesday, Sept. 19 is the final day to return your mail ballot in the Fallbrook Union High School District Special Election.\nIf you live in the district and are still holding onto your ballot, act now and vote from the comfort of home. Sign and date your return envelope, seal your ballot inside and return it by mail – no postage needed – or to one of the Registrar’s official ballot drop boxes listed below. If you are dropping off your ballot, it must be returned by 8 p.m. on Sept. 19.\n\n\n\nOfficial Ballot Drop Box Locations\nHours of Operation\n\n\nFallbrook Branch Library\n124 S Mission Rd\nFallbrook – 92028\nOpen 24 hours daily up until 8 p.m. on Election Day, Sept. 19\n\n\nFallbrook Regional Health District Community Health & Wellness Center\n1636 E Mission Rd\nFallbrook – 92028\nOpen 9 a.m. – 5 p.m. Monday\nOpen until 8 p.m. on Election Day, Sept. 19\n\n\n\nBallots returned by mail must be postmarked on or before Election Day, Sep. 19 and received by the Registrar’s office no later than Tuesday, Sept. 26 to be considered timely cast. Voters who return their ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nThis is a vote by mail election, but if you need to vote in person, you can do so at the Registrar of Voters office in Kearny Mesa from 8 a.m. to 5 p.m. Monday, Sept. 18. On the final day of voting, Sept. 19, the Registrar’s office will be open from 7 a.m. to 8 p.m.\nOnly those who live in the district can vote in the election. If you’re not registered to vote and want to participate in the election, you may visit the Registrar’s office to conditionally register and vote provisionally through Sept. 19.\nOnce the voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the district, the voter registration becomes active and the provisional ballot is counted.\nThe person elected will fill Trustee Area One’s vacant seat for the remainder of the current term ending December 2026. Only those who live in the district can vote in the election. Check your district at sdvote.com.\nOn election night, the first set of unofficial election night results will come in shortly after 8 p.m. This update will include mail ballots received before Election Day.\nAfter the first unofficial report, there will be no additional updates election night. The next release of unofficial results is scheduled to be posted by 5 p.m. on Friday, Sept. 29. Additional updates will occur at the discretion of the Registrar of Voters.\nHowever, the results must be certified by Oct. 19. For this special election, certification may occur on an earlier date. All updates will be posted on sdvote.com with the final certified results posted by Oct. 19.\nLearn more about voting in the Fallbrook Union High School District Trustee Area One Special Election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230918.08.32.16"}