{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adopts $7.36 Billion Budget", "description": "The San Diego County’s Board of Supervisors unanimously approved a $7.36 billion 2022-23 budget Tuesday.", "datePublished": "2022-06-28T15:21:08-07:00", "url": "https://www.countynewscenter.com/?p=208855", "keywords": ["government", "adopted budget", "affordable housing", "behavioral health", "climate change", "community engagement", "enhancing communities", "equity", "equity and access", "homelessness", "housing", "justice reform", "substance use support", "supporting families", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-06-29T08:30:07-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors unanimously approved a $7.36 billion 2022-23 budget Tuesday.\nThe new budget builds on commitments to address mental health, homelessness, equity, racial justice and climate change, while upholding essential public safety, land use and social services.\nBoard Chair Nathan Fletcher thanked the public for its input, feedback and participation in numerous budget meetings and hearings. Citing the County’s motto, “the noblest motive is the public good,” Fletcher said the Board recognized its fundamental role in keeping the community safe from crime and emergencies like wildfires, but that the County was also making record investments in other essential services.\n“I believe that our fiscal year 2022-23 budget is a reflection of values,” Fletcher said. “At the end of the day, that’s what budgets are. They’re not just buckets of money. They are a reflection of values and prioritizations and recognizing the needs of the community.”\nThe $7.36 billion budget the Board adopted Tuesday is $208 million larger than the budget the County recommended in May. It is 1.8%, larger than the County’s 2021-22 budget.\nSome additions to the recommended budget that increased the final spending plan included added money for labor costs based on negotiations; for six additional capital improvement projects; to buy a twin-engine firefighting helicopter; and for a pilot program to retrofit, harden and create defensible for homes in high fire-risk areas. There is also additional spending for new vehicles and added staff for law enforcement.\nThe final adopted budget makes investments in several key areas:\nMental Health and Substance Use Support\nThe new budget adds $71.8 million and 115 new positions to help continue County efforts to transform its behavioral health system, from crisis response to prevention, continuous care to keep people connected and healthy.\nThe budget continues to improve services to help people with mental health challenges and substance use disorders, focusing on those who have historically suffered silently, including people experiencing homelessness and youth.\nThe budget supports the County’s Mobile Crisis Response Teams that send mental health experts rather than law enforcement to respond to people in crisis when appropriate.\nThe budget also includes a wide variety of resources to match the right type of care with the person in need — things such as recuperative care, school-based services, services for foster youth, people in long-term care services and the LGBTQ community.\nHomelessness and Housing\nTo continue efforts to make significant progress to end homelessness, the budget combines mental health and substance use support with investments in innovative housing.\nIncreased investments include $11.9 million from one-time stimulus funds to develop affordable housing to reduce homelessness.,\nAs part of the new budget, in March, County Supervisors approved making an additional $10 million available to cities to buy shelters and places to stay for people experiencing homelessness. One recent partnership with the Lucky Duck Foundation and the City of San Diego will result in a 150-bed emergency shelter opening this summer.\nAnother $3 million will be used to create more affordable housing for residents by waiving permit fees to encourage building accessory dwelling units. In addition, $810,000 will be spent to create an inclusionary zoning ordinance that will require new development to include housing that people at or below median income levels can afford.\nJustice Reform\nThe new budget continues County programs to shift its justice system toward prevention, rehabilitation and training to help people avoid justice involvement and successfully come back to their communities after custody. This includes the Alternatives to Incarceration initiative. The initiative supports alternatives to jail and provides services and care, including mental health and sobering services, for people who don’t pose a public safety threat.\nMore than $130 million is invested in health care services in the County’s jails to help offenders.\nRoughly $6.2 million will be spent on a Youth Development Academy to help young people who have committed serious offenses by giving them more intensive, longer-term behavioral health, rehabilitative and skill-building services to help them come back to our communities.\nCounty Probation will use $1 million toward de-escalation training for their staff, supporting the young people they supervise.\nThe Juvenile Diversion Initiative and Transitional Age Youth Diversion program in the District Attorney’s office will be bolstered with $2.4 million, to give juveniles the opportunity to accept services and counseling instead of prosecution.\nThe Public Defender’s Office will add $21.8 million and 90 staff to defend clients, represent immigrants and the indigent in our neighborhoods, and improve transitions back into communities.\nThe District Attorney will use $3.5 million and add 18 positions to expand services to victims of crime, including the South Bay Center for Community Resiliency and Trauma Recovery, and a resentencing program.\nEquity and Access\nThe new budget also continues efforts to weave equity into all County programs and services.\nThe County Office of Equity and Racial Justice has implemented its new Budget Equity Assessment Tool that helps County departments prioritize services and allocations with equity in mind. The tool uses a series of questions to better understand how allocations affect historically marginalized vulnerable communities, those who are low-income or those who have historically and currently suffer from inequality.\nThe tool also incorporates community engagement, an important cornerstone of the County’s operations that will be expanded in this budget to provide opportunities for all community members to play meaningful roles in discussions and decision-making.\nIncreased translation and interpretation services will provide greater access to services and information.\nA new Office of Sustainability and Environmental Justice is funded with $3.6 million and work to make sure all communities have the same protection from health hazards.\nAnd the San Diego County Office of Labor Standards and Enforcement will serve as the central location for education and resources for employers and their workers. It will undertake research and data analysis regarding worker issues and pursue enforcement measures to protect workers.\nSustainability and Fighting Climate Change\nClimate change is already affecting San Diego County communities and the County is working hard to address the issue through reducing greenhouse gas emissions and increasing sustainability.\nMore than $25 million will be invested to cut greenhouse gas emissions in our unincorporated communities, including $1 million to support electric vehicle charging stations.\nNearly $60 million will be spent on other environmental improvements, including $40 million to address stormwater issues, $16.3 million on the Multiple Species Conservation Program and $3.4 million to improve the Tijuana River Valley.\nGreen building and solar energy will be promoted by waiving an estimated $2.1 million in permit fees. More than 3,500 trees intended to trap more than 178,000 pounds of carbon dioxide a year will be planted around the county.\nGreenhouse gas emissions will be reduced — while equitable access to health care is boosted — by allocating $2 million to buy two additional Live Well on Wheels vehicles and a new mobile public health lab that can bring services to residents rather than requiring them to travel individually to health offices.\nSupporting Families\nThis budget also includes additional funding and positions to focus on the day-to-day needs of residents at home and at work, especially the most vulnerable.\nIn-Home Supportive Services for older adults and people who are blind or disabled was boosted by 60 positions. Another 100 new positions bolster essential services including CalFresh and Medi-Cal, to help people get the food and health care they need. Child Welfare Services will add 100 new positions to increase emergency response support, and quality placement for children in care, and to strengthen prevention services and continue improving connecting families to community-based services.\nMore than $30 million received through the America Rescue Plan Act of 2021 will continue to support the Board of Supervisors’ framework for using the funds, including mental health services for young people and support for renters and nutrition programs.\nThe County’s new Office of Economic Development & Government Affairs will foster inclusive economic growth, provide opportunities in arts and culture, and administer grant programs that focus on nonprofits and community-based organizations.\nAnd the County’s new Office of Evaluation, Performance and Analytics will use data and analytics to better inform decisions that impact our communities and improve service delivery.\nEnhancing Communities and Keeping Them Safe\nThe budget also invests in safety and quality of life.\nIt includes $2.9 million for land for a future public safety facility located at Interstate 15 and State Route 76, and $250,000 to start plans and design for a new Jacumba fire station.\nIn addition, the San Diego County Fire Protection District is adding $2.2 million to protect communities and reduce community wildfire risk in unincorporated areas through roadside vegetation management and creating fire breaks.\nPublic Health Services will add 71 new positions to continue to strengthen its overall ability to protect our residents’ health.\nThe budget will spend $550,000 for new and expanded County parks, including Calavo, Star Ranch, Lindo Lake, Park Circle and the Waterfront Park. And a Food Access Initiative to help create community gardens will be funded with $1 million.\nCommunity Engagement\nThe County and Board of Supervisors courted the public’s input in forming the budget.\nThe County held virtual community budget meetings in each of the Board of Supervisor’s five districts; conducted public hearings June 13 and an evening hearing June 16. It also created an Operational Plan website and offered people the chance to comment online throughout the public hearing process.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220628.15.21.08"}