{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Issues Mask Mandate for Indoor Public Places", "description": "Starting Dec. 15, San Diegans will be required to wear a mask while indoors in all public places, regardless of their vaccination status, under a new statewide mandate issued Monday.", "datePublished": "2021-12-13T14:14:34-08:00", "url": "https://www.countynewscenter.com/state-issues-mask-mandate-for-indoor-public-places/", "keywords": ["health", "30-day mask mandate", "coronavirus", "covid-19", "face coverings", "masks"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-13T15:20:04-08:00", "articleType": "article", "articleContent": "\nStarting Dec. 15, San Diegans will be required to wear a mask while indoors in all public places, regardless of their vaccination status, under a new statewide mandate issued Monday.\nThe California Department of Public Health (CDPH) announced the new requirements were a response to the increase in cases and hospitalizations in the state and the detection of the new Omicron variant. The County follows CDPH’s requirements. The indoor face covering mandate is scheduled to last at least through Jan. 15, 2022 and will be reevaluated.\n“Masks help to slow the spread of COVID-19 and its many variants,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “San Diegans should wear a mask while indoors in public places to protect themselves and others.”\nThe state COVID-19 public health updated procedures also include the following:\n\nCOVID-19 testing prior to attending mega events. A negative PCR test is required 48 hours before an event or an antigen test 24 hours before the event.\nAsking travelers to the state to get a COVID-19 test three to five days after arrival.\n\nIn addition to wearing a mask indoors in public places, the following measures also help to protect against all varieties of COVID-19, including the Omicron variant:\n\nGet vaccinated and get a booster if you qualify. The vaccine is available at health care providers, retail pharmacies and community clinics. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the My Turn website.\nGet tested if you’ve travelled or have any symptoms, whether you’ve been vaccinated or not. You can make a free test appointment or find a walk-in test clinic at coronavirus-sd.com.\nWash your hands frequently and stay home if you’re sick and distance yourself from others.\n\nAll the above strategies will help to keep you, your family and your communities safe. More information about COVID-19, variants, testing and vaccinations can be found at coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211213.14.14.34"}