{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Votes to Expand Rental Assistance, Small Business Grant Programs", "description": "The County Board of Supervisors today decided on how the County will distribute pending emergency rental assistance funds allocated to the region by the state.", "datePublished": "2021-02-09T18:21:11-08:00", "url": "https://www.countynewscenter.com/board-expands-rental-assistance-small-business-grant-programs/", "keywords": ["health", "coronavirus", "covid rental assistance", "covid-19", "small business stimulus program", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-02-09T18:27:19-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today decided on how the County will distribute pending emergency rental assistance funds allocated to the region by the state.\nThe County will administer a single program, overseeing the distribution of an estimated $52.5 million in state funding and the $49 million in funding from the federal government the County received in January. These funds will assist San Diegans who have been economically impacted by COVID-19 in paying for housing expenses.\nThe program will serve people who reside in the unincorporated areas of the County, as well as San Diegans living in 16 cities within the region. The cities of San Diego and Chula Vista received funding directly from the federal and state governments and will not be covered under the County’s program.\nThe emergency rental assistance program is open to both County residents who have applied to previous emergency rental assistance programs, and those who have not received rental assistance through the initiative. The County will soon open the application period for the program and area residents who want to learn more about the initiative and how to apply for COVID-19 rental assistance, can find more information here.\nSmall Business Grants\nThe Board also voted to provide additional stimulus funds to small businesses that have suffered economic hardship due to the pandemic. The Board voted to allocate at least $30 million to the Small Business Stimulus Grant Program once the federal and state government appropriate funds to the County in the coming weeks.\nToday’s Board action allows County staff to prepare the next round of the program so grants can be distributed to qualified applicants as soon as the funds come in. Depending on the timing of federal government approval, the Board may call a special meeting to finalize the details of the next round of the program once the County receives the funds.\nThe upcoming round will be open to small businesses and nonprofit entities with 20 or fewer employees. As with prior grants, Board offices will determine final eligibility for businesses in their respective jurisdictions.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 34.2 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 9.1%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 12.1% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers, but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 16.\n\nCommunity Setting Outbreaks:\n\nSix community outbreaks were confirmed Feb. 8: three in business settings, one in a daycare/preschool/childcare setting, one in a food/beverage processing setting and one in a government setting.\nIn the past seven days (Feb. 2 through Feb 8), 72 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n12,370 tests were reported to the County on Feb. 8, and the percentage of new positive cases was 6%.\nThe 14-day rolling average percentage of positive cases is 6.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,820.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n789 cases were reported to the County on Feb. 8. The region’s total is now 248,051.\n10,868 or 4.4% of all cases have required hospitalization.\n1,520 or 0.6% of all cases and 14.0% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nThirty-two COVID-19 deaths were reported Feb. 8. The region’s total is 2,853.\nFifteen women and 17 men died between Jan. 4 and Feb. 7.\nOf the 32 new deaths reported that day, 13 people who passed away were 80 years or older, three people were in their 70s, 10 people were in their 60s, four people were in their 50s and two people were in their 40s.\nTwenty-seven had underlying medical conditions, four did not and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210209.18.21.11"}