{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Casa Anita Offers a Place to Call Home for People Experiencing Homelessness", "description": "The County is celebrating another grand opening of an affordable housing development, this time in Chula Vista. The Casa Anita Apartments have 96 new units dedicated to people and families experiencing homelessness including those diagnosed with a serious mental illness.", "datePublished": "2023-03-28T10:36:20-07:00", "url": "https://www.countynewscenter.com/casa-anita-offers-a-place-to-call-home-for-people-experiencing-homelessness/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-03-28T10:36:20-07:00", "articleType": "video.other", "articleContent": "\nThe County is celebrating another grand opening of an affordable housing development, this time in Chula Vista. The Casa Anita Apartments have 96 new units dedicated to people and families experiencing homelessness including those diagnosed with a serious mental illness. The County partnered with Wakeland Housing and Development on the project and invested $10 million through the No Place Like Home program and Innovative Housing Trust Fund. And despite a pandemic, international supply shortages and even torrential rains… Casa Anita is ready for its new residents.\nThe County of San Diego Housing and Community Development Services (HCDS) helps more than 53,800 people live in safe affordable housing. The department maintains more than 6,600 affordable units in 142 developments throughout the County, with more than 14,500 people calling this housing, home. Currently, HCDS is helping fund 16 developments under construction, totaling 1,244 units. In addition, there are 22 developments on the horizon, bringing a total of 3,144 units actively under construction or in the works.\nThese and other endeavors are part of the County’s ongoing response to the region’s housing affordability crisis. Efforts are underway to create a roadmap, or Housing Blueprint, to guide our ongoing response. Community input has been vital to the County’s efforts to address the crisis to date and is encouraged to help inform final recommendations for the Blueprint’s goals and objectives and be presented to the Board of Supervisors.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230328.10.36.20"}