{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board of Supervisors Approves Appointment of Interim Chief Administrative Officer", "description": "Sarah Aghassi has been selected by the Board of Supervisors to serve as Interim Chief Administrative Officer for the County of San Diego, bringing more than 20 years of progressively responsible executive-level strategic, political, and operational leadership in both the private and public sectors.", "datePublished": "2024-01-09T14:16:02-08:00", "url": "https://www.countynewscenter.com/county-board-of-supervisors-approves-appointment-of-interim-chief-administrative-officer/", "keywords": ["government", "board of supervisors", "cao", "chief administrative officer", "lueg", "sarah aghassi"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-01-09T15:12:59-08:00", "articleType": "article", "articleContent": "\nSarah Aghassi has been selected by the Board of Supervisors to serve as Interim Chief Administrative Officer for the County of San Diego, bringing more than 20 years of progressively responsible executive-level strategic, political, and operational leadership in both the private and public sectors.\nAghassi most recently served as Deputy Chief Administrative Officer and group General Manager for the County’s Land Use and Environment Group, which includes six departments as well as the new Office of Sustainability and Environmental Justice.\nUnder her leadership, she has collaboratively advanced the County’s sustainability efforts to protect natural resources and reduce climate change, including the County’s Climate Action Plan and unique Regional Decarbonization Framework designed to reduce the region’s overall carbon footprint.\n“Sarah is a visionary, a compassionate leader, who has been guided by her commitment to equitable service and passion for achieving the County’s vision for a just, sustainable and resilient future for all. She is someone who leads with integrity, character and a steadfast focus on doing the right thing for our communities,” said Board Chairwoman Nora Vargas.\nAghassi will serve as Interim CAO while the County continues the process of selecting a permanent CAO.\n“I am deeply grateful for the privilege to work alongside our incredible County team – the heart and soul of all we do – and look forward to collaborating and using innovation to build upon the ways we currently serve the public while actively advancing the impactful projects initiated by our Board that uplift our region,” said Aghassi.\nAghassi succeeds Helen Robbins-Meyer whose last day was Jan. 9, 2024. Robbins-Meyer extended her March 30, 2023 retirement date to aid a smooth transition as the County Board of Supervisors continues its robust search for a permanent CAO.\nThe Chief Administrative Officer is appointed by the Board of Supervisors to implement policies and direct the County’s daily operations. County services touch the lives of all San Diegans, from health and human services, property taxes, elections, disaster preparedness and justice services for the entire region to functions including roads, parks and libraries, planning and animal services for the unincorporated area.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240109.14.16.02"}