{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Lakeside Community Celebrates Grand Opening of New Library Branch", "description": "The new Lakeside Library branch is now open for business.", "datePublished": "2023-03-27T16:26:02-07:00", "url": "https://www.countynewscenter.com/lakeside-community-celebrates-grand-opening-of-new-library-branch/", "keywords": [], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2023-03-27T16:26:02-07:00", "articleType": "video.other", "articleContent": "\nThe new Lakeside Library branch is now open for business. A formal ribbon-cutting ceremony to celebrate the grand opening took place over the weekend.\nThe event featured music, art displays, activities and crafts for kids and adults. Community members were also invited to tour the new 16,800 square foot library on Woodside Ave. and learn more about its design features, including the themed Children’s Area and Teen Space that feature age-appropriate books and fun spaces to hang out.\nThe new branch is more than three times larger than the prior facility on Vine St. and includes meeting spaces, a 2,000 square foot community room, 3D printing capabilities, a Vet Connect station to link veterans to resources through the Office of Military and Veterans Affairs, and a Friends of the Library bookstore.\nThe new Lakeside library was designed as a Zero Net Energy building, meaning the energy needed to operate the building is completely offset by solar power. There are also three biofiltration basins on site that collect all the water that falls onto the building’s roof, the surrounding sidewalks, and the parking lot when it rains.\nThe building also features LED lighting, which uses significantly less electricity than traditional light bulbs and the landscaping surrounding the new library incorporates native and drought-tolerant plants.\nConstruction started in July 2021 and was completed earlier this year.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230327.16.26.02"}