{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisors Approve Little Libraries Initiative", "description": "County supervisors voted unanimously Tuesday to create a “little libraries” initiative to boost literacy in low-income and communities of color by giving the people and children living in them more opportunities to have books to read in their homes.", "datePublished": "2021-03-16T17:33:06-07:00", "url": "https://www.countynewscenter.com/supervisors-approve-little-libraries-initiative/", "keywords": ["government", "books", "literacy", "little libraries", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-03-16T17:33:06-07:00", "articleType": "article", "articleContent": "\nSan Diego County’s Board of Supervisors voted unanimously Tuesday to create a “little libraries” initiative to boost literacy in low-income and communities of color by giving the people and children living in them more opportunities to have books to read in their homes.\nSupervisor Nora Vargas, who brought the item to the Board for consideration, said the County library system has “been fantastic” in promoting and increasing literacy through its 33 branch libraries, digital and e-books, services and programs.\nBut Vargas said low income and communities of color, including some in District 1 that she represents, often face obstacles that prevent them from taking advantage of those services, such as lack of access to transportation and financial constraints that hamper internet access and book-buying. She said studies show having books to read in homes improves learning success and a “little libraries” initiative could help put more books in homes.\nLittle libraries are mailbox like structures put up in communities to create neighborhood book exchanges where people can freely borrow or leave books for others to read. They can be found all around San Diego County, but Vargas said there are just four in her District 1, serving a population of roughly 650,000.\n“Residents can borrow books as they like and return them afterward as an honor-based system,” Vargas said. “The motto being ‘take a book and share a book.’”\nWith the Board’s vote Tuesday, the County Library will work with the San Diego Council on Literacy, nonprofits like the national Little Free Library Organization, the County’s Friends of Library groups, and volunteer groups to increase the number of little libraries.\n“The reality is there are vast disparities,” Vargas said. “And many communities’ children don’t have access to age-appropriate books at home, which causes them to fall behind. This initiative today is going to address disparities seen in disadvantaged communities by promoting and encouraging reading from home and by creating more access to literature.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210316.17.33.06"}