{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "10 Percent Of County Residents Now Fully Vaccinated", "description": "More than one million COVID-19 doses have been delivered to the region and over 924,000 doses have been administered.", "datePublished": "2021-03-01T16:48:33-08:00", "url": "https://www.countynewscenter.com/10-percent-of-county-residents-now-fully-vaccinated/", "keywords": ["health", "coronavirus", "covid-19", "update", "vaccinations"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-03-01T16:48:33-08:00", "articleType": "article", "articleContent": "\nMore than one million COVID-19 doses have been delivered to the region and over 924,000 doses have been administered. Of those vaccinated to date, more than 272,000, or just over 10 percent of San Diegans 16 and older, are fully immunized.\nOverall, more than 570,000 County residents have received at least one shot of the two-dose vaccine. That’s 21.3 percent of those eligible\nThe difference between doses delivered and those used in a vaccination represent approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\n“These vaccination numbers are important milestones in our work to achieve herd immunity, but we still have a long way to go,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “San Diegans need to stay focused and continue wearing masks, practice social distancing and washing their hands as we protect our health and that of those around us.”\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit vaccinationsuperstationsd.com.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 15 cases per 100,000 residents (as of Feb. 23) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 5%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.4% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 2.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed Feb. 28 in a daycare/preschool/childcare setting.\nSeven new community outbreaks were confirmed Feb. 27: three in business settings, one in a daycare/preschool/childcare setting, one in a preschool setting, one in a restaurant setting and one in a retail setting.\nOne new community outbreak was confirmed Feb. 26 in a retail setting.\nIn the past seven days (Feb. 22 through Feb. 28), 30 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n7,180 tests were reported to the County on Feb. 28, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 4.0%.  Target is less than 8.0%.\nThe 7-day, daily average of tests is 13,561.\n\nCases, Hospitalizations and ICU Admissions:\n\n269 cases were reported to the County on Feb. 28. The region’s total is now 260,625.\n13,123 or 5.0% of all cases have required hospitalization.\n1,595 or 0.6% of all cases and 12.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported Feb. 28. The region’s total is 3,303.\nNineteen new COVID-19 deaths were reported Feb. 27.\nFive women and 14 men died between Jan. 7 and Feb. 26.\nOf the 19 deaths reported that day, eight people who passed away were 80 years or older, one person was in their 70s, six were in their 60s, three were in their 50s and one was in their 40s.\nEighteen had underlying medical conditions and one has medical history pending.\nThirteen new COVID-19 deaths were reported Feb. 26.\nFour women and nine men died between Feb. 13 and Feb. 26.\nOf the 13 deaths reported, five people who died were 80 years or older, three were in their 70s, four were in their 60s and one was in their 50s.\nEleven had underlying medical conditions and two did not have any medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210301.16.48.33"}