{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Unvaccinated San Diegans Account for Nearly All COVID-19 Cases, Hospitalizations, Deaths", "description": "Almost all COVID-19 cases, hospitalizations and deaths being reported in the region are occurring in San Diegans who are not vaccinated or are only partially immunized.", "datePublished": "2021-07-07T16:51:26-07:00", "url": "https://www.countynewscenter.com/unvaccinated-san-diegans-account-for-nearly-all-covid-19-cases-hospitalizations-deaths/", "keywords": ["health", "coronavirus", "covid-19", "unvaccinated", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-07-07T18:55:14-07:00", "articleType": "article", "articleContent": "\nAlmost all COVID-19 cases, hospitalizations and deaths being reported in the region are occurring in San Diegans who are not fully vaccinated.\nNew data from the County Health and Human Services Agency shows that since Jan. 1, 2021, COVID-19 has been primarily occurring in San Diegans who are unvaccinated or partially vaccinated. They represent:\n\n99.8% of deaths\n99.88% of hospitalizations\n99.1% of cases\n\n“The data shows what we’ve known all along. The COVID-19 vaccines are very effective at preventing serious illness and deaths,” said Seema Shah, M.D., medical director of HHSA’s Epidemiology and Immunization Services branch. “If you have not gotten vaccinated or are missing a second shot of your COVID-19 vaccine, get it now be safe and limit the spread of this virus.”\nSince Jan. 1, a total of 1,219 COVID-19 deaths have been reported in the region and only three were San Diegans who had been fully vaccinated. Of the 5,159 hospitalizations that have occurred during the same period, only 10 were in people who were fully immunized. Furthermore, over 106,000 COVID-19 cases have been reported since the beginning of this year and only about 1,000 were in San Diegans who were fully vaccinated.\nThe new data analysis and trends can be found on Page 13 of this week’s COVID-19 Watch report.\nVaccination Progress:\n\nDoses administered: Over 4.1 million.\nReceived at least one shot: More than 2.2 million or 78.8% of San Diegans 12 and older.\nFully vaccinated: Close to 1.9 million or 67.6%.\nThe goal: vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 105% of the goal population has received at least one vaccine and 90.1% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nDeaths:\n\nTwo new deaths were reported between June 30 and July 6. The region’s total is 3,782.\nTwo men 80 years or older and with underlying medical conditions died June 19 and June 29.\n\nCases, Case Rate and Testing:\n\n102 COVID-19 cases were reported to the County on July 6. The region’s total is now 283,376.\nSan Diego County’s case rate is 2.5 cases per 100,000 residents as of July 6.\n3,621 tests were reported to the County on July 6, and the percentage of new positive cases was 2.8%.\nThe 14-day rolling percentage of positive cases among tests is 1.5%.\n\nCommunity Setting Outbreaks:\n\nNine new community outbreaks were confirmed in the past seven days (June 30 through July 6): two in faith-based settings, two in restaurant/bar settings, one in a residence, one in a grocery setting, one in a business setting, one in a fitness/gym setting and one in a retail setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m. on Wednesdays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210707.16.51.26"}