{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Affordable Housing Campus Opens; Second on County Surplus Property", "description": "A grand opening celebration for 79 new affordable housing units was held today in the Clairemont Mesa neighborhood. The Paul Downey Senior Residence is located at 5255 Mt. Etna Drive, just off Genesee Avenue.  ", "datePublished": "2025-01-30T16:27:32-08:00", "url": "https://www.countynewscenter.com/affordable-housing-campus-opens-second-on-county-surplus-property/", "keywords": ["health", "affordable housing", "excess county land", "low income", "mt etna campus", "senior housing", "serving seniors"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-01-30T16:37:06-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA grand opening celebration for 79 new affordable housing units was held today in the Clairemont Mesa neighborhood. The Paul Downey Senior Residence is located at 5255 Mt. Etna Drive, just off Genesee Avenue.  \nIt is the first of four new buildings and designated for low-income seniors and families.  It also is the second affordable complex to open on County surplus property. \nThe Paul Downey Senior Residence features five studio apartments, 73 one-bedroom apartments and a manager’s unit. An adjacent Senior Wellness Center will offer supportive services for residents and the local senior community, who are part of the fastest growing population in the county. \n“Housing is health, and that is especially true for our seniors. An affordable home is essential for stability and self-sufficiency in our aging community,” said Kimberly Giardina, Deputy Chief Administrative Officer for the County Health and Human Services Agency. “That’s why the County is investing record amounts of funding in building and preserving affordable housing.”  \nThe central location for the new housing means residents will be in walking distance to grocery stores, restaurants, retail, public transportation, medical facilities, schools and parks.  \nThe County invested $15 million in funding for the Mt Etna Campus along with the parcel of land valued at $42 million.  Once complete, the campus will consist of two senior buildings and a pair of family buildings. Combined they will add 404 new affordable homes to the area by spring 2026.  \nAll four phases of the Mt. Etna campus are being developed by Chelsea Investment Corp with supportive services provided by Serving Seniors. The project is a testament to the success of public private partnerships. \nLearn more about the Mt Etna interest list. \nSince 2017, the County has invested more than $314 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal, and local funding sources administered by the County. Those funds have helped open doors to over 2,500 homes, 1,800 new units just for seniors, with 3,100 more on the way. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250130.16.27.32"}