{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Animal Shelters Make Urgent Appeal for Fosters, Waive Adoption Fees", "description": "Only a handful of kennels are available for dogs at both the Carlsbad and the Bonita County Department of Animal Services shelters. The shelters are very nearly at capacity.", "datePublished": "2023-10-20T16:09:42-07:00", "url": "https://www.countynewscenter.com/county-animal-shelters-make-urgent-appeal-for-fosters-waive-adoption-fees/", "keywords": ["animals", "das", "free pet adoptions", "pet foster"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-10-20T16:09:42-07:00", "articleType": "article", "articleContent": "\nThe County’s Department of Animal Services shelters are very nearly at capacity with only a handful of kennels are available for dogs at both the Carlsbad and the Bonita  shelters.\n“This is an urgent plea. We need the public’s help to get some of these really great dogs and cats into homes, even temporarily,” said Kelly Campbell, Animal Services director. “We typically take in a dozen or more stray dogs a day and the average stay for each dog is more than two months, so that space we have available right now may be gone by the end of the day.”\nPippa is one of the long-stay dogs and is very sweet and playful. She is available at the Bonita shelter.\nCampbell said they are waiving adoption fees this month on all animals to incentivize adoptions. The ‘all treats, no tricks’ adoption special is the best-case scenario for the dogs and cats waiting for homes.\nCampbell recognizes not everyone can  adopt. If you are not in a position to adopt but can help temporarily, the department would welcome foster families for their dogs, even short-term fosters.\n“We have a lot of really nice dogs in care that have lived with families before and some that know some commands,” she added.\nCampbell said people shouldn’t assume the dogs are being relinquished for behavioral issues, pointing to the fact that it is often financial issues or living restrictions that prompt the difficult decision.\n\nAs of Friday, they had 148 dogs at Bonita and 105 dogs in Carlsbad and more than 100 cats of different ages at each shelter location, Campbell said.\nThere are twice as many animals in the shelters’ care right now – more than 500 animals in total – compared with what has historically been normal for this time of year. Typically, the shelter reaches out to animal rescue partners and other shelters, but right now everyone is full, she said.\nAdopt by going online to browse and download an application for the Department of Animal Services Bonita or for the Carlsbad shelter. If you cannot adopt but have some room at home for a temporary roommate, please consider fostering a pet. Even a short break from the kennel environment makes a huge difference in the quality of life for shelter pets.\n\nThe County Department of Animal Services’ top priority is providing excellent care in its shelters while finding good homes for every healthy and treatable animal. While the goal is to find the right fit for animals and their permanent adopter to form a lasting and loving bond, animal fostering is another opportunity for animals to learn how to be in a home and socialize with people and other animals.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231020.16.09.42"}