{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Sheriff Reentry Program Wins Taxpayers Association Award", "description": "The San Diego County Sheriff's Department is being recognized by the San Diego County Taxpayers Association for giving men and women in county jails a second chance to successfully prepare for their return to our communities.", "datePublished": "2023-11-28T15:57:41-08:00", "url": "https://www.countynewscenter.com/sheriff-reentry-program-wins-taxpayer-association-award/", "keywords": ["public safety", "reentry", "san diego county sheriff s department", "taxpayers association"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-11-28T16:24:33-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Sheriff’s Department is being recognized by the San Diego County Taxpayers Association for giving men and women in county jails a second chance to successfully prepare for their return to our communities.\nDuring the Taxpayer’s Golden Watchdog and Fleece Awards on November 16, the Sheriff’s Department received the “Public-Private Partnership Award” for the groundbreaking work being done by Sheriff’s Reentry Services. Sheriff Kelly Martinez, Assistant Sheriff Theresa Adams-Hydar and Sheriff’s Reentry Services Manager Patricia Ceballos accepted the award.\n“This award represents the Sheriff’s Reentry Services Division’s dedication to helping individuals achieve positive change and highlights the meaningful partnerships we have built to reinforce the positive impact we make each day,” Ceballos said.\nWith more than three dozen reentry programs ranging from gardening and construction trades to culinary arts, Sheriff’s Reentry Services gives incarcerated men and women the opportunity to learn valuable skills.\nThe Sheriff’s Department partners with more than 40 organizations to connect incarcerated people with various resources for a successful transition back into society.\nSheriff’s Reentry Services also collaborates with its partners to provide wellness classes. One partner is the Old Globe Theater which brings its performances right to the participants in custody through their Arts Engagement tours. The Old Globe Theater also offers a program that those reentering can attend upon their release from custody. This has helped many of them stay connected to one another and to the theater.\nAnother successful collaboration is with the San Diego Workforce Partnership. The organization has career centers at both the East Mesa Reentry Facility in Otay Mesa and the Las Colinas Detention and Reentry Facility in Santee.\nThe team from San Diego Workforce Partnership conducts workshops to support program participants with resumes, job interview skill building and connections to employers both during and post-incarceration. Employers are brought into county jails for a job fair, offering participants the opportunity to find a job before their release from custody.\nCommunity partnerships are key to providing additional education, skills, connection to services in the community while assisting in creating a pathway to sustainable employment and increased self-sufficiency.\nThese programs empower individuals by providing them with the tools and resources they need to succeed. Ultimately, these individuals achieve a greater level of independence, confidence and long-term success.\nParticipants are also provided services ranging from obtaining identification cards, birth certificates and enrolling in medical insurance prior to their release. Reentry programs are proven to help reduce rates of return to custody, increasing public safety and supporting successful reentry to the community.\nLearn more about Sheriff’s Reentry Services.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231128.15.57.41"}