{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Youth, Officers Sprint Over Challenging Obstacles in 5K Run", "description": "Five County Probation youth from the Youth Transition Campus, and five officers ran over rugged terrain, mud crawled and climbed ropes as part of the 5K Spartan Sprint recently in Valley Center.", "datePublished": "2025-04-29T10:00:51-07:00", "url": "https://www.countynewscenter.com/probation-youth-officers-sprint-over-challenging-obstacles-in-5k-run/", "keywords": ["public safety", "county probation", "running", "transitional youth", "youth transition campus"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-04-29T10:24:35-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteFive County Probation youth from the Youth Transition Campus, and five officers ran over rugged terrain, mud crawled and climbed ropes as part of the 5K Spartan Sprint recently in Valley Center.\nThe ten are part of the running club offered to youth who have been assigned to a structured program by a Juvenile Court judge.\nThe running club is a tool that Probation officers use to help the young men find a physical and mental outlet that can help with stress, mood problems, anxiety and self-esteem. It can also be a meditative time to refocus and set a positive goal.\nThe Spartan Race is an “ultimate obstacle course challenge” with 20 challenges designed to test a runner’s physical and mental limits.\n“Most of the youth are first-time runners when they join the club. They embrace the challenge that running presents and often support and motivate one another during training sessions and races,” said Supervising Probation Officer Carlos Sanchez.\n“The shared experience fosters a strong sense of camaraderie and connection among the participants.”\nSo that they don’t miss out on any court-mandated or school-related programming, the youth wake up at 5 a.m. to train with an officer three times a week. The training focuses on long-distance running and speed workouts at the Youth Transition Campus track.\nThe event was held in honor of military service members and first responders.\nAfter completing the race, which they all completed in over an hour – a few did it in 1 hour and 5 minutes – the exhausted and exhilarated youth grabbed lunch with the officers. The running club program has a small budget to register students for races and buy lunch. Several staff members accompany the runners when they participate in the community events.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250429.10.00.51"}