{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adopts $7.23 Billion Budget", "description": "The County Board of Supervisors adopted a $7.23 billion revised budget for fiscal year 2021-22 after public deliberations on Tuesday.", "datePublished": "2021-06-29T17:32:27-07:00", "url": "https://www.countynewscenter.com/county-adopts-7-23-billion-budget/", "keywords": ["government", "board of supervisors", "budget adoption", "fiscal year 2021-22"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-06-29T17:32:27-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors adopted a $7.23 billion revised budget for fiscal year 2021-22 after public deliberations on Tuesday.\nThe adopted budget responds to voices in the community and follows a Framework for the Future that will fundamentally change County operations, with significant funding to address justice system reform, racial justice, health and environmental equity, homelessness and economic opportunity.\n“This is a budget that meets the needs of all our residents,” County Chief Administrative Officer Helen Robbins-Meyer said, “… stretching, but maintaining a prudent and responsible fiscal position.”\nA $7.03 billion recommended budget was presented to the Board on May 6 and called for a 7.3% increase. The Board approved additional spending on Tuesday, adding $200.9 million to the budget.\nAs a result, the revised $7.23 billion budget represents an increase of $681.1 million, or 10.4%, over last year’s. The revised budget also adds nearly 1,000 employees for a total of 18,782.5 staff years.\nJustice System Reform\nThe revised budget prioritizes justice system reform, focusing on preventive over punitive measures and expanded reentry support for those who are involved in the justice system to reduce recidivism and result in more positive outcomes.\nMedical care and access to mental health services will be expanded throughout the jail system with 141 additional staff, and $10 million will expand the Mobile Crisis Response Team program used as an alternative to dispatching law enforcement for individuals in crisis. The revised budget added another $2.5 million bringing the total to $12.5 million.\nThe revised budget also provides the Sheriff’s Department with 58 extra employees and increased funding to expand Medication Assisted Treatment (MAT) services in County jails.\nThe County is also investing $75 million for phase two of the new Youth Transition Campus to move away from a traditional correctional, punitive model that looks, feels, and operates like a jail to one that fosters a framework for positive youth development that is shown to support improved well-being and outcomes.\nThe Public Defender’s Office will see funding in the revised budget for a one-year pilot for an Immigrant Rights Legal Defense Program. The pilot will also offer translation services to detained immigrants.\nThe revised budget will also allow San Diego County Fire to create three member teams at three remote fire stations.\nRacial Justice\nThe revised budget provides a net increase of $0.6 million for the newly formed Office of Equity and Racial Justice. The funding will support equity in County programs, support training, organizational development, and change management.\nThe  budget will also support new projects from the Office of Equity and Racial Justice such as the initiative designed to Uplift Boys and Men of Color.\nBehavioral Health\nThe budget also prioritizes support for behavioral health, dedicating almost $813 million overall, including increases to redesign and enhance programs and services. This also includes mobile outreach for clients reluctant to engage in traditional settings, lowering staff-to-client ratios, enhancing crisis stabilization services, and helping ensure behavioral health clients are placed at the correct level of care possibly reducing emergency room use.\nThe budget also funds $3.2 million for 23 nurses supporting the San Diego County Psychiatric Hospital, which provides critical crisis stabilization and inpatient behavioral health services to some of San Diego County’s most vulnerable residents, as well as additional mental health support for adults and youth involved in the justice system.\nHealth Equity\nThe COVID-19 pandemic underscores the need for health equity. The recommended budget invests $226.9 million toward continued response to COVID-19 and includes diversely targeted outreach for hard-hit neighborhoods and other vulnerable populations, continued testing, treatment and tracing efforts, and meals for at-risk seniors. The budget also increases funding to help every person live the healthiest life possible. This includes 166 additional positions to meet increased demand for safety net services including the CalFresh and Medi-Cal programs, and provides extra staffing for Adult Protective Services, In-Home Supportive Services and Child Welfare Services.\nAn extra $89.4 million in the revised budget will support infectious disease testing, case investigation and contact tracing, surveillance, containment and mitigation. Funding will also advance health equity in racial and ethnic minority groups and rural populations.\nEconomic Opportunity\nThe new budget, along with an anticipated allocation of $650 million in American Rescue Plan Act funding, is focused on economic recovery. The funding will provide senior and youth services, small business stimulus funds, permit fee waivers for the events industry, expanded broadband access, infrastructure, child-care subsidies, food assistance and mental health services.\nA revised budget increase of $1.1 million and 5.00 staff years will support the newly established Office of Labor Standards and Enforcement.\nHomelessness\nThe budget calls for new ways to make progress on this critical issue, including the creation of a Homeless Solutions and Equitable Communities department, to streamline operations that are spread across several County agencies. The budget also includes 19 new positions and a $2.5 million increase for Community Care Coordination programs to support veterans, youth and high-need individuals with housing and other assistance. Separately, the Board of Supervisors has created a framework for the approximately $650 million to be received through the American Rescue Plan Act with $85 million currently earmarked for services to support those who are homeless.\nHousing Accessibility and Affordability\nA combined $107 million state and federal allocation will continue offering rental assistance through the Emergency Rental Assistance Program. The budget also includes increased funding for the CalWORKs Housing Support program to help families in need find and retain permanent housing and $2.7 million to encourage development of accessory dwelling units, or ADUs, by waiving permit and impact fees and offering pre-approved plans to save time and cost.\nAn increase of $25.0 million will expand funding for the Innovative Housing Trust Fund (IHTF) and other housing initiatives to increase production and preservation of affordable housing.\nEnvironmental Protection\nThe budget calls for $104.5 million for environmental protection and includes reducing greenhouse gas (GHG) emissions, planting trees, acquiring at least 500 acres of land for open space, protecting water quality and agriculture, and diverting waste from landfills.\nThe newly established Office of Environmental and Climate Justice will see a revised budget increase of $1.3 million and three additional staff.\nFunding will also broaden the Environmental Justice Element in the County’s General Plan to reduce pollution exposure and promote public facilities, food access, safe and sanitary homes, and physical activities in underserved communities.\nGovernment Transparency\nThe budget provides resources to support a new subcommittee to enhance accessibility and open government within County operations that includes engaging the public in the County budget and Board of Supervisors meetings. The subcommittee will also review and assess a Public Records Act portal, accessing archived public records and the County’s email retention policy.\nThe revised budget includes an additional $4.5 million and 20.00 staff years for the newly established Office of Evaluation, Performance and Analytics.\nCommunity Investments\nThe budget calls for $282.7 million in capital projects to improve communities throughout the region. This includes a new Otay Mesa Fire Station, new Casa De Oro Library and Julian Library Community Room, and more than $70 million for new parks, trails and recreational areas to enjoy the outdoors and preserve open space.\nThe budget plan is part of a two-year operational plan that will help determine how the County spends its resources. The first year of the plan for Fiscal Year 2021-22 was adopted Tuesday; the second year was approved in principle.\nThe new fiscal year budget takes effect on Thursday, July 1.\nFor more information on the budget, visit the County’s budget portal.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210629.17.32.27"}