{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands its Health-Focused Response to Tijuana River Valley Sewage Crisis", "description": "The County of San Diego is expanding its ongoing response to South County health concerns about exposure to raw sewage flowing in the Tijuana River Valley. ", "datePublished": "2024-09-05T13:08:57-07:00", "url": "https://www.countynewscenter.com/county-expands-its-health-focused-response-to-tijuana-river-valley-sewage-crisis/", "keywords": ["health", "sewage", "south bay", "tijuana river valley"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-09-05T13:37:00-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County of San Diego is expanding its ongoing response to South County health concerns around exposure to raw sewage flowing in the Tijuana River Valley. \nThis week the County is expanding the South County public health focused website and finalizing an agreement with the Centers for Disease Control and Prevention (CDC) for a community assessment. \n“For years, the communities in the Tijuana River Valley have endured the severe impacts of pollution, creating one of the biggest environmental and social justice crises of our time,” said Chairwoman Nora Vargas. “As Chairwoman, I been advocating tirelessly for a stronger response, and this agreement with the CDC is a direct result of those efforts. While this is a critical next step in addressing the long-term impacts of cross-border pollution, I remain committed to continuing this fight and finding solutions that truly improve the quality of life for our South County families.“\nIn May 2024, the County contacted the California Department of Public Health requesting support in addressing the situation. Additionally, a formal request to the CDC’s National Center for Environmental Health (NCEH) requesting an Epi-Aid investigation into the Tijuana River Valley was submitted on June 25.  The Epi-Aid was verbally approved on July 31, 2024.      \nThe CDC-led investigation related to the crisis will assess household level impacts in the South region of San Diego County in 2024 related to sewage exposure from the Tijuana River Valley, including air and water exposures. It will also look at occupational and other environmental exposures, health effects and concerns in at-risk populations, and identify information gaps, assess community needs and produce household-based information.\nFormally known as a Community Assessment for Public Health Emergency Response (CASPER), it will take place as a collaboration between the County, California Department of Public Health and San Diego State University. CASPERs are done sparingly. They are typically conducted when the public health needs of a community are not well known and population-representative data are needed. \nThe survey will involve several hundred households and the County is working with the CDC on when the interviews will begin The CDC is responsible for the timing and publication of data and any after action reports. \nThe Public Health Services South County website, originally set-up on February 16, 2024, as one-stop location for health information related to the Tijuana River Valley Sewage Crisis, is being renamed Surveillance Bulletin: South Region Health Concerns to better reflect its expanding scope. Among the data currently tracked is surveillance for gastrointestinal symptoms—such as diarrhea and vomiting—among persons seeking medical attention in emergency departments. Also tracked will be communicable gastrointestinal diseases state law requires that medical providers disclose.\nStarting this week, the website will add respiratory syndromic surveillance that tracks reports of asthma or chronic obstructive pulmonary disease symptoms, including reactive airway disease, wheezing, and bronchospasm. The information has been added to address concerns that have been raised regarding respiratory impacts from the odors attributed to Tijuana River Valley sewage. The page is updated each Wednesday. \n“Raw sewage flows, and the associated odors and potential for disease, should not be anyone’s everyday worry,” said Dr. Ankita Kadakia, interim County Public Health Officer. “Public Health Services has worked with the community to address their concerns about this ongoing pollution for more than a year. The expanded website and pending partnership with the CDC are part of our continuing commitment to be responsive and transparent to everyone in our region.” \nTo date, no significant unexplained respiratory increases in syndromic surveillance have been observed. \nThe updated site also features a link to the San Diego County Air Pollution Control District (APCD) webpage focused on investigations of numerous odor complaints from communities surrounding the Tijuana River Valley. (The APCD is an independent government agency separate from the County of San Diego with its own governing board.) \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240905.13.08.57"}