{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Advances Electric Vehicle Use", "description": "The County made more progress in 2022 advancing electric vehicle ownership and use which reduces greenhouse gas emissions, improves air quality, and supports the climate action and decarbonization efforts.", "datePublished": "2023-07-11T16:13:20-07:00", "url": "https://www.countynewscenter.com/county-advances-electric-vehicle-use/", "keywords": ["environment", "electric vehicles", "environment", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-07-11T16:13:20-07:00", "articleType": "article", "articleContent": "\nThe County made more progress in 2022 advancing electric vehicle (EV) ownership and use which reduces greenhouse gas emissions, improves air quality, and supports the climate action and decarbonization efforts.\nSupporting County Operations \nAs of April 2023, there are 126 electric vehicles in the County fleet and another 133 on order. This will bring the total number of County-operated electric vehicles to 259, exceeding the EV Roadmap goal of 250 fleet vehicles by 2025. The County also working on transitioning medium- and heavy-duty vehicles to clean and zero-emission fuels.\nTo keep these EVs charged and on the go, 119 new Level II EV charging stations were added in the County Operations Center parking structure bringing the total number of EV chargers installed for fleet vehicles to 203 in 2022. And with funding through operational budget and up to $3 million in grants, 282 additional charging stations will be installed at up to 17 County sites within the next five years.\nSan Diego County Library also purchased two all-electric mobile outreach vans and it is planning to purchase three more to provide expanded mobile library services to residents and students throughout the region. These vans will have charging stations at the Ramona, Borrego, Fallbrook, and Julian libraries. And for greater fleet efficiency, the County’s Land Use & Environment Group and Department of General Services agreed to share EVs.\nAnd by allowing employees to telework in 2022, the County avoided 36,529,767 vehicle miles of travel! This is a 26 percent reduction in commuting miles if employees were working in-office full time. This avoided an estimated 10,611 metric tons of carbon dioxide equivalent (MTCO2e) which is equal to planting 17,685 tree seedlings.\nSupporting Public EV Use \nThe County is also identifying areas for public EV charging stations in unincorporated communities and at County facilities including at multi-family developments and where EV-supporting infrastructure is lacking.  The County has installed 56 public EV charging stations at County facilities and plans to install four Level II stations at the Southeastern Live Well Center, two Level II charging stations at the Lakeside Library, and 19 shared public/fleet charging stations at the Youth Transition Campus next year.\nAs a result of regional partnerships and grants, new EV charging stations are being installed at the Julian Library and Palomar McClellan Airport.\nThe County has also worked with the U.S. Dept. of Transportation to designate new Alternative Fuel Corridors for EVs including State Route (SR) 67 (from I-8 in El Cajon to Eucalyptus Hills), SR 94 (from downtown San Diego to SR 188), and SR 125 (from SR 905 in Otay Mesa to SR 52 in El Cajon). This action will increase public accessibility to electric vehicle charging and reshape the regional transportation system to support the transition to EVs.\nSince streamlining its permitting process, the County has also approved approximately 950 EV charging stations in private residential homes and commercial developments in the unincorporated area.\nThe County also increases EV ownership and charging station installations through education, outreach, regional collaboration, and sharing incentive opportunities on its EV Consumer website. Here, people can find consumer-friendly information on the benefits and costs of EV ownership, available vehicle and charger purchase incentives, charger options and installation procedures, a fuel cost comparison calculator, and access to a vehicle search and comparison tool.\nIt includes information for a diverse range of users (i.e., low-income residents, residents of multi-family developments, large families, residents with accessibility needs) and utilizes enhanced website design components to facilitate translation of all website content into over a hundred languages including all County threshold languages.\nIn late 2022, SANDAG and the County were awarded a Caltrans Planning Grant to research and design an incentive program that will offer rebates to residents for the purchase or lease of zero-emission vehicles. This will enable significantly more EV purchases (new and used) by residents in low- and moderate-income households.\nIn 2022, the Board also directed staff to analyze current and future hydrogen fueling needs and demands for medium and heavy-duty vehicles (i.e., trucks, buses, freight, construction equipment) in the unincorporated area to support regional fleets. The findings will be incorporated into the Climate Action Plan Update.\nYou can track the County’s EV Roadmap implementation and find helpful resources on its EV Consumer website.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230711.16.13.20"}