{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Safe Parking is Angel’s Answer to a Prayer", "description": "Last summer, the County’s Department of Homeless Solutions and Equitable Communities led an effort to transform a freeway underpass into a safe space for people experiencing homelessness and living in their cars. For people like Angel Gomez and his girl Luna, the Safe Parking lot has been life changing.", "datePublished": "2023-06-06T15:11:19-07:00", "url": "https://www.countynewscenter.com/safe-parking-is-angels-answer-to-a-prayer/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-06-06T15:11:19-07:00", "articleType": "video.other", "articleContent": "\nLast summer, the County’s Department of Homeless Solutions and Equitable Communities led an effort to transform a freeway underpass into a safe space for people experiencing homelessness and living in their cars. With support from multiple agencies, organizations, community partners and other county departments, a Safe Parking site opened on North Magnolia Ave near El Cajon. The non-profit ‘Dreams for Change’ manages the lot that includes 16 parking spaces, restrooms, handwashing stations and onsite security 24/7. County outreach teams offer supportive, wrap-around services for the individuals and families who park each evening at the site. For people like Angel Gomez and his girl Luna, the Safe Parking lot has been life changing.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230606.15.11.19"}