{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "High School Students Learn About Sheriff Career", "description": "Everyone knows to call 9-1-1 in emergency situations and the dispatcher who answers the phone is often a lifeline to the person in distress.", "datePublished": "2025-02-13T14:11:50-08:00", "url": "https://www.countynewscenter.com/high-school-students-learn-about-sheriff-career/", "keywords": ["public safety", "emergency dispatch", "san diego county sheriff s office", "youth academy"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-02-13T14:11:50-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesEveryone knows to call 9-1-1 in emergency situations and the dispatcher who answers the phone is often a lifeline to the person in distress.\n“It’s a challenging job and ultimately, a very rewarding job,” said Jeff Hebert, a San Diego Sheriff’s Office Communications Coordinator. He is one of three managers who are responsible for the operations of the Sheriff’s Office communications center, but he started out as a dispatcher some 30 years ago and has stayed on because he loves what he does.\nLast year, the Sheriff’s Office developed a Responder Ready Public Safety Communications Academy geared toward high school students to expose them to this civilian career in law enforcement. The 12-week academy was held on Saturdays for four hours and on Feb. 1, 19 students graduated from the first academy. A new academy is planned for April.\nHonors graduate Sage Sekerke, 16, of San Marcos said it was an amazing experience.\n“I’m applying as soon as I turn 18 and graduate high school,” Sekerke said. When she first went to the academy, she didn’t think she would want to be a dispatcher, but after getting to learn about job and observe real dispatchers at work, she feels drawn to the role.\nHebert said the coursework included everything from professionalism and ethics to looking for jobs, gaining job interview skills, using critical thinking, decision making skills and phone procedures for taking calls and using the radio to dispatch help.\nTo learn how to use the computer aided dispatch system, the students worked on a simulator to learn how to gather information and document it, often with a dispatcher sitting with them to help guide them. They also got to sit and observe a dispatcher at work.\nTo be a dispatcher, you have to be 18 years old and have a high school diploma or equivalent. Hebert added that one of the graduates in the academy turned in her application the next day and several told him they are interested in applying when they turn 18. To learn more about Sheriff emergency dispatchers visit the Sheriff’s Office page and keep an eye out for the next academy.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250213.14.11.50"}