{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Contractors and Suppliers Learn How to Connect with County", "description": "More than 100 local businesses and non-profits attended an outreach event at the County Administration Center Monday to learn about working with the County’s Department of Purchasing and Contracting.", "datePublished": "2023-10-03T15:12:15-07:00", "url": "https://www.countynewscenter.com/local-contractors-and-suppliers-learn-how-to-connect-with-county/", "keywords": ["government", "buyers", "buynet", "connecting with the county", "dpc", "fgg", "pellegrino", "purchasing and contracting", "suppliers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-10-03T15:13:53-07:00", "articleType": "article", "articleContent": "\nMore than 100 local businesses and non-profits attended an outreach event at the County Administration Center Monday to learn about working with the County’s Department of Purchasing and Contracting.\nThe County is one of the largest buyers in the region and spends about $2 billion a year to provide everything from pencils to entire new buildings.\n“Because of our significant spend and the wide range of good and services we procure, we are a major economic engine in the region. With such a large contract portfolio we’re always looking for great contractor and suppliers, but often suppliers don’t know how to get in touch, or they don’t know how to do business with us,” said County Purchasing and Contracting Director Jack Pellegrino. “Events like this help us connect with the business community to create more equitable opportunities.”\nThe outreach event was a chance for local suppliers and contractors to network with each other and County departments, get information on County procurement methods and attend a panel discussion addressing ethics, equity, labor standards and more.\nOne man who attended the event, Anayo Nworjih of the non-profit Watering Hope, is interested in working with the County to support people experiencing homelessness.\n“Definitely, a lot of synergy, people, relationships, resources and connections that are well aligned with wanting to bring about change and a difference and also have an impact on the community,” said Nworjih.\nPurchasing and Contracting is making conscious efforts to increase supplier diversity by reaching out to underrepresented suppliers and contractors.\nThe County offers a local business preference program where a 5% preference is given to local, small, veteran-owned or disabled veteran businesses. The department is also looking to increase access and opportunities for minority businesses and is instituting an equity in contracting review for all the County’s services.\nOne example was the County’s new Southeastern Live Well Center. A different contracting approach saw the prime contractor, PCL, use $8.2 million of local business contractors within the four zip codes aligned with the site. PCL hired 9.6% of the construction workforce from those same communities.\nNine County departments participated in the outreach event to meet one-on-one with attendees including General Services, Parks, the Sheriff’s Department and Behavioral Health Services.\nIf you’re interested in becoming a supplier or contractor with the County, register for the County’s updated online procurement system called BuyNet. Those who are already registered need to re-register.\nTo get more information about Monday’s event and future events and to learn more about Purchasing and Contracting, visit their website.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231003.15.12.15"}