{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Six More Flu Deaths Reported, Cases Increase in San Diego", "description": "Six additional influenza deaths were reported last week, bringing this season’s total to 63, the County Health and Human Services Agency announced today.", "datePublished": "2020-02-19T10:59:38-08:00", "url": "https://www.countynewscenter.com/six-more-flu-deaths-reported-cases-increase-in-san-diego/", "keywords": ["health", "flu deaths", "flu shot", "flu vaccine", "influenza shot"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-02-19T11:17:27-08:00", "articleType": "article", "articleContent": "\nSix additional influenza deaths were reported last week, bringing this season’s total to 63, the County Health and Human Services Agency announced today.\nThe ages of the new flu deaths ranged from 55 to 84 years and all had underlying medical conditions.\nAfter two weeks of declines, the number of lab-confirmed cases increased slightly last week, when 1,637 cases were reported. In comparison, 1,520 flu cases were reported the previous week. To date, a total of 16,706 cases have been reported.\n“Influenza activity is unpredictable, and weekly case totals could go up and down during the season,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “It’s important that people continue getting vaccinated since influenza could last through April and even May.”\nFor the first time in several weeks, the number of people showing up at local emergency departments with influenza-like symptoms dropped from 8% to 7% last week.\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Feb. 15, 2020, the report shows the following:\n\nEmergency department visits for influenza-like illness: 7% of all visits (compared to 8% the previous week).\nTotal influenza deaths to date: 63 (compared to 35 at this time last season).\nTotal lab-confirmed cases to date: 16,706 (compared to 4,848 last season).\n\nWhen to Seek Medical Help\nPeople with influenza-like symptoms continue to crowd local emergency departments and are taxing some hospitals.\nCounty health officials are encouraging people who are sick to first contact their health care provider by telephone or arrange an urgent appointment.  You should go to an emergency department when you have any of the following symptoms:\n\nDifficulty breathing or shortness of breath\nChest pain or abdominal pain\nSudden dizziness\nConfusion\nSevere or persistent vomiting\nFlu-like symptoms that appear to get better, but then return with a fever and worse cough\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nFlu vaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nThe flu vaccine is available at doctors’ offices and retail pharmacies. If you don’t have medical insurance, you can go to a County public health center to get vaccinated. For a list of locations, visit www.sdiz.org or call 211 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200219.10.59.38"}