{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Toys for Tots Time Returns at 5 County Airports", "description": "The hap-happiest season of all is here again. And you can get that happy by donating a new toy at one of five County airports and putting a smile on the face of a child!", "datePublished": "2024-11-18T13:50:26-08:00", "url": "https://www.countynewscenter.com/toys-for-tots-time-returns-at-5-county-airports/", "keywords": ["families", "equity", "families"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-11-18T13:50:26-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe hap-happiest season of all is here again. And nothing makes the holiday season happier than putting smiles on the faces of children.\nYou can get that happy feeling with the help of the U.S. Marine Corps and County of San Diego.\nAll you have to do is drop off a new, unwrapped toy in a Toys for Tots donation box at one of five County airports.\nDonation boxes are out and will remain up until Saturday, Dec. 14 at those five airports: McClellan Airport in Carlsbad, Gillespie Field in El Cajon, Fallbrook Airpark in Fallbrook, Ramona Airport in Ramona and Borrego Valley Airport in Borrego Springs.\nAll donations will be given out to children in San Diego County communities. Pilots are welcome to fly in to deliver their donations at the airports.\nDonations being accepted are new, unwrapped toys, bikes, games, dolls, stuffed animals and other things to play with that will help brighten up a child’s holidays.\nAs they have done in past years, Fallbrook Airpark and Ramona Airport will hold special Toys for Tots collection events in December. Uniformed Marines will be at those events to personally collect your gifts.\nThe first event is scheduled to be held from 10 a.m. to 1 p.m., Saturday, Dec. 7, at Ramona Airport, located at 2450 Montecito Road in Ramona. The second is scheduled to take place from 10 a.m. to 1 p.m. the next weekend, Saturday, Dec. 14, at Fallbrook Airpark, located at 2155 Air Park Road in Fallbrook.\nSo, get that good holiday feeling! Join the County of San Diego and the U.S. Marine Corps and put smiles on the faces of local kids by dropping off a new toy for a child.\nThe five airports are located at:\n\nBorrego Valley Airport: 1820 Palm Canyon Dr, Borrego Springs, CA, 92004.\nFallbrook Airpark: 2155 South Mission Road, Fallbrook, CA 92028.\nGillespie Field: 1960 Joe Crosson Drive, El Cajon, CA, 92020.\nMcClellan Palomar Airport: 2192 Palomar Airport Road, Carlsbad, CA, 92011.\nRamona Airport: 2450 Montecito Road, Ramona, CA, 92065.\n\nFor more information, contact the Fallbrook Airpark at (760) 723-8395 or Ramona Airport at (760) 788-3366.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241118.13.50.26"}