{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrate Earth Month with the County", "description": "April is Earth Month. Celebrated throughout the globe, this year’s theme is “Our Power, Our Planet” and includes  a call for people to pledge to do something to make our planet greener.", "datePublished": "2025-04-10T11:24:48-07:00", "url": "https://www.countynewscenter.com/celebrate-earth-month-with-the-county-2/", "keywords": ["environment", "earth month", "environmental sustainability", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-04-10T12:16:54-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutes\n\n\n\nApril is Earth Month. Celebrated throughout the globe, this year’s theme is “Our Power, Our Planet” and includes a call for people to pledge to do something to make our planet greener.\nTo mark the celebration, the County is offering a number of events and activities, including hosting an Earth Fair from 11 a.m. to 1 p.m. on April 18, at the County Operations Center, 5500 Overland Drive in Kearny Mesa.\nVarious departments and organizations will host booths at the fair to promote some of the ways it’s taking on the environmental sustainability challenge as a government organization, and through partnerships with community-based organizations.\nWhether it’s Vector Control highlighting its work to detect and intercept invasive pests or General Services showing off some of its electric vehicles, the County Library bringing a community outreach electric van to talk to people about how they support environmental sustainability in libraries, or Public Works providing information on its waterscape rebate program and watershed efforts. The fair will also offer fun activities and some giveaways.\nAmong the partner organizations participating are the San Diego River Park Foundation, Surfrider Foundation, the Environmental Health Coalition and San Diego Community Power among many others.\nThere are a number of additional offerings for you to check out to see how actions make a difference in protecting and investing in our environment. These include:\n\nVirtual hikes of County parks.\nVisiting a local community garden.\nSome virtual activities are available for people to do at home. From coloring sheets to print out, games, to tips on growing your own food.\nWays to reduce your environmental impact from preventing mosquito breeding to recycling to reducing food waster to composting to air pollution and water use.\n\n\n\n\n\n\n\n\n\n\nNeighborhood Disposal:\n\nSaturday, April 19\n\n\n9 a.m. to 2 p.m. or until capacity is reached. Unincorporated area residents may bring household hazardous waste and electronic waste to dispose of it properly at Fallbrook High School, 2400 S. Stage Coach Lane. Household hazardous waste includes batteries, cellphones, printers, computers, motor fluids, oils, household cleaners and other chemicals, LED and fluorescent light bulbs, and paint. No bulky items, tires, mattresses, green waste and hazardous waste from businesses will be accepted.\n\n\n\n\n\n\n\n\n\n\n\nGuided Hikes\n Saturday, April 19\n\n\n9 a.m. Volcan Mountain Wilderness Preserve with Women in the Wild. Summit hike to majestic views to the west and the Anza Borrego Desert to the east for roughly a 5-mile hike roundtrip trail through conifer forest. The guide will discuss trail safety, hiking essentials, watersheds, and point out unique plant and animal species to the 2,900 acres preserve.  For information on this hike, call (619) 214-2642.\n10 a.m. Sycamore Canyon/Goodan Ranch County. Moderately difficult 3.5-mile Martha’s Grove Trail starts at the Goodan Staging Area and will lead you through a variety of habitats, historic oak groves and the remnants of an old ranch. Call (858) 513-4737.\n\nSunday, April 20\n\n\n10:30 a.m. Dos Picos County Park. Park staff will lead this easy, mile long hike on the Ernie Pantoja Memorial Trail where you will explore coast live oak, native plants, learn about animals and get a view of Mount Woodson and Dos Picos pond. Call (760) 789-2220 for more information.\n\n\nSunday, April 27\n\n\n10 a.m. Dictionary Hill County Preserve. A ranger and a biologist will lead this 1-mile hike with California coastal sage scrub habitat and a discussion of the unique and rare plant species. The 1,500-foot summit boast views of the Coronado Islands, San Diego coastline, downtown, and Sweetwater Reservoir on a clear day. Call for details at (619) 644-5492.\n\n\n\n\n\n\n\n\n\n\n\nVolunteer Event\n\nSaturday, April 26\n\n\n9 a.m. to noon clean up waterways event with I Love a Clean San Diego at the following County Parks: Lindo Lake, Old Ironsides, Otay Lakes, Rainbow, and San Dieguito. Advance registration is required at cleansd.org.\n\n\n\n\n\n\n\n\n\n\n\nStep Foot on a Story Trail\n\nEarth Week, April 20-26\n\n\nColorful pages of children’s book have been posted on signs by Library staff at the following most family-friendly County parks: Adams in Valley Center, Agua Caliente  in Julian/Anza Borrego, Barnett Ranch in Ramona, Borrego Springs, Dos Picos in Ramona, Eastview in Sweetwater/Bonita, Flinn Springs in El Cajon, Lake Morena in Campo, Lincoln Acres in National City, Live Oak in Fallbrook, Louis A. Stelzer in Lakeside,  Pine Valley, Potrero, Santa Ysabel Nature Center in the East County and Waterfront downtown San Diego.\n\n\n\n\n\n\n\n\n\n\n\nAnimal Encounters\n\nSaturday, April 19\n\n\n10 a.m. Reading with Rosy: An animal encounter with books at San Elijo Lagoon Nature Center. Park rangers with Rosy the Rosy Boa and a reptile ambassador will host an interactive snake workshop, a lagoon trail walk, and a very special story time with the San Diego County Library. Meet at the Nature Center Amphitheater. Call (760) 634-3026 for more information.\n\n\nSunday, April 20\n\n\nNoon Picnic with the Goats at Los Penasquitos Ranch House. Bring your lunch for a pen-side picnic with animal ambassadors. Rangers will discuss 1860s ranch life, animal care and Nubian goats. Call (858) 484-7504.\n\n\n\n\n\n\n\n\n\n\nIf you are unable to attend one of these events, more sustainable activities continue in May.\nTo learn and find out more about all of these activities visit sandiegocounty.gov/earthday.\n\n\n\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250410.11.24.48"}