{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Face Coverings, Physical Distance Needed to Prevent Surge of COVID-19", "description": "If people don't wear a face covering and maintain physical distance, a surge of COVID-19 could occur, forcing the County to slow, stop or dial back the reopening of the local economy.", "datePublished": "2020-06-11T16:17:11-07:00", "url": "https://www.countynewscenter.com/face-coverings-physical-distance-needed-to-prevent-surge-of-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "face coverings", "social distancing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-11T16:55:58-07:00", "articleType": "article", "articleContent": "\nAs people head back to work or resume some of their normal activities, County health officials are reminding the public to continue doing three things to prevent a surge of COVID-19: wear a face covering, keep their distance from others and wash their hands regularly.\nResearch has shown that when face coverings are used properly, they reduce transmission of the novel coronavirus. Maintaining physical distance from other people does too.\nThe latest is a Centers for Disease Control and Prevention study of sailors at the aircraft carrier Theodore Roosevelt which showed that sailors who used a face covering and practiced social distancing had a lower infection rate.\n“We now have more scientific evidence that face coverings prevent the spread of COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “When people are in public the risk of exposure is higher so they should wear a face covering, especially when they’re within six feet from others.”\nFace coverings are important because they disrupt the trajectory of droplets when people cough or sneeze. Also, people can have COVID-19 and transmit the virus, but not have any symptoms.\nIn addition to the CDC, the World Health Organization is also now recommending that people wear a face covering when in public and close to others.\nIn San Diego County, about 10% of all the people who tested positive for COVID-19 had no symptoms, which means they could have been unknowingly transmitting the virus to others.\nFurthermore, adjacent counties and states have seen an increase in cases and no travel restrictions are in place within the United States.\nFace coverings are required in public until further notice.\nIf San Diegans fail to heed the public health advice, the region could experience an increase in cases which would require the County to slow, stop or dial back the reopening of the local economy.\n“When you wear a face covering, you protect those around you. When others use a face covering, they protect you,” Wooten said. “The COVID-19 pandemic is not over and this dangerous virus remains in circulation throughout the community. People should not get complacent and continue heeding the guidance given to protect themselves and others.”\nThe County’s local Health Officer Order requires San Diegans to wear a face covering when in public and less than six feet from others, or any time they enter a business, except when its use is prevented by a medical condition.\nFace coverings will be required in public until further notice.\n“People who choose not to wear face coverings should stay home. They may be cited and denied access to businesses, transit or recreational areas,” said Wooten, adding that people should also wash their hands properly and regularly to prevent the spread of COVID-19.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n4,997 tests were reported to the County on June 10 and 161 or 3% were positive.\nThe 14-day, rolling average percentage of positive tests is 3.1%.\n\nCases:\n\n161 new cases were reported for a San Diego County total of 8,998.\n1,459 or 16.2% of the total cases have required hospitalization.\n414 or 6% of all cases and 28.4% of hospitalized cased had to be admitted to an intensive care unit.\n\nDeaths:\n\nThree new COVID-19 deaths were reported today, bringing the region’s total deaths to 308.\nThree men ages 49, 70 and 80 died.\nTwo had underlying medical conditions.\n\nThere are currently 56 active outbreaks in skilled-nursing facilities and other congregate and community settings:\n\n22 outbreaks with 809 cases, including 87 deaths in skilled nursing facilities.\n23 outbreaks with 943 cases, including 68 deaths in other congregate settings.\n11 outbreaks with 404 cases, including six deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200611.16.17.11"}