{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Ballots Go Out to Registered Voters for March Presidential Primary Election", "description": "Over 1.9 million ballots are on their way to the County’s registered voters for the March presidential primary election.", "datePublished": "2024-02-02T10:49:45-08:00", "url": "https://www.countynewscenter.com/ballots-go-out-to-registered-voters-for-march-presidential-primary-election/", "keywords": ["elections", "ballots go out", "fgg", "march 5", "march 5 presidential primary", "registrar of voters office"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-02T10:49:45-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesOver 1.9 million ballots are on their way to the County’s registered voters for the March presidential primary election. Voters should receive their ballots the week of Monday, Feb. 5. The official ballot packet will also include an “I Voted” sticker.\nEarly voting begins Monday, Feb. 5 at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar’s office will be closed Monday, Feb. 19 in observance of Presidents Day.\nThe Registrar encourages voters to take advantage of the convenience of voting by mail. You can vote from home and return your ballot through the mail – no postage needed – or to any of the Registrar’s official ballot drop boxes starting Tuesday, Feb. 6 through the final day of voting Tuesday, March 5.\nRemember to sign and date your return ballot envelope. You must sign your return envelope for your vote to count.\nVoters who return their ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nVoters who prefer to vote in person will have more options to do so when 39 vote centers open daily from 8 a.m. to 5 p.m. starting Saturday, Feb. 24.\nOn Saturday, March 2, an additional 179 vote centers will open for a total of 218. The locations will be open daily from 8 a.m. to 5 p.m. through March 4. On the final day of voting, March 5, all vote centers and official ballot drop boxes will be open from 7 a.m. to 8 p.m.\nAvoid long lines by taking advantage of the early voting. You have the option of casting your ballot at any vote center around the county.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nIf you plan to vote for president, the Registrar urgers voters to review each political party’s rules.\nLearn more about voting in the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240202.10.49.45"}