{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s COVID-19 Emergency Declarations to End; Response Continues", "description": "The County’s Board of Supervisors accepted a COVID-19 update Tuesday stating the County’s nearly 3-year-old coronavirus local emergency and local health emergency will end Feb. 28, matching the end of the state of California’s previously announced plan.", "datePublished": "2023-02-07T17:06:24-08:00", "url": "https://www.countynewscenter.com/countys-covid-19-emergency-declarations-to-end-response-continues/", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19", "emergency declaration", "public health", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-02-07T17:06:24-08:00", "articleType": "article", "articleContent": "\nThe County’s Board of Supervisors accepted a COVID-19 update Tuesday stating the County’s nearly 3-year-old coronavirus local emergency and local health emergency will end Feb. 28, matching the ending date of the state of California’s previously announced plan.\nThe update also stated the County will continue to provide all the services needed to respond to the ongoing pandemic, including surveillance, testing, tracing, treatment, vaccinations and public engagement.\nThe Board first ratified the County’s proclamation of a local emergency and declaration of the local health emergency on Feb. 19, 2020, becoming just the second county in California to declare a local emergency for the then-emerging coronavirus pandemic.\nThose emergency responses allowed the County to respond more effectively to the pandemic; seek and use mutual aid; put itself in place to seek financial reimbursement to handle COVID-19; and make sure County health professionals, and other health agencies had the tools they needed to respond, including standing up equitable and highly accessible testing and vaccination programs.\nLike the rest of the world, COVID-19 impacted San Diego County. Over the past three years, more than 976,000 San Diegans have laboratory confirmed positive tests for COVID-19, more than 38,500 have been hospitalized and 5,728 died.\nCounty Public Health Officer Wilma J. Wooten, M.D., M.P.H., noted the County’s focus on mass testing, treatment, vaccinations and investigation and tracing proved positive and saved people from dying.\n“Sadly, while lives have been lost, combined community efforts, including enhanced surveillance, accessible and equitable testing and vaccination strategies, and provision of appropriate PPE (Personal Protective Equipment), have saved lives,” Wooten said. “Early and thorough response from the County of San Diego resulted in an estimated 3,307 lives saved, from Feb. 14, 2020, through Nov. 13, 2021, according to an analysis by the County’s Community Health Statistics Unit.”\nCounty Health and Human Services Agency Director Nick Macchione thanked current and former County supervisors, County Chief Administrative Officer Helen Robbins-Meyer, County employees, nurses, physicians, therapists, local hospitals, healthcare facilities, CAL FIRE, first responders, the County’s 18 cities, community partners, community-based organizations, the public and the media for their part in addressing a “generational pandemic.”\n“What we accomplished collectively is regarded as one of the best responses in the nation, with recognition from the federal government, the governor and the state, and many other leaders.” Macchione said, “We set the bar for others to follow.”\nThe County’s comprehensive local response to protect the public’s health with an equity focus featured numerous actions, including:\n\nRapidly deploying widespread testing and mass vaccinations\nKeeping people informed across sectors from education to faith based and through open and frequent media communications\nEmploying “promotoras”—community health workers\nProcuring outreach contracts with various and ethnic community organizations\nWorking with long-term care facilities that housed people at high risk of the virus\nSurveilling wastewater to detect and gauge virus levels\n\nSince the start of the pandemic, the County has invested more than $1 billion to fight coronavirus, not only through health actions, but also by providing food, housing and child-care assistance, as well as stimulus to help businesses and people hurt by COVID-19. Nearly 2.7 million San Diegans have received the primary series of one of the approved COVID-19 vaccines and more than 560,000 have received a bivalent booster vaccine.\nMore information about the County’s ongoing response to COVID-19 is available online on the County COVID-19 website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230207.17.06.24"}