{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Urged to Get a Flu Shot", "description": "While influenza activity in the region is extremely low compared to other seasons, County health officials are urging San Diegans to get vaccinated to prevent getting sick.", "datePublished": "2020-12-08T09:30:57-08:00", "url": "https://www.countynewscenter.com/san-diegans-urged-to-get-a-flu-shot/", "keywords": ["health", "flu", "flu shot", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-07T16:46:36-08:00", "articleType": "article", "articleContent": "\nWhile influenza activity in the region is extremely low compared to other seasons, County health officials are urging San Diegans to get vaccinated to prevent getting sick.\nDec. 6 through Dec. 12 is National Influenza Vaccination Week and a perfect time for you and your family to get a flu shot.\n“With widespread transmission of novel coronavirus in our community, it’s so important everyone over six months old get a flu shot this year,” said Wilma Wooten, M.D., M.P.H., County public health officer.  “Every flu case prevented means more resources available to defeat COVID-19. And not only are you safer but you are helping others.”\nInfluenza is a serious respiratory illness and can make you very sick, cause you to miss work, school, and time that should be spent enjoying the holiday season. The flu can even be deadly for some people. Last season in San Diego County, 108 people died from the flu.\n“The flu vaccine is the best way to protect against influenza,” Wooten said.\nYour Best Shot Against the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nFlu vaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\n \nThe influenza vaccine is now available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 211 San Diego.\nTips to Prevent the Flu \nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nLast season, a total of 20,711 lab-confirmed flu cases were reported in the region.\n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201208.09.30.57"}