{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Asking Organizations to Host Sleeping Cabins as Emergency Shelter", "description": "The County’s Health and Human Services Agency is seeking organizations interested in partnering with the County to buy sleeping cabins to expand emergency housing options for unsheltered San Diegans. ", "datePublished": "2023-11-01T10:00:40-07:00", "url": "https://www.countynewscenter.com/county-asking-organizations-to-host-sleeping-cabins-as-emergency-shelter/", "keywords": ["housing", "building partnerships", "hhsa", "homeless", "housing", "hsec", "sleeping cabins", "unsheltered"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-11-01T10:00:40-07:00", "articleType": "article", "articleContent": "\nThe County’s Health and Human Services Agency is seeking partner organizations as it looks to purchase and place sleeping cabins. These cabins will expand emergency housing options for unsheltered San Diegans.\nThe Department of Homeless Solutions and Equitable Communities will open grant applications Nov. 1 for private organizations to purchase the cabins directly from a pre-approved vendor. \nDevelopment of the $1.5 million sleeping cabin program was approved last year by the San Diego County Board of Supervisors as part of ongoing efforts to expand shelter options for individuals and families in need.  \n“We are in a housing crisis and every new safe shelter made available can help someone move a step closer to securing permanent housing,” said Barbara Jiménez, County Community Operations Officer. “This is a unique opportunity for organizations with a parking lot or other space to help us quickly expand our capacity to safely shelter more people experiencing homelessness.” \nAbout 100 Pallet Shelter cabins will be made available to organizations through this program. Each cabin sleeps one to two people.  The cabins have storage space, a locking door and charging outlets. They are light and sturdy structures that can be quickly set up. \nPartner organizations chosen will receive cabins directly from Pallet Shelter. \nGrant funds will cover the purchase, delivery and assembly of sleeping cabins. Qualified partner organizations would need to operate the cabins on their property and serve people experiencing homelessness. Those selected would also need to have funding and infrastructure for setup, zoning, permitting, and ongoing facilities and services to maintain the site. \nOrganizations interested should email HSEC-OHS.HHSA@sdcounty.ca.gov to sign up for the informational webinar and/or receive an application packet. Qualified applicants will be reviewed in the order they are received and awarded on a rolling basis until all have been awarded. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231101.10.00.40"}