{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Works to Expand Flood Debris Recovery Program", "description": "County Public Works road crews are currently busy helping property owners remove and dispose of flood-damaged items following the torrential downpours last Monday. Next Monday, Jan. 29, the crews will get extra help from a contractor for a broader, comprehensive program.", "datePublished": "2024-01-26T12:36:07-08:00", "url": "https://www.countynewscenter.com/county-public-works-to-expand-flood-debris-recovery-program/", "keywords": ["government"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-01-26T12:36:07-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty Public Works road crews are currently busy helping property owners remove and dispose of flood-damaged items following the torrential downpours last Monday.\nNext Monday, Jan. 29, the crews will get extra help from a contractor for a broader, comprehensive program.\nThe crews will focus on some of the hardest-hit areas including but not limited to Spring Valley, La Presa, Winter Gardens and Bonita.\nIf you have flood damage to your property, call 2-1-1 and they will help you coordinate the flood debris removal.\nStarting Monday, Spring Valley, La Presa, Winter Gardens and Bonita residents can simply place the flood-damaged debris curbside leaving traffic lanes clear, and the County will pick up and properly dispose of the items.\nThis County-provided service is free of charge. No one will ask you for payment or personal information.\nIf you have flood damage to your property, call 2-1-1 and they will help you coordinate the flood debris removal.\nIf you’ve already submitted a damage assessment report through the County’s voluntary online survey and you’ve been asked for additional information, please provide it so the pick-up teams better understand your collection needs.\nFor other available resources, visit AlertSanDiego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240126.12.36.07"}