{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Santa Fe Senior Village Breaks Ground in Vista", "description": "A groundbreaking in North County this morning celebrated the County’s latest supportive housing development located in the city of Vista. Santa Fe Senior Village in downtown Vista will provide 54 fully furnished studio and one-bedroom apartment homes for seniors who are unhoused or at risk of being unhoused.", "datePublished": "2023-05-15T16:47:32-07:00", "url": "https://www.countynewscenter.com/santa-fe-senior-village-breaks-ground-in-vista/", "keywords": ["housing", "affordable housing", "groundbreaking", "housing insecurity", "santa fe senior village", "senior supportive housing", "senior veterans", "unhoused", "vista"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-05-15T17:03:12-07:00", "articleType": "article", "articleContent": "\nA groundbreaking in North County this morning celebrated the County’s latest supportive housing development located in the city of Vista. Santa Fe Senior Village in downtown Vista will provide 54 fully furnished studio and one-bedroom apartment homes for seniors who are unhoused or at risk of being unhoused. Two homes will be set aside for senior veterans experiencing housing insecurity.\nSanta Fe Senior Village will provide residents 62 years and above a permanent home along with full access to services including case management, mental health care, substance use services, counseling, and advocacy as well as peer support activities and physical health care. Santa Fe Senior Village will be next to the Vista Transit Center Station and within walking distance of a grocery store, public park, medical clinic, public library and restaurants. Onsite amenities will include a large community center, private offices a community garden and laundry facilities.\nDeveloped by National Core and the San Diego Community Housing Corporation, the County is contributing $9 million dollars to the project along with County Housing Authority Vouchers valued at $20 million. This is the third affordable housing groundbreaking supported by the County, and the second for seniors, in the last month.\nFor information about applications and eligibility, visit the website for National Core.\nSince the integration of Housing and Community Development Services into the County’s Health and Human Services Agency in 2017, more than $240 million dollars have been used toward affordable housing projects through our Innovative Housing Trust Fund, project-based vouchers, county excess property, and No Place Like Home funds. In the past six years, the County has supported the opening of more than 1,100 new affordable homes and an additional 3,144 units are on the way in the next 5 years.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230515.16.47.32"}