{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Community, County Leaders Preview New Immigrant and Refugee Welcome Center", "description": "County and community leaders gathered today to tour a new Welcome Center in National City that will serve San Diego’s immigrants and refugees. ", "datePublished": "2022-10-14T15:14:33-07:00", "url": "https://www.countynewscenter.com/community-county-leaders-preview-new-immigrant-and-refugee-welcome-center/", "keywords": [], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-10-14T15:14:33-07:00", "articleType": "video.other", "articleContent": "\nCounty and community leaders gathered today to tour a new Welcome Center in National City that will serve San Diego’s immigrants and refugees.  The center, scheduled to open by the end of the year, will open just over a year after the Board of Supervisors approved the establishment of a new office dedicated to providing critical support to immigrants and refugees.\n“As an immigrant, the creation of this first-of-its-kind Welcome Center is particularly important to me,” said Vice Chair Nora Vargas, San Diego County Board of Supervisors. “This center will serve as a hub where refugees and immigrants can receive services and resources they need to more easily incorporate into our community. As the safety net of our region, it is critical that we meet our communities where they’re at, including our refugee and immigrant community, and this center does just that.”\nThe Office of Immigrant and Refugee Affairs (OIRA) is part of the County’s Health and Human Services Agency’s (HHSA) Homeless Solutions and Equitable Communities department and was established in June 2021.\n“San Diego has a strong history of welcoming immigrants and people from diverse backgrounds,” said Nick Macchione, HHSA Director. “We are looking forward to the opening of this new Welcome Center and the services it will provide.”\nThe Welcome Center will connect individuals – from refugees to asylum seekers to longtime residents of the county-with a wide variety of resources and services all accessible in one building. These services include employment assistance, housing support, interpretation, referrals to legal services and health screenings.\nOIRA held two listening sessions to hear from service providers, community-based organizations, and members of the public to learn what they wanted to see in the Welcome Center, including which specific providers should offer services and resources.\n“We are already receiving some valuable feedback from our community about their needs. This space is for them. Our goal is to be open-armed and provide much-needed support as they settle into their lives here in San Diego County,” said Lucero Chavez Basilio, OIRA Director. “When we work together with the community and our partners, we can alleviate some of the stress individuals and families face.”\nCurrently, San Ysidro Health, Alliance for African Assistance, Jewish Family Service, SBCS and the Bilateral Safety Corridor Coalition are working collaboratively with OIRA and the list continues to grow.\nListening sessions are expected to continue with another meeting in the works for the end of the year.\nThe Welcome Center will be located at 401 Mile of Cars Way in National City inside the South Region Live Well Center.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221014.15.14.33"}