{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Storms Clear Out for Valentine’s Day Weddings", "description": "The day started with a few showers, but the sun came out for many couples saying “I do” on Valentine’s Day.", "datePublished": "2025-02-14T17:27:50-08:00", "url": "https://www.countynewscenter.com/storms-clear-out-for-valentines-day-weddings/", "keywords": ["families", "arcc", "county administration center", "valentine s day", "weddings"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-02-14T17:27:50-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe day started with a few showers, but the sun came out for many couples saying “I do” on Valentine’s Day.\nA flurry of bridal gowns, hearts and flowers took over wedding venues at Assessor/Recorder/County Clerk’s (ARCC) offices across the region Friday.\nFeb. 14 is traditionally one of the ARCC’s busiest days for weddings.\nBetween the four ARCC locations, 153 marriage licenses were issued, and 108 wedding ceremonies took place.\nThe busiest Valentine’s Day on record for the County was a decade ago. In 2014, the office issued 266 licenses and performed 242 ceremonies.\nValentine’s Day wedding appointments this year were booked days in advance, but those who made last minute decisions to tie the knot could still get married. Walk-ins were welcome at the ARCC’s office downtown.\nTwenty couples also found themselves the happy recipients of a free marriage license and ceremony package.\nARCC partnered with the Larry Himmel Neighborhood Foundation to cover the costs. Radio Channel 93.3 gave away ten of the donated wedding packages on their morning show that were good for 90-days. The neighborhood foundation treated the first ten wedding couples at the County Administration Center with free weddings, flowers and chocolates.\nThe ARCC’s current yearly average for marriage licenses comes to nearly 25,000. For ceremonies, the ARCC reports more than 12,000 ceremonies. Half of customers who request a marriage license also hold their wedding ceremonies at the ARCC’s office.\nFor more information on how to get a marriage license or reserve a date for a civil wedding ceremony, visit the Marriage License & Civil Ceremony website.\nSee some of the Valentine’s Day newlyweds or couples getting their marriage license at the County Administration Center below.\n  Nancy & AiraEbony & MichaelMayra & FernandoJen & BradLilly & FridelGriselda & ZaurindianaAlmaty & HectorBethany & ForrestMaria & EduardoDesirae & JoshuaNicole & AaronShayan & Sarvnaz  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250214.17.27.50"}