{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Introduces New COVID-19 Data Reporting Tools", "description": "The County of San Diego Health and Human Services Agency is updating its COVID-19 data reporting pages to provide users with a more interactive experience.", "datePublished": "2022-03-16T17:19:21-07:00", "url": "https://www.countynewscenter.com/county-introduces-new-covid-19-data-reporting-tools/", "keywords": ["health", "coronavirus", "covid", "covid-19", "covid-19 update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-03-17T08:40:55-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is updating its COVID-19 data reporting pages to provide users with a more interactive experience.\nAdditional graphics can help users better visualize COVID data trends over time, and the new tools allow users to choose options based on their interest.\nThe updated dashboard shows the number of confirmed COVID-19 cases, hospitalizations, and deaths over time. Users can choose between daily or weekly reporting data based on demographic group.\nAdditional data is available by hovering or clicking on various areas of the interactive charts. Information located above the graphs will help users navigate the charts. Separate links are provided to better display on mobile devices.\nThe website changes will result in certain reports that had been on the site no longer being available as the data are now accessible in the new format.\nAs announced last week, the updates include discontinuing the County’s Triggers Dashboard, which reported 13 surveillance, hospital capacity and public health response metrics. The County is now aligning with California’s SMARTER Plan, which state health officials are now using to respond to the COVID-19 pandemic and prepare for potential surges of the virus or new variants.\nVaccination Progress:\n\nReceived at least one shot: Close to 2.94 million or 93.4% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.58 million or 82.1%.\nBoosters administered: 1,193,449 or 55.3% of 2,159,057 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n43 new deaths were reported since the last report on March 9, 2022. The region’s total is 5,133.\n28 men and 15 women died between Jan. 4, 2022 and March 9, 2022.\n17 were age 80 or older, 11 were in their 70s, nine were in their 60s, one was in their 50s, four were in their 40s and one was in their 30s.\n18 of the people who died were fully vaccinated and 25 were not fully vaccinated.\n39 had underlying medical conditions and four had medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n375 COVID-19 cases were reported to the County on March 15, 2022. The region’s total is now 745,684.\n2,987 cases were reported in the past week (March 9 through March 15) compared to 3,599 infections identified the previous week (March 2 through March 8).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 11.3 for people fully vaccinated and boosted, 11.1 for fully vaccinated people and 25.6 for not fully vaccinated San Diegans.\n6,617 tests were reported to the County on March 13, 2022, and the percentage of new positive cases was 4.1%.\nThe 14-day rolling percentage of positive cases among tests reported through March 13, 2022 is 3.7%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220316.17.19.21"}