{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two Deer Mice Test Positive for Hantavirus", "description": "Two deer mice collected during routine vector surveillance activities in Boulevard have tested positive for hantavirus, County environmental health officials said this week.", "datePublished": "2021-04-28T16:05:28-07:00", "url": "https://www.countynewscenter.com/two-deer-mice-test-positive-for-hantavirus/", "keywords": ["health", "environmental health", "hantavirus", "lueg", "public health", "vector control"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-04-28T16:05:28-07:00", "articleType": "article", "articleContent": "\nTwo deer mice collected during routine vector surveillance activities in Boulevard have tested positive for hantavirus, County environmental health officials said this week.\nWhile this is the first detection of hantavirus in the region this year, the virus is not uncommon in San Diego County. In 2020, 25 rodents collected in routine monitoring by County Vector Control tested positive for hantavirus.\nThere is no cure or vaccine for hantavirus and it can potentially cause deadly infections in people. People can be exposed to hantavirus when wild rodents shed it in their urine, feces and saliva, the matter dries and is stirred into the air where people can breathe it in.\nHowever, people are rarely exposed to hantavirus because the main carriers are wild rodents that prefer to live in the wild away from people.\n“If you find rodents in or near your home, do not touch the animals and refrain from sweeping up or vacuuming up after them,” said Amy Harbert, director of the Department of Environmental Health and Quality. “Instead, use a wet-cleaning method to keep from breathing in the virus and getting sick.”\nRecommended wet cleaning methods include the use of bleach, disinfectants, rubber gloves and bags.\nHere are additional tips that can help people prevent being exposed to wild rodents and hantavirus, as well as details about using wet-cleaning methods.\nAvoid Exposure to Hantavirus\n\nSeal up all external holes in homes, garages and sheds larger than a dime to keep rodents from getting in.\nEliminate rodent infestations immediately.\nAvoid rodent-infested areas and do not stir up dust or materials that may be contaminated with rodent droppings and urine.\nClean up rodent droppings and urine using the wet cleaning method described below.\n\nUse “Wet-cleaning” Methods to Prevent Inhaling the Virus\n\nDo not sweep or vacuum infested areas.\nVentilate affected area by opening doors and windows for at least 30 minutes.\nUse rubber gloves. Spray a 10 percent bleach solution or other disinfectants onto dead rodents, rodent droppings, nests, contaminated traps, and surrounding areas and let the disinfectant stand for at least 15 minutes before cleaning.\nClean with a sponge or a mop that has been soaked in disinfectant.\nPlace disinfected rodents and debris into two plastic bags, seal them and discard in the trash.\nWash gloves in a bleach solution, then soap and water, and dispose of them using the same double-bag method.\nThoroughly wash your hands with soap and water.\n\nFor more information, contact the County Department of Environmental Health and Quality  (DEHQ) at (858) 694-2888 or visit the DEHQ hantavirus web page.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210428.16.05.28"}