{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Purple Flags Mark International Overdose Awareness Day Observance", "description": "“Together, we can, was the theme for the 23rd International Overdose Awareness Day (IOAD) and press conference at the County Administration Center. The annual event features a garden of purple flags, each one representing an overdose death in San Diego County. This year featured 1,203 purple flags, 97 fewer flags than last year.", "datePublished": "2024-08-29T16:02:35-07:00", "url": "https://www.countynewscenter.com/purple-flags-mark-international-overdose-awareness-day-observance/", "keywords": ["health", "access and crisis line", "behavioral health services", "fentanyl overdose", "harm reduction strategy", "international overdose awareness", "opioid overdose", "substance use disorder"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-08-30T12:18:06-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutes“Together, we can,” was the theme for the 23rd International Overdose Awareness Day (IOAD) and press conference at the County Administration Center.\nThe annual event featured a garden of purple flags, each one representing an overdose death in San Diego County. This year there were 1,203 purple flags, 97 fewer flags than last year.\nThe County Administration Center will also be lit up in purple on Aug. 31 in recognition of those who died from an overdose and their grieving loved ones left behind.\nInternational Overdose Awareness Day is an opportunity to raise awareness about fatal overdoses, eliminate stigma, share information about programs and services, and support those affected by drug-related deaths and injuries.\nAccidental fentanyl overdose deaths remain the number one killer of 18-to 45-year-olds.\nHowever, there is some encouraging news this year.\nThe San Diego County Substance Use and Overdose Prevention (SUOPT) 2024 Report Card, shows that accidental overdose deaths fell from 1,300 in 2022 to 1,203 in 2023, and unintentional fentanyl-caused deaths dropped from 814 to 749.\nFentanyl is a synthetic opioid that is up to 50 times stronger than heroin and 100 times stronger than morphine. It cannot be seen, smelled, or tasted and is often added to other drugs and illegal substances to make them cheaper, more powerful and more addictive.\n“Fentanyl is almost impossible to detect on your own so people may not even be aware they are taking it,” said Dr. Seema Shah, Interim Deputy Public Health Officer for the County. “In some cases, as little as two milligrams is enough to cause an overdose or even death.”\nOverdose deaths are preventable, and substance use disease is treatable.\n“We know treatment works for substance use disorders and we have to make it more accessible,” said Luke Bergmann, Director of Behavioral Health for the County. “We need to build connections between the treatment services that we have established and support, and the people they would benefit.”\nAs part of the County’s Harm Reduction Strategy, naloxone, an opioid overdose reversal medicine, and fentanyl test strips are available to anyone who wants them.\nSeveral locations across the county offer the public cost-free naloxone kits. Locations can be found by using the interactive Substance Use and Medication Assistance Treatment (MAT) and Naloxone Resource map.\nSimilarly, the interactive Prescription Drug Drop-Off Locator Map guides people to locations where they can safely dispose of unwanted medications.\nSubstance use treatment resources and support services are available by calling the County’s Access and Crisis Line at 888-724-7240 or the national Suicide and Crisis Lifeline at 988. These resources are available 24 hours a day, seven days a week and can provide help in over 150 languages.\nToday is the best day to start a recovery journey.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240829.16.02.35"}