{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What to Expect If a Contact Tracer Calls You", "description": "If you get a call from a number you don’t recognize, don’t automatically ignore it. The person on the other end could be calling from County Public Health Services to tell you you’ve been exposed to COVID-19.", "datePublished": "2020-06-02T09:21:04-07:00", "url": "https://www.countynewscenter.com/what-to-expect-if-a-contact-tracer-calls-you/", "keywords": ["health", "contact tracing", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-02T12:51:13-07:00", "articleType": "article", "articleContent": "\nIf you get a call from a number you don’t recognize, don’t automatically ignore it.\nThe person on the other end could be calling from County Public Health Services to tell you you’ve been exposed to COVID-19.\nThe County has been scaling up its contact tracing efforts as some stay-at-home restrictions are eased and people are out more and heading back to work.\nContact tracing is done by local and state health departments when certain infectious diseases are reported. This is a classic method that public health has been using for decades.\nThe County has been doing contact tracing of positive COVID-19 cases in the region. To date, the entire COVID-19 disease control response team consists of about 400 disease fighters of which there are more than 200 contact tracers and more being trained. Since May 4, the team has investigated more than 3,100 close contacts in cases where tracing activities were initiated. Nearly 85% of these close contacts were associated with the same household as a confirmed case.\nCounty Communicable Disease Investigator Ernie Awa conducts contact tracing training.\nWhy is Contact Tracing Important?\nWhen trying to contain or mitigate the spread of COVID-19, time, and contact tracers, are of the essence.\nTracers need to identify close contacts of a positive case immediately and make sure they do not interact with others. This is critical to protect communities from further spread of the virus.\nTo effectively do that, the County has determined that 450 contact tracers need to be hired and trained.\n“Without robust contact tracing in place, the spread of COVID-19 is likely to increase to the point that the region would need to step back and adopt strict mitigation strategies to contain the virus,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nWhat a Contact Tracer Needs to Know\nWhen a confirmed case is investigated by Public Health staff, the investigator works with the case to identify all close contacts who may have been exposed. Contact tracers take it from there and attempt to get in touch with all these contacts so that they can be self-quarantined at home and monitored for symptoms of COVID-19, which typically are a fever, cough or shortness of breath or difficulty breathing.\nIf you test positive for COVID-19, your doctor or another health official will let you know. A positive case must be reported to County Public Health Services so that each confirmed case can be used to help in identifying others who may have been exposed. Contact tracing can start the process of reaching out to the close contacts.\n“When a contact tracer calls you, it is important that you answer because immediate action is needed,” Wooten said.\nIf you don’t answer, the contact tracer should leave a voicemail message. Call the contact tracer back because they need to know that you have isolated yourself and who you have had close contact with.\nThe contact tracer will identify themselves as being part of the County and all information gathered during the contact tracing effort is kept confidential. The goal is developing trust and a partnership with the contact to fight the virus together and slow the spread.\nWhat to Do if You’ve Been Exposed to COVID-19\nTracers call those who were a close contact with a person with COVID-19. According to the Centers for Disease Control and Prevention, a close contact is someone who was within six feet of an infected person for at least 15 minutes starting from 48 hours before symptoms developed in the case and until the time the patient is isolated.\nIf you are placed under self-quarantine, this is what you will be asked to do:\n\nStay home as much as possible for 14 days\nMaintain physical distance from others who were not exposed\nMonitor yourself for symptoms and take your temperature twice daily\nDo not share utensils, cups or glasses\nUse good hand hygiene and wash your hands thoroughly with soap and water\n\n“We now know that people without symptoms can spread COVID-19. That’s why it’s important that people who were exposed to someone with the virus stay home and away from others,” Dr. Wooten said.\nA County Public Health nurse or health care worker might also check on you occasionally to make sure you’re staying away from others to find out if you’ve developed symptoms and link you to support and services you might need.\nIf you are identified as a close contact and develop symptoms, you should immediately isolate yourself and notify your case manager and your doctor to get care and testing if needed. If you don’t have a place to isolate, the county will provide a paid hotel for the duration of the isolation.\nUntil a vaccine is available, contact tracing will be an important activity to further prevent the spread of COVID-19 in our region.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200602.09.21.04"}