{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Dine-In Restaurants, Other Indoor Activities to Close in County", "description": "Indoor dining at restaurants, bars, breweries and wineries will close July 7 for at least three weeks, after the County remained on the state’s Monitoring List for three consecutive days due to the region’s high number of COVID-19 cases.", "datePublished": "2020-07-06T18:50:50-07:00", "url": "https://www.countynewscenter.com/dine-in-restaurants-other-indoor-activities-to-close-in-county/", "keywords": ["health", "coronavirus", "covid-19", "dine-in closures"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-08T09:25:19-07:00", "articleType": "article", "articleContent": "\nIndoor dining at restaurants, bars, breweries and wineries will close July 7 for at least three weeks, after the County remained on the state’s Monitoring List for three consecutive days due to the region’s high number of COVID-19 cases.\nOutdoor/patio dining today is still permitted until 10 p.m., but patrons must leave the premises by 11 p.m. Also, pickup, delivery and drive-thru can still occur.\nState guidance requires that indoor activities be closed in the 23 counties in the state that have more than 100 COVID-19 cases per every 100,000 residents in a 14-day period, after being on California’s watchlist for three days.\nIn the past three days, the rate of COVID-19 cases in San Diego County using the state’s formula is now at 136.1.\n“This metric has been abnormal for several days,” said Wilma Wooten, M.D., M.P.H., County public health officer, adding that it coincides with more outbreaks in community settings, especially in restaurants and bars. “This supports the actions we are taking today and that are being imposed upon us.”\nIndoor activities also will be restricted at movie theaters, family entertainment centers such as bowling alleys and batting cages, as well as museums, zoos and cardrooms.\nIndoor activities will be restricted for at least three weeks, a requirement the state implemented to slow the spread of COVID-19. If the rate of infection for the region does not fall below 100, the period of restrictions could be extended unless the state issues new guidance.\nMore Young People Getting Infected\nIn recent weeks, the percentage of cases in people between 20 and 39 years old has been increasing compared to other age groups. Currently, they represent about 50% of the cases being reported.\n“The surge in cases is occurring in these age groups because they are less likely to wear a face covering and maintain physical distance,” Wooten said.\nWhen outside the home, San Diegans should do the following to protect themselves and others:\n\nPractice good hand hygiene and sanitation\nKeep six feet apart\nWear a face covering\nAvoid crowded places\nStay home if they are sick\n\nCOVID-19 Triggers, Tests, Cases and Deaths\nCommunity Setting Outbreaks and Other Triggers:\n\nOne new outbreak was reported July 5, in a restaurant/bar.\nIn the past seven days, 21 community setting outbreaks were identified.\nThe number of new outbreaks in community settings is above the trigger of seven in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\nThe County also reached the Case Investigation trigger because only 57% of investigations were initiated within 24 hours of notification over a 7-day period. The percentage should be at least 71%.\n\nTesting:\n\n7,667 tests were reported to the County July 5 and 4% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 5.4%.\nThe 7-day daily average of tests is 7,730.\n\nCases:\n\n274 were reported July 5 in San Diego County for a total of 17,000.\n1,912 or 11.2% of cases have required hospitalization.\n516 or 3% of all cases and 27% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo COVID-19 deaths were reported July 5, and the region’s total remains at 387.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200706.18.50.50"}