{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Supervisor Sworn Into Office", "description": "A new member of the San Diego County Board of Supervisors was sworn in Tuesday at the County Administration Center.", "datePublished": "2023-12-05T14:29:12-08:00", "url": "https://www.countynewscenter.com/new-county-supervisor-sworn-into-office/", "keywords": ["government", "2023 swearing-in ceremony", "board of supervisors", "district 4", "monica montgomery steppe", "supervisor monica montgomery steppe", "swearing in"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2023-12-05T14:57:05-08:00", "articleType": "article", "articleContent": "\nA new member of the San Diego County Board of Supervisors was sworn in Tuesday at the County Administration Center.\nSupervisor Monica Montgomery Steppe will represent the Fourth Supervisorial District for the remainder of the current term ending in January 2027.\nSupervisor Montgomery Steppe was sworn in by her father-in-law Cecil Steppe and joined by her husband Steve while reciting her oath. She becomes the county’s first Black woman supervisor.\n“We know that today marks a momentous occasion in our county’s history, filled with promise, filled with hope and filled with progress,” Supervisor Montgomery Steppe said. “As I stand before you, deeply humbled and immensely grateful, l am acutely aware of the weight of responsibility and the honor to be chosen by the people as the first Black woman to serve on the San Diego County Board of Supervisors in the history of this county. I am truly honored.”\nDistrict 4 voters selected Montgomery Steppe to fill the vacant board seat during the Nov. 7 special election. She previously served as a council member for the City of San Diego.\n“This moment also belongs to every person who dared to dream, who fought against adversity and believed in the possibility of a more inclusive and equitable future for our community,” Supervisor Montgomery Steppe said. “I stand on the shoulders of countless individuals who paved the way, breaking barriers and clearing the path for diversity, representation and for change.\nDistrict 4 includes the following areas: Alta Vista, Azalea Park, Balboa Park, Bankers Hill, Bay Park, Bay Terraces, Birdland, Broadway Heights, Casa de Oro – Mount Helix, Chollas Creek, Chollas View, City Heights, City of La Mesa, City of Lemon Grove, Civita, Clairemont Mesa, College Area, El Cerrito, Emerald Hills, Encanto, Hillcrest, Kensington-Talmadge, Lincoln Park, Linda Vista, Lomita Village, Mid-City, Middletown, Mission Hills, Mission Valley, Montezuma Mesa-SDSU, Morena, Normal Heights, North Bay Terraces, North Clairemont, North Park, Oak Park, Old Town, Paradise Hills, Portions of Grantville, Portions of Kearny Mesa, Portions of Spring Valley, Rancho San Diego, Rolando, Serra Mesa, Skyline, University Heights, Valencia Park, and Webster.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231205.14.29.12"}