{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Record Meth, Prescription Drug, Fentanyl Deaths Reported in County", "description": "A total of 722 San Diegans died because of meth and another 576 people died due to prescription drugs in the region last year, the Methamphetamine Strike Force and Prescription Drug Abuse Task Force announced today.", "datePublished": "2021-09-21T16:42:10-07:00", "url": "https://www.countynewscenter.com/record-meth-prescription-drug-fentanyl-deaths-reported-in-county/", "keywords": ["health", "fentanyl", "meth", "methamphetamine", "opioids", "prescription drugs"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-22T08:07:51-07:00", "articleType": "article", "articleContent": "\nSubstance abuse continues to take a toll on San Diego County residents and communities.\nA total of 722 San Diegans died with meth in their system and another 576 people died due to prescription drugs in the region last year, the Methamphetamine Strike Force and Prescription Drug Abuse Task Force announced today.\nThe Meth Report Card shows the new figure far exceeds the previous record set in 2019 when 546 deaths reported.\nThe prescription drug and opioid deaths reported in 2020 more than double the 275 fatalities reported in 2019.\nThe prescription drug report also includes statistics on fentanyl. It shows that a record 462 people died from fentanyl in 2020, compared to 151 the year before that. Fentanyl is a synthetic opioid primarily coming from Mexico that is 50 to 100 times more potent than morphine and 25 to 50 times stronger than heroin.\nKey Meth Indicators\nThe 2021 meth report card was released by District Attorney Summer Stephan and Holly Porter, deputy chief administrative officer for the County Public Safety Group. The report card shows the leading indicators of meth problems in the region.\nThe 2021 Meth Report Card also shows:\n\n566 men and 156 women died with meth in their system.\nThere were 16,309 emergency room visits due to methamphetamines in 2019 compared to 13,020 in 2018. Data from 2020 will be available in 2022.\nA total of 4,740 people were admitted to County-funded treatment programs due to meth abuse last year, vs. 6,591 in 2019.\n56% of adult arrestees tested positive for meth in 2020, compared to 59% the previous year.\n8% of juvenile arrestees tested positive for meth in 2020, compared to 11% in 2019.\nArrests for selling and possession of meth decreased to 7,211 compared to 11,313 in 2019.\n\n\nPrescription Drug Problem in San Diego\nThe Prescription Drug Report Card was released by task force tri-chairs Cindy Cipriani, senior management counsel at the Office of the U.S. Attorney, Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency and Dr. Steven Campman, County chief medical examiner.\nIn addition to deaths, the Prescription Drug Report Card tracks additional key indicators of opioid misuse in the region. It also shows the following (most recent years for which numbers are available vary by statistic):\n\n430 men and 146 women died from prescription drugs.\n7,723 visits to local emergency rooms in 2019, compared to 6,162 in 2018. Data for last year is not yet available.\n10% of 11th graders reported prescription drug use in 2019, the same percent as in 2017. The survey is done every two years.\n46% of adults arrested reported misusing prescription drugs in 2020, the same as the year before.\n\nAn important tool to prevent opioid overdose is naloxone, also known by the brand name Narcan, which is a medication used to reverse some overdoses by restoring normal breathing. Naloxone can be used to prevent opioid overdose, if used quickly and followed by medical treatment.\nTreatment is Available\nThe County funds residential and outpatient treatment programs across the region to help people recover from substance use disorders.\nParticipation in treatment and recovery services improves wellbeing, can reunite families and loved ones, and also improves overall health.\nSubstance use treatment resources are available by calling the County’s Access and Crisis Line at (888) 724-7240 or 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210921.16.42.10"}