{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Behind the Scenes Peek at the New Public Health Lab’s Construction", "description": "The County's new state-of-the-art public health lab in Kearny Mesa is on schedule to open in spring 2025. The $93 million dollar facility will greatly expand the county’s ability to test for infectious diseases, monitor food and water safety, and test for dangerous pathogens.", "datePublished": "2025-01-08T12:31:58-08:00", "url": "https://www.countynewscenter.com/behind-the-scenes-peek-at-the-new-public-health-labs-construction/", "keywords": ["health", "county operations center", "epidemiology", "hhsa", "infectious disease", "phs", "public health lab"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-01-08T16:36:09-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteAnticipation and excitement are building as the County’s new $93 million public health laboratory and garage nears completion.\nScheduled to open in late spring 2025, the 52,000 square foot building is three times larger than the County’s previous cramped and outdated public health lab that was limited by its aging infrastructure.\nThe new two-story public health lab at the County Operations Center in Kearny Mesa will greatly expand the county’s ability to test for infectious diseases, monitor food and water safety, and test for dangerous pathogens. It will also provide additional services like whole genome sequencing and testing for tuberculosis.\nAdditionally, the state-of-the-art lab will be a regional resource, serving as the Centers for Disease Control and Prevention Lab for San Diego and Imperial Counties. The lab will also provide teaching and training opportunities for public health microbiologists and hospital partners in the community.\nThe CDC Epidemiology and Laboratory Capacity fund as well as the State’s Future of Public Health program contributed to the new lab.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250108.12.31.58"}