{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Recommends Syphilis Screenings During Pregnancy as Infant Cases Rise    ", "description": "Cases of babies born with syphilis have increased in San Diego County, reaching a record 35 in 2022, according to new data from County Public Health officials.  ", "datePublished": "2024-03-26T08:10:51-07:00", "url": "https://www.countynewscenter.com/county-recommends-syphilis-screenings-during-pregnancy-as-infant-cases-rise/", "keywords": ["health", "congenital syphilis", "pregnancy", "syphilis screening"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-03-26T09:57:57-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCases of babies born with syphilis have increased in San Diego County, reaching a record 35 in 2022, according to new data from County Public Health officials.  \nSyphilis is a contagious bacterial infection that can be spread through sexual contact or from a birthing parent to a baby during pregnancy. That is called congenital syphilis and can lead to miscarriage, stillbirth, major health problems in babies, and even death, if not treated.  \nThe number of congenital syphilis cases in 2022 is up from 30 in 2021 and includes two stillbirths. Since 2013, the rate of congenital syphilis has increased by almost 1,200 percent.  \nCases of syphilis in women of potential childbearing age, between 15 to 49 years, have also increased from 369 in 2021 to 424 cases in 2022.  \nCounty public health officials are reminding those who are pregnant or planning to become pregnant to talk to their healthcare provider about getting tested.   \n“You can protect your baby by getting tested during your first prenatal visit to your doctor and during your third trimester visit, and then getting treatment during your pregnancy if you do have syphilis.” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “It’s important to get tested because you can have syphilis and not know it and unfortunately pass it on to your baby.” \nSyphilis symptoms can be mild or feel like symptoms for other health problems. It can be treated with antibiotics, even during pregnancy.  \nSexual partners of a person with syphilis should also be tested and treated to prevent the pregnant person from getting infected again.  \nSyphilis in babies causes bone abnormalities, severe anemia, enlarged livers or spleens, and brain and nerve problems like loss of vision or hearing.   \nOverall, syphilis cases, including congenital syphilis, have steadily risen nationwide since the early 2000s with the exception of a slight decrease from 2021 to 2022. \nResources for syphilis and other STD testing is available at County Public Health centers. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240326.08.10.51"}