{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Suicide Report Shows Small Increase in Suicide Deaths Overall, but Youth High Risk", "description": "The number of confirmed suicide deaths in San Diego County in 2023 was 363, a 1 percent increase from the 359 deaths the previous year, and a 6 percent increase since 2021. The newest data on suicide in our region was shared at a press conference today by County leaders in Behavioral Health and the Suicide Prevention Council.", "datePublished": "2025-01-13T16:10:51-08:00", "url": "https://www.countynewscenter.com/suicide-report-shows-small-increase-in-suicide-deaths-overall-but-youth-high-risk/", "keywords": ["health", "access and crisis line", "mcrt", "report to the community", "spc", "suicide", "suicide attempt", "suicide ideation", "suicide prevention council"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-01-13T16:31:12-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe number of confirmed suicide deaths in San Diego County in 2023 was 363, a 1 percent increase from the 359 deaths the previous year, and a 6 percent increase since 2021.\nOverall, from 2019 to 2023, the suicide death rate has been trending down, with a 12 percent decrease in deaths. These numbers do not include individuals who attempted suicide and survived.\nCounty Supervisor Terra Lawson-Remer and Behavioral Health Services Director Luke Bergmann, shared the updated information today at the San Diego County Suicide Prevention Council’s annual Report to the Community press conference.\nThe report is a compilation of the most recent data on suicide in the County. Suicide rates are determined by the number of deaths per 100,000 population. Because it takes time to gather the data, the results are generally a year behind.\nBroken down by demographics, suicide death rates in 2023 were highest among male residents, aged 65 or older, Non-Hispanic White, or living in East Region which geographically had the highest rate of suicide death in our county.\nFirearms accounted for more than half the deaths by suicide for people 65 years and up. Firearms were also the most common method of death for males.\n“We want everyone in San Diego County to know that you, personally, have the power to start a conversation about suicide and even help to prevent one. Use this action plan to get informed and learn how to make a difference,” said Supervisor Terra Lawson-Remer, Vice Chair of the Board of Supervisors. “Guns are the most-reported form of suicide in our region, so the Board of Supervisors will continue to pursue common-sense regulations like safe gun storage, so firearms are secured and less likely to fall into the wrong hands.”\nFrom 2022 to 2023, youth aged 10 to 24 experienced a 56 percent increase in suicide rates.\nIn November, 2024, the County’s Behavioral Health Services began deploying Mobile Crisis Response Teams to school districts across San Diego County. The Helping, Engaging, Reconnecting, and Educating (HERE) Now program has reached more than 3,800 students providing suicide risk assessments and interventions.\nThe county’s suicide data reinforces the ongoing need to promote education, training, wellness and recovery to reduce suicides and the devastating impact they have on our communities.\nThe SPC offers suicide prevention trainings on how to best recognize warning signs, provide resource information, and assist their loved ones through open and direct communication. Learn more about these cost-free trainings at www.SPCSanDiego.org.\nSuicide can be prevented. If you or a loved one are in need of support, please call seven days a week/24 hours a day the Access & Crisis Line (ACL) at 888-724-7240. You don’t need to be in crisis to call. You can also request an MCRT at this phone number.\nCounselors offer support and resources if you are in crisis, just need to talk, or have questions on how to offer support to someone else. The line is free, confidential, and assistance is available in over 200 languages. You can also call the national Suicide and Crisis Lifeline at 988.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250113.16.10.51"}