{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Sharp Increase of COVID Cases After Thanksgiving Holiday", "description": "The County of San Diego Health and Human Services Agency is reporting a spike in new COVID-19 cases.", "datePublished": "2022-12-08T17:00:37-08:00", "url": "https://www.countynewscenter.com/sharp-increase-of-covid-cases-after-thanksgiving-holiday/", "keywords": ["health", "coronavirus", "covid-19", "flu", "influenza"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-12-08T17:15:14-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is reporting a spike in new COVID-19 cases. The 5,649 lab-confirmed cases reported this week represent an increase of more than 63 percent when compared to the previous week, when 3,455 new infections were reported.\nWhile flu cases are slightly down compared to last week, wastewater data shows a continued increasing trend. The County is reporting 2,583 new lab-confirmed cases of influenza this week. Last week, 2,721 cases were reported. By this time last year, 539 flu cases had been reported for the entire season up to this point.\n“Holiday gatherings, especially indoors, can increase the spread of respiratory viruses like COVID-19 and flu as we’re seeing after the Thanksgiving holiday,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “San Diego County residents know how to keep loved ones safe when gathering for celebrations, as they have done so in the past. Masking, home testing and vaccinations can help ensure you and your families don’t spend this holiday season sick or worse.”\nThe bivalent COVID-19 booster and flu vaccinations are separate shots that are both effective at decreasing the chance of catching the targeted viruses, being hospitalized, or dying. County officials strongly advise all eligible residents get both. Wearing a mask if able, particularly during indoor public gatherings, will help protect you and those around you.\nIn addition to vaccination and masking, there are a number of other precautions San Diegans can take to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often;\nStaying away from sick people;\nStaying home and avoiding contact with others when sick;\nHome testing when exposed or when ill;\nRegularly cleaning commonly touched surfaces.\n\n“These steps will help protect our critical hospital capacity and your loved ones,” Kaiser said. “I also want to remind everyone it’s never too late to get a flu shot or a bivalent COVID booster.”\nCOVID-19 Vaccination Progress:\n\nClose to 2.69 million or 80.4% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 449,633 or 18% of 2,493,367 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nCOVID-19 Deaths:\n\n15 additional deaths were reported since the last report on Dec. 1, 2022. The region’s total is 5,584.\nOf the 15 additional deaths, seven were women and eight were men. They died between March 1, 2022 and Nov. 29, 2022. Five of the newly reported deaths occurred in the last two weeks.\nTen of the people who died were 80 years or older, four were in their 70s and one was in their 60s.\n12 of these individuals had been vaccinated and three had not received any COVID-19 vaccines.\nAll had underlying medical conditions.\n\nCOVID-19 Cases, Case Rates and Testing:\n\n5,649 COVID-19 cases were reported to the County in the past seven days (Nov. 29 to Dec. 5, 2022). The region’s total is now 947,909.\nThe 5,649 cases reported in the past week were higher compared to the 3,455 infections identified the previous week (Nov. 22 to Nov. 28, 2022).\n6,329 tests were reported to the County on Dec. 3, and the percentage of new positive cases was 12% (Data through Dec. 3).\nThe 14-day rolling percentage of positive cases, among tests reported through Dec. 3, is 9.4%.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Dec. 3, 2022, the report shows the following:\n\nFive additional flu deaths; the season’s total is now 13.\nThree of the additional flu deaths were women and two were men. They died between Nov. 24, 2022 and Nov. 29, 2022.\nTwo of them had received a flu shot this season and three had not.\nAll had underlying medical conditions and none of the newly-reported deaths were coinfected with COVID-19.\nEmergency department visits for influenza-like illness: 10% of all visits (compared with 11% the previous week).\nLab-confirmed influenza cases for the week: 2,583 (compared to 2,721 the previous week).\nTotal lab-confirmed cases to date: 15,560 (compared to 539 at the same time last season and a 611 prior 5-year average during the same week).\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221208.17.00.37"}