{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Cases Decline, County Urges People to Get  Vaccinated, Boosted", "description": "COVID-19 cases are currently decreasing across San Diego County, but County health officials continue to urge people to get the primary vaccine series and the bivalent boosters because coronavirus is still widespread, and vaccinations protect against serious illness and death.", "datePublished": "2023-02-02T17:52:06-08:00", "url": "https://www.countynewscenter.com/covid-19-cases-decline-county-urges-people-to-get-vaccinated-boosted/", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19", "public health", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-02-03T09:24:32-08:00", "articleType": "article", "articleContent": "\nCOVID-19 cases are currently decreasing across San Diego County, but County health officials continue to urge people to get the primary vaccine series and the bivalent boosters. The SARS-CoV-2 virus is still widespread in the community, and vaccinations protect against serious illness, and even death.\nNew studies continue to report the bivalent COVID-19 boosters add protection against new COVID-19 variants that now make up about 40% of new cases in the U.S. and protect against COVID-19 causing hospitalizations and deaths.\nBoth COVID-19 vaccinations and treatment remain widely available throughout San Diego County. COVID-19 primary series vaccines, bivalent boosters, and flu vaccines are available at local pharmacies, medical providers’ offices, and County vaccination sites. People can check online for the days and hours sites are open.\n“It is encouraging that COVID-19 cases appear to be declining, but it remains important that people continue to protect themselves by getting vaccinated if they haven’t already done so,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “Cases, hospitalizations, and deaths are still occurring in San Diego County. Studies show COVID-19 vaccines and bivalent boosters can protect you, your family and friends from getting seriously ill. So please, get vaccinated and boosted if you haven’t.”\nThe Centers for Disease Control and Prevention (CDC) and California Department of Public Health (CDPH) recommend a bivalent booster for everyone six months of age and older. Previous CDC studies have reported that people who have not been vaccinated run much higher risks of dying from COVID-19 than those who have been vaccinated.\nCOVID-19 Prevention, Treatment\nCounty public health officials notified medical providers last week that Evusheld, a COVID-19 prevention drug, is no longer available for emergency use. That was because the Federal Food and Drug Administration (FDA) said it was not effective against new COVID-19 variants. However, Paxlovid, which is effective, is still widely available. Information about treatment can be found on the County’s COVID-19 treatment webpage.\nPreventive Measures   \nIn addition to vaccination and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often.\nStaying away from sick people.\nWearing a facial covering, especially in crowded indoor settings.\nRegularly cleaning commonly touched surfaces.\nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County’s COVID-19 testing webpage.\n\nCOVID-19 Vaccination Progress \n\nMore than 2.69 million or 80.6% of San Diegans have received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 563,047 or 22.5% of 2,498,936 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators.\nCOVID-19 Data \nFor the week ending Jan. 28, 2023, the report shows:\n\n1,816 COVID-19 cases were reported to the County in the past seven days. The region’s total is now 976,826.\nThe 1,816 cases reported in the past week were lower compared to the 1,922 infections identified the previous week.\nTwelve additional deaths were reported in the week ending Jan. 28, 2023. The region’s total is 5,728.\nTen of the people who died were 65 or older.\nSeven of the people had been vaccinated and five were unvaccinated or had not completed the primary vaccine series.\nEleven had underlying medical conditions. One determination of underlying medical conditions is pending.\n\nInfluenza Data \nFor the week ending Jan. 28, 2023, the report shows the following:\n\nNo additional flu deaths were reported; the season’s total is 39.\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 3% the previous week).\nLab-confirmed influenza cases for the week: 88 (compared to 89 the previous week).\nTotal lab-confirmed cases to date: 20,726 (compared to 1,490 at the same time last season and a 6,617 prior 5-year average during the same week).\n\nMore Information\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230202.17.52.06"}