{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "This Holiday Season, Tips to Reduce Food Waste", "description": "The holiday season often means food, food and more food! It’s also a time that it becomes pretty easy to waste food. So here are some tips to reduce food waste and enjoy your holidays.", "datePublished": "2023-11-21T09:00:14-08:00", "url": "https://www.countynewscenter.com/this-holiday-season-tips-to-reduce-food-waste/", "keywords": ["consumer", "food waste", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-11-21T09:00:14-08:00", "articleType": "article", "articleContent": "\nMan―the holiday season! For many of us it means food, food and more food!\nAnd it’s also a time, as our feasts run from Thanksgiving through New Year’s, that it becomes pretty easy to waste food. Like when it’s served up but we’re too full to have another bite, or when it goes bad before we eat the leftovers.\nIt’s hard to believe, but every year in the U.S. up to 40% of the total food supply goes to waste, according to the United States Department of Agriculture and County of San Diego.\nThat’s not only a waste of good food, it’s also really hard on your wallet. The Environmental Protection Agency (EPA) estimates the average family of four spends $1,500 a year on food that they end up not eating. It also wastes the land, water, energy and things used to produce, transport, prepare and store food.\nAnd get this, food waste can even make climate change worse.\nThat’s because when you toss organic matter―like food waste―into landfills to decompose, it creates methane, a greenhouse gas pollutant. The EPA said in 2022 that methane traps about 80 times the heat that carbon dioxide does and is responsible for roughly one-third of the warming from greenhouse gases occurring today.\nSo with all of that in mind, here are some simple steps you can take to stop wasting food, save money and even fight climate change.\nReduce Wasted Food — Shop and Plan Wisely\nThe easiest way to reduce wasting food, during the holidays or just day to day, is to not cook too much, right? To help, plan ahead, shop smart and serve just enough food to make everyone happy. Of course, that sounds easy. But it can be hard to do. How do you know how much food is enough? SaveTheFood.com has a “Guest-imator” that can help you calculate how much food you need to prepare, based on how many people you’re serving and how much they typically eat, even for Thanksgiving. And yes, it can even calculate having leftovers if you want them.\nFreeze or Find Ways to Reuse Leftovers\nOf course, even the best planners can end up with leftovers sometimes, especially at a big event like Thanksgiving. But you don’t have to let them go to waste. If you’re having guests, provide to-go containers, or invite your guests to bring their own, so they can take leftovers home with them. Rethink your leftovers and use them as ingredients for new meals. Leftover meat and vegetables can make a great soup or casserole. Or turn mashed potatoes into potato pancakes. And of course, you can freeze leftovers to use in future meals.\nCompost What’s Left!\nAnd don’t forget to compost leftovers. If you don’t have your own compost pile or bin, you can place any remaining food scraps and organic waste into your curbside green bin! (Note: If you do have your own compost bin at home, you probably want to avoid composting meats and bones; they can attract unwanted pests.)\nRecycling and Cutting Down on Wasting Food Can Keep Your Pipes Clean\nBelieve it or not, recycling and cutting back on wasting food can even protect your house. That’s because cooking oils and grease can gunk up your plumbing and even cause sewage overflows if you discard them down your sink’s drain. Making sure you’re not over-preparing food can cut down on the amount of cooking oils you’re using. And keeping used oils out of your plumbing by collecting them and recycling them can keep your pipes clean and your house protected. Contrary to popular belief, mixing used oils with soap, or pouring hot water down the drain after discarding oils in the sink, doesn’t prevent fat clogs that can back up your pipes.\nThere are free drop-off locations for used cooking oils all around the county. Just collect your used cooking oils in a secure container with a lid and label it “used cooking oil.” Don’t mix chemicals or other liquids in with them. To find the nearest drop-off location, visit the County’s Recycling and Household Hazardous Waste database, WasteFreeSD.org, or call 1-877-R-1-EARTH (1-877-713-2784).\nTo learn more about reducing wasting food, visit the County’s Solid Waste Planning and Recycling website. And have a great Holiday season!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231121.09.00.14"}