{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Child and Family Well-Being Department Celebrates One Year of Transformation, Achievements", "description": "The County’s Child and Family Well-Being Department (CFWB) is celebrating its first anniversary in what will be a multiyear transition focused on providing prevention and support services through one dynamic department. ", "datePublished": "2024-07-24T15:45:25-07:00", "url": "https://www.countynewscenter.com/countys-child-and-family-well-being-department-celebrates-one-year-of-transformation-achievements/", "keywords": ["families", "alethea arguilez", "cfwb", "first anniversary", "kim giardina"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-07-24T16:02:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Child and Family Well-Being Department (CFWB) is celebrating its first anniversary in what will be a multiyear transition focused on providing prevention and support services through one dynamic department. \nThis change reflects a shift in how the County focuses on and supports families.  \n“We work to keep children and teens out of the child welfare system while creating partnerships with their families. These partnerships help us leverage their lived experience and personal expertise in keeping their children safe,” Kim Giardina, DSW, director of Child and Family Well-Being said. \n\n\nThe department uses data and insights from subject-matter experts and has caught the attention of advocates around the world. \nIn its first year, the CFWB reduced the number of children in foster care by nearly 12 percent. For children who did need the protection of foster care, 44 percent were placed with relatives—marking a 10 percent increase over the previous year. \nChild and Family Well-Being was created by merging the First 5 Commission and Child Welfare Services.  \n“It is always exciting to have the opportunity to innovate to serve and our teams have done a great job adapting to the new vision focused on prevention,” said Alethea Arguilez, assistant director of the Office of Child and Family Strengthening. “We look forward to continuing to collaborate with our community partners to work toward the best future for our families and children we serve and the region as a whole.”  \nOver this first year, the department launched new programs, including the Workforce Investment and Shared Services Alliance programs for child care providers countywide. Additionally, the new Family Income for Empowerment program is already providing cash supplements for 350 families.  \nThe County’s Office of Evaluation, Performance, and Analytics (OEPA) is evaluating how the Family Income for Empowerment program’s economic support impacts well-being and strengthens families. OEPA aims to improve the quality of life for people in San Diego County by supporting County decisions through robust data and evidence. \n\nCFWB is working on a “prevention hub” that will connect families with a variety of preventative services and is scheduled to launch in spring 2025. It is designed to help those who don’t know where to start and need support. Set to be run by SAY San Diego, the prevention hub will have trained personnel who can guide families through challenges and connect them to services. \nThe department has hired 150 new team members to support case management and operations and launched a Mandated Reporter Portal, creating an easier process for mandated reporters to communicate directly with CFWB staff and ultimately keep children safe. \nThe department continues to evolve and work with the community and experts to identify the various ways to best serve families. This includes developing a Community Response Guide and continuing efforts related to the Child Care Blueprint.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240724.15.45.25"}