{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Move to Red Tier March 17", "description": "Given that the state has met a mark of vaccinating 2 million people in the communities hardest hit  by COVID-19, it has revised its tier system, and San Diego County is expected to move to the Red Tier for activities March 17.", "datePublished": "2021-03-12T18:23:58-08:00", "url": "https://www.countynewscenter.com/county-to-move-to-red-tier-march-17/", "keywords": ["health", "16 to 64", "chronic conditions", "coronavirus", "covid-19", "red tier"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-13T10:40:19-08:00", "articleType": "article", "articleContent": "\nGiven that the state has met a mark of vaccinating 2 million people in the communities hardest hit  by COVID-19, it has revised its tier system, and San Diego County is expected to move to the Red Tier for activities March 17.\nThe change in tiers will allow indoor operations to resume, at limited capacity and with modifications, at restaurants, gyms, movie theaters and other establishments.\nSan Diego and 11 other counties are moving to the less restrictive Red Tier, which now requires a case rate of four to 10 COVID-19 cases per 100,000 residents. San Diego County’s state-calculated, adjusted case rate is currently 8.8 cases per 100,000 residents.\n“This is great news for our region. San Diegans have done a good job following the public health guidance and that has driven our case rate down in recent weeks,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Our vaccination efforts have also helped to slow the spread of COVID-19. As more people get vaccinated, the number of cases should continue to decrease.”\nThe County must remain in the Red Tier and post two consecutive weeks of data in the in the Orange Tier before moving to the less restrictive level which would ease more restrictions.\nCurrently, the testing positivity percentage is 3.3%, placing the County in Tier 3 or the Orange Tier. The County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 4.5% and is also in the Orange Tier or Tier 3. These metrics are also expected to decrease when the state announces tier assignments March 16.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the most restrictive tier.\nWhen the state administers 4 million doses in the vaccine equity quartile, tier assignments will be revised once again.\nSan Diegans With Chronic Illnesses Eligible for Vaccine Monday\nStarting March 15, people between 16 and 64 years of age who have a severe health condition will be able to get vaccinated against COVID-19, the County Health and Human Services Agency announced today.\nThe vaccine is being made available to people in this category because they are deemed to be at high risk of severe illness from COVID-19 due to their pre-existing medical condition.\n“People with chronic health conditions should get vaccinated as soon as possible,” Wooten said. “All the vaccines currently available are 100% effective at preventing severe illness from COVID-19.”\nSan Diegans with a developmental or other severe high-risk disability will also be eligible to get the COVID-19 vaccine.\nPeople in Phase 1 are encouraged to get vaccinated by their health care provider. San Diegans without a doctor should contact 2-1-1 to be connected to a provider or make an appointment at www.vaccinationsuperstationsd.com.\nSan Diegans who have a health care provider don’t have show proof of an existing medical condition because their medical history is already on file and doctors should be inviting their patients to get vaccinated when it’s their turn. People without a health care provider will be asked to sign a self-attestation form indicating they have one of the chronic conditions listed.\nAn older man gets his COVID-19 vaccine at County Oceanside clinic.\nBreweries Without Food Can Open\nBeginning March 13, breweries, wineries and distilleries that do not serve meals may open outdoors only with modifications.\nPatrons visiting these establishments must have reservations and must observe a 90-minute time limit. Also, service for on-site consumption must end by 8 p.m. The updated guidance does not apply to breweries, wineries and distilleries that provide meals.\nVaccination Progress:\n\nMore than 1.27 million COVID-19 vaccine doses have been delivered to the region, and over 1.18 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, nearly 400,000 County residents, or 14.8% of San Diegans 16 and older, are fully immunized.\nOverall, nearly 688,000 County residents have received at least one shot of the two-dose vaccine. That’s 25.6% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nCommunity Setting Outbreaks:\n\nThree new community outbreaks were confirmed March 11: one in a business setting, one in a TK-12th grade school setting and one in a restaurant/bar setting.\nIn the past seven days (March 5 through March 11), 12 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n12,907 tests were reported to the County on March 11, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.9%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,857.\n\nCases, Hospitalizations and ICU Admissions:\n\n362 COVID-19 cases were reported to the County on March 11. The region’s total is now 264,889.\n13,327 or 5% of all cases have required hospitalization.\n1,621 or 0.6% of all cases and 12.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n12 new COVID-19 deaths were reported March 11. The region’s total is 3,434.\nSeven men and five women died between Dec. 23 and March 10.\nOf the 12 deaths reported March 11, three people who died were 80 years or older, five were in their 70s, two were in their 60s and two were in their 50s.\n10 had underlying medical conditions, one did not and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210312.18.23.58"}