{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Dr. Jonathan Lucas Appointed Chief Medical Examiner for San Diego County", "description": "Dr. Jonathan Lucas, M.D., is San Diego County’s new Chief Medical Examiner, bringing over 20 years of forensic pathology experience and leadership to the role.", "datePublished": "2025-05-16T08:30:46-07:00", "url": "https://www.countynewscenter.com/dr-jonathan-lucas-appointed-chief-medical-examiner-for-san-diego-county/", "keywords": ["public safety", "jonathan lucas", "medical examiner", "medical examiner s office"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2025-05-16T08:50:42-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDr. Jonathan Lucas, M.D., is San Diego County’s new Chief Medical Examiner, bringing over 20 years of forensic pathology experience and leadership to the role. Dr. Lucas will lead the department responsible for investigating all sudden, unexpected, or unnatural deaths to help identify public health risks and inform preventative efforts across the County, a critical function in protecting public health and safety. \nDr. Lucas previously held key leadership roles at both the San Diego County and Los Angeles County Medical Examiner’s Offices. From 2017 to 2022, he served as Chief Medical Examiner-Coroner for Los Angeles County, managing one of the nation’s busiest offices with more than 250 staff and a service population exceeding 10 million residents. He returned to San Diego County in 2022 as Chief Deputy Medical Examiner. \n“It is an honor to assume the role of Chief Medical Examiner,” said Dr. Lucas. “I am committed to continuing the department’s legacy of scientific excellence, integrity, transparency, and service to the community. Our work plays a vital role in public health and public safety, and I look forward to supporting our dedicated team as we carry out this critical mission.” \nHe succeeds Dr. Steven Campman, who is retiring after 24 years of service with the Department of the Medical Examiner, including the last four years as Chief Medical Examiner. \nThroughout his career, Dr. Lucas has maintained a strong commitment to public health. He has participated in regional task forces focused on substance abuse and the opioid epidemic and worked collaboratively with community partners to monitor trends in deaths related to intoxication and injury. His dedication to advancing the field also extends to education and mentorship. \nDr. Lucas earned his undergraduate degree in Biology from UC Riverside and his medical degree from the University of Nevada School of Medicine. He completed his residency in anatomic and clinical pathology at UCLA Medical Center and completed fellowship training in forensic pathology at the Office of Chief Medical Examiner in New York City. He began his career with the San Diego County Medical Examiner’s Office in 2001 and was promoted to Chief Deputy in 2011. \nOver the course of his career, Dr. Lucas has performed or supervised nearly 5,000 autopsies, responded to numerous death scenes, and provided expert testimony in both criminal and civil proceedings. He has led accreditation efforts with the National Association of Medical Examiners (NAME) and the Accreditation Council for Graduate Medical Education (ACGME), including playing a key role in restoring ACGME accreditation for the department’s forensic pathology training program—one of fewer than 50 in the nation. \n“Dr. Lucas brings a depth of expertise and leadership that makes him exceptionally well-suited for this role,” said Andrew Strong, Deputy Chief Administrative Officer. “His experience in both San Diego and Los Angeles Counties, along with his focus on innovation, training, and public health, will be a tremendous asset as we continue to strengthen the work of the Medical Examiner’s Office. We also extend our deep gratitude to Dr. Campman for his decades of exemplary service.” \nThe Chief Medical Examiner is appointed by the County’s Chief Administrative Officer and operates independently from law enforcement. Under California Government Code Section 24010, San Diego County transitioned from a coroner to a medical examiner system in 1990.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250516.08.30.46"}