{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrate Earth Month with the County", "description": "The County is transforming Earth Day into Earth Month by holding a series of events highlighting sustainable activities that will span through the month of April to raise awareness about environmental issues.", "datePublished": "2024-04-02T09:34:49-07:00", "url": "https://www.countynewscenter.com/celebrate-earth-month-with-the-county/", "keywords": ["environment", "climate action", "earth day", "earth month", "hiking", "sustainability", "tree planting"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-04-02T09:34:49-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County is transforming Earth Day into Earth Month by holding a series of events highlighting sustainable activities that will span through the month of April to raise awareness about environmental issues.\nEarth Day, which is celebrated on Monday, April 22, connects people to the public spaces where wildlife and nature thrive. The global theme this year is Planet vs. Plastics. \nCome celebrate our planet and learn how the County is working to create a greener world.\nBelow is a list of events to add to your April calendar. Check www.sandiegocounty.gov/earthday for specific times and locations.\nEarth Fair at County Operations Center:\nThe Earth Day Fair will be held from 11 a.m. to 1 p.m., Monday, April 22 at the County Operations Center, located at 5500 Overland Drive, San Diego. There will be numerous County departments with booths set up for you to learn about the ways your County makes a difference protecting and investing in our planet. The event is free and open to the public.\nTree Planting and Park Beautification Opportunities:\nJoin us for a morning full of park beautification projects, including tree plantings, invasive plant removal and general trash pickup. Your efforts will improve the environment in and around our waterways – part of the larger Creek to Bay Cleanup coordinated by I Love a Clean San Diego!\nProjects will take place from 9 a.m. until 12 p.m. on Saturday, April 20. Advance registration is required. Materials are provided; come ready in clothes you don’t mind getting dirty and wear sturdy shoes and sun protection. Don’t forget your own water bottle and gloves!\nTo learn more about these and other volunteer opportunities, visit our volunteer web page or send an email to ParksVolunteer@sdcounty.ca.gov. \nSelf-led Activities:\nThere will be several self-led activities, including Earth Day arts and crafts and park ranger-led hikes. More information at www.sdparks.org.\nNature Discovery Tables:\nLearn about local wildlife and the unique adaptations that help them survive in a variety of habitats. Our rangers will be on site to answer all your park-related questions and help you understand, appreciate and experience nature. More information at www.sdparks.org.\nStep foot on a story trail:\nSan Diego County Library has placed colorful pages of children’s books on signs that our staff will be placing along some of our most popular parks. Visit one of the following recreation destinations during Earth Week (April 20 – 27) for a real English/Spanish literary adventure!\n\nAdams County Park (Valley Center)\nDos Picos County Park (Ramona)\nFlinn Springs County Park (El Cajon)\nLake Morena County Park (Campo)\nLincoln Acres County Park (National City)\nLive Oak County Park (Fallbrook)\nLouis A. Stelzer County Park (Lakeside)\nOtay Lakes County Park (Chula Vista)\nPine Valley County Park (Pine Valley)\nPotrero County Park (Potrero)\nRamona Grasslands County Preserve (Ramona)\nSan Dieguito County Park (Del Mar)\n\nCelebrate our Earth at any time with other fun activities:\n\nColor, play games, solve mysteries, and create your own science experiments at home.\nGrow your own food at one of San Diego County’s community gardens.\nSet out on a virtual hike of San Diego trails and discover how well you know your local ecosystem.\nDiscover how the County is committed to restoring equity in our communities.\nDiscover culture by exploring museums, visiting global landmarks, admiring artworks, and playing games.\nTake a virtual journey around the world from your living room with 360° views of incredible landscapes.\n\nTo learn and find out more about all of these activities, visit www.sandiegocounty.gov/earthday.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240402.09.34.49"}