{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Design and Outreach Underway For New County  Southeastern Live Well Center", "description": "The public will soon have opportunities to participate in the next steps of creating the Southeastern Live Well Center that will serve as a hub for community services in the San Diego neighborhood.", "datePublished": "2021-02-19T15:43:20-08:00", "url": "https://www.countynewscenter.com/design-and-outreach-underway-for-new-county-southeastern-live-well-center/", "keywords": ["health", "live well", "live well center", "southeastern live well center"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-02-19T15:43:20-08:00", "articleType": "article", "articleContent": "\nThe public will soon have opportunities to participate in the next steps of creating the Southeastern Live Well Center, which will serve as a hub for community services in the San Diego neighborhood.\nThe County of San Diego, along with the PCL Construction + Steinberg Hart design-build team and Project Management Advisors, Inc. as the acting owner’s representative for the County, are starting the design phase of the project at the corner of Market Street and Euclid Avenue. This phase is when details are refined for the concepts shared earlier and will include engaging groups that will work at the building along with community advisors on design.\nIn the coming months PCL will host outreach events for local businesses and community residents who are interested in learning more about the project and potential opportunities. For additional information and to be included in the upcoming bidder list please contact SELWCOutreach@pcl.com.\n“The people who live and work in Southeastern San Diego are the greatest resource we have in shaping a facility to serve their needs,” said Board of Supervisors Chair Nathan Fletcher. “It is critical that we not only listen to them, but ensure they have the opportunity to learn and benefit from the project’s construction.”\nAs the project moves forward, subcontractors will have the option to assist in the design development and the contractor will begin buyout of early trades. The County’s contract specifies local hiring and subcontracting participation, including $6 million of participation, from the project’s four local ZIP codes: 92102, 92113, 92114 and 92139.\n“We look forward to a Southeastern Live Well Center that promotes the health and well-being of our residents and makes the community proud,” said Vice Chair Nora Vargas. “Engaging residents in the design phase and seeking their feedback is key to fostering connection to the space, and a major first step to building healthier and stronger communities.”\nTraffic studies for the Southeastern Live Well Center supported the need for medians on Euclid Avenue from Highway 94 to Imperial Avenue and a traffic signal on Market Street located at the project’s driveway, which will align with the Malcom X Library’s west parking lot entrance. The project also will provide contributions for future traffic improvements on Market Street’s intersections with 47th Street and Euclid Avenue. The County is currently working with the City of San Diego on a complete list of street improvements for Market Street along the project site.\nOnce constructed, the 65,000-square-foot Southeastern Live Well Center will provide a full array of community services including medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services. The Southeastern Live Well Center also will have space for community meetings in its 4,000-square-foot conference center.\nThe Southeastern Live Well Center is expected to break ground in fall of 2021 and open in the summer of 2023.\nAs design work continues, the existing Tubman Chavez Community Center is providing an essential service as a COVID testing and vaccine site. Prior to start of construction there will a new nearby location for COVID testing and vaccination.\nInformation about the new Southeastern Live Well Center, its design and opportunities for public comment are available on a dedicated Live Well San Diego website page at https://www.livewellsd.org/content/livewell/home/community/live-well-communities/southeastern-live-well-center.html\nLive Well Centers are operating in National City, Chula Vista, Escondido and Lemon Grove, a location that was extensively remodeled last year. A new Live Well Center recently opened in Oceanside.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210219.15.43.20"}