{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "25 Remarkable Teens Honored for their Accomplishments, Passions", "description": "The San Diego County Public Defender’s Office recognized the 25 Most Remarkable Teens in San Diego County during its fifth annual awards ceremony Thursday evening. ", "datePublished": "2022-11-12T09:10:32-08:00", "url": "https://www.countynewscenter.com/25-remarkable-teens-honored-for-their-accomplishments-passions/", "keywords": ["public safety", "awards", "most remarkable teens", "public defender s office", "remarkable teen"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-11-14T12:31:28-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Public Defender’s Office recognized the 25 Most Remarkable Teens in San Diego County during its fifth annual awards ceremony.\nThe 25 teens were selected from a pool of more than 155 nominees after virtual interviews and a review of supplemental materials by a panel from the Public Defender’s Office. The 25 Most Remarkable Teens in San Diego County are set apart from other teen award honorees because students selected to be “Most Remarkable” are not only talented, but are driven to succeed, overcome adversity and are passionate about civic issues or projects.\n“San Diego youth are acting as leaders, innovators, activists and trailblazers throughout the county,” said Public Defender Randy Mize. “Demonstrating courage, spirit and tenacity, these 25 teens are leading the way to a successful future with creative, smart solutions both for their lives and our community.”\nThe Most Remarkable Teen program recognizes San Diego youth ages 13-19 for their contributions and efforts in 25 categories including environmental advocacy, arts and culture, technology, civic involvement, entrepreneurship, courage to overcome adversity and other outstanding accomplishments. However, all students interviewed received a certificate of recognition for the honor of being considered.\nIn partnership with the San Diego Public Library, the awards event was held Thursday at the Shiley Special Events Suite at the City of San Diego Central Library. Elected officials presented the awards. Among them were San Diego City Council President Sean Elo-Rivera, President Pro Tem Monica Montgomery Steppe, Councilmember Marni von Wilpert, Councilmember Joe LaCava and Councilmember Raul Campillo. Mayor Todd Gloria opened the evening with welcoming remarks congratulating the teens for their exemplary efforts and accomplishments.\nThe 25 Most Remarkable Teens for 2022 are:\nEllen Xu\nEllen Xu, 17, Del Norte High School senior, received the Public Defender’s Award of Excellence. Inspired by her younger sister who was diagnosed with Kawasaki disease, Ellen delved into research at the UCSD Kawasaki Disease Research Center and Rady Children’s Hospital. Ellen was an integral contributor to the development of an artificial intelligence image recognition algorithm early diagnostic tool for Kawasaki disease which is key to increased survival rates among young patients. Ellen has presented her findings at the International Kawasaki Disease Symposium in Tokyo, and at multiple other scientific conferences. Ellen was inducted into the Sigma Xi Scientific Research Honor Society and honored with multiple awards. Having fenced competitively for six years, Ellen represented the US at the Romania Cadet World Cup and captained the Junior Olympic silver medalist team in 2020. Through Zipline Theory, an organization she started, Ellen led a cybersecurity program for girls of military families. At school, Ellen serves as co-editor in chief for her school’s literary magazine and on the PUSD Literature Adoption Committee.\nKaizer Jones\nKaizer Jones, 17, Morse High School senior, received the Personal Determination award. He experienced homelessness and said this taught him endurance and self-reliance. He began reading the Bible to improve poor reading skills and soon he was reading at college level. Authors such as Malcolm X and Kwaame Ture gave him insight into his own life as a black man and his struggles with poverty. At Morse, Kaizer restarted the Black Student Union. He now serves as the BSU Coalition president of high schools all over the county and provides feedback to district leaders on how to best meet the needs of African American youth.\nKatie Tran\nKatie Tran, 16, West Hills High School, received the Campus Leadership award. She experienced an unstable childhood and faced bullying, while struggling with anxiety and depression. Yet, Katie says she also experienced love and kindness from others. Katie is now the school’s Key Club president, and the service project division leader for all Key Clubs in the Grossmont Union School District. She co-created and is president of the Button Club, a stress-free club spreading positivity around school one button at a time. The club also creates buttons for various school events. Katie is an ASB student leader, a Pack Council member which addresses bullying and mental health issues, and a part of the Mending Matters Mental Health Student Advisory.\nKyle Tianshi\nKyle Tianshi, 16, junior at The Cambridge School, received the Inventor award. Kyle is an internationally recognized inventor whose patent-pending design, NEREID, detects microplastic contamination in water sources or tiny particles that degrade from larger plastic pieces over time. They can absorb harmful chemicals and toxic bacteria, as well as enter the human body through unclean water. Kyle’s experience conducting garage research inspired him to co-found Clearwater Innovation, an organization that seeks to generate awareness about the global water crisis. This organization maintains a weekly advocacy blog, conducts interviews with young scientists, presents at science expos, hosts summer camps and research workshops. Clearwater Innovation has been featured in two documentaries by National Geographic and HP.\nKeala Minna-Choe\nKeala Minna-Choe, 16, Canyon Crest Academy junior, received the Civic Engagement award. Keala’s environmental work includes phasing out fossil fuels and advocating for a just transition to renewable energy. Keala is a leader in SD350’s Youth4Climate, a grassroots movement to prevent the worst impacts of climate injustice. Keala secured endorsements for a climate resolution by two school boards, the San Diego County Office of Education and the San Diego City Council. Keala speaks publicly at climate justice rallies and serves on committees of two local climate-action organizations. But climate is not Keala’s only passion. She is Red Cross Club president at Canyon Crest combining efforts with the Blood Donor Ambassador Team. She also works with a program called Flowers for the Future, helping girls in Afghanistan increase access to education as well as helping Afghan refugees living in San Diego.\nLucia Perez Valles\nLucia Perez Valles, 18, Olympian High School graduate and University of Southern California freshman, received the Social Conscience award. Lucia’s mother emigrated from Mexico and struggled financially. Lucia was exposed to problems occurring in Mexico and was specifically moved by the difficulties people in Mexico face when trying to access healthcare. Seeing this disparity fueled Lucia’s ambition to pursue a career in community health and opened her eyes to the need for civic engagement in Chula Vista. Lucia earned her Girl Scout Gold Award by creating “Embrace Our Community,” a summer camp to wean children off electronic devices by providing the environment and resources kids need to disconnect. Lucia helps educate children about the resources, programs, and facilities that are available to them in San Ysidro to support their success. Lucia, a ballet dancer for 9 years with the San Diego Civic Youth Ballet, has also brought ballet to kids with special needs.\nAndres Garcia (AJ)\nAndres Garcia, 19, Madison High School graduate, is enrolled at the TRACE School. He won the Courage to Overcome Adversity: Physical Disability award. TRACE is part of San Diego Unified School District’s continuum of service options for assisting students transitioning from high school to adult life. AJ, who is deaf, and his family moved between Chula Vista, Spring Valley, San Diego and Tijuana throughout his teen years. At one point, the family lived in a hotel. But AJ’s resilience prevailed, and he is now in a stable living situation. At TRACE, AJ was eager to learn skills in the construction trade. He was accepted into a pre-apprenticeship training program offered though the San Diego College of Continuing Education. Through this program, AJ earned certifications in OSHA and Multi-craft Construction programs. AJ was Trace’s first student to complete this construction pre-apprenticeship program, and the apprenticeship program’s first deaf student.\nCharlee Miller\nCharlee Miller, 18, Madison High School graduate, is currently studying at San Diego Mesa College. She won the award for Creativity: Art. Charlee is an exceptional artist producing brilliant and thought-provoking works. Charlee works tirelessly to accomplish her artistic goals all the while sharing techniques and new concepts with other students to help them reach their goals. Life wasn’t always easy for Charlee. When she was young, she was bullied for being “weird.” Charlee says having an interest in macabre fiction and her tendency to use words that only made sense to her caused her to be mocked. Charlee discovered that the world in which those traits lived and took shape was called a paracosm – a detailed imaginary world, populated by what she now calls the inspiration for her art and her writing. Charlee’s efforts have earned her an award for academic excellence in the subject of art, and an excellence in creative writing award. Once she completes San Diego Mesa College, she plans to transfer to a four-year university.\nVedant Nahar\nVedant Nahar, 16, Scripps Ranch High School junior, won the Most Enterprising award. He is the CEO of a startup company called MedAlert. He led his team from a basic idea to the development of an iOS/Android app. MedAlert is a task management app that allows nurses to create, claim, and delegate tasks using tablets. No longer constrained by paper and having to convey information verbally, nurses can use the app to communicate in real time avoiding errors in patient care and drug dispensing. Under Vedant’s leadership, the MedAlert team won the Best Healthcare Pitch and placed in the Blue Ocean Entrepreneurship Competition, the most prestigious high school entrepreneurship competition in the world. Vedant and his team were invited to pitch MedAlert to investment groups such as the NuFund Investment Angels. Vedant reveals his competitive spirit athletically as well as academically. He is a club and varsity swimmer and a second-degree black belt in Taekwondo.\nRenee Wang\nRenee Wang, 15, is a junior at The Bishop’s School and she won the Innovation award. She founded SOS, the Story of the Streets, an organization whose mission is to alleviate the homelessness crisis in San Diego. Her RUBIX invention has been widely recognized at engineering and science fairs, architectural design competitions and entrepreneurship challenges. Renee was inspired by Lego bricks and the Rubik’s Cube to create RUBIX, a tiny home designed for the unhoused. Composed of 10 prefabricated interlocking modular components, RUBIX has its own kitchen and bathroom within the unit. The main construction materials are bamboo and recycled plastics, and it runs entirely on solar power and an independent plumbing system. During the pandemic, Renee organized monthly homeless outreach excursions to distribute necessities to people on the streets. Most recently, Renee was named a Rising Global Scholar, one of 100 youth awarded such distinction from a pool of 13,000 nominees from 43 countries.\nAngel Martinez\nAngel Martinez, 17, Hoover High School senior, received the Commitment to Personal Excellence award. Angel holds a lieutenant colonel role, the highest position a student can earn, in the Junior Reserve Officer Training Corps program (JROTC) at Hoover High School. The senior also holds a district level position in JROTC as the liaison officer, communicating with 13 San Diego Unified School District principals to implement strong leadership roles for JROTC programs districtwide. Angel’s dad left the house when he was in the sixth grade and the separation of his parents led Angel to be his own motivator and push through despite the added challenge of needing to help his mom – a single parent who works two jobs to provide for Angel and his siblings. Angel is a serious student and a natural leader. From co-founding Hoover’s Guitar Club to participating on the academic team competing with other San Diego high schools to his involvement with the Ocean Discovery Institute, Angel is an exemplary young man.\nEvan Noseworthy\nEvan Noseworthy, 18, Classical Academy High School senior, won the award for Entrepreneur. Evan is a metaverse architect. Metaverse architecture creates spaces where the real and the virtual world become one. Evan is the founder and CEO of a metaverse development studio that takes ideas, brands and companies and represents them across multiple platforms. He is working with Eversmart City as their metaverse head, to help create smart and sustainable cities in both the physical and digital world. He has built out over 25 unique metaverse experiences for clients worldwide. Things were not always easy for Evan. He started school in special education due to a speech disorder and ADHD. Eventually he moved into regular education and improved his speech and attention span. He now views ADHD as a superpower. Evan discovered if he had a passion for something, he would become hyperfocused. He used his hyperfocus to push the cutting edges of technology and leap into the developing world of the metaverse.\nNicolette Luna\nNicolette Luna, 16, Bonita Vista High School junior, won the award for Journalism. Nicolette took a Southwestern College journalism class when she was only 14. By age 15, she was a news editor at the Southwestern College Sun student newspaper. She became an award-winning feature writer and editorialist. As editor, she skillfully directed the work of college students, some of whom were twice her age. She is now editor-in-chief of the 2022 Southwestern College El Sol Magazine. Nicolette’s work was awarded three first place spots at the recent Society of Professional Journalists banquet, and she was invited to write an op-ed piece in the San Diego Union Tribune. The California College Media Association, San Diego Society of Professional Journalists, and the Journalism Association of Community Colleges have each given Nicolette multiple awards. She would like to become part of a vanguard of young Latinas working to diversify the American news media and improve its representation of underrepresented journalists.\nLea Nepomuceno\nLea Nepomuceno, 16, Scripps Ranch High School senior, received the award for Social Justice. In 2019, Lea co-founded Youth for Juvenile Justice Reform – interviewing over 200 formerly incarcerated individuals in efforts to educate youth on the criminal justice system. Through the organization, she has collaborated with artists and been featured as a panelist on the VIBE Movement’s, “What’s Color Got to do with it? Dismantling the School-to Prison Pipeline” series in 2020 as well as Youth Summit NYC 2021. Lea is also the youngest member of the University of Southern California’s Prison Education Project. Lea created the podcast, Evidence for Change, where she interviews alumni from the Johns Hopkins Center for Gun Violence Solutions Summer Youth Institute. Evidence for Change has over 15,000 listeners. In 2022, Lea was invited to President Biden’s signing ceremony of the bipartisan Safer Communities Act alongside the nation’s leading activists and policymakers on gun violence prevention.\nSofie Muneer\nSofie Muneer, 17, Canyon Crest Academy senior, won the Public Health: Women award. At a young age, Sofie realized that women’s health is often pushed to the edges of medical care and shrouded in stigma. Because of her personal experience with polycystic ovarian syndrome and endometriosis, Sophie came to learn that there was little data and research into the conditions in teens. As a high school junior Sofie founded the nonprofit Endo Teen. Endo Teen is an easy-to understand platform that includes summaries on different reproductive conditions, new research in the field and a thorough analysis of gender inequality in healthcare. The first goal of Endo Teen is to make scientific research and medical information about women’s health accessible, especially to teens. Sophie is a member of the National Society of High School Scholars, The Society of Torch and Laurel, Sigma Xi, John Hopkins Center for Talented Youth and the National Academy of Future Physicians.\nRoberto Cone (Bobby)\nRoberto Cone, 16, San Diego School of Creative and Performing Arts sophomore, won the award for Performing Arts: Musical Theatre. Bobby became involved in musical theater at age eight. Despite facing academic challenges, Bobby found his passion in the arts. He committed to musical theater – specifically to acting and singing. Bobby couldn’t read until third grade. He still struggles to read. But when he started acting, his resilience kicked in and Bobby’s solution was to memorize his lines quickly. He found that memorizing lines came much easier to him than to other people. Bobby admits he’s quiet but says if he’s given a play, a song and a spotlight, he comes alive. Bobby has played numerous parts in various plays produced by the California Youth Conservatory, Theatre Arts School of San Diego, San Diego Junior Theatre, and his own school, the San Diego School of Creative and Performing Arts. In 2021, Bobby received the school’s award for Outstanding Artist in Musical Theatre.\nJasmine Matthews\nJasmine Matthews, 17, Preuss School senior, won the award for Perseverance. Jasmine was homeless during second and fourth grade, and then again, her entire junior year of high school. Returning to these circumstances was especially challenging mentally. Toward the end of her junior year, Jasmine stayed with a friend so she would have an environment where she could finish her homework without the added stress of wondering where she was going to sleep. She is in school seven hours a day and leaves the house at 6:15 a.m. for Preuss, taking 2 buses and two trolleys from El Cajon, then does it again at the end of the school day. Through all these hardships, Jasmine has excelled academically. She has earned awards in chemistry and algebra and has been inducted into the Rho Kappa National Social Studies Honor Society. Jasmine is also a Girls Varsity basketball team member and is co-president of the Black Student Union. Jasmine plans to attend UCLA with the hope of becoming a screenwriter.\nLivia Iacobelli\nLivia Iacobelli, 17, is a senior at High Tech High School, North County and she received the award for Community Service. In 10th grade, Livia launched a non-profit called the Student Healthcare Readiness Program (SHRP). The organization serves low-income youth who want a career in medicine. SHRP connects high school students with college mentors, hosts monthly keynote speakers and presents educational workshops. As a volunteer at the La Jolla Institute for Immunology, Livia created a system which was used to breed the Double Reporter Mouse, a mouse that expresses fluorescent proteins for the imaging of NETs to use to model pulmonary thrombosis because of COVID-19. Livia also volunteers with the UCSD Healthcare Call Pool where she helps marginalized patients navigate the maze of the health care system. She serves as “Google translator” and companion to many immigrants seeking care. Livia plans to become a doctor.\nRoshan Shah\nRoshan Shah, 17, Westview High School senior, won the award for Public Health: Innovation. Roshan volunteered in classrooms for students with special needs. He noticed students with communication needs were not allowed to take their school issued communication devices (tablets, iPads, PCs) with them after high school graduation which meant they were left with no way to communicate online. Communication devices with an app can cost almost $1,000 and many families cannot afford the expense. Roshan created VoicesGo.Org, a website helping families understand the avenues available to fund and secure a device. VoicesGo has helped students obtain devices so they can participate in society, register to vote, gain employment, and interact with family and peers. The problem of leaving a public school district without a communication device affects thousands of students across California. Roshan drafted a bill for the California State Legislature which would cost taxpayers nothing but would enable students with disabilities to procure a device before leaving public school.\nElla Kim\nElla Kim, 15, Francis Parker School junior, won the award for Writing. As a Korean American, Ella is motivated to give voice to those whose silent struggles and difficulties she can understand. Ella believes the simple act of seeing oneself reflected in the world, in any way, is inexplicably powerful, whether through music, writing or other mediums, and it is through both her stories and her actions that Ella wants to bring that vision to those around her. Ella explains that when she was young, she never saw books that explained her culture or her history and later felt like she grew up missing that part of herself. Ella intends to address that deficiency through her Girl Scout Gold Award project by creating an illustrated children’s book focused on the topic of Korean history. Ella also created Parker’s Writer’s Circle, is a member of the school robotics team and a founding member of the National History Society Project, head of publicity on the Parker Community Engagement Board and co-head of writing for the Culture of San Diego Club.\nAlurah Chappel\nAlurah Chappell,17, San Pasqual Academy senior, received an award for Courage to Overcome: Family Situation. Alurah hopes to attend UCSD – and be the first in her family to graduate from college but the path toward this goal has not been an easy one. Alurah was sent to Polinsky Children’s Center after her freshman year of high school. She has been in the foster care system ever since. Alurah grew up poor and in a bad neighborhood with gunshots firing every night. Family life was tumultuous, her father volatile, her brothers disinterested in school or learning. Alurah says being away from family allows her to understand what she wants from life and gives her the freedom to make her own decisions. On the other hand, being away from her parents means she must handle problems on her own without anyone to “save” her. Alurah has maintained a 4.0 GPA and received 10 awards in academic excellence. She has also played five different sports.\nMakena Stumpo\nMakena Stumpo, 13, is an 8th grade student at Pacific Beach Middle School. He won an award for Performing Arts: Music. He plays piano and guitar both by ear and by reading music, and he is a soulful vocalist. His music teacher shares that Makena has a special gift. He can listen to a song and then replicate it perfectly on his piano or transpose it into a piece of his own. Makena started performing in public in 2021 and he has performed at a variety of venues. He also enjoys being a busker – a person who performs music in a public place for donations. This summer, with his parents by his side, Makena found a spot downtown, put a sign up that said the proceeds would go to the Prevent Drowning Foundation, and with his electric keyboard played music and sang. He raised $200 through this effort. Makena participates in San Diego Junior Lifeguards and plays football, volleyball, and track and field.\nLeslie Pagel\nLeslie Pagel, 17, Crawford High School senior, received an award in the category of LGBTQIA+ Activist. Leslie grew up in Tijuana and when she turned 12, she came out as queer. During middle school, Leslie was harassed because of her identity. Verbal harassment and cruelty toward gay students was not only tolerated but openly condoned by school staff. In her freshman year, her family moved to the U.S. and Leslie found a sense of community at Crawford that she had never experienced before. She became president of the Gay Student Alliance (GSA) and spent hours researching LGBTQ history to educate and engage GSA members, and to spread information through crafting presentations, Jeopardy games, a Kahoot about pride flags and other creative events. Leslie’s other passion is art. She won the grand prize in San Diego Public Library’s Pride Card contest with her powerful design of trans pioneering advocate and icon, Marsha P. Johnson. Her portrait of Johnson is printed on library cards distributed citywide.\nReed Ganzer\nReed Ganzer, 16, Poway High School junior, won an award in the Technology: Robotics category. Reed served as outreach lead for two years on his robotics team, First Tech Challenge Cerulean Centaurs, and for two years on the Green Griffins robotics team. Since 2018, he has volunteered at over 80 outreach robotics events. He has mentored five younger First Lego league teams. Concerned about the environment, Reed created the STEM to STEAM initiative in 2018 to repurpose waste from robotics competitions. Robotics competitions often require metal or plastic that are thrown out at the end of the competition season. Reed partnered with local colleges and donated robotics materials destined for the landfill to art programs at San Diego State University and Southwestern College. Reed also mentors young students in computer programming through his after-school job at Code Ninjas in Poway.\nNaeem Miller\nNaeem Miller, 16, is a junior at San Pasqual High School. He received the award for Environmental Activist. Naeem believes everyone has the right to breathe clean air and drink clean water. He has volunteered with CleanEarth4kids for the past two years. Naeem has worked and spoken at events, activities and meetings in San Diego and other cities to lobby for the passage of AB2771, the California PFAS-Free Cosmetic Act, to ban PFAS from personal care and beauty products, and AB1817, the California Safer Clothes and Textiles Act, to stop the use of all PFAS from clothing and textiles made and sold in California. He has also worked on legislation requiring a 3,200-foot buffer zone to protect homes, hospitals, schools, parks and other sensitive areas from oil and gas drilling, a law requiring schools to install water refill stations in new construction and remodels, and a law requiring environmental justice and tribal representation on California Water Boards.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221112.09.10.32"}