{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Spirit Fund Donations A Boon to A Lucky Dog", "description": "An Australian Cattle Dog was picked up as a stray by a County Animal Services officer in December 2023. During his intake examination, a medical team member noticed that he was a healthy dog who didn’t bear weight on one of his rear legs.", "datePublished": "2024-09-12T11:30:27-07:00", "url": "https://www.countynewscenter.com/spirit-fund-donations-a-boon-to-a-lucky-dog/", "keywords": ["animals", "adopt pets", "das", "pet foster", "spirit fund"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-09-12T11:30:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAn Australian Cattle Dog was picked up as a stray by a County Animal Services officer in December 2023. During his intake examination, a medical team member noticed that he was a healthy dog who didn’t bear weight on one of his rear legs.\nAfter further examination, the team determined he would need to have his right rear leg amputated, a procedure that would require costly surgery at a pet hospital. Luckily for the dog, who they later named Boone, the Spirit Medical Fund, made up of public donations for animals that need emergency veterinary care due to an injury, was there to help.\nCounty Animal Services established the Spirit Medical Fund in July 2008, after people around the County donated to help a 10-week-old puppy who had been rescued with severe injuries from a beating. Shelter staff named the puppy Spirit because, despite several broken bones and evidence of other injuries, her spirit was not broken and she was still loving.  Spirit was adopted by a loving family, but the love for her and other animals continues.\nSo many donations had come in for Spirit that the remaining money was used to help other animals in need, like a puppy found in a dumpster bin with his ears cut off and a dog that was relinquished because the owner couldn’t afford medical care for a broken limb.\nWithout emergency medical care, these animals, including Boone, would not know what it was like to be part of a loving adoptive family.\nBoone had his surgery and his luck continued when a registered veterinary technician offered to foster him to help him with his recovery in a home environment.\nThen, in February, he was adopted by a family that includes two dog “siblings,” Nikita, another Australian Shepherd, and Duke, a German Short-haired Pointer.\nAccording to his adoptive family, Boone is a happy and energetic dog that adjusted to his new home and life with three limbs without any issues.\nThey added that Boone has “big dog” energy and spends his days running around a fenced 1-acre yard with the other dogs. He also loves to go for car rides with his “Dad” and accompany him wherever he can. Lately, he can be found staying cool with his water toys.\nYou can help animals like Boone, through  adoption, fostering  or donating to the Spirit Medical Fund. All donations are tax deductible and can be made online or in person or mail with a check made payable to County Animal Services” and “Donation for Spirit Fund” in the memo field of the check.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240912.11.30.27"}