{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Keep The Flu or COVID-19 from Getting a Seat at the Table", "description": "As San Diegans prepare for Thanksgiving gatherings, COVID-19, the flu and other viruses are going to try and grab seat at the table.", "datePublished": "2022-11-23T16:22:28-08:00", "url": "https://www.countynewscenter.com/keep-the-flu-or-covid-19-from-getting-a-seat-at-the-table/", "keywords": ["health", "coronavirus", "covid-19", "flu", "influenza"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-11-23T16:30:50-08:00", "articleType": "article", "articleContent": "\nAs San Diegans prepare for Thanksgiving gatherings, COVID-19, the flu and other viruses are going to try and grab seat at the table.\nFortunately, we have ways to protect ourselves and loved ones.\nVaccines are safe and effective against COVID-19 and flu, and the supplies and availability of both remain plentiful.\nWhile it takes about two weeks after vaccination until the body develops sufficient immunity against both vaccinations, there are other steps people can take to lessen their risks.\nThese include wearing a well-fitting, good-quality mask indoors or in crowded spaces; washing hands thoroughly and often; staying away from sick people; and cleaning commonly touched surfaces.\n“This is a wonderful time of year, and we want everyone to celebrate smartly and protect themselves, their family and community,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Don’t let flu, COVID-19, or other winter illnesses spoil your family reunions this holiday season.”\nCOVID-19 and flu vaccines are widely available across the region at pharmacies, medical centers and clinics. The two vaccines can be administered during the same visit. It is important to note that the COVID-19 primary vaccine series or booster does not protect against the flu and the flu vaccine does not protect people against COVID-19. Therefore, it is recommended that eligible San Diegans get vaccinated against both viruses.\nCOVID-19 Vaccination Progress:\n\nClose to 2.69 million or 80.4% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBoosters administered: 1,500,106 or 60.2 % of 2,492,580 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nCOVID-19 Deaths:\n\nFive additional deaths were reported since the last report on Nov. 17, 2022. The region’s total is 5,562.\nOf the five additional deaths, two were women and three were men. They died between Nov. 5, 2022 and Nov. 14, 2022. Three of the newly reported deaths occurred in the last two weeks.\nTwo of the people who died were 80 years or older, one was in their 70s, one was in their 60s and one was in their 50s.\nFour received at least the primary series of the vaccine and one had not.\nAll had underlying medical conditions.\n\nCOVID-19 Cases, Case Rates and Testing:\n\n3,034 COVID-19 cases were reported to the County in the past seven days (Nov. 14 to Nov. 20, 2022). The region’s total is now 938,321.\nThe 3,034 cases reported in the past week were higher compared to the 2,193 infections identified the previous week (Nov. 7 to Nov. 13, 2022).\n5,012 tests were reported to the County on Nov. 19, and the percentage of new positive cases was 6.6 (Data through Nov. 19).\nThe 14-day rolling percentage of positive cases, among tests reported through Nov. 19, is 5.3%.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday (it was published a day early this week due to the Thanksgiving holiday) and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Nov. 19, 2022, the report shows the following:\n\nThree additional flu deaths; the season’s total is now five.\nOf the three additional flu deaths, two were women and one was a man. They died between Nov. 8, 2022 and Nov. 14, 2022.\nOne had received a flu shot this season and two had not.\nAll had underlying medical conditions and none of the newly-reported deaths were coinfected with COVID-19.\nEmergency department visits for influenza-like illness: 10% of all visits (compared with 10% the previous week).\nLab-confirmed influenza cases for the week: 2,353 (compared to 2,387 the previous week).\nTotal lab-confirmed cases to date: 10,231 (compared to 357 at the same time last season and a 381 prior 5-year average during the same week).\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221123.16.22.28"}