{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 4-13-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through April 12.", "datePublished": "2021-04-13T18:30:16-07:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-4-13-2021/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-04-14T13:32:24-07:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through April 12.\nVaccination Progress:\n\nAlmost 2.28 million COVID-19 vaccine doses have been delivered to the region, and about 2.12 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, more than 745,000 County residents, or 27.7% of San Diegans 16 and older, are fully immunized.\nOverall, nearly 1.2 million County residents have received at least one shot of the two-dose vaccine. That’s 44.3% of those eligible.\nThose who received the one-dose Johnson & Johnson vaccine, which is currently on hold in the County due to guidance from the Centers for Disease Control and Prevention and Food and Drug Administration, are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.0 cases per 100,000 residents (as of April 13) and this data point places the region in the Red Tier or Tier 2. (The County remains in the Orange Tier or Tier 3 following recent guidance from the state.)\nThe California Department of Public Health recently advised that unless there are extenuating circumstances, such as low rate of vaccine uptake, a county will only move to a more restrictive tier if hospitalizations are increasing significantly among vulnerable individuals, especially among vaccinated individuals, and both testing positivity and adjusted case rates show a concerning increase in transmission. This is currently not the case in the region and the County remains in the Orange Tier or Tier 3.\nCurrently, the testing positivity percentage is 2.5%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 3.0% and is also in the Orange Tier or Tier 3.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 20.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed April 12.\nIn the past seven days (April 6 through April 12), 16 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n12,404 tests were reported to the County on April 12, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,549.\n\nCases, Hospitalizations and ICU Admissions:\n\n278 COVID-19 cases were reported to the County on April 12. The region’s total is now 273,708.\n15,024 or 5.5% of all cases have required hospitalization.\n1,665 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nTwo new COVID-19 deaths were reported April 12. The region’s total is 3,623.\nOne woman and one man died between Feb. 26 and April 9.\nOf the people who died, one was 80 years of age or older and one was in their 60s.\nBoth had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210413.18.30.16"}