{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Open House to Include Budget Numbers", "description": "The first budget open house since the May 1 release of the County’s recommended budget will take place May 22.", "datePublished": "2025-05-19T09:30:54-07:00", "url": "https://www.countynewscenter.com/county-open-house-to-include-budget-numbers/", "keywords": ["government", "2025-26 budget", "2025-27 recommended budget", "2025-27 recommended operational plan", "5-22-25 budget open house", "community budget open house", "engage san diego"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-05-19T09:39:04-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe first budget open house since the May 1 release of the County’s recommended budget will take place May 22.\nThe open house will include some proposed numbers for County priorities. They include public safety, housing and homelessness, behavioral health, vulnerable populations and environmental sustainability as well as roads, parks and libraries.\nStaff members will be on hand to answer questions about how the budget is built, where funding comes from and how the budget process works. Residents will be able to give their written comments on the budget during the open house.\nParents can bring along their children. Similar to  an informational budget open house in April, kids will have a chance to see some adoptable animals, meet a park ranger with a live owl, check out emergency vehicles and enjoy other activities.\nThe County’s budget affects nearly all residents in some way.\nRegionally, County government provides services like:\n\nSocial services and health programs\nCriminal prosecution, detention facilities and emergency preparedness\nFood and restaurant inspections and beach water monitoring\nElections\n\nIn the unincorporated area, County government provides things a city government would typically do like:\n\nLaw enforcement and fire protection\nRoads, parks and libraries\nBuilding permits\nAnimal shelters and protection\n\nSome cities also contract with the County to provide some of these services.\n\n \n \n \n \n \n \nThe May 22 open house will run from 5 to 7 p.m. at the County Operations Center in Kearny Mesa.\nFor those who cannot attend the May 22 event, a virtual community budget meeting with the same information is scheduled for 5:30 p.m. on Wednesday, May 28. You can learn more, register and request language and accessibility services for one or both events at Engage San Diego.\nThere’s also a chance to make budget comments now through June 12 at Engage San Diego.\nBudget hearings will take place before the Board of Supervisors at 9 a.m. on Tuesday June 3 and at 5:30 p.m. on Monday, June 9.\nThe Board is scheduled to hold deliberations and adopt the budget on June 24. The adopted budget takes effect July 1.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250519.09.30.54"}