{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "‘Promotoras’ Working in Latino Communities to Prevent Spread of COVID-19", "description": "Community health workers known as promotoras started working in local Latino communities earlier this week to prevent the spread of COVID-19. Promotoras are long-time and trusted residents of the communities they serve.", "datePublished": "2020-08-05T18:49:37-07:00", "url": "https://www.countynewscenter.com/promotoras-working-in-latino-communities-to-prevent-spread-of-covid-1/", "keywords": ["health", "coronavirus", "covid-19", "parks and prayer", "promotoras"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-06T10:18:57-07:00", "articleType": "article", "articleContent": "\nCommunity health workers known as promotoras started working in local Latino communities earlier this week to prevent the spread of COVID-19. Promotoras are long-time and trusted residents of the communities they serve.\nThe first group began doing contact tracing in the South Bay. Their role is to contact people who were in close contact with someone who tested positive for COVID-19, ask them to quarantine themselves and guide them through the quarantine process.\nTeams of promotoras who speak English and Spanish are being deployed into Latino communities that are being disproportionately impacted by COVID-19. Their work is being done through a collaboration between the County, Project Concern International and South Bay Community Services.\nTheir role is to connect with close contacts within 24 hours after getting the case. They will contact the person by phone, email or text and, in special cases, through in-person visits taking the appropriate preventative measures. Their goal is to make sure people are in quarantine, stay in contact with them to find out if they develop symptoms and give them information and resources to prevent the spread of COVID-19.\n“These are our neighbors we all know and trust,” said Mauricio Torre, vice president of programs and operations for South Bay Community Services. “The continuous contact is done with the goal of keeping the individual well-informed on the resources and actions to take…to protect the community’s health.”\nMore promotoras, many of whom speak other languages such as Arabic and Tagalog, will be coming onboard next week through a collaboration with San Diego State University. They will also work in Latino neighborhoods and other underserved communities.\nCase Investigations Improve Significantly\nThe hundreds of case investigators the County brought onboard has helped the case investigation trigger to move from red to green. The metric requires that 71% or more case investigations begin within 24 hours after a positive case is assigned. The seven-day rolling average is now at 73% after hitting a low of 7% July 23.\n“In the past seven days we’ve been increasing due to bringing additional case investigators,” said Wilma Wooten, M.D., M.P.H., County public health officer. “This is very good news. As of yesterday, we were not backlogged with any of our case investigation assignments.”\nThe local goal for case investigations started within 24 hours is 90% and, Wooten said, the County is likely to meet it next week.\nCounty Parks Open for Worship and Workouts\nTo help businesses stay open during the pandemic, the County Board of Supervisors today voted to allow reservable areas at County parks to be used by places of worship, gyms and other fitness-oriented establishments.\nThe application process is being streamlined and reservation fees are being waived. Day use parking fees, equipment rental fees and utility costs beyond normal park use are still applicable.\n\nThe County Department of Parks and Recreation will review all applications to determine if the requests meet the fee waiver criteria, are compatible with ongoing park activities, can operate with the available infrastructure in the park and not cause damage to the natural environment or landscape.\nCommunity Setting Outbreaks:\n\nFive new outbreaks were identified on Aug. 4: one in a preschool, two in business settings, one in a faith-based organization and one in a restaurant/bar setting.\nIn the past seven days, 30 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n6,981 tests were reported to the County on Aug. 4 and the number of laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 5.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,114.\n\nCases:\n\n348 new cases were reported in San Diego County for a total of 30,864.\n2,655 or 8.6% of cases have required hospitalization.\n666 or 2.2% of all cases and 25.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n10 new COVID-19 deaths were reported in San Diego County on Aug. 4 and the region’s total is now 578.\nSix men and four women died between June 23 and Aug. 4, and their ages ranged from 60 to 87 years of age.\nAll had underlying medical conditions.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200805.18.49.37"}