{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Don’t Delay! Return Your Mail Ballot for 79th Assembly District Election", "description": "If you’re a 79th Assembly District voter and have been holding onto your mail ballot, act now and vote from the comfort of your home. Sign and date your return envelope, seal your completed ballot inside and return it to a trusted source.", "datePublished": "2021-04-01T08:30:03-07:00", "url": "https://www.countynewscenter.com/dont-delay-return-your-mail-ballot-for-79th-assembly-district-election/", "keywords": ["elections", "79th assembly district", "79th state assembly district special primary election", "april 6", "ballot marking device", "election", "fgg", "mail ballot", "special election", "trusted source"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-03-30T15:13:23-07:00", "articleType": "article", "articleContent": "\nIf you’re a 79th Assembly District voter and have been holding onto your mail ballot, act now and vote from the comfort of your home. Sign and date your return envelope, seal your completed ballot inside and return it to a trusted source.\nYou can return it by mail, no postage needed, or at one of many convenient mail ballot drop-off locations around the district. Be sure to visit each location’s website for hours of operation before heading out to return your ballot.\nBallots received by the Registrar’s office throughout this week should be processed in time for the first release of election night results that are posted shortly after 8 p.m. The sooner you return your mail ballot, the sooner Registrar’s staff can process it into the count.\nOnly those who live in the 79th Assembly District can vote in the election. The area encompasses southeastern San Diego, the cities of La Mesa and Lemon Grove, and parts of Chula Vista, Bonita, and National City. Not sure if you live in the 79th Assembly District? You can find out here.\nIf you want to vote in-person that option is available, too. You can do so:\n\nAt the Registrar’s office: Thursday, April 1, Friday, April 2, and Monday, April 5 from 8 a.m. – 5 p.m.\nAt your assigned polling place or the Registrar’s office on Election Day, Tuesday, April 6 when voting hours change from 7 a.m. – 8 p.m.\n\nThis election, all in-person voters will mark their ballot on a ballot marking device. This device does not store, tabulate or count any votes. After the voter confirms their selection on the device, the voter will print their ballot, review it, and place it in the ballot box to be counted at the Registrar’s office election night.\nTo learn about Vote Safer San Diego and voting in the 79th State Assembly District Special Election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210401.08.30.03"}