{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Summertime Brings SUN Bucks", "description": "New this summer, families with school-aged children who rely on free or reduced-price meals during the school year will have some extra grocery money. California SUN Bucks, also called Summer-EBT, begins next month.", "datePublished": "2024-05-17T12:30:39-07:00", "url": "https://www.countynewscenter.com/summertime-brings-sun-bucks/", "keywords": ["health", "alternative income form", "calfresh", "calworks", "ebt card", "school meal"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-05-17T13:36:09-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteNew this summer, families with school-aged children who rely on free or reduced-price meals during the school year will have some extra grocery money. California SUN Bucks, also called Summer-EBT, begins next month and will provide an additional $40 per month in food benefits to eligible children to purchase groceries during the summer months of June, July, and August.\nSUN Bucks work just like CalFresh and can be used to buy foods like fruits, vegetables, meat, and dairy products at most grocery stores, farmer’s markets, and other authorized retailers. They are available to children who receive free or reduced-price school meals through a school meal application or an Alternative Income Form, or get CalFresh, CalWORKs, or Medi-Cal. Children who are attending Head Start, experiencing homelessness, living in foster care or part of a migrant family will also be automatically enrolled. There is no need to apply.\n“No child should spend their summer hungry,” said Richard Wanne, Director of the County Department of Self Sufficiency. “SUN Bucks are a great way to ensure families in need don’t have to worry about how they will put food on the table.”\nSUN Bucks cards will be mailed directly to eligible households with a one-time lump sum of $120 dollars per child. Children who receive SUN Bucks can still participate in other summer meal programs.\nIf your child doesn’t meet one of the requirements for automatic enrollment, they may still be eligible. To check, ask your child’s school for a school meal application or an Alternative Income Form. When you return the form to the school, they will evaluate it and determine if your children are eligible for SUN Bucks.\nLearn more about SUN Bucks or apply for CalFresh Benefits.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240517.12.30.39"}