{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Building a County Budget for All – A Step-by-step Process", "description": "If it’s spring, then it’s high budget season at the County. Preparations are in full swing for a May 4 release to the public.", "datePublished": "2023-04-13T09:32:02-07:00", "url": "https://www.countynewscenter.com/building-a-county-budget-for-all-a-step-by-step-process/", "keywords": ["government", "2023-24 budget", "budget", "clerk of the board", "community engagement", "data", "engage san diego county", "open budget"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-04-13T10:26:22-07:00", "articleType": "article", "articleContent": "\nIf it’s spring, then it’s high budget season at the County. Preparations are in full swing for a May 4 release to the public.\nStaff began preparing the new two-year budget in February but now it’s crunch time. After examining the data, considering community feedback, and pinpointing funding priorities, a balanced recommended budget must be compiled for review by the Chief Administrative Office for release in early May.\nThat’s about three weeks away, which may seem like quite a bit of time, but the County budget is no small matter. Last year, the budget for Fiscal Year 2022-23 came to $7.36 billion.\nEverything the County does for the region’s residents must be considered with equity and justice in mind. And it’s built on community input from various events, surveys and online opportunities throughout the year.\nSo, what does the County budget cover? In the unincorporated areas, the County provides things a city typically would, like roads, parks, libraries and more.\nBut regionwide, the County has even larger responsibilities. For example, it provides services for mental health and substance use issues and provides food and medical assistance to those who need them. The County addresses homelessness and affordable housing, monitors public health for disease outbreaks and inspects restaurants, buildings, gas stations, price scanners, harmful insects, and beach water.\nThe District Attorney’s Office, Probation, Office of Emergency Services and Child Support provide services to the entire county too. The Sheriff’s Department oversees the unincorporated area but is also paid by some cities for law enforcement. The County runs elections, collects property taxes, keeps vital records and the list goes on.\nFunding must support all existing programs and cover new ones. Where does the money for the budget come from? A large share comes from the state and federal government. But those tax dollars must be spent on certain programs. Some money comes in from property taxes, fees for services and other sources.\nOnce the state and federal dollars are accounted for, the County looks at what funds are left to spend and considers how to get the most out of the remaining tax dollars.\nCounty staff did all the legwork preparing a recommended budget, but residents get a say, too. Once the recommended budget is released, the public can submit comments online.\nBut that’s not the end of it. You can give your feedback, either at community meetings on May 16 and May 18, or by attending or calling into the Board of Supervisors budget meetings. A list of key days and times is listed on our open budget website. You’ll also see last year’s adopted budget.\nThis year, departments will give their budget presentations to the Board of Supervisors at a meeting on May 11. The Board will hold public hearings on June 12 and June 15. A revised recommended budget comes out on June 23, and budget deliberations and adoption take place on June 27.\nIn the meantime, the County wants to know how to keep you informed as it moves along the budget process. Do you prefer email, text or some other form of communication? Visit the budget page on Engage San Diego County and give us your ideas. Starting May 4 through June 21, you can leave your e-Comments on the budget at the same site.\nThe County’s Engage San Diego County webpage was created to make it easier for the public to be involved in the planning process of County projects and initiatives. People can find information about active and upcoming public projects, forums and links to numerous ways to take part and weigh in on those projects.\nYou can also visit the Clerk of the Board’s website or call 619-531-5434 to get details about the Board’s budget meetings and request translation services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230413.09.32.02"}