{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Signs Agreements to Transition Families in Hotels to Long-Term Housing Solutions", "description": "The County of San Diego, the City of San Diego's Housing Commission, and the National City Housing Authority have agreed on plans to help residents affected by the January storms to transition out of the County's Emergency Temporary Lodging Program to longer-term housing solutions.", "datePublished": "2024-06-05T15:58:40-07:00", "url": "https://www.countynewscenter.com/county-signs-agreements-to-transition-families-in-hotels-to-long-term-housing-solutions/", "keywords": ["government", "alertsandiego.org/recovery", "emergency services director jeff toney", "emergency temporary lodging program", "national city housing authority", "san diego housing commission"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-06-07T14:10:46-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County of San Diego, the City of San Diego’s Housing Commission, and the National City Housing Authority have agreed on plans to help residents affected by the January storms to transition out of the County’s Emergency Temporary Lodging Program to longer-term housing solutions.\nThe Emergency Temporary Lodging program was created to bridge the gap for those affected by the January floods to receive federal support and help those residents return to their homes.\nNearly 500 households, or more than 1,500 people, are currently supported by the County program and receiving temporary lodging, food, and access to mental health services.\nThe County provided $4.2 million in grant funds to the San Diego Housing Commission to support City of San Diego Emergency Temporary Lodging Program participants with rental assistance, security deposits, utility payments, landlord incentives, unit rehabilitation or direct case management costs. The San Diego Housing Commission will determine how best to meet the needs of their residents including how much support each individual will receive. The County finalized a similar agreement with National City. The National City Housing Authority received more than $360,000 in County grant funds to help their residents successfully transition out of the County Emergency Temporary Lodging Program.\n“This is the next step in helping our neighbors recover from the January flood,” said Emergency Services Director Jeff Toney. “The County program to provide hotel rooms ends June 21, and we want to make sure the experts at the city housing agencies have what they need to help their residents find the appropriate long-term housing solutions.”\nThe County Board of Supervisors allocated money for the San Diego Housing Commission, the National City Housing Authority, and the Housing Authority of the County of San Diego to help families leaving the County program secure alternate housing solutions. More than 300 residents in the County program have also received FEMA assistance to help with home repair or rental assistance.\nFor more information on the County’s Emergency Temporary Lodging Program, go to AlertSanDiego.org/Recovery.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240605.15.58.40"}