{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Behavioral Health Workforce Symposium Addresses Lack of Qualified Workers", "description": "A new report presented to the County of San Diego by the San Diego Workforce Partnership found far fewer behavioral health workers in our region than necessary to meet demand.", "datePublished": "2022-08-23T16:18:44-07:00", "url": "https://www.countynewscenter.com/?p=209286", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2022-08-23T16:18:44-07:00", "articleType": "video.other", "articleContent": "\nA new report presented to the County of San Diego by the San Diego Workforce Partnership found far fewer behavioral health workers in our region than necessary to meet demand. The shortage is expected to multiply over the next five years. Today, the County assembled a panel of behavioral health leaders, educators, and workers to discuss the report’s findings and respond to recommendations on how to retain the workforce needed to provide the highest quality of behavioral health services possible to San Diego residents.\nThe report estimates the region is short up to 8,000 workers of what is currently needed to meet the mental health and substance use disorder treatment needs of San Diego County residents. Our region needs to educate, train, attract, employ and retain 18,500 additional professionals over the next five years to address current demands, replace open positions and keep pace with the population growth.\nReview the entire San Diego Workforce Partnership report at workforce.org/bhreport.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220823.16.18.44"}