{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Initiative Selected as National TB Elimination Champion", "description": "The County’s Tuberculosis Elimination Initiative has been selected as a 2021 TB Elimination Champion by the Centers for Disease Control and Prevention.", "datePublished": "2021-04-06T10:31:49-07:00", "url": "https://www.countynewscenter.com/county-initiative-selected-as-national-tb-elimination-champion/", "keywords": ["health", "tb", "tb elimination champion", "tuberculosis"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-06T10:31:49-07:00", "articleType": "article", "articleContent": "\nThe County’s Tuberculosis Elimination Initiative has been selected as a 2021 TB Elimination Champion by the Centers for Disease Control and Prevention.\nThe TB Elimination Initiative was one of 19 organizations or individuals recognized by the CDC throughout the United States.\n“This is a great recognition and a great example of what can be accomplished when public and private entities work together to fight diseases such as tuberculosis,” said Wilma Wooten, M.D., M.P.H., County public health officer. “This is a well-deserved recognition for all the staff in the County’s Tuberculosis Control Program.”\nThe CDC U.S. TB Elimination Champions project recognizes organizations and individuals who have made meaningful contributions to end TB in their communities, especially during the ongoing COVID-19 pandemic.\nThe County’s Tuberculosis Elimination Initiative is being recognized for the region’s coordinated efforts to establish public-private partnerships to build a TB elimination framework that serves the County’s diverse population. The Initiative involves multiple sectors and communities impacted by TB.\n“We are honored to receive this formal CDC recognition and want to thank our 35 local partners. Despite the ongoing COVID-19 pandemic, stakeholders throughout the county collaborated with us to develop key recommendations and plan for implementation.” said Ankita S. Kadakia, M.D., chief medical director for Tuberculosis Control and Refugee Health at the County Health and Human Services Agency.  The county has also expanded access to its TB prevention programs through telehealth and is evaluating opportunities to leverage existing vaccination infrastructure to provide education and testing for people at highest risk for TB and latent TB infection.\nMore information about TB elimination and local statistics are available on the TB program website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210406.10.31.49"}