{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Check Once, Check Twice, Check Your Receipts so Your Holiday’s Nice", "description": "The shop-shoppingest time of the year is back. And that means it’s a perfect time to remind all of us―always, always double-check your receipts so you don’t get accidentally overcharged by faulty cash registers and price scanners.", "datePublished": "2023-11-22T10:35:53-08:00", "url": "https://www.countynewscenter.com/check-once-check-twice-check-your-receipts-so-your-holidays-nice/", "keywords": ["consumer", "ag weights and measures", "check receipts", "holiday shopping", "lueg", "protecting consumers"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-11-22T10:35:53-08:00", "articleType": "article", "articleContent": "\nThey’re almost here―Black Friday; Cyber Monday; even Santa Claus!\nYup. The shop-shoppingest time of the year is back. And that means it’s a perfect time to remind all of us―always, always double-check your receipts so you don’t get accidentally overcharged by faulty cash registers and price scanners.\nOnline shopping has gotten huge. But most of us are still trekking to the shopping mall and stores. According to the U.S. Census Bureau’s recently released E-Commerce Third Quarter 2023 report, ecommerce made up 15.6% of all retails sales. That means a heck of a lot of people are going to, and buying in, stores.\nAnd being overcharged can happen.\nEvery year, to make sure local consumers are being charged accurately, the County department of Agriculture, Weights and Measures inspects more than 1,400 local businesses and 21,000 price-scanning devices, scales that charge for items by weight, and other equipment that set prices.\nAnd even the best businesses have occasional overcharges.\nThis year, between January and October, just over one out of every five stores, 18.5%, that were inspected had overcharge errors. And the average overcharge was $2.37. An extra two and a half bucks may not sound alarming, but even tiny overcharges can add up to make big dents in your wallet or pocketbook in the holiday shopping season.\nSo, be like Santa! Check your lists (receipts) and check them twice to make sure you have a merry holiday season. Here are some other tips to help you shop smartly and safely:\nProtect Against Overcharging:\n\nAlways verify receipts and immediately notify store management of any price discrepancies.\nStores are required to display the price of an item, as you are buying it, before the transaction is complete. Watch the display screen as your items are scanned.\nTake sales advertisements with you when shopping to verify prices.\nKnow that stores cannot legally charge more than their lowest advertised, posted or quoted price.\n\nShop Smart:\n\nPlan ahead. Start watching for store sale fliers, flea markets, garage sales, clearance sales, etc.\nMake a list of what you need.\nComparison shop with at least five different sources for the best values.\nDon’t buy everything at once. Establish a spending plan and timetable to buy what you need over several weeks or months to take full advantage of future sales and true bargains.\nDownload and use the County’s Tell Us Now app to contact Agriculture, Weights and Measures, or call AWM at 1-888-TRUE SCAN (1-888-878-3722) or email to wm.awm@sdcounty.ca.gov to report overcharges you can’t resolve with a store.\n\nFor more information, go to Agriculture, Weights and Measure’s Consumer Protection webpage and check out this video about the scanner inspection program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231122.10.35.53"}