{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County of San Diego Hires Public Defender", "description": "After an extensive recruitment with input from internal and external stakeholders, and community engagement at its center, the County of San Diego has appointed Paul A. Rodriguez as the new Public Defender. Rodriguez will be dedicated to ensuring that people charged with a crime in state court who are financially unable to retain private counsel receive a rigorous defense. His focus will extend to providing comprehensive support to staff and pursuing innovative and effective programs to each client from arrest to post-sentencing. ", "datePublished": "2023-12-20T16:06:47-08:00", "url": "https://www.countynewscenter.com/county-of-san-diego-hires-public-defender/", "keywords": ["government", "indigent criminal defense", "paul a. rodriguez", "public defender office"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-12-20T16:07:33-08:00", "articleType": "article", "articleContent": "\nAfter an extensive recruitment with input from internal and external stakeholders, and community engagement at its center, the County of San Diego has appointed Paul A. Rodriguez as the new Public Defender. Rodriguez will be dedicated to ensuring that people charged with a crime in state court who are financially unable to retain private counsel receive a rigorous defense. His focus will extend to providing comprehensive support to staff and pursuing innovative and effective programs to each client from arrest to post-sentencing. \n \nThe selection of Rodriguez aligns with the County’s pursuit of a leader who champions restorative justice, diversity, inclusion and belonging. His aim is to cultivate an environment where defenders are not only passionate, but also skilled advocates for their clients. Prior to assuming this position, Rodriguez served as the El Cajon Branch Supervisor, where he provided support to more than 50 attorneys and staff. He joined the Public Defender Office as an intern before graduating from the University of San Diego School of Law. \n \n“Paul has a leadership style that is transparent, collaborative, and team oriented, with a high level of integrity and a mission-driven focus. San Diego County Defenders and professional staff are committed and passionate about their work, and I am excited to see all the Office will accomplish under Paul’s leadership,” said Holly Porter, the Deputy Chief Administrative Officer for Public Safety.\n  \nRodriguez, expressing his commitment, stated, “I have dedicated my legal career to indigent criminal defense.  Our department will continue to provide zealous legal representation to those with fewer opportunities, those who are consistently marginalized, to protect them from being presumed guilty.  It is my privilege to continue this difficult work with our dedicated staff of professionals who work tirelessly every day.” \n \nRodriguez was born in Santiago, Chile and he says his family moved extensively to pursue better economic opportunities in Argentina, Puerto Rico, Florida, Luxembourg, and Belgium. Throughout his childhood, he says he and his family witnessed and experienced social, economic, and political inequities that later compelled him to work for justice and freedom for all. \n \nThe San Diego County Public Defender Office was established in 1988 by county resolution and is recognized as one of the finest in the nation.  The office consists of 547 employees working in four separate divisions: the Primary Public Defender, the Alternate Public Defender, the Multiple Conflict’s Office, and the Office of Assigned Counsel, all ethically separated to avoid conflicts.  Staff include attorneys, investigators, legal support and administrative staff and behavioral health professionals. The Public Defender’s Office recognizes that clients’ needs extend beyond addressing their legal matter, and the Office includes mental health support for clients, housing navigators, and mitigation specialists.\nLearn more about the Public Defender Office here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231220.16.06.47"}