{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Annual Report Shows Community in Action", "description": "The County works with the community to address the region’s challenges and together, we are getting results. You’ll see our achievements in the County’s Fiscal Year 2023/24 Annual Report released Thursday.", "datePublished": "2024-10-10T15:56:00-07:00", "url": "https://www.countynewscenter.com/san-diego-county-annual-report-shows-community-in-action/", "keywords": ["government", "annual report", "behavioral health", "community engagement", "community in action", "ebony shelton", "environmental sustainability", "equity", "healthy and safe communities", "homelessness and affordable housing", "public safety and justice reform", "san diego county"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-10-10T15:56:00-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County works with the community to address the region’s challenges and together, we are getting results.\nYou’ll see our achievements in the County’s Fiscal Year 2023/24 Annual Report released Thursday.\nThe report shows how we’re moving forward in areas that affect all of us in some way – affordable housing, homelessness, behavioral health, public safety, justice reform, environmental sustainability, healthy and safe communities, and equity.\n“In coming together, we achieved more than any of us could alone,” said Chief Administrative Officer Ebony Shelton. “That unity, and the collective impact it brings, is making a difference in the lives of people throughout the region and positions us to deal with any challenges that may come our way.”\nHere are some of the highlights:\nThe County worked with its partners to help more people across the region move into affordable housing. Ten affordable housing developments opened this last fiscal year and 17 more are in the works. The County has invested $314 million into affordable housing since 2017.\nThe Shallow Rental Subsidy Program expanded to help more low-income seniors avoid homelessness. A $500 a month subsidy goes to their landlords allowing these seniors to stay in their homes.\nIn just one year, nearly 1,000 unhoused veterans were permanently housed as part of the Leave No Veteran Homeless initiative. The County and over a dozen regional partners worked together to make it happen.\nThe Board of Supervisors also approved nearly $4.5 million to expand its Mobile Crisis Response program. It uses behavioral health experts rather than law enforcement to respond to non-violent situations where people are experiencing a behavioral health crisis.\nSome people experiencing a behavioral health crisis were admitted to Crisis Stabilization Units (CSUs) where a calm space allows them to become stable. The County has six CSUs around the region and broke ground on its 7th in July.\nCounty Fire celebrated the opening of the East Otay Mesa Fire Station last October and the Sheriff’s Office took delivery of two new state-of-the-art helicopters. One will fight fires and the other will primarily act as a patrol helicopter.\nPhase 2 of the Youth Transition Campus was completed and is now fully operational. The campus incorporates justice reform into detention facilities for young people. For adults who are leaving jail, a resource hub is in the works to help them reenter the community.\nOne Safe Place, the North County Family Justice Center, helps trauma survivors with much needed services. Plans are now underway to open a second location in the South Bay.\nThe County is investing $500,000 to implement the Uplift Boys & Men of Color initiative. It will connect at-risk youth with wrap-around services, trauma support systems and workforce development opportunities.\nThe Equity Impact Grant Program gave ten nonprofits $100,000 grants each and another ten are under evaluation. The program helps small, nonprofit organizations address inequity in areas like housing, health, education and public safety. The County is adding another $2 million over two years to expand the program.\nThe County updated its Climate Action Plan for unincorporated communities. The plan outlines how the County, residents and businesses can reduce greenhouse gases, wildfire risks and protect the natural environment.\nThe County also added more open space, planted thousands of trees, increased the number of electric vehicles in its fleet and built more charging stations.\nConstruction began on a new state-of-the-art public health lab that will serve the entire region. The facility will open next spring.\nAnd the Southeastern Live Well Center opened its doors. The community played a central role in its creation. The County’s sixth Live Well Center offers food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services.\nTwo libraries expanded last year, and a new branch is planned for Casa de Oro. Two parks opened: Four Gee Park in 4S Ranch and the County’s first equestrian park in Lakeside. Three other parks around the region are in the works.\nTo see the full Annual Report, go to the County’s Annual Report webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241010.15.56.00"}