{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Most COVID-19 Restrictions End Tuesday", "description": "The state will officially retire its Blueprint for a Safer Economy tier system Tuesday, lifting capacity and physical distancing restrictions for most businesses and activities in the region.", "datePublished": "2021-06-14T17:20:30-07:00", "url": "https://www.countynewscenter.com/most-covid-19-restrictions-end-tuesday/", "keywords": ["health", "blueprint for safer economy ends", "coronavirus", "covid-19", "retiring of tier system", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-06-14T17:20:30-07:00", "articleType": "article", "articleContent": "\nThe state will officially retire its Blueprint for a Safer Economy tier system Tuesday, lifting capacity and physical distancing restrictions for most businesses and activities in the region. This means that almost all sectors of the economy can return to pre-pandemic capacity limits tomorrow.\nCertain COVID-19 guidance will continue to be in place for large-scale event settings. Organizers of these so-called mega events with more than 5,000 people indoors, or more than 10,000 people outdoors will need to take extra steps to ensure the safety of attendees.\nPeople who attend mega events indoor will be required to show proof of vaccination or a negative COVID-19 test before they arrive at the venue. Organizers of outdoor mega events will be strongly encouraged to implement the same safety protocols, though they will not be required to do so.\nFace covering mandates will remain in effect after tomorrow in nine settings: on public transit, indoors in K-12 schools and in childcare settings, in healthcare settings, long term care facilities, detention centers, homeless shelters, emergency shelters and cooling centers.\nThe state guidance will remain in place until at least October 1.\n“The end of the state’s framework will allow us to go back to many of the activities we have not been able to enjoy since last March, but the pandemic does not end tomorrow,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “COVID-19 is still present in our community and we all need to continue to do our part to protect the most vulnerable and avoid spreading the virus.”\nVaccination Progress:\n\nDoses delivered: Close to 4.22 million.\nDoses administered: Over 3.89 million.\nReceived at least one shot: Over 2.10 million or 75.2% of San Diegans 12 and older.\nFully vaccinated: Close to 1.75 million or 62.4%.\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people.\nTo date, 100.3% of the goal population has received at least one vaccine and 83.3% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 1.2 cases per 100,000 residents, placing the County in the Yellow Tier.\nThe testing positivity percentage is 1.1% and the County is in the Yellow Tier.\nThe health equity metric is 1.3%, placing the County in the Yellow Tier.\nThe state’s metric system will be retired tomorrow, June 15.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed June 11-13.\nIn the past seven days (June 7 through June 13), three community outbreaks were confirmed.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nTesting:\n\n5,591 tests were reported to the County on June 13, and the percentage of new positive cases was 0.8%.\nThe 14-day rolling average percentage of positive cases is 0.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,998.\n\nCases, Hospitalizations and ICU Admissions:\n\n46 COVID-19 cases were reported to the County on June 13. The region’s total is now 281,313.\n15,467 or 5.5% of all cases have required hospitalization.\n1,712 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new deaths were reported June 13 or June 12. The region’s total is 3,770.\nTwo new deaths were reported June 11. A man in his 60s with underlying medical conditions died June 9, 2021 and a woman in her 60s with underlying medical conditions died June 10, 2021.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210614.17.20.30"}