{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Makes Speaking at Board Meetings Easier Than Ever", "description": "Have you ever wanted to speak about an issue at a San Diego County Board of Supervisors meeting? Well, the County is introducing changes to make it easier to do than ever before!", "datePublished": "2025-03-25T10:24:02-07:00", "url": "https://www.countynewscenter.com/county-makes-speaking-at-board-meetings-easier-than-ever/", "keywords": ["government", "clerk of the board", "community engagement", "equity", "fgg"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2025-03-25T13:24:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesHave you ever wanted to speak about an issue at a San Diego County Board of Supervisors meeting?\nWell, the County is introducing changes to make it easier to do than ever before.\nUntil now, anyone who wanted to speak at a Board meeting had to fill out a speaker slip before the meeting started—either a written slip in person at the Board meeting, or electronically online if they wanted to talk by phone.\nStarting April 2, no more paper slips, no more waiting in line and no more waiting until the day of the meeting to request to speak.\nAnyone can submit a simplified speakers’ slip online using their phone, laptop or other device, at any time before the Board starts taking public comment on the item during the meeting. If you’re speaking by phone, the new system will even call you when the meeting starts and give you real-time notifications about where you are in line to talk on the item or items you’ve selected to speak about.\nTo make the new changes even easier for the public to use, the County Clerk of the Board of Supervisors will be hosting three informational webinars on Zoom to demonstrate how the system works and to take any questions people may have.\n\nSaturday, April 5 at 10 a.m. (Zoom registration link)\n\n\nMonday, April 7 at noon (Zoom registration link)\n\n\nMonday, April 7 at 7 p.m. (Zoom registration link)\n\nAnd of course, County staff will also be available at Board meetings to provide on-site assistance and help people if they need it to sign-up to speak.\nSimple System, How it Works\n\nGo Online to “San Diego County, CA Meetings” webpage: The new speaker-request system is easy to use. Use your smartphone, computer, laptop, or other device to go to the webpage at: https://PublicComment.SanDiegoCounty.gov.\nClick on the Meeting You Want to Speak At: Click on the meeting date for the meeting you want to comment at. That will provide information about the meeting.\nClick “Register”: Click on the blue “Register” box at the bottom of the page.\nFill out the Form: Clicking the “Register” button will bring up a set of instructions, the online submittal form, and the list of agenda items for you to select one or more items that you want to speak to. The submittal form can be translated into multiple languages. Simply fill out your information, mark the item or items you wish to speak to, and whether you’re attending “In Person” or “Virtually” by phone.\nScroll to request Interpreter if Needed: Scroll to the bottom of the submission form to request an interpreter if English is not your first language.\nCheck the box to ask to be called when the Board meeting starts: You can also check a box to subscribe to updates on the Board of Supervisors.\nClick “Register” again at the bottom: And you’re all set. You’ll receive an email confirming your request to speak.\n\nImproved Customer Service; Take Part in County Government\nMaking it easier for people to engage with County government is of the utmost importance to us. This new public comment system is designed to do just that. We know that government of the people and for the people works best with the people’s input. So, take part by sharing your thoughts at County Board of Supervisors’ meetings. It’s easier than ever.\nFor detailed instructions about using the new system, more information about County Supervisors’ Board meetings, how to find Board agendas or more general information, go to the County Clerk of the Board’s website.\nHere’s an additional video to help you learn more about the speaking at the Board of Supervisors meetings and about the new speaker online slip process.\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250325.10.24.02"}