{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Shares Resources and Events this Older Americans Month", "description": "Older adults are the fastest growing population in San Diego County, estimated to climb to nearly 825,000 by 2029. At that time, they would make up almost a quarter of our region’s population of 3.3 million. This Older Americans Month, the County is sharing resources, events and opportunities available to older adults and their loved ones. ", "datePublished": "2025-05-14T14:06:15-07:00", "url": "https://www.countynewscenter.com/county-shares-resources-and-events-this-older-americans-month/", "keywords": ["health", "aging and independence services", "older adults", "older americas month"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-14T14:06:15-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesOlder adults are the fastest growing population in San Diego County, estimated to climb to nearly 825,000 by 2029. At that time, they would make up almost a quarter of our region’s population of 3.3 million. This Older Americans Month, the County is sharing resources, events and opportunities available to older adults and their loved ones. \nThis year’s Older Americans Month theme is Flip the Script on Aging, which encourages everyone to transform how we perceive, talk about and approach aging—like challenging stereotypes and misconceptions about getting older. \n“Older adults are an important part of our region and it is in all of our best interest to support healthy aging, provide innovative resources and include everyone,” said Jennifer Bransford-Koons, County Aging & Independence Services director. “Our Aging Roadmap does just that. It is a framework that focuses on ten priority areas for designing age-friendly and dementia-friendly communities.” \nThe Aging Roadmap, which launched in 2019, outlines the region’s efforts to make sure the needs of older adults are met when it comes to care and support, affordable housing, accessible transportation and opportunities to work and volunteer.  \nSeveral County programs help older adults stay connected and provide activities for well-being including:  \n\nMeals and Senior Dining: hot, nutritious meals are served for people over 60 years old weekly at nearly 30 locations around the region. Many locations also offer transportation. \n\n\nIn-Home Supportive Services (IHSS): helps eligible older adults and people with disabilities with homemaker and personal care assistance.   \n\n\nMultipurpose Senior Services Program (MSSP): helps eligible older adults, over the age of 60, stay in their home by providing help with care coordination  \n\n\nVolunteer opportunities: older adults can find social connections and serve the community in a variety of ways through the Retired Senior Volunteer Program (RSVP). Volunteers can also serve in the Long-Term Care Ombudsman Program to visit long-term care sites to ensure residents receive quality care and advocate for their rights.  \n\nScam Jam San Diego  \nAnother important resource available starting this month is San Diego Scam Jam, in partnership with AARP. In-person fraud presentations, a shred event and cybersecurity workshops are scheduled throughout the county for May, June and July.  \nPeople can learn about recognizing, avoiding, and reporting scams, as well as how to stay safe online. For a list of events, dates and locations, visit the Scam Jam San Diego website.  \nTo learn more about available resources or to report suspected elder abuse, contact the County Aging & Independence Services Call Center at 800-339-4661 or visit their website.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250514.14.06.15"}