{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "SBA to Open Business Recovery Center for Businesses Impacted by Flooding", "description": "The U.S. Small Business Administration will be opening a Business Recovery Center in National City for businesses that were impacted by the severe storm and flooding from Jan. 21-23. ", "datePublished": "2024-02-23T13:47:23-08:00", "url": "https://www.countynewscenter.com/sba-to-open-business-recovery-center-for-businesses-impacted-by-flooding/", "keywords": ["public safety", "disaster recovery", "flood recovery", "jan. 22 severe storm", "national city", "sba", "sba loans"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-02-23T14:08:45-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe U.S. Small Business Administration (SBA) will be opening a Business Recovery Center in National City for businesses that were impacted by the severe storm and flooding from Jan. 21-23. \nThe center will open on Monday, Feb. 26 at 12 p.m. at the Southwestern College Higher Education Center located at 880 National City Blvd. National City, CA 91950. It will be in Room 7100 on the first floor in the Center for Business Advancement. \nSBA representatives will be available to help business owners get access to the services they need and low-interest loans.  \nThe Business Recovery Center will be open Monday through Friday from 8:30 a.m. to 5 p.m. No appointment is necessary.  \nBusinesses and private nonprofit organizations may borrow up to $2 million to repair or replace damaged or destroyed property, equipment, inventory, and other business assets. The loans will cover losses that are not fully covered by insurance or other recoveries. \nInterest on SBA disaster loans will not accrue until 12 months from the date of the first disbursement. Repayment of loans will also begin 12 months from the date of the first disbursement. \nTo apply for a disaster loan online or find more disaster information assistance, visit SBA.gov/disaster, call the SBA Customer Service Center at 800-659-2955 or email disastercustomerservice@sba.gov. \nSBA representatives will also provide help to business owners and residents at the FEMA disaster recovery centers when they open to the public \nThe deadline to apply for property damage is April 19, 2024. The deadline to apply for economic injury is Nov. 19, 2024. \nHomeowners impacted by the storm can also apply for low-interest disaster loans through the SBA disaster assistance website. \nFor more information about storm recovery resources, including how to apply for FEMA disaster assistance, visit AlertSanDiego.org/Recovery. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240223.13.47.23"}