{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Vista Azul Affordable Housing Opens in Carlsbad", "description": "A grand opening ceremony was held this week for Vista Azul in Carlsbad, the newest affordable housing community in the county for low-income individuals and families.", "datePublished": "2024-11-07T15:43:06-08:00", "url": "https://www.countynewscenter.com/vista-azul-affordable-housing-opens-in-carlsbad/", "keywords": ["health", "affordable housing", "carlsbad", "family apartments", "innovative housing trust fund", "low income"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-11-07T16:55:48-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA grand opening ceremony was held this week for Vista Azul in Carlsbad, the newest affordable housing community in the county for low-income individuals and families.\nThe 70-unit development is near the corner of Aviara Parkway and Palomar Airport Road and includes a mix of 32 one-bedroom apartments, 19 two-bedroom apartments, and 18 three-bedroom apartments with one manager’s unit. The homes are available to individuals and families who earn between 30% and 60% of the Area Median Income.\n \nVista Azul features a community room with free wifi and kitchen, a teen room, a common laundry area, an outdoor BBQ and picnic area, a play structure with a tot lot, and a bocce ball court. It is located near retail shops, employment opportunities and schools.\n“There is a critical need for affordable housing and I am proud of our partnership with the City of Carlsbad to make this grand opening possible, “said David Estrella, County Housing and Community Development Services Director. “The residents here at Vista Azul will have housing security and that leads to better health and educational outcomes.”\nVista Azul is a BRIDGE Housing development made possible through private and public partnerships including the $1.3 million dollars in HOME Investment Partnerships Funding provided by HUD and administered by the County of San Diego.\nVisit the BRIDGE Housing website for more information.\nSince 2017, the County has invested more than $314 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal, and local funding sources administered by the County.\nThose funds have helped open doors to nearly 2,500 homes with 3,100 more on the way.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241107.15.43.06"}