{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adopts New $8.17 Billion Budget", "description": "The County Board of Supervisors unanimously adopted a new $8.17 billion budget for Fiscal Year 2023-24 after public deliberations on Tuesday.", "datePublished": "2023-06-27T14:59:26-07:00", "url": "https://www.countynewscenter.com/county-adopts-new-8-17-billion-budget/", "keywords": ["government", "2023-24 budget", "2023-24 recommended budget", "adopted budget", "budget"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-06-29T10:04:54-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors unanimously adopted a new $8.17 billion budget for Fiscal Year 2023-24 after public deliberations on Tuesday.\nThe adopted budget shows an increase of $806.4 million or 11% from last year. The County will also add more than 500 employees for a total of 20,387.25 staff years.\nPrior to the vote, Board Chairwoman Nora Vargas thanked her colleagues and the community for doing the hard work to create a budget that reflects our communities.\n“Now more than ever, we have to demonstrate that we have to do this work together,” said Vargas. “We had to make sure this budget was a fiscally prudent budget so we can continue to move the County forward and communities get the resources they need for the quality of life that they deserve,” said Vargas.\nThe recommended budget released May 4 funds efforts to fight homelessness; take on mental health and substance use disorder challenges; improve the justice system; help working families and maintain core services like roads, fire protection and parks. The plan also reflects investments into a new public health lab and affordable housing projects.\nA revised recommended budget released last week added $60.6 million or an increase of 0.7% to the recommended budget plan to reach the total of $8.17 billion.\nThe increased funding will help implement a May 24 board direction to remove barriers from housing. The revision also includes funding for special election costs, an upgrade to the regional communication system, two mobile service center vehicles for the Probation Department, funding for prevention, diversion and reentry and more.\nThe County’s budget was built on community input, and residents were invited to departmental budget presentations, two community budget meetings, two budget hearings and Tuesday’s deliberations and adoption.\nInvestment priorities in the adopted budget include:\nMental Health and Substance Use Disorder\n\n$66.7 million increase for a total investment of $737.9 million for contracted services including:\n\n\n\n\n$37.5 million mental health services for adults.\n$10.9 million for crisis diversion services including expanding Mobile Crisis Response Teams, the Crisis Line, public messaging awareness and crisis community-based services.\n$9.5 million substance use disorder outpatient, withdrawal management, residential and recovery services.\n$8.8 million for 41 long-term beds.\n\n\n\n\n$18.3 million for implementation of the CARE Act, a new state program for people with serious behavioral health issues that may provide services, shelter and treatment through a civil court proceeding.\n$7.1 million to address opioid addiction.\n\n Homelessness and Housing\n\n$25.0 million increase for the Innovative Housing Trust Fund to help build affordable housing.\n$6.6 million increase to support Permanent Local Housing Allocation and HUD entitlement programs.\n$5.8 million increase to prevent homelessness and provide housing stability for families experiencing homelessness.\n$2.3 million for homeless services/housing for the LGBTQIA+ community.\n$2.0 million increase to expand the Pilot Shallow Rental Subsidy Program.\n$2.0 million increase for the Alternatives to Incarceration initiative to provide care coordination and housing for high needs justice-involved populations assisted through the Connection Points pilot.\n$0.5 million increase to expand regional homeless diversion efforts.\n\n Sustainability and Fighting Climate Change\n\n$3.8 million to continue work on an ambitious Regional Decarbonization Framework that will help communities move the region toward zero-carbon emissions.\nPlan to plant more than 5,000 trees as part of a regional effort to add 10,000 trees throughout the county to naturally remove carbon dioxide from the air and lower temperatures.\n$2.5 million for the design phase of the new Zero Carbon Portfolio Plan for County operations with the goal to reach a 90% reduction in greenhouse gas emissions in facilities by 2030.\n$2.7 million to restore land and improve water quality in the Tijuana River Valley.\n\nJustice Reform\n\n$10.6 million to protect the public and help justice-involved people who have substance use disorders and/or behavioral health issues as they reenter their communities by connecting them with treatment, housing and jobs.\n$12.8 million for court programs to support those with mental health, substance use and other needs, such as Collaborative Courts, Drug Courts, Mandatory Supervision Courts, Reentry Courts, Veterans Courts and Behavioral Health Courts.\n$2.0 million to keep young people out of the criminal justice system and address underlying causes of their harmful behavior.\n\nInvesting in Working Families\n\n354 additional staff years across all Health and Human Services Agency departments to support safety net programs like CalWORKs, CalFresh, and Medi-Cal, and services for behavioral health, public health, seniors, children, and families.\n$141.1 million increase for safety net program benefit payments, higher wages for In-Home Supportive Services caregivers, additional employment services and training for CalWORKS and CalFresh recipients and expanding Info Line 211 Access.\n$18.0 million increase to support foster youth, increase mental health services for transition-age youth and to set up a Prevention Hub to help families avoid the child welfare system and Juvenile Probation.\n$5.2 million of ongoing support for the Office of Immigrant and Refugee Affairs.\n\nHealthy and Safe Communities\n\n$18.0 million to build “One Safe Place South: The South County Family Justice Center,” matching the one opened in North County, to help survivors with restraining orders, safety planning and trauma therapy, and help them get healthcare, food assistance, shelter and housing.\n$3.9 million to bolster Public Health Infrastructure.\n$17.0 million to build a new Jacumba Fire Station to better protect the entire community and region.\n$37.6 million to build a new Santee Animal Shelter opening in fall 2024.\n$1.8 million increase to build capacity and infrastructure for Enhanced Case Management and/or Community Support services to support implementation of CalAIM for individuals accessing the Medi-Cal services delivery system.\n$0.6 million increase for a pilot which will expand jail in-reach and transitional services to individuals who are involved with the justice system with behavioral health needs as they reenter their communities.\n\nThe Fiscal Year 2023-24 budget takes effect on July 1.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230627.14.59.26"}