{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Child Support Helping Families Get Students Ready for New School Year", "description": "It is back-to-school season, and County Child Support Services is giving away hundreds of backpacks filled with school supplies, while supplies last, to families who attend its Super Saturday event.", "datePublished": "2024-08-01T10:58:05-07:00", "url": "https://www.countynewscenter.com/county-child-support-helping-families-get-students-ready-for-new-school-year/", "keywords": ["families", "back to school", "backpacks", "dcss", "super saturday"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-08-01T10:58:05-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIt is back-to-school season, and County Child Support Services is giving away hundreds of backpacks filled with school supplies, while supplies last, to families who attend its Super Saturday event.\nThe community event will be held from 9 a.m. to 1 p.m., on August 10 at the Child Support Services Central Office, 3666 Kearny Villa Road in San Diego.\nEvery August, Child Support Services celebrates Child Support Awareness Month by assisting families in the community and supporting them during the back-to-school season. The backpacks and school supplies have been made available through generous donations from Child Support staff, local businesses, and various community organizations, said Andrea Cooley, chief of operations.\nChild Support Services recognizes that local families may be experiencing challenges with the rising costs associated with basic living expenses and this is one way they can help. A new backpack and supplies can boost a child’s confidence and self-esteem as they start a new school year, she said.\nAt the Super Saturday event, parents may also access services from of the following County departments and partner organizations who will be at the event:\n\nEquus Workforce Family Solutions and Jewish Family Service providing employment and basic living support services\nDads Corps offering parental training\nFamily Law Facilitators offering child support legal assistance\nCounty Animal Services assisting families who want to adopt a pet, adoption fees are waived in August\nCounty Human Resources offering job opportunities\nCounty Emergency Services offering valuable emergency information and tips\nCounty Health and Human Services Agency providing eligibility and family self-sufficiency services\nAlso, various community-based organizations will be providing employment, housing and education assistance\n\nAdditionally, Child Support Services will be available to share details on how to obtain a high school diploma in partnership with San Diego County Library, and how the Parents Invest in Education and Youth with Dreams programs work to help children.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240801.10.58.05"}