{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar to Hold Election Administration Plan Public Hearings", "description": "The Registrar of Voters office is holding two hearings on Wednesday, July 26, inviting the public to provide input on the renewal of the County’s Election Administration Plan.", "datePublished": "2023-07-14T14:54:57-07:00", "url": "https://www.countynewscenter.com/registrar-to-hold-election-administration-plan-public-hearings/", "keywords": ["elections", "california voter s choice act", "county registrar of voters", "election administration plan", "public hearings", "voter s choice act"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-07-14T15:15:12-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters office is holding two hearings on Wednesday, July 26, inviting the public to provide input on the renewal of the County’s Election Administration Plan.\nThe Registrar’s office adopted the plan in 2022 and is renewing the plan as part of the two-year review process.\nThe plan describes how the Registrar’s office administers elections under the Voter’s Choice Act.\nThe vote center model falls under the Voter’s Choice Act, and it modernizes the election process in several ways:\n\nActive registered voters automatically receive a ballot in the mail.\nVoters can return their ballot by mail, a secure ballot drop box, or in person at any vote center.\nVote centers open for up to 11 days, giving voters more time to return their ballot.\n\nDuring the hearings, the public can give input on vote center and ballot drop box locations, and voter education and outreach plans.\nThe public can also find suggestion forms for vote center and ballot drop box locations, and general comment forms on the Registrar’s Voter’s Choice Act page.\nPublic Hearing #1: In Person or Virtually\n\n9 a.m.\nWednesday, July 26\nCampus Center Chambers at County Operations Center, Kearny Mesa\n5520 Overland Ave., 92123\n\nPublic Hearing #2: Virtual Only\n\n5:30 p.m.\nWednesday, July 26\n\nZoom details will be posted soon at sdvote.com under Voter’s Choice Act and on the Registrar’s Community Calendar.\nInterpretation services will be available during both sessions in American Sign Language, Spanish, Filipino, Vietnamese, Chinese, Arabic, Japanese, Korean, Laotian, Persian and Somali.\nImportant Dates\n\nJuly 12: The Registrar posted proposed updates to the Election Administration Plan at sdvote.com for a 14-day public review and comment period.\nJuly 26: In-person and virtual public hearings including the county’s disability, and state and federally covered language communities.\nJuly 26: The initial public review and comment period ends.\nAug. 9 – Aug. 23: The Registrar posts an amended Election Administration Plan for a second 14-day public review and comment period.\nSept. 6: The Registrar posts the final adopted plan and sends it to the California Secretary of State for approval.\n\nThe Election Administration Plan is reviewed every four years in the odd year prior to a scheduled election year. For more information about the Voter’s Choice Act, visit sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230714.14.54.57"}