{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Join Community Choice Energy Program", "description": "Residents in the unincorporated areas of the County will soon have a choice when it comes to buying electricity. The County Board of Supervisors voted Tuesday to authorize the County to join a community choice energy program (CCE) called San Diego Community Power.", "datePublished": "2021-08-31T17:44:58-07:00", "url": "https://www.countynewscenter.com/county-to-join-community-choice-energy-program/", "keywords": ["government", "cce", "community choice energy", "joint powers authority", "san diego community power", "san diego county board of supervisors", "supervisor nora vargas", "supervisor terra lawson-remer"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-08-31T17:44:58-07:00", "articleType": "article", "articleContent": "\nResidents in the unincorporated areas of the County will soon have a choice when it comes to buying electricity.\nThe County Board of Supervisors voted Tuesday to authorize the County to join a community choice energy program (CCE) called San Diego Community Power. The CCE launched in March and includes the cities of Chula Vista, Encinitas, Imperial Beach, La Mesa and San Diego.\nThe County will become part of a joint powers authority which governs the CCE. Supervisor Terra Lawson-Remer will represent the County and become a director on the JPA’s Board of Directors. Supervisor Nora Vargas will act as alternate director.\nCommunity choice allows cities and counties to buy electricity, including renewable energy like solar and wind for residents and businesses. CCEs offer customers in the county’s unincorporated areas an alternative to buying power from San Diego Gas and Electric. SDG&E would still provide transmission and delivery services, as well as billing.\nThe CCE could provide residents competitive utility rates and cost savings compared to SDG&E, and also offer more renewable power.\nCurrently, there are 24 CCEs operating throughout the state including two in San Diego County, San Diego Community Power and the Clean Energy Alliance. The Alliance  members include Carlsbad, Del Mar and Solana Beach. In all, the state’s CCEs serve 11 million customers.\nSan Diego Community Power is the second largest CCE in California and is expected to begin serving County customers in spring 2023.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210831.17.44.58"}