{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Holiday Shopping has Begun, Be Sure to Check Your Receipts!", "description": "You may have noticed. The holiday shopping season has begun! That means it is the perfect time to remind all you Santa Clauses out there—always double-check your receipts so you don’t get accidentally overcharged by faulty cash register price scanners.", "datePublished": "2022-11-10T08:42:38-08:00", "url": "https://www.countynewscenter.com/holiday-shopping-has-begun-be-sure-to-check-your-receipts/", "keywords": ["consumer", "agriculture", "awm", "holiday shopping", "protecting consumers", "weights and measures"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-11-10T09:29:03-08:00", "articleType": "article", "articleContent": "\nBlack Friday and Cyber Monday remain the traditional “start” of holiday shopping, but advertising campaigns have already begun, and retail associations say in-person, in-store shopping is on the rise.\nThat means it is the perfect time to remind all you Santa Clauses out there—always double-check your receipts so you don’t get accidentally overcharged by faulty cash register price scanners.\nIt can happen. If you’re not paying attention, you could end up paying more than you should. Every year, to make sure local consumers are being charged accurately, the County department of Agriculture, Weights and Measures inspects more than 1,400 local businesses and 30,000 price-scanning devices, scales that charge for items by weight, and other equipment that set prices.\nAnd even the best businesses have occasional overcharges.\nThis year, between January and October, just over one out of every six stores, 17.7%, that were inspected had overcharge errors. And the average overcharge was $1.51. An extra buck and a half may not sound alarming, but in the holiday shopping season, even tiny overcharges can add up to make big dents in your wallet or pocketbook.\nSo, be like Santa! Check your lists (receipts) and check them twice to make sure you have a merry holiday season. Here are some other tips to help you shop smartly and safely:\nProtect Against Overcharging:\n\nAlways verify receipts and immediately notify store management of any price discrepancies.\nStores are required to display the price of an item, as you are buying it, before the transaction is complete. Watch the display screen as your items are scanned.\nTake sales advertisements with you when shopping to verify prices.\nKnow that stores cannot legally charge more than their lowest advertised, posted or quoted price.\n\nShop Smart:\n\nPlan ahead. Start watching for store sale fliers, flea markets, garage sales, clearance sales, etc.\nMake a list of what you need.\nComparison shop with at least five different sources for the best values.\nDon’t buy everything at once. Establish a spending plan and timetable to buy what you need over several weeks or months to take full advantage of future sales and true bargains.\nDownload and use the County’s Tell Us Now app to contact Agriculture, Weights and Measures, or call AWM at 1-888-TRUE SCAN (1-888-878-3722) or email to sdcawm@sdcounty.ca.gov to report overcharges you can’t resolve with a store.\n\nFor more information, go to Agriculture, Weights and Measure’s Consumer Protection webpage and check out this video about the scanner inspection program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221110.08.42.38"}