{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is Last Day to Vote in Nov. 7 Special Election", "description": "Tuesday, Nov. 7 is the final day to cast your ballot in the Nov. 7 special election. Only the voters who live in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District or Rainbow Municipal Water District can vote in their respective elections.", "datePublished": "2023-11-06T10:17:47-08:00", "url": "https://www.countynewscenter.com/tuesday-is-last-day-to-vote-in-nov-7-special-election/", "keywords": ["elections", "chula vista city attorney election", "district 4 special runoff election", "fallbrook public utility district", "fourth district supervisorial election", "nov. 7 election", "nov. 7 special election", "rainbow municipal water district"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-11-06T10:17:47-08:00", "articleType": "article", "articleContent": "\nTuesday, Nov. 7 is the final day to cast your ballot in the Nov. 7 special election. Only the voters who live in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District or Rainbow Municipal Water District can vote in their respective elections.\nIf you’re not sure whether you live in one of the districts, you can look it up at sdvote.com.\nEligible voters can vote early from 8 a.m. to 5 p.m. Monday, Nov. 6 at any one of 12 vote centers or they can drop off their mail ballot at one of 48 official ballot drop boxes around the county.\nOn the final day of voting, Nov. 7, the Registrar’s office and a total of 22 vote centers will be open from 7 a.m. to 8 p.m. Any voter who is in line at a vote center or official ballot drop box location at 8 p.m. will be allowed to vote. However, no one can join the line after the 8 p.m. deadline.\nThe special runoff election for the Fourth Supervisorial District will fill the vacant seat for the remainder of the current term ending in January 2027.\nThe special election for the City of Chula Vista will fill the vacant seat for city attorney for the remainder of the current term ending in December 2026.\nVoters who live in the Fallbrook Public Utility District and Rainbow Municipal Water District will vote on a ballot measure.\nIf you’re not registered to vote and otherwise eligible to participate in the election, you may visit any vote center or the Registrar’s office to conditionally register and vote provisionally through Nov. 7.\nVote centers replace polling places and provide these services:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or measure on the ballot. Additionally, an individual may not circulate any petitions, including for initiatives, referenda, recall or candidate nominations.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com.\nOfficial ballot drop boxes or vote centers near you are listed inside your voter information pamphlet, or you can look it up online at sdvote.com. You can also contact the Registrar of Voters at (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231106.10.17.47"}