{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Success Story: County Man Finds Direction with RESPECT", "description": "Five years ago, San Marcos resident Antonio Ramirez says, he was a teenager who was struggling with school, authority, peer pressure, gang influences, and the tragic death of a friend; luckily, he found his direction in life with help from the San Diego Sheriff’s Department and a little RESPECT.", "datePublished": "2021-02-12T12:19:44-08:00", "url": "https://www.countynewscenter.com/success-story-county-man-finds-direction-with-respect/", "keywords": ["public safety", "living safely", "san diego sheriff s department"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-02-12T12:19:44-08:00", "articleType": "article", "articleContent": "\nFive years ago, San Marcos resident Antonio Ramirez says he was a teenager who was struggling with school, authority, peer pressure, gang influences, and the tragic death of a friend; luckily, he found his direction in life with help from the San Diego Sheriff’s Department and a little RESPECT.\nSponsored by the Sheriff’s Department, the RESPECT Project is a 10-week character-building and mentoring program for teenagers in the North County aimed at reducing juvenile delinquency, lowering recidivism, and offering alternatives to street gangs, substance abuse and a life trapped in the criminal justice system.\nToday, just four years after his initial involvement in the RESPECT Project, the future is looking very bright for Ramirez, who is a new father and works full time as a traffic control specialist for San Diego Gas & Electric.\n“The RESPECT Project is not like a school, they aren’t here to be your boss, they are here to be your mentors,” said Ramirez. “They are here to help out the community and they are going to teach you so many things. They show you other options and mentor you to make better decisions.”\nRamirez said some of the most valuable things he learned from the program were responsibility and communication, and how being able to communicate with others helps to open the door to opportunities you wouldn’t otherwise have. He also said the program changed his entire perspective about law enforcement.\n“I learned responsibility, and how to go out and talk to people, and those people had certain connections, and that led to getting more mentors,” said Ramirez. “No matter what you do, the deputies will help guide you to the right place.”\nAt the time he was an active participant in the RESPECT Project, Ramirez said the program was run out of the San Marcos Boys and Girls Club, which presented some logistical challenges as limited space also limited the types of services provided. He said there was always hope the program would eventually get a new home, and it most certainly did.\nThe collaborative success of the RESPECT Project in North County led to the program getting its own 7,000-square-foot building in 2020. Located at 151 East Carmel Street in San Marcos, the one-story building features an activity area, recording studio, kitchen, classrooms conference room for guest speakers and an outdoor gym.\n“Our ribbon-cutting ceremony was scheduled for December but was postponed indefinitely due to the pandemic,” said Deputy Dustin Nelson, who has been assigned full time to the RESPECT Project since December 2016. “We hope to serve between 10 to 30 students a day at our new campus and graduate an additional 30 to 45 students each year.”\nNelson, along with Deputy Todd Baker, are the founders and coordinators of the RESPECT Project that started back in 2014. Since that time, the program has grown to include additional deputies and volunteers from other county departments who help to mentor youth, serve as guest speakers and oversee field trips for both indoor and outdoor activities.\n“When we started this program, we felt compelled to help solve problems in our community; we saw a lot of ‘band-aids’ being placed on juvenile delinquency and crime issues and we seized the opportunity to do more,” said Nelson.  “Todd and I believe in the importance of community service because it forces us to think outside of ourselves and take notice of others and their needs.”\nRamirez said the opening of the new RESPECT Project campus is important so that other struggling teenagers can benefit from the program in the same manner he did.\n“They opened up a whole new world for me,” said Ramirez. “I appreciate those guys a lot and this new facility is going to help a lot of people just like me.”\nNelson said a total of 125 students have graduated from the program since it began in 2014, and that he also looks forward to when the new campus can be open for business.\n“These students need that relationship, they need activities,” said Nelson. “We want to get back to doing what we do which is giving these students the tools and helping them solve their issues. There is something here for everyone.”\nMore information on the RESPECT Project is available on the Sheriff Department’s official website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210212.12.19.44"}