{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Residents Give Input at County Community Budget Meeting", "description": "Members of the community had a chance to learn about the County’s recommended budget, ask questions and provide input during the first of two community budget meetings Tuesday.", "datePublished": "2023-05-16T17:23:30-07:00", "url": "https://www.countynewscenter.com/residents-give-input-at-county-community-budget-meeting/", "keywords": ["government", "2023-24 operational plan", "budget plan", "community budget meeting", "engage san diego county"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-05-16T17:23:30-07:00", "articleType": "article", "articleContent": "\nMembers of the community had a chance to learn about the County’s recommended budget, ask questions and provide input during the first of two community budget meetings Tuesday.\nThe combined virtual and in-person meeting took place at the County Operations Center.\nCommunity members learned what services the County provides to the overall region as well as what services are provided specifically to the unincorporated areas, things that a city would typically do like public safety and road and park maintenance.\nThe County’s budget covers:\n\nAdministering state programs like social services, health programs, foster care and adult protective services.\nRegional services such as adult and youth detention facilities, criminal prosecution, elections, tax assessment and collection and beach water monitoring, and food and restaurant inspections.\nMunicipal services in non-city communities like law enforcement, libraries, parks, roads and land use zoning.\n\nThe new recommended budget would maintain, improve and offer new services across the board.\nThe managers of the four departmental groups that run the County gave details in a presentation on their budget plans for Fiscal Year 2023-24. Afterward, community members took part in a question-and-answer session with the County’s finance experts, covering issues like behavioral health, homelessness, environmental justice and sustainability.\nA second community budget meeting will take place at 5:30 to 7 p.m. on Thursday, May 18 and will be virtual only. You can register at Engage San Diego County.\nTo learn more about the recommended budget, you can find an executive summary on the County’s budget portal.\nPublic hearings will get underway in June. The first one begins at 9 a.m. on Monday, June 12. An evening hearing takes place at 5:30 p.m. on Thursday, June 15.\nYou can watch, listen and participate during Board of Supervisors meetings or you can leave eComments on the budget until 5 p.m. on June 21.\nBudget deliberations and adoption are scheduled for June 27.\nFor details about the board meetings and to request translation services, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230516.17.23.30"}