{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Convenient, Secure, COVID-safe: Vote from Home", "description": "As mail ballots start showing up for 79th Assembly District voters, the Registrar of Voters is encouraging the residents to vote safer at home.", "datePublished": "2021-03-15T11:13:02-07:00", "url": "https://www.countynewscenter.com/convenient-secure-covid-safe-vote-from-home/", "keywords": ["elections", "2021 special primary election", "79th state assembly district special primary election", "april 6", "fgg", "vote at home", "voter safer san diego"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-03-15T11:13:02-07:00", "articleType": "article", "articleContent": "\nAs mail ballots start showing up for 79th Assembly District voters, the Registrar of Voters is encouraging the residents to vote safer at home.\nOver 300,000 mail ballots have been sent out for the district’s Special Primary Election.\nOnly those who live in the 79th District can vote in the April 6 election. The area encompasses southeastern San Diego, the cities of La Mesa and Lemon Grove, and parts of Chula Vista, Bonita, and National City. Not sure if you live in the 79th Assembly District? You can find out here.\nVoting by mail is:\n\nSIMPLE: A mail ballot, instructions and an “I Voted” sticker are included in your mail ballot packet.\nSAFER: Make voting decisions and mark your ballot comfortably at home.\nSECURE: Sign and date your envelope, seal your completed ballot inside and return it postage free to a trusted source:\nReturn your ballot through the mail. For a collection box or post office near you, visit the U.S. Postal Service website.\nStarting Monday, March 29, you can return it to one of many mail ballot drop-off locations around the district. Find the closest one to you by visiting the Registrar’s online locator tool.\nReturn it to the Registrar’s office where early voting is already underway from 8 a.m. to 5 p.m. Monday through Friday. If you plan to drop off your mail ballot there or vote in person, wear a face covering and maintain social distancing.\n\nVoters who return their mail ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nIf you haven’t received your mail ballot by March 16, call the Registrar’s office at (858) 565-5800.\nTo learn more about Vote Safer San Diego and voting in the 79th State Assembly District Special Election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210315.11.13.02"}