{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Child and Family Well-Being Department Hosts Town Hall on Keeping Families Together and Thriving", "description": "County of San Diego Child Welfare Services is transforming into the Child and Family Well-Being Department, expanding its focus to keeping families intact and thriving.", "datePublished": "2023-06-12T14:37:16-07:00", "url": "https://www.countynewscenter.com/child-and-family-well-being-department-hosts-town-hall-on-keeping-families-together-and-thriving/", "keywords": ["families", "child and family well-being", "child welfare", "town hall"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-06-12T14:37:16-07:00", "articleType": "article", "articleContent": "\nCounty of San Diego Child Welfare Services is transforming into the Child and Family Well-Being Department, expanding its focus to keeping families intact and thriving.\nThe public is invited to participate in a town hall on the topic this Saturday, June 17 at the Copley-Price Family YMCA, 4300 El Cajon Blvd from 10:30 a.m. to noon. People who would like to learn more or share their thoughts on how the County can better serve children and families can register to attend here.\n“This change comes as a natural progression in our continuous effort to pursue equity and the best outcomes for children and families,” said Kim Giardina, director of the Child and Family Well-Being Department. “We hope to hear from families across the county on how we can best support them years into the future.”\nThe change was adopted unanimously by the County of San Diego Board of Supervisors in February. The department will focus efforts and budget on child and family strengthening programs and community partnerships to provide a more holistic approach.\nThe new department includes the Office of Child and Family Strengthening, made up of First 5 San Diego and other prevention and strengthening services including the regional coordination of the local childcare system. It will also include the Office of Child Safety, which will continue to provide all services currently administered through Child Welfare Services. The Child and Family Strengthening Advisory Board will oversee the overarching organizational change and monitor the department’s work.\nThe new Child and Family Well-Being Department will begin this multi-year transition in July 2023. More information is available on the department’s website and in this article about its approval.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230612.14.37.16"}