{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Surpasses 1 Million COVID-19 Vaccinations", "description": "More than a million doses of the COVID-19 vaccines have been administered in the region, the County Health and Human Services Agency reported today.", "datePublished": "2021-03-05T18:12:00-08:00", "url": "https://www.countynewscenter.com/county-surpasses-1-million-covid-19-vaccinations/", "keywords": ["health", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-03-05T18:25:59-08:00", "articleType": "article", "articleContent": "\nMore than a million doses of the COVID-19 vaccines have been administered in the region, the County Health and Human Services Agency reported today.\nOf those vaccinated to date, more than 319,000, or nearly 12 percent of San Diegans 16 and older, are fully immunized. A total of 619,924 people, or 23.1 percent, have received at least one dose of the two-dose regimen.\n“We are making great progress in vaccinating San Diegans but it is too soon to let our guard down,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Herd immunity does not occur until at least 70 percent of the population 16 and older is fully vaccinated and we have a ways to go before we can get back to many of the things we miss.”\nThe region’s vaccination efforts are slowed by shortages in vaccine supply, forcing several vaccination sites across the region to pause.\nThe following sites will be paused through Monday: the Lemon Grove Community Center, the Central Region Immunization Clinic in Logan Heights, the Copley-Price YMCA in City Heights, the Martin Luther King Community Center in National City, the Border View YMCA in Otay Mesa and the Linda Rhoades Recreation Center in Vista. The North Coastal Live Well Center in Oceanside is closed but will open Monday for second doses. Additional information about the temporary closures of the vaccination sites can be accessed here.\nVaccination Progress:\n\nOf the 1.1 million COVID-19 vaccine doses delivered to the region, more than 1,026,000 have been logged as administered. Of those vaccinated to date, more than 319,000, or nearly 12 percent of San Diegans 16 and older, are fully immunized.\nOverall, more than 619,000 County residents have received at least one shot of two-dose vaccine. That’s 23.1 percent of those eligible.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit vaccinationsuperstationsd.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 10.8 cases per 100,000 residents (as of March 2) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 4.2%, placing the County in Tier 3 or the Orange Tier. While the testing positivity rate for the County qualifies it for Tier 3, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 6% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 9.\n\nCommunity Setting Outbreaks:\n\nFour new community outbreaks were confirmed March 4: two in daycare/preschool/childcare settings, one in a business setting and one in a preschool setting.\nIn the past seven days (Feb. 26 through March 4), 29 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n13,752 tests were reported to the County on March 4, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 3.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,628.\n\nCases, Hospitalizations and ICU Admissions:\n\n499 cases were reported to the County on March 4. The region’s total is now 262,360.\n13,224 or 5% of all cases have required hospitalization.\n1,606 or 0.6% of all cases and 12.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n12 new COVID-19 deaths were reported March 4. The region’s total is 3,371.\nFive women and seven men died between Jan. 29 and March 4.\nOf the 12 deaths reported March 4, five people who died were 80 years or older, one was in their 70s, four were in their 60s, one was in their 50s and one was in their 40s.\n10 had underlying medical conditions, one did not have any medical conditions and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210305.18.12.00"}