{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on Ramona Community Resource Center", "description": "A dream 23 years in the making is coming true in North County. Officials broke ground Thursday on a new community resource center for Ramona.", "datePublished": "2023-06-22T14:50:02-07:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-ramona-community-resource-center/", "keywords": ["health", "behavioral health services", "child welfare services", "groundbreaking", "public health", "ramona", "ramona community resource center", "ramona intergenerational community campus", "self sufficiency"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-06-22T14:50:02-07:00", "articleType": "article", "articleContent": "\nA dream 23 years in the making is coming true in North County.\nOfficials broke ground Thursday on a new community resource center for Ramona.\nThe $15 million facility will replace one that had been in operation for 35 years. The new Ramona Community Resource Center will serve as a one-stop shop for residents who need behavioral health, public health, child welfare and self-sufficiency services like CalFresh, Medi-Cal and CalWORKs.\nThe resource center will be built on the corner of 12th and Main Streets, next door to the Ramona Library and will serve 5,000 residents.\nThe new building will be the latest addition to the Ramona Intergenerational Community Campus. A new 100-unit senior affordable housing complex is expected to break ground on the campus in late 2025.\nThe concept for the resource center originated in 1999. The Board of Supervisors approved the purchase of land from Caltrans in 2017 and a design-build contract was awarded to Nielsen Construction last year.\nThe new facility is designed to reflect the community and its residents and includes public art.\nThe center will also be built to meet LEED Gold standards. LEED stands for Leadership in Energy and Environmental Design. And the building will be zero net energy meaning it will generate more energy from the solar panels on its roof than it consumes when measured over a year.\nThe center is expected to open its doors late next year.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230622.14.50.02"}