{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Budget Hearings Begin Monday", "description": "The County of San Diego’s $7.03 billion recommended budget for fiscal year 2021-22 will go before the Board of Supervisors starting at 9 a.m. on Monday, June 14.", "datePublished": "2021-06-10T08:55:54-07:00", "url": "https://www.countynewscenter.com/county-budget-hearings-begin-monday/", "keywords": ["government", "budget hearings", "covid safety measures", "e-comment", "evening hearing", "fiscal year 2021-22", "in-person", "in-person participation", "public hearings"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-06-10T08:55:54-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s $7.03 billion recommended budget for fiscal year 2021-22 will go before the Board of Supervisors starting at 9 a.m. on Monday, June 14. The budget will reflect residents’ needs and build a framework for the future that fundamentally changes operations.\nThe recommended budget plan is part of a two-year operational plan that will help determine how the County spends its resources. Budget information is also available through the online budget portal.\nFollowing Monday’s budget hearing, an evening hearing will take place at 5:30 p.m. on Wednesday, June 16. Budget deliberations and adoption are scheduled to start at 2 p.m., on Tuesday, June 29.\nThe public can attend and provide comments in person at the budget hearings, but limitations will remain in place to follow COVID-19 safety measures.\nPhysical distancing guidelines cap the number of public participants in the Board Chamber at a time to 22 people.\nOverflow rooms will be available, but due to limited capacity, the Clerk of the Board strongly urges the public to watch the meetings live online and make a request to speak via teleconference or submit a written eComment.\nThe online comments can be submitted until budget hearings close at 5 p.m. on Wednesday, June 23.\nAttend the Meeting in Person\nMembers of the public must follow the safety guidelines below to attend the Board meeting in person.\n\nEnter the County Administration Center from the south side (near the playground)\nUndergo a security screening, a temperature check and answer standard COVID-19 screening questions\nWear a face covering at all times except when speaking at the podium\nFollow physical distancing rules\nWait outside the building if the maximum capacity is reached inside the Board Chamber and overflow rooms until space becomes available\n\nWatch Online\nThere may be a 45-second or more delay when viewing the broadcast online, depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo Livestream\nYouTube\nFacebook\nTwitter\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nCurrently not available on AT&T U-Verse\n\nListen on the Phone\n\nA call-in line is also available to listen to the live Board meeting while it is in session at 619-531-4716. This is a listen-only line.\n\nComment\nMembers of the public can use the eComment service to submit comments on agenda and non-agenda items before and during the hearings.\nThose who want to participate in the meeting and speak via teleconference must fill out the online Board of Supervisors tele-comments form and submit it before the hearing starts. After submitting the form, you will receive instructions on how to call in to the meeting to provide your comments.\nLarge groups wishing to comment on a common item are encouraged to submit comments in writing or to identify one spokesperson to join the teleconference on behalf of the group.\nFor more information about the hearings, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210610.08.55.54"}