{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Wastewater Monitoring Piloted as Path to Safe School Reopening", "description": "The County of San Diego is working with the University of California San Diego on a pilot program that may provide a roadmap for schools to safely reopen while our community gets vaccinated.", "datePublished": "2021-02-11T10:50:29-08:00", "url": "https://www.countynewscenter.com/wastewater-monitoring-piloted-as-path-to-safe-school-reopening/", "keywords": [], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-02-11T10:50:29-08:00", "articleType": "video.other", "articleContent": "\nThe County of San Diego is working with the University of California San Diego on a pilot program that may provide a roadmap for schools to safely reopen while our community gets vaccinated.\nThe Safer at School Early Alert system, or “Sassy” as it is called by participants, is an evidence-based program to detect SARS-CoV-2 at schools and child care centers. The project began with technology launched as part of UC San Diego’s Return to Learn program which collects daily wastewater samples that are tested for shed coronavirus.\nFor the last four months, Safer at School Early Alert has been piloted in 10 schools and two child care centers within communities at highest risk for COVID-19 including San Ysidro, Chula Vista, El Cajon, Southeastern San Diego and Vista.\n“We know that through the pandemic, the educational gap has grown wider – often in our communities hardest hit by the pandemic,” said County Board of Supervisors Chair Nathan Fletcher. “In my discussions with UCSD researchers and my COVID-19 Scientific Advisory Group, it became clear that there were lower-cost alternatives to regular testing that would allow for some of those most impacted students to return to school safely. Through this pilot and funding through the federal CARES Act appropriated by the Board, we have been able to test out new testing options. It is my hope that we could scale up this program.”\nThrough daily wastewater and surface monitoring, the Safer at School Early Alert tests for the presence of particles of the coronavirus and is combined with a responsive testing strategy. The goal is to quickly identify children or staff members who are infected with COVID-19 before an outbreak occurs.\nThe three elements of the pilot are using a robot in a sewage outlet to collect daily wastewater samples that are tested at UC San Diego School of Medicine, daily swabbing of floors for virus particles that have settled and a no-cost PCR testing program. Child care sites also send used diapers to test fecal samples in children who are not yet potty-trained.\nA second step includes daily surface monitoring. Teachers or staff use a swab to sample a one-square-foot section of the center of the floor in a classroom, which is where aerosols tend to settle. These samples are tested daily at UC San Diego lab.\nTesting children and staff at each location is the third part of the detection program. Children and staff who voluntarily consent undergo free PCR COVID-19 testing at their school or child care center in response to a positive result from wastewater or surface monitoring.\n“The safe reopening of schools remains a priority for the County of San Diego,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “What UC San Diego has demonstrated with the Safer at School Early Alert pilot program models the types of steps that can help us ease back into classroom education while continuing to fight the virus.”\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210211.10.50.29"}