{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board Approves Workplace Justice Fund", "description": "Local victims of wage theft can turn to a County Workplace Justice Fund for help while trying to regain their lost wages.     ", "datePublished": "2023-05-23T18:19:06-07:00", "url": "https://www.countynewscenter.com/county-board-approves-workplace-justice-fund/", "keywords": ["government", "office of labor standards and enforcement", "olse", "wage theft", "workplace justice fund"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-05-24T08:31:39-07:00", "articleType": "article", "articleContent": "\nLocal victims of wage theft can turn to a County Workplace Justice Fund for help while trying to regain their lost wages.\nThe Board of Supervisors approved the introduction of an ordinance Tuesday which would put $100,000 into the new fund.\nBoard supervisors will meet on Tuesday, June 13, to consider and adopt the ordinance which will then formally establish the Workplace Justice Fund.\nPayments of $3,000 or $4,000 would help wage theft victims get by while waiting for their claims to make their way through the legal system or waiting for employers to pay the wage theft judgments against them.\nLocally, nearly 1,000 workers in the past six years have suffered from unpaid wages or wage theft judgments that were not paid out. Lost wages amount to nearly $13 million dollars.\nThe County’s Office of Labor Standards and Enforcement (OLSE) will administer and accept applications for the fund. OLSE will also give wage theft victims information on how they may qualify for CalFresh, CalWORKS, the County Libraries’ GED and Broadband Program, and many more services.\nOLSE continually educates businesses on compliance with labor standards laws through multiple Know-your-Rights campaigns and seminars, so businesses are aware and act in good faith.\nOLSE also acts as a regional resource for all San Diegans who have questions about workers’ rights and labor law compliance. The office offers information about a wide range of topics including sick leave, overtime, wages and more.\nFor more information, visit the OLSE website, call the OLSE advice line at 619-985-1597 or email OLSE@sdcounty.ca.gov.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230523.18.19.06"}