{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Days Left for Clear the Shelters Special Deal", "description": "A once stray, terrified, shy and skinny black pit bull mix dog found her personality in a County Animal Services foster care placement and now has a new family who love and treasure her. Rita, now 2 years old, has her forever family.", "datePublished": "2024-09-06T12:17:47-07:00", "url": "https://www.countynewscenter.com/days-left-for-clear-the-shelters-special-deal/", "keywords": ["animals", "adopt pets", "clear the shelters", "das", "pet foster"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-09-06T13:51:28-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA once stray, terrified, shy and skinny black pit bull mix dog found her personality in a County Animal Services foster care placement and now has a new family who loves and treasures her. Rita, now 2 years old, has her forever family.\nShe is enjoying car rides with her new “sisters,” playing at the dog run, has lots of new toys and even borrows cute hair bows from her humans.\nRita’s story is a shining example of why foster care is so important for shelter animals. Some animals just shrink away and become stressed out in a shelter environment but thrive when placed in a home with a loving person.\nWhen Rita’s now forever family saw her picture online, they asked to meet her. At that meeting they fell in love with her personality and adopted her that day.\nBut if she had never gone into foster care, she might not have presented herself as well.\nThis is Scooby A1929788 and he’s available for adoption at the South Shelter.\nWith only days left until the Clear the Shelters campaign ends on Sept. 10, County Animal Services is reminding would-be forever families that there are lots of beautiful dogs like Rita, along with cats, rabbits, pigs and other animals waiting for their happily ever after.The County’s Bonita and Carlsbad shelters are waiving adoption fees on all animals, and they have been doing that since Aug. 10 to give the pets their best chance to find homes.\n \nThis handsome guy Hipster A1913226 is available at the North Shelter.\n \nBrowse the County shelters’ online animal listings on the Adoptions page, you may find a new love or two to bring into your family.  Due to the popularity of this adoption special, Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already adopted.\nNot everyone is in a position where adoption is an option, but everyone can help. . Learn about our fostering program.\n \nThis is Tonka A1926164 and he is available at the North Shelter.\nAdoption fees are always waived for senior adopters, senior pets and pets that have been waiting for their forever home for 30 days or more.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240906.12.17.47"}