{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board Ratifies Valley Fire Emergency Proclamation", "description": "The County Board of Supervisors voted unanimously Wednesday to ratify the County’s local emergency proclamation issued Sept. 6 for the Valley Fire due to the fire threat and damage, including the loss of at least 20 structures.", "datePublished": "2020-09-09T17:50:49-07:00", "url": "https://www.countynewscenter.com/county-board-ratifies-valley-fire-emergency-proclamation/", "keywords": ["public safety", "emergency", "emergency proclamation", "valley fire"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-09-09T22:23:10-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted unanimously Wednesday to ratify the County’s local emergency proclamation issued Sept. 6 for the Valley Fire due to the fire threat and damage, including the loss of at least 20 structures.\nThe proclamation will cover damage in the unincorporated area and will help make the region eligible for potential federal and state resources. These resources could help repair roadways, public infrastructure and cover emergency response costs.\nGovernor Gavin Newsom proclaimed a state of emergency on Sept. 3 for a number of fires burning in the state including the Valley Fire in San Diego County. In doing so, it opens up additional resources to assist in fighting the fire and recovery efforts.\nThe Valley Fire started just after 4 p.m. on Saturday, Sept. 5 off Japatul Road and Carveacre Road, southeast of Alpine. As of Wednesday at 6:45 p.m., CAL FIRE reported the fire was 17,665 acres and 27 percent contained.  Damage inspections are ongoing but to date, 20 structures have been confirmed to be destroyed.\nSan Diego County Deputy Chief Administrative Officer Holly Porter said a swift and well-resourced response from CAL FIRE held the fire within the containment lines during a forecasted wind event Tuesday and prevented further destruction.\nSan Diego County Supervisor Dianne Jacob commented that the fire could have been much worse if not for CAL FIRE and “phenomenal” aerial support. She noted however that the area was not yet out of the woods because it is not fully contained.\nThe County of San Diego added information at its SDCountyRecovery.com site and has established a Recovery Hotline at (859) 715-2200 and an email to help those affected by the Valley Fire. The hotline and emails will be answered from 8 a.m. to 5 p.m. weekdays and through the upcoming weekend.\nFor more up to date information, visit SDCountyEmergency.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200909.17.50.49"}