{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "District Four Special Primary Election Results – When to Expect Them", "description": "Counting ballots takes time, even for a special election like the Fourth Supervisorial District Special Primary Election. So, what can you expect on election night? The first set of unofficial election night results will come in shortly after 8 p.m.", "datePublished": "2023-08-15T08:30:43-07:00", "url": "https://www.countynewscenter.com/district-four-special-primary-election-results-when-to-expect-them/", "keywords": ["elections", "d4 special primary election", "election results", "fgg", "registrar of voters", "supervisorial district 4"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-08-15T16:37:32-07:00", "articleType": "article", "articleContent": "\nCounting ballots takes time, even for a special election like the Fourth Supervisorial District Special Primary Election.\nSo, what can you expect on election night?\nThe first set of unofficial election night results will come in shortly after 8 p.m. This update will include mail ballots received before Election Day and vote center ballots from early voting between Aug. 5 – Aug. 14.\nAfter the first unofficial report, election night updates will only include vote center ballots cast on Election Day.\nThe Election Day ballots come in after the vote centers close at 8 p.m. There will be a gap in time for the next set of results due to poll workers packing up supplies and driving in from the vote centers.\nUpon arrival to the Registrar’s office, the vote center ballots will be scanned, and results will be periodically updated until all of the vote center ballots have been counted.\nYou can check for the latest results on election night by visiting sdvote.com or follow the Registrar’s office on Twitter.\nThe final unofficial election night results may not come in until 10 p.m. or later and will only cover the ballots that could be counted immediately. The counting of ballots does not end election night.\nWhat’s left to count?\nMail ballots. The Registrar’s office mailed nearly 400,000 ballots for this election and a portion of those were dropped off at vote centers, official ballot drop boxes or picked up by the U.S. Postal Service on Election Day. Mail ballots sent right before or on Aug. 15 have seven days to arrive if postmarked by Election Day.\nThen there are provisional ballots. People who missed the July 31 registration deadline may conditionally register and vote provisionally in person up to and on Election Day.\nOnce their voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the district, the voter registration becomes active and the provisional ballot is counted.\nAfter election night, the next release of unofficial results is scheduled to be posted by 5 p.m. on Aug. 17. Additional updates will occur at the discretion of the Registrar of Voters.\nHowever, the results must be certified by Sept. 14. For this special election, certification may occur on an earlier date. All updates will be posted on sdvote.com with the final certified results posted by Sept. 14.\nFor more information, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230815.08.30.43"}