{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Building Career Success for Foster Youth", "description": "The County of San Diego and partners have launched a new program to guide foster youth through higher education opportunities and career development. The $5 million program is called Career Pathways for Foster Youth.", "datePublished": "2023-09-05T16:49:24-07:00", "url": "https://www.countynewscenter.com/building-career-success-for-foster-youth/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-09-05T16:49:24-07:00", "articleType": "video.other", "articleContent": "\nThe County of San Diego and partners have launched a new program to guide foster youth through higher education opportunities and career development. The $5 million program is called Career Pathways for Foster Youth.\nBoard of Supervisors Chairwoman Nora Vargas, along with the San Diego Workforce Partnership and other community partner organizations, delivered the news this morning outside of the Partnership’s Imperial Avenue training center.\nYoung adults in foster care face disproportionate levels of unemployment and homelessness as adults.\nAt 21 years of age, almost half of the youth who were in foster care are unemployed. Of those who are employed, 70 percent live below the federal poverty level.\nThese challenges are especially evident in youth of color, who are overrepresented in foster care and far more likely to face barriers to success and wellbeing as they become young adults.\nCareer Pathways for Foster Youth will provide young people in the foster system equitable access to services, providing them a clearer path to success.\nFor current and former foster youth, this means receiving hands-on, individual employment services to support vocational/career interests, skills, and talents as they transition out of the foster care system and into adulthood.\nFor more information or to apply for the program, visit San Diego Workforce Partnership.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230905.16.49.24"}