{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Urged to Not Go to Emergency Departments for COVID-19 Testing", "description": "County health officials are urging San Diegans not to go to local emergency departments for COVID-19 testing.", "datePublished": "2022-01-05T18:11:11-08:00", "url": "https://www.countynewscenter.com/san-diegans-urged-to-not-go-to-emergency-departments-for-covid-19-testing/", "keywords": ["health", "coronavirus", "covid testing", "covid-19", "emergency departments", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-01-05T18:12:37-08:00", "articleType": "article", "articleContent": "\nCounty health officials are urging San Diegans not to go to local emergency departments for COVID-19 testing.\nLocal hospitals are experiencing an increase in COVID-19 hospitalizations, as well as staff shortages due to the coronavirus and are preserving their resources for patients who are seriously ill.\nThe County recommends that people worried about COVID-19 infection and others seeking COVID-19 testing only go to a hospital to be tested if they have severe symptoms.\n“Do not go to an emergency department just to get tested, and only go when you have symptoms that need emergency care,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “If you’re experiencing no COVID-19 symptoms, have mild illness or have not been exposed to someone who tested positive, go to one of the many testing locations available in the region.”\nThe region’s healthcare providers offer testing to members who meet each systems’ criteria. Many neighborhood pharmacies offer same day testing as do other locations on this list. The County, which has about 10 percent of the region’s testing capacity, has a network of no-cost testing public sites that are both walk-up and can take appointments.\nTogether, all testing sites have the capacity to perform about 45,000 tests daily. Rapid antigen tests, which are available at many local pharmacies, are a good option if a testing site is unavailable. Those who test positive on a rapid should follow the healthcare guidance and generally do not need a confirmatory PCR test unless instructed by a doctor.\n“Currently, there is a high demand for COVID-19 testing so we’re asking San Diegans to be patient as testing traffic can surge and sites can be very busy,” Kaiser said.\nAvoid Fake COVID-19 Testing Sites\nThe County is also warning San Diegans about potential scams from “pop up” sites that are offering “free” COVID-19 testing.\nAll legitimate COVID-19 testing sites should be able to show you their medical credentials upon request. They should also be able to tell you what laboratory test is being used, where the test is being run and how the results will be reported.\nA testing site could be fake if:\n\nThey ask for social security numbers or other non-medical information\nMaterials do not have a logo\nSite is on a sidewalk and not affiliated with a medical provider\n\n“San Diegans should be wary as some pop-up sites could be personal information scams. If you have doubts, go to a County or community pharmacy COVID-19 testing site,” Kaiser said.\nCOVID-19 Vaccines Widely Available\nAlso, the region has plenty of COVID-19 vaccines and booster doses, which remain the best long-term protection against COVID-19 hospitalizations and deaths.\nThere are more than 400 vaccination sites that include pharmacies, medical providers, clinics and County locations; the region has the capacity to meet demand. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nDoses administered: Over 6.26 million.\nReceived at least one shot: Nearly 2.79 million or 88.6% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.47 million or 78.5 %.\nBoosters administered: 820,766.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n34 new deaths were reported since the last report on Dec. 29, 2021. The region’s total is 4,495.\n17 women and 17 men died between Aug. 31, 2021 and Jan. 2, 2022.\n17 were age 80 or older, six were in their 70s, seven were in their 60s, two were in their 50s, one was in their 40s and one was in their 30s.\n11 of the people who died were fully vaccinated and 23 were not fully vaccinated.\n33 had underlying medical conditions and one had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n8,204 COVID-19 cases were reported to the County on Jan. 4, 2022. The region’s total is now 465,607.\n45,017 cases reported in the past week (Dec. 29, 2021 through Jan. 4, 2022) compared to 16,657 cases identified the previous week (Dec. 22 through Dec. 28)\nDuring the 30-day period between Nov. 23 to Dec. 22, there were 488 COVID-19 hospitalizations; 340 people were not fully vaccinated and 148 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 27.6 overall, 18.1 for fully vaccinated people and 45.8 for not fully vaccinated San Diegans.\n24,730 tests were reported to the County on Jan. 4, 2022, and the percentage of new positive cases was 33.2%.\nThe 14-day rolling percentage of positive cases among tests is 18.1%.\n\nCommunity Setting Outbreaks:\n\n45 new community outbreaks were confirmed in the past seven days (Dec. 29, 2021 through Jan. 4, 2022): 11 in business settings, eight in TK-12 grade school settings, six in government settings, four in retail settings, four in emergency services settings, three in restaurant/bar settings, two in restaurant settings, two in college/university settings, two in childcare/preschool/childcare settings, one in a hotel/resort/spa setting, one in a distribution warehouse setting and one in a community-based organization setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220105.18.11.11"}