{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Disaster Loans Available for Small Businesses Economically Impacted by the Pipeline Oil Spill", "description": "The U.S. Small Business Administration is offering low-interest federal disaster loans to small businesses that were economically impacted by the pipeline oil spill which began Oct. 2. A virtual business recovery center opens Oct. 28 for help in determining eligibility.", "datePublished": "2021-10-28T15:43:43-07:00", "url": "https://www.countynewscenter.com/disaster-loans-available-for-small-businesses-economically-impacted-by-the-pipeline-oil-spill/", "keywords": ["public safety", "emergency", "sba"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-10-28T15:56:24-07:00", "articleType": "article", "articleContent": "\nThe U.S. Small Business Administration is offering low-interest federal disaster loans to small businesses that were economically impacted by the pipeline oil spill which began Oct. 2. A virtual business recovery center opens Oct. 28 for help in determining eligibility.\nThe SBA acted under its own authority to declare a disaster in response to a request from the Governor’s Office of Emergency Services, SBA’s Administrator Isabella Casillas Guzman said.\nThe disaster declaration makes SBA assistance available in Los Angeles, Orange, Riverside, San Bernardino and San Diego counties. The deadline to apply for economic injury is July 27, 2022.\n“Small nonfarm businesses, small agricultural cooperatives, small businesses engaged in aquaculture and most private nonprofit organizations of any size may qualify for Economic Injury Disaster Loans of up to $2 million to help meet financial obligations and operating expenses which could have been met had the disaster not occurred,” said Tanya Garfield, director of SBA’s Disaster Field Operations Center-West.\n“These loans may be used to pay fixed debts, payroll, accounts payable and other bills that can’t be paid because of the disaster’s impact. Disaster loans can provide vital economic assistance to small businesses to help overcome the temporary loss of revenue they are experiencing,” she added.\nEligibility is based on the financial impact of the disaster only and not on any actual property damage. These loans have an interest rate of 2.855 percent for small businesses and 2 percent for private nonprofit organizations with terms up to 30 years and are restricted to small businesses without the financial ability to offset the adverse impact without hardship.\n“SBA’s mission-driven team stands ready to help California small businesses impacted by the pipeline oil spill,” said Administrator Guzman. “We’re committed to providing federal disaster loans swiftly and efficiently, with a customer-centric approach to help businesses and communities recover and rebuild.”\nIn consideration of the public health concerns due to the Coronavirus pandemic, SBA has established a Virtual Business Recovery Center to answer questions about SBA’s disaster loan program, explain the application process and help individuals complete their electronic loan application.\nApplicants may apply online, receive additional disaster assistance information, and download applications at https://disasterloanassistance.sba.gov/. Applicants may also call SBA’s Customer Service Center at (800) 659-2955 or email disastercustomerservice@sba.gov for more information on SBA disaster assistance. Individuals who are deaf or hard‑of‑hearing may call (800) 877-8339. Completed applications should be mailed to U.S. Small Business Administration, Processing and Disbursement Center, 14925 Kingsport Road, Fort Worth, TX  76155.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211028.15.43.43"}