{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Nine Animals Impounded from Julian Animal Wellness Center", "description": "County Animal Services and San Diego Sheriff’s deputies served a search warrant Friday at Urban Feline, a holistic animal wellness center in Julian, and impounded nine animals in need of immediate veterinary attention.", "datePublished": "2025-05-09T15:56:08-07:00", "url": "https://www.countynewscenter.com/nine-animals-impounded-from-julian-animal-wellness-center/", "keywords": ["animals", "animal cruelty", "county animal services", "das"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-05-09T15:56:08-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty Animal Services and San Diego Sheriff’s deputies served a search warrant Friday at Urban Feline, a holistic animal wellness center in Julian, and impounded nine animals in need of immediate veterinary attention.\nAnimal Services obtained a search warrant for the property after an earlier investigation of alleged neglectful treatment of a dog, said Vaughn Maurice, director of County Animal Services. The business owner, Andres Zepeda, was advised by an animal control officers at the time of the original investigation to seek veterinary care for the dog and was given time to do so, he said.\nWhile animal control officers did not find the dog from the original investigation at Urban Feline, they found five cats and four dogs that required immediate veterinary attention and transported the nine pets to a veterinarian for evaluation and care.\nThe Department of Animal Services promotes the humane and responsible care of pets by providing the unincorporated areas of San Diego County with 24-hour animal rescues; helping those who can no longer care for their pets; investigating and stopping animal cruelty or neglect; enforcing state and local laws related to animals as needed; and educating the public about responsible care which includes animal welfare, restraint, and licensing benefits.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250509.15.56.08"}