{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Starts Short-Term Lodging for Jan. 22 Flood Victims", "description": "The County of San Diego has begun providing people displaced from their homes by the Jan. 22 flooding with up to 30-days of temporary lodging.", "datePublished": "2024-02-12T11:39:23-08:00", "url": "https://www.countynewscenter.com/county-starts-short-term-lodging-for-jan-22-flood-victims/", "keywords": ["public safety", "disaster recovery", "flood recovery", "flood response", "flood victims", "housing"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-02-12T14:07:04-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County of San Diego has begun providing people displaced from their homes by the Jan. 22 flooding with up to 30-days of temporary lodging.\nThe first people transitioning are in two categories: Those already placed into short-term hotel rooms where supporting funding is now running out and those who have not been in hotels and may now need temporary lodging due to the Jan. 22 flood.\nWork on these first placements started over the weekend and will continue through the week. It is being done in partnership with several nonprofit organizations who had been sheltering some of the displaced.\nThe County earlier identified many of those in need of lodging through a survey or their in-person visit to one of the Local Assistance Centers. Follow up contacts will continue through the week to understand their current needs.\nPeople who were displaced by the Jan. 22 flooding and have not filled out the survey or visited a Local Assistance Center can call 2-1-1 to apply for the emergency lodging. These new applications will be accepted through Feb. 23.\nWhen people submit a new application by calling 2-1-1, an operator will ask for information such as the location of their flooded home, pets, household size and medical needs that require accommodations. That information will be submitted by 2-1-1 to the County.\nDue to the expected initial workload, there is no option to check on an application. Everyone who applies will be contacted, even if they were determined to be ineligible.\nThe County expects this program will provide temporary lodging for hundreds of households. No precise estimate is available.\nIt is anticipated some people identified earlier will have found accommodations on their own and others will be new to the program.\nFunding is from a $10 million flood relief program unanimously approved Jan. 30, 2024, by the San Diego County Board of Supervisors. The program was designed to follow State and Federal emergency response guidelines.\nFor more information about the flood response, visit https://www.alertsandiego.org/\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240212.11.39.23"}