{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Wild Bat Found Inside Safari Park Tests Positive for Rabies ", "description": "County public health officials are looking for people who may have come in contact with a bat found at the San Diego Zoo Safari Park on Monday, Sept. 23 at 2:15 p.m. that later tested positive for rabies. The wild bat was not one that is on habitat at the Safari Park.", "datePublished": "2024-09-28T10:02:51-07:00", "url": "https://www.countynewscenter.com/wild-bat-found-inside-safari-park-tests-positive-for-rabies/", "keywords": ["health", "county public health", "rabies", "san diego zoo safari park", "wild bat"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-09-28T10:02:51-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty public health officials are looking for people who may have come in contact with a bat found at the San Diego Zoo Safari Park on Monday, Sept. 23 at 2:15 p.m. that later tested positive for rabies.   \nThe wild bat was not one that is on habitat at the Safari Park. Park visitors who had no physical contact with the bat are not at risk for rabies.\nA Safari Park team member saw a bat fall from a roof and land in an employee only section of the Africa Tram loading area, which is not accessible by the public.   \nA trained team member collected the bat safely. It was transported to a local rehabilitation facility, where it later died and was submitted it to the County for rabies testing. The County Public Health Laboratory confirmed the bat was infected with rabies.  \nIf you or someone in your family or group were in the area of the Africa Tram on Sept. 23 and had direct contact with a bat before 2:15 PM, you are urged to contact County Public Health Services as soon as possible at (619) 692-8499. \n“Human rabies is usually fatal without prompt post-exposure vaccine and treatment,” said Dr. Ankita Kadakia, County interim public health officer. “Rabies transmission can happen from a bat bite or if a bat’s saliva comes in contact with a cut or abrasion, or with mucous membranes, such as the eyes, nose or mouth.”  \nThe County has detected five rabid bats in 2024 throughout the San Diego region. Although bats can carry rabies, they are also an important part of nature. There are many species of bats found in San Diego County which feed on insects such as mosquitos. Other bat species feed on nectar from plants and pollinate them in the process. You may see bats occasionally around sunset when they are most active. \nIt is important to appreciate wildlife from a safe distance and not touch them. If you do come in direct contact with a bat, wash the affected area thoroughly with soap and water and get medical advice immediately. \nRabies is a preventable viral disease that is most often transmitted through the bite of a rabid animal.  \nSymptoms of rabies in people can take weeks to months to develop after being exposed to a rabid animal.  Once symptoms develop, rabies is almost always fatal. However, prompt post-exposure treatment following exposure to the virus will prevent the disease. \nFind more information about bats and rabies on the County’s website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240928.10.02.51"}