{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, Tri-City to Build Psychiatric Facility in Oceanside", "description": "The Board of Supervisors today voted to enter into an agreement with Tri-City Healthcare District to build a psychiatric health facility in Oceanside.", "datePublished": "2020-01-14T13:39:55-08:00", "url": "https://www.countynewscenter.com/county-tri-city-to-build-psychiatric-facility-in-oceanside/", "keywords": ["health", "behavioral health", "mental health facility", "oceanside", "tri-city"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-14T13:52:27-08:00", "articleType": "article", "articleContent": "\nThe Board of Supervisors today voted to enter into an agreement with Tri-City Healthcare District to build a psychiatric health facility in Oceanside.\nThe County will contribute $17.4 million to build the 16-bed facility, which will be located on vacant land at the Tri-City Medical Center in Oceanside. Tri-City will operate the hospital.\nIn 2018, Tri-City Healthcare District closed its Behavioral Health Unit, which provided adult inpatient psychiatric services, and its Crisis Stabilization Unit.\nSince then, meeting the urgent and emergent behavioral health needs of North San Diego County became increasingly challenging.\n“Getting Tri-City Health into the behavioral health business has been a top priority,” said Supervisor Jim Desmond, whose district includes the hospital. “The biggest winners are the residents of San Diego County, residents and families who count on and rely on the needed behavioral health services.”\nLast summer, the supervisors directed the County’s Chief Administrative Officer to negotiate with Tri-City, or other local hospitals, an agreement to provide funding to assist in constructing a psychiatric health facility in Oceanside.\nThe County will lease the property on which the psychiatric health facility will be built, construct the building, and then sublease the building to Tri-City.\nDuring the term of the sublease, the operating agreement will govern what psychiatric services Tri-City will provide at the facility and how the County will compensate Tri-City for those services. Additionally, Tri-City will repay the County 50% of the construction costs over time through a combination of lease agreements and services.\nImproving Local Behavioral Health Care Services\nThe new psychiatric facility could take up to three years to open. It will complement the County’s ongoing work to review the full continuum of local behavioral health care services and engage in regional collaboration to strengthen the services, transforming them from crisis to chronic care.\nOne of the first steps is to make sure that people with psychiatric needs have access to services that are in the area where they live and are interwoven with their sources of social and family support. The second is to make sure that most behavioral health systems of care are interconnected so that they are seamless and sustained.\nThe efforts align with the County’s Live Well San Diego vision for a region where all residents have the opportunity to improve their health, live safely and thrive.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200114.13.39.55"}