{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens Local Assistance Center for Valley Fire", "description": "County Supervisor Dianne Jacob and officials announced the County is opening a Local Assistance Center to help residents affected by the  Valley Fire, starting at 10 a.m. Saturday, Sept. 12, at the County Library’s Rancho San Diego branch in El Cajon.", "datePublished": "2020-09-10T12:30:05-07:00", "url": "https://www.countynewscenter.com/county-opens-local-assistance-center-for-valley-fire/", "keywords": ["public safety", "recovery", "valley fire"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-09-10T14:12:35-07:00", "articleType": "article", "articleContent": "\nCounty Supervisor Dianne Jacob and officials announced the County is opening a Local Assistance Center to help residents affected by the  Valley Fire, starting at 10 a.m. Saturday, Sept. 12, at the County Library’s Rancho San Diego branch at 11555 Via Rancho San Diego in El Cajon.\nThe Local Assistance Center is designed to make it as easy as possible for residents to start the recovery process by giving them one place to receive help and information from numerous agencies. The center is initially scheduled to operate from 10 a.m. to 6 p.m. on Saturday and Sunday, and from 11 a.m. to 7 p.m. Monday.\nThe Local Assistance Center will comply with public health orders for the coronavirus, including physical distancing and facial coverings.\nSome of the services County departments will provide include: information about people’s homes, properties and permits; emergency temporary occupancy and power permits; general guidance about rebuilding; housing assistance; connection to crisis counseling; CalFresh (food stamp) cards; vital records; help for older adults and people with disabilities; health screenings and first aid.\nThe County’s Live Well San Diego mobile unit will also be parked outside to help residents. Other agencies that will also provide help and information include the Department of Motor Vehicles, the American Red Cross; the California Department of Insurance; the State Contractor’s Licensing Board; San Diego Gas & Electric; and the California Franchise Tax Board.\nThe County previously established a Recovery Hotline, (858) 715-2200, and a Recovery email, ValleyFireRecovery@sdcounty.ca.gov, in English and Spanish.\nThe hotline will be staffed from 8 a.m. to 5 p.m. weekdays and through the upcoming weekend.  The Recovery email will also be answered between 8 a.m. and 5 p.m. weekdays and through the upcoming weekend. Messages and emails that come in after hours will be responded to the following business day.\nFor the latest emergency updates in English and Spanish, visit www.sdcountyemergency.com, and download the SD Emergency app.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200910.12.30.05"}