{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Design Work on County Southeastern Live Well Center Resumes", "description": "The County of San Diego, along with PCL Construction Services, Inc. and architects Steinberg Hart, are revising the Southeastern Live Well Center project.", "datePublished": "2020-11-24T09:07:19-08:00", "url": "https://www.countynewscenter.com/design-work-on-county-southeastern-live-well-center-resumes/", "keywords": ["health", "live well center", "southeastern live well center"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-24T09:18:18-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego, along with PCL Construction Services, Inc. and architects Steinberg Hart, are revising the Southeastern Live Well Center project.\nThe new design retains the full array of community services while reducing the amount of space for back-office staff who are now expected to telework.\n“The COVID-19 pandemic has showed us that many employees can effectively work from home and prefer that arrangement,” said Supervisor Greg Cox, chairman of the Board of Supervisors. “This redesign acknowledges that trend without reducing services to the public.”\nThe size of the public and client areas in the 65,000-square-foot Southeastern Live Well Center will remain the same as in the earlier 80,000-square-foot design.\n“My priority has been to push for services at the new facility that reflect the needs and wants of the neighborhood,” said Supervisor Nathan Fletcher. “I’m committed to ensuring the project retains those resources and to adding even more between now and opening day.”\nBecause County employees who do not interface with clients will now primarily work from home, this new office model shrinks the workspace and support area requirements originally anticipated. The County has tasked PCL Construction and Steinberg Hart to make the necessary changes without impacting the overall design concept.\nUnchanged will be the site layout with its public plaza and entrance near the intersection of Euclid Avenue and Market Street, the exterior façade design with its welcoming public entrance, and the public lobby with its grand stair soaked in daylight from the second story skylights.\nAlso unchanged are plans for a 4,000 square-foot Conference Center and installation of public art. Other Community amenities will include the Meditation and Wellness Garden, connection of Chollas Creek Trail to Market Street, and a coffee cart at the public plaza near Market Street and Euclid Avenue.\n\nTraffic studies for the Southeastern Live Well Center project were conducted during the planning of the project. As a result, street improvements will include medians on Euclid Avenue from Highway 94 to Imperial Avenue and a traffic signal on Market at the entrance of the west driveway for the Malcom X Library. The project also will provide Fair Share contributions for future traffic improvements on Market Street’s intersections with 47th Street and Euclid Avenue.\nThe Tubman Chavez Community Center is providing an essential service as a COVID testing site for the Southeastern Community. Prior to start of construction there will a new location in the community for COVID testing.\nInformation about the new Southeastern Live Well Center, its design and opportunities for public comment are available on a dedicated Live Well San Diego website.\nServices Available at the Center\nThe Southeastern Live Well Center is expected to break ground in summer of 2021 and open in the summer of 2023. The County’s contract with PCL for this center includes a commitment for local hiring and subcontracting participation from the project’s four local Zip codes; 92102, 92113, 92114 and 92139. The contract requires $6 million of participation from those areas.\nAs part of this endeavor PCL Construction and Steinberg Hart also are reaching out to subcontractors, including local subcontractors, to assist in design re-development and re-budgeting efforts for the 65,000 square-foot building.\nServices that will be available include medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities and military and veterans’ services. The Southeastern Live Well Center also will include space for community meetings in the 4,000-square-foot conference center.\nLive Well Centers are operating in National City, Chula Vista, Escondido, and the recently remodeled Lemon Grove location. A new Live Well Center is also under construction in Oceanside.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201124.09.07.19"}