{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Shelters Waiving Adult Dog and Cat Adoption Fees through July", "description": "Don’t “paws,” come meet our “pawsome” adult dogs and “purrfect” cats. Fall in love with one or two and help them make their “furever” homes with you. Adult dog and cat adoption fees are being sponsored.", "datePublished": "2024-07-11T15:02:50-07:00", "url": "https://www.countynewscenter.com/county-shelters-waiving-adult-dog-and-cat-adoption-fees-through-july/", "keywords": ["animals", "adopt pets", "pet adoption", "pet special adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-07-11T15:40:47-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDon’t “paws,” come meet our “pawsome” adult dogs and “purrfect” cats. Fall in love with one or two and help them make their “furever” homes with you. Adult dog and cat adoption fees are being sponsored.\nThe County Department of Animal Services is participating in the Bissell Pet Foundation’s “Empty the Shelters” national adoption event that began July 8 and continues through the end of the month.\n“We are thrilled to introduce our community to the hundreds of wonderfully deserving adult cats and dogs at our Bonita and Carlsbad shelters. Our staff is eager to assist in finding the perfect match for each family,” said Suzy Clayton, Animal Services intake coordinator. “Adult pets are ideal for both first-time and experienced owners – whether you’re looking for a home office companion or an outdoor playmate, we have the perfect pet for you.”\nDue to the nationwide shelter overcrowding crisis, Bissell’s Empty the Shelters helps homeless pets find families by making adoption affordable for prospective pet owners. The Bissell-sponsored national adoption events are held quarterly.\n“BISSELL Pet Foundation’s Summer National Empty the Shelters event is a crucial opportunity for people to make a real difference in their community through adoption. Every single adoption saves a life and creates space to save another,” said Cathy Bissell, founder of BISSELL Pet Foundation. “Please adopt and give a pet a chance it might otherwise not have. If you can’t adopt, fostering saves lives when shelters are full. Deserving pets across the country are counting on all of us.”\nFind your new best friend by browsing the County shelters’ online animal listings. You will find loveable cats, dogs, a dove, bunnies, a tortoise, a guinea pig, fowl and pigs available on the Adoptions page. Due to the popularity of this adoption special, Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already adopted. If you cannot adopt, there are other ways to help. Learn about our fostering program.\nAdoption fees are always waived for senior adopters, senior pets and pets that have been waiting for their forever home for 30 days or more.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240711.15.02.50"}