{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Polling Places Open Tomorrow in 79th Assembly District Election", "description": "Tomorrow is the last day to cast your ballot in the 79th State Assembly District Special Election. The Registrar’s office and your assigned polling place will be open from 7 a.m. to 8 p.m. on Election Day, April 6.", "datePublished": "2021-04-05T08:15:33-07:00", "url": "https://www.countynewscenter.com/polling-places-open-tomorrow-in-79th-assembly-district-election/", "keywords": ["elections", "79th assembly district", "79th state assembly district special primary election", "april 6", "election", "mail ballot", "mail ballot drop-off locations", "polls open", "vote safer san diego"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-04-02T15:06:58-07:00", "articleType": "article", "articleContent": "\nTomorrow is the last day to cast your ballot in the 79th State Assembly District Special Election. The Registrar’s office and your assigned polling place will be open from 7 a.m. to 8 p.m. on Election Day, April 6.\nOnly those who live in the 79th Assembly District can vote in the election. The area encompasses southeastern San Diego, the cities of La Mesa and Lemon Grove, and parts of Chula Vista, Bonita, and National City. Not sure if you live in the 79th Assembly District? You can find out here.\nTo vote in person, be prepared.\n\nGo to your assigned polling place. The location is listed in your mail ballot packet or you can find it online.\nWear your face mask and maintain social distance. If you forget your mask, poll workers will give you one. Voters who are unable or unwilling to wear a facial covering or mask will be assisted outside at a social distance and will be able to vote outside.\nFollow all instructions provided by poll workers.\n\nThis election, all in-person voters will mark their ballot on a ballot marking device. This device does not store, tabulate or count any votes. After the voter confirms their selection on the device, the voter will print their ballot, can review it, and place it in the ballot box to be counted at the Registrar’s office election night.\nThe Registrar of Voters is adhering to the County’s public health orders and has put in place protocols to ensure the health and safety of election workers, voters and observers at the Registrar’s office, polling places and mail ballot drop-off locations. This includes:\n\nHand sanitizer when entering and exiting the facility\nMasks and gloves\nPlexiglass barriers and floor markers to ensure social distancing\nA defined path of travel throughout the facility\nRegular cleaning/disinfecting of frequently touched objects and surfaces\nPoll workers wearing gloves, masks and in some cases, face shields\nPoll workers undergoing a temperature screening before their shift\n\nCampaigning or electioneering within 100 feet of a polling place or mail ballot drop-off location is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate on the ballot.\nDo you still need to return your mail ballot? There is still time. Be sure to sign and date your return envelope, seal your completed ballot inside and return it to a mail ballot drop-off location, a polling place, or the Registrar’s office. If you are dropping off your mail ballot it must be received by 8 p.m.\nTo learn more about Vote Safer San Diego and voting in the 79th State Assembly District Special Election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210405.08.15.33"}