{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Urged to Vaccinate Despite Milder Flu Season", "description": "Influenza cases continued to decrease last week, though County health officials still recommend people get their flu shot for best protection.", "datePublished": "2022-01-19T11:07:47-08:00", "url": "https://www.countynewscenter.com/san-diegans-urged-to-vaccinate-despite-milder-flu-season/", "keywords": ["health", "flu", "flu vaccinations", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-01-20T15:20:59-08:00", "articleType": "article", "articleContent": "\nInfluenza cases continued to decrease last week, though County health officials still recommend people get their flu shot for best protection.\nAccording to the latest data from the County Health and Human Services Agency’s Epidemiology and Immunization Services branch , 43 lab-confirmed influenza cases were reported the week ending Jan. 15. 2022. That’s 36 fewer cases compared to the previous week. In comparison, 53 flu infections were reported during the same week last season.\n“Once again, it appears that some of the same measures San Diegans are taking to prevent getting COVID-19 are also helping to slow down the spread of influenza,” said Wilma J. Wooten, M.D., M.P.H., County public health officer.\nWhile the percentage of people at local emergency departments with influenza-like illness also decreased from 8% to 6% last week, influenza is still circulating in the region and San Diegans should continue getting vaccinated against the flu.\n“It’s not too late to get a flu shot. When people are vaccinated, they are less likely to develop serious illness and require going to hospitals, which are currently under extreme pressure due to COVID-19,” Wooten said.\nThe latest Influenza Watch report from the County Health and Human Services Agency shows the following for the week ending Jan. 15, 2022:\n\nEmergency department visits for influenza-like illness: 6% of all visits (compared with 8% the previous week)\nLab-confirmed influenza cases for the week: 43 (compared to 79 the previous week)\nTotal lab-confirmed cases to date: 1,304 (compared to 642 at the same time last season and a 5,079 prior 5-year average during the same week)\nInfluenza-related deaths reported to date: 1 (compared to 0 at the same time last year)\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe flu vaccine is especially important for people at higher risk of having serious complications from the virus.\nThey include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers, if unable to wash hands\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nDuring the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths. During the 2019-2020 flu season, a total of 108 San Diegans died from influenza and more than 20,700 flu cases were reported.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220119.11.07.47"}