{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Home Order Issued as Region’s ICU Capacity Drops Below 15%", "description": "The Southern California intensive care unit (ICU) bed capacity has dropped below 15%, and the state will require San Diego County to implement a Regional Stay Home Order that prohibits gatherings of any size and closes operations in multiple sectors, including restaurants, bars, wineries and personal services.", "datePublished": "2020-12-05T16:33:14-08:00", "url": "https://www.countynewscenter.com/stay-home-order-issued-as-regions-icu-capacity-drops-below-15/", "keywords": ["health", "coronavirus", "covid-19", "stay at home order"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-07T09:21:37-08:00", "articleType": "article", "articleContent": "\nThe Southern California intensive care unit (ICU) bed capacity has dropped below 15%, and the state will require San Diego County to implement a Regional Stay Home Order that prohibits gatherings of any size and closes operations in multiple sectors, including restaurants, bars, wineries and personal services.\nThe current ICU capacity for the Southern California region, which includes San Diego and 10 other counties, is now 12.5%. The order will go into effect Monday and will last for at least three weeks or until the region’s ICU capacity meets or exceeds 15%. The order will be assessed by the state on a weekly basis after the three-week period.\n“Lives are at stake, so this action is necessary,” said Eric McDonald, M.D., M.P.H., medical director of Epidemiology and Immunization Services at the County Health and Human Services Agency. “We must restrict our activities and avoid contact with others to reduce transmissions of COVID-19.”\nAmong restrictions that go beyond the current Purple Tier that already apply to San Diego:\n\nNo gatherings of any size.\nRestaurants open for takeout, delivery or drive-thru only. No on-site dining.\nIndoor operations limited to 20%.\nHotels and lodging. Open only for critical infrastructure support.\n\nThe following will be closed from operating in any form, indoors or outdoors:\n\nIndoor or outdoor playgrounds\nHair salons and barbershops\nPersonal care services, including nail salons\nMuseums, zoos and aquariums\nMovie theaters\nWineries\nCardrooms and satellite wagering\nOvernight stays at campgrounds\n\nEssential businesses such as supermarkets, grocery stores, laundromats and pharmacies will remain open.\nParks, beaches and hiking and bike trails remain open. Other outdoor activities are also permitted but a face mask and social distancing is required.\nRecord Number of COVID-19 Cases Reported\nA total of 2,287 COVID-19 confirmed cases were reported Dec. 4, surpassing the record 2,039 cases reported the previous day. The region’s total is now 90,468.\n“These high numbers are likely the result of the cooler weather and increased social interactions, particularly during the Thanksgiving holiday,” McDonald said. “We’re seeing new daily cases reported in the 2,000s. We cannot let this trend become the new normal.”\nMcDonald urged San Diegans with COVID-19 symptoms and those who traveled or attended Thanksgiving gatherings to get tested immediately to prevent from spreading the virus to others.\nThe County operates more than 50 testing sites throughout the region. All COVID-19 tests are free and most of the sites do not require an appointment.\nFor more information on testing, visit 211sandiego.org or call 2-1-1.\nCommunity Setting Outbreaks:\n\n15 new community outbreaks were confirmed on Dec. 4: six in business settings, three in daycare/preschool/childcare settings, one in a restaurant/bar setting, one in a fitness/gym setting, one in a hotel/resort/spa, one in a government setting, one in a health care setting and one in a distribution warehouse setting.\nIn the past seven days (Nov. 28 through Dec. 4), 92 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n24,159 tests were reported to the County on Dec. 4, and the percentage of new laboratory-confirmed cases was 9%.\nThe 14-day rolling average percentage of positive cases is 7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 20,299.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n4,836 or 5.3% of all cases have required hospitalization.\n1,065 or 1.2% of all cases and 22% of hospitalized cases had to be admitted to an intensive care unit.\nA COVID-19 case rate map shows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nEight new deaths were reported to the County on Dec. 4. The region’s total is now 1,055.\nSix men and one woman died between Nov. 16 and Dec. 4, and their ages ranged from early 50s to early 90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201205.16.33.14"}