{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Recognizing the Signs of Elder Abuse", "description": "On this World Elder Abuse Awareness Day, the County of San Diego Aging & Independence Services is asking San Diegans to be on the lookout for signs of elder abuse.", "datePublished": "2022-06-15T14:00:02-07:00", "url": "https://www.countynewscenter.com/recognizing-the-signs-of-elder-abuse/", "keywords": ["health", "elder abuse", "elder abuse awareness day"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-06-15T15:47:29-07:00", "articleType": "article", "articleContent": "\nOn this World Elder Abuse Awareness Day, the County of San Diego Aging & Independence Services is asking San Diegans to be on the lookout for signs of elder abuse.\nElder abuse can take many shapes and forms, including physical abuse, neglect, financial abuse, abandonment, isolation, abduction, or other poor treatment that results in harm, pain, or mental suffering to an adult 60 years of age or older.\nEach year, an estimated 1 in 10 older Americans become victims of elder abuse, neglect, or exploitation.\nYou can help by reporting suspected elder abuse or concerns about self-neglect. Make an anonymous report by calling the County’s Adult Protective Services (APS) at (800) 339-4661.\nLocal elder abuse report numbers have increased in recent years as the large percentage of Baby Boomers who live in the region reach their retirement years. Almost 23 percent of the County’s population is projected to be over age 65 by the year 2050.\nDue to the large number of older residents, APS is receiving more requests for elder abuse investigations than ever before.\nAdditional Resources\nIn addition to responding to allegations of abuse and neglect, the County is proactively working to reduce the likelihood of abuse by addressing risk factors, including social isolation, and building community support.\nOne of the tools used to address risk factors is the Aging Roadmap, the region’s comprehensive plan for services to make the county a better place for residents as they age.\nThe plan includes alternative transportation options, opportunities for social engagement, training older adults to use technology, and providing additional supports to caregivers, such as respite care, to help manage burnout.\nAPS also has a specialized program called the Alzheimer’s Response Team, which helps older adults with dementia access support services when they are in crisis so that they are less likely to end up in the emergency department or in law enforcement custody. Originally created as a pilot project in East County, the initiative was recently expanded to serve all areas of the county.\nFor more information on Adult Protective Services and elder abuse resources, visit the APS website. You can also get general information about programs and services for older adults and caregivers on the Aging & Independence Services website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220615.14.00.02"}