{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Vaccination Transitioning to Public Health Sites", "description": "Due to a significant drop in demand for COVID-19 vaccines, the County is phasing out some of its vaccination sites, but the push to vaccinate San Diegans continues.", "datePublished": "2021-06-25T13:55:45-07:00", "url": "https://www.countynewscenter.com/county-covid-19-vaccination-transitioning-to-public-health-sites/", "keywords": ["health", "clinics closing", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-06-25T16:31:55-07:00", "articleType": "article", "articleContent": "\nDue to a significant drop in demand for COVID-19 vaccines, the County is phasing out some of its vaccination sites, but the push to vaccinate San Diegans continues.\nSome County vaccination sites have closed or will be closing at the end of this month; however, people who have not been vaccinated still have plenty of options to do so.\n“As expected, demand for COVID-19 vaccines has waned significantly,” said Wilma Wooten, M.D., M.P.H., County public health officer. “While we have to phase out some vaccination clinics, San Diegans still have plenty of places to get vaccinated to protect themselves and others. Throughout the pandemic, the County has focused on equity and has been reaching out to communities and populations that have vaccine hesitancy.”\nThe County has reached the federal goal to vaccinate 70% of San Diego County residents 12 and older, or 1,961807 people, with at least one dose.\nOverall, more than 2.16 million San Diegans have received at least one COVID-19 vaccine and more than 1.83 million are fully vaccinated.\nSan Diegans are encouraged to continue getting vaccinated to prevent getting and passing the COVID-19 virus to others.\nVaccinations continue to be available at more than 400 locations, including doctors’ offices, retail pharmacies and County clinics throughout the region. Some vaccination sites will continue to offer extended hours to make it easier for San Diegans to get immunized.\n“The more people who get vaccinated, the better chance we have at ending this pandemic locally,” Wooten added.\nIn addition to existing COVID-19 vaccination clinics, County partners like local municipalities, Champions for Health, UC San Diego Health, San Diego American Indian Health Center and the San Diego Black Nurses Association will be handling requests for mobile vaccination events. Organizations wishing to host a vaccination event can submit a request.\nNo-cost COVID-19 testing sites remain operational around the County. For a complete list of County testing and vaccination locations and more vaccine information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210625.13.55.45"}