{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Youth Get a Say in Influencing Positive Changes", "description": "This week ten young women from the Youth Transition Campus sat down with local law enforcement officers to expand their understanding and learn from each other’s experiences and perspectives, all with the goal of  improving how officers do their jobs.", "datePublished": "2025-03-21T17:50:15-07:00", "url": "https://www.countynewscenter.com/probation-youth-get-a-say-in-influencing-positive-changes/", "keywords": ["public safety", "county probation", "thank"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-03-21T17:54:54-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThis week ten young women from the Youth Transition Campus sat down with local law enforcement officers to expand their understanding and learn from each other’s experiences and perspectives, all with the goal of improving how officers do their jobs.\nThrough thoughtful discussion with local law enforcement, the Probation youth shared opinions and helped shape solutions on serious topics such as racial profiling, abuse of power, lack of trust, not knowing one’s rights, and the challenges of completing probation.\nThe goal of the dialogue was to change perceptions and behaviors of both law enforcement and detained youth with the goal of achieving more positive outcomes. The three-hour interactive training was put on by Game Changers, a community organization that uses a national “pre-de-escalation” training model rooted in behavioral psychology.  The program creates opportunities for empathy and understanding between officers and the youth currently involved in the justice system.\nGame Changers partnered with the Point Loma Nazarene University’s criminal justice program and the event was hosted Wednesday at San Diego County’s Youth Transition Campus for the first time.\nThe discussion took place between five San Diego probation officers, a San Diego Sheriff’s captain, and two La Mesa police officers with 10 detained juvenile girls and five Point Loma Nazarene University criminal justice majors.\nCalifornia law enforcement officers who participate can earn continuing education units from the state for their involvement in the discussions.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250321.17.50.15"}