{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Takes New Steps to Address Homelessness in Unincorporated Area", "description": "The County Board of Supervisors today voted to adopt several measures, including sheltering options and expanded outreach teams, to deal with homelessness in unincorporated communities.", "datePublished": "2020-01-28T15:13:29-08:00", "url": "https://www.countynewscenter.com/board-takes-new-steps-to-address-homelessness-in-unincorporated-area/", "keywords": ["housing", "hart", "homelessness", "unincorporated areas"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-28T15:49:22-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today voted to adopt several measures, including sheltering options and expanded outreach teams, to deal with homelessness in unincorporated communities.\nThe measures, brought forward by Supervisors Dianne Jacob and Jim Desmond, are expected to help with homelessness in unincorporated areas that have seen a significant increase of people who don’t have a place to live. Recent encampments at Lamar Park, Spring Valley Park and in other outlying areas are the latest reminders that homelessness is a regional crisis.\n“Like in the city of San Diego and the rest of California, homelessness has become a huge concern in the suburban and rural parts of our region,” said District 2 Supervisor Dianne Jacob, whose represents East County. “Today’s board vote opens the door to creating a comprehensive approach to homelessness that includes immediate and long-range measures.”\nThe unincorporated communities of San Diego County have experienced a significant increase in homelessness and its associated impacts in recent years.\nA 2019 ruling out of the U.S. Court of Appeals for the Ninth Circuit determined that municipal ordinances prohibiting sleeping or camping on public property could not be enforced by law enforcement without the provision of access to an alternative shelter location.\nThe new measures call for the expansion of the pool of funding and the eligibility for the County’s hotel/motel voucher program for up to 125 additional people above the current contract, with an estimated cost of about $2.3 million in fiscal year 2019-20, depending on how many people use the program. The yearly costs are estimated to be $5.6 million, however, the need for this level of service is not expected to be ongoing once other recommendations are implemented.\n“The value of human life must always be a foremost concern when developing sound public policy,” said District 5 Supervisor Jim Desmond. “Additionally, there is also a value to the quality of life that residents and business owners face daily interacting with homelessness. Taxpayers demand accountability and compassion alone is not helpful. Programs must be effective and accountable.”\nIn addition, county staff will be looking for properties to lease, license or purchase for safe and temporary emergency relocation options or a shelter, and where health services may be provided. They will also be searching for properties for temporary storage for personal belongings in Spring Valley and/or Lakeside.\nThe Board directed the review and proposal of County regulations to strengthen the way they address sleeping in public areas such as parks and public right of way and obstruction of public spaces including parks, sidewalks, road right of ways and commercial loading docks, environmentally sensitive lands with endangered habitats, areas near watersheds and areas that present extreme fire danger.\nSupervisors also voted to add four deputies and equipment to the Sheriff’s Department Homeless Assistance Resource Team (HART). The team is part of an intensive outreach the County recently piloted involving the Health and Human Services Agency,  Department of Public Works and Department of Parks and Recreation to connect people who are homeless in these communities with services and potential housing. Many have serious, chronic needs and it’s important to break the cycle of homelessness, addiction, medical emergencies and incarceration.\nThe video below shows a Homeless Assistance Resource Team during one of its outreach events in Spring Valley. It recounts the day’s individual encounters and efforts to get unsheltered people connected with services.\n\nFinally, the County will be exploring the feasibility of expanding the Homeless Court program to include warrant removals for people who are homeless in exchange for participation in a transitional living program.\nThe County has multiple programs in place to connect people experiencing homelessness to services they need and to help them find a home. Over the past few years, the County has made significant investments in outreach, treatment, and housing services. The County has greatly expanded critical services since the beginning of the Affordable Care Act. During fiscal year 2019-20, the County will be spending $712.9 million on mental health and substance use treatment programs and services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200128.15.13.29"}