{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands Tree Planting Program in Unincorporated Communities", "description": "County Supervisors voted this week to expand its robust tree planting program in underserved communities in the unincorporated area.", "datePublished": "2024-03-01T13:13:43-08:00", "url": "https://www.countynewscenter.com/county-expands-tree-planting-program-in-unincorporated-communities/", "keywords": ["parks and rec", "climate action plan", "county parks and recreation", "equitable communities", "tree planting"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-03-04T12:20:37-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIn Summary: \n• County expands tree planting program. \n• Goal is to reduce greenhouse gas emissions. \n• Since 2016, the County has planted over 35,000 trees.\nCounty Supervisors voted this week to expand its robust tree planting program in underserved communities in the unincorporated area.\nThe Board’s actions allow the County to award contracts estimated at $2 million to buy about 4,000 trees through different vendors. In addition to buying trees, the funds will be used to remove dead or diseased trees, install watering systems and needed equipment. The trees will be planted between Spring and Winter 2024.\nOn Aug. 31, 2022, the Board approved the development of an Equity-Driven Tree Planting Program. The program focuses on identifying priority locations for tree planting in underserved areas.\nThe County surpassed its goal of planting 10,000 trees in the 2023 calendar year, adding 11,010 to parks and facilities across the region, including:\n\n5,744 new trees planted at County parks and facilities.\n1,637 trees planted through non-government organizational partnerships.\n3,629 trees planted by incorporated cities.\n\nSince 2016, the County has planted over 35,000 trees in County parks to help reduce greenhouse gas emissions. Plants and trees extract the greenhouse gas carbon dioxide from the air and use it to grow through photosynthesis. Several large volunteer events contributed to the County tree plantings. They included:\n\nHundreds of students from St. Augustine High School planted trees at County parks during “Giving Tuesday.”\nStaff at 14 County parks hosted planting events during “Green Friday,” an annual stewardship.\nThe County delivered 2,000 Coast Live Oaks to a storage area at Mt. Woodson where they are being staged for planting.\nThe Sheriff’s Department’s Reentry Services Community Involved Vocational Incarcerated Crew Services Program has planted over 2,500 oak trees at County parks in the past five years.\n\nThe County’s Parks and Recreation Tree Planting Program is part of the County’s Climate Action Plan. The overall goal of the plan is to reduce greenhouse gas emissions.\nThe County plants a variety of healthy native and climate-ready trees that adapt to changing temperatures. These types of trees also help to prevent tree infestation by pests. More trees help clean the air, provide shade, and cool air temperatures in the surrounding environment.\nThe U.S. Forest Service estimates that California has lost more than 147 million trees since 2010. The County estimated 20 trees per acre were lost over 50,000 acres of County open space.\nThe County has a tree plotter to help staff track tree inventory and plantings regionwide. You can also take an active role in building a greener tomorrow by reporting trees you plant on your own. Visit our Tree Plotter web page to get started.\nWatch: How to Properly Plant a Tree by County of San Diego Parks and Recreation:\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240301.13.13.43"}