{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting Saturday, 39 Vote Centers Open for March  Presidential Primary Election", "description": "You don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at 39 vote centers starting Saturday, Feb. 24. The centers are located around the county and will be open daily from 8 a.m. to 5 p.m.", "datePublished": "2024-02-23T10:42:14-08:00", "url": "https://www.countynewscenter.com/starting-saturday-39-vote-centers-open-for-march-presidential-primary-election/", "keywords": ["elections", "county registrar of voters", "fgg", "march 5 presidential primary", "vote centers open"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-23T10:42:14-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesYou don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at 39 vote centers starting Saturday, Feb. 24. The centers are located around the county and will be open daily from 8 a.m. to 5 p.m.\nOn Saturday, March 2, an additional 179 vote centers will open for a total of 218. The locations will be open daily from 8 a.m. to 5 p.m. through March 4. On the final day of voting, March 5, all vote centers and official ballot drop boxes will be open from 7 a.m. to 8 p.m.\nYou can visit any vote center in the county. Find a location near you at sdvote.com.\nVote centers replace polling places and provide more services. You can:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selections on ballot marking devices. When finished, the voter will print out the official ballot, review it and hand it to a poll worker to insert it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or measure on the ballot. Additionally, an individual may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nDon’t delay! If you have been holding onto your ballot, act now. You also have the option to vote from the comfort of your home. Sign and date your return envelope, seal your completed ballot inside and return it by mail promptly to make sure it arrives at the Registrar’s office before March 5.\nAnother option allows you to drop off your ballot at one of the Registrar’s 146 official ballot drop boxes. The secure stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.” Find one close to you through the Registrar’s online locator tool, your voter information pamphlet or online at sdvote.com. Check each location’s hours of operation before heading out at sdvote.com.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nIf you plan to vote for president, the Registrar urges voters to review each political party’s rules.\nLearn more about voting in the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240223.10.42.14"}