{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Southeastern Live Well Center Celebrates Formal Grand Opening", "description": "Elected leaders, County officials and community members formally opened the Southeastern Live Well Center with a ribbon-cutting ceremony Wednesday.", "datePublished": "2023-09-20T15:10:26-07:00", "url": "https://www.countynewscenter.com/southeastern-live-well-center-celebrates-formal-grand-opening/", "keywords": ["health", "community input", "hhsa", "public art", "ribbon-cutting ceremony", "southeastern live well center"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-09-20T16:26:40-07:00", "articleType": "article", "articleContent": "\nElected leaders, County officials and community members formally opened the Southeastern Live Well Center with a ribbon-cutting ceremony Wednesday.\nThe two-story, 65,000 square-foot building and adjacent four-level parking structure anchors the corner of Market Street and Euclid Ave. The site covers nearly five acres.\nThe event celebrated the opening but also marked a new era. The center was built for the community but more importantly, by the community.\nResidents had a say in the design, color, look, layout and the public art. They requested and received certain amenities. Local businesses and workers helped build the project. And the area’s history and culture were incorporated into the center.\nThe community was brought in at the beginning of the $79 million project. Residents could join one of four advisory committees, attend more than 30 community outreach events, take tours of another Live Well center and keep up to date on project details through a website.\nIn the end, the center reflects the community’s wants and needs, and offers County health and social services for a wide range of people in the area.\nThe services include medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services.\nInput from residents led to a wellness and meditation garden, a 4,000 square-foot conference center that can be used for community meeting space, an outdoor area for a coffee cart, dedicated workspace for community organizations, a shared elected official office for meetings with the community, a play area for children in the Family Resource Center waiting area and a walking path along Chollas Creek.\nResidents asked for a community cultural display marking the site’s history. A display titled the Tubman Chavez Story is featured inside the building.  And they wanted local art representing the area’s history and culture. Fifty pieces of artwork from 33 artists now grace the premises.\nThe building itself was built to LEED Gold standards which stands for Leadership in Energy and Environmental Design. Solar panels on the roof and parking structure will produce more energy than the building consumes over the course of a year making the facilities Zero Net Energy. EV chargers are available for both the public and County vehicles.\nThe Live Well Center is now the sixth community service hub in San Diego County. Others Live Well centers are in National City, Chula Vista, Escondido, Lemon Grove and Oceanside.\nThe Southeastern Live Well Center will hold a community open house next month. Residents are invited to attend from 11 a.m. to 3 p.m. on Saturday, Oct. 14. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230920.15.10.26"}