{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County and Local Partners Launch Parks After Dark Program", "description": "The County of San Diego is teaming up with the City of San Diego, San Diego Parks Foundation and other local partners to launch a new program that will transform three area parks into safe, family friendly, nighttime entertainment spaces throughout the summer.", "datePublished": "2022-07-12T16:30:20-07:00", "url": "https://www.countynewscenter.com/county-and-local-partners-launch-parks-after-dark-program/", "keywords": ["health", "parks after dark"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-07-13T09:37:32-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is teaming up with the City of San Diego, San Diego Parks Foundation and other local partners to launch a new program that will transform three area parks into safe, family friendly, nighttime entertainment spaces throughout the summer.\nThe Parks After Dark events will feature live entertainment, activities for all ages, games and free meals for kids. The program will be offered from 6 to 9 p.m. on Thursday, Friday and Saturday nights at the City Heights, Linda Vista, and Skyline Hills Recreation Centers.\n“The County of San Diego is pleased to help support Parks After Dark that provides a wide range of enjoyable, supervised activities and safe services to our neighborhood children and adults,” said Chair Nathan Fletcher, San Diego County Board of Supervisors. “The County is supporting programs that improve youth mental health – and being able to enjoy our parks is one way to do that.”\nParks After Dark is modeled after similar programs in the area, including a number of County initiatives. These programs are credited with reducing crime and creating a sense of community and safe places to gather and play on summer nights.\nSince 2007, the County has conducted nighttime park activities such as sunset hikes, full-moon hikes, star parties, campfire programs, summer movies and concerts. It also has an ongoing partnership with the Parks Foundation under the ‘Get Kids Outside’ initiative which has offered a series of free or low-cost events in over 20 recreation and aquatic centers across South and Central San Diego.\n“Parks After Dark programming provides an opportunity for children, teens, grandparents and entire families to get together outdoors and enjoy fun, safe, community-based activities right in their own neighborhoods,” said Nick Macchione, director of the County Health and Human Services Agency. “The County is proud to support this initiative because we know that communities are stronger and healthier when people can safely get together outdoors, be active, connect with friends and neighbors and enjoy quality family time.”\nSan Diego’s Parks After Dark program kicks off this week and runs through Aug. 27. For more information, visit https://comeplaysd.com/programs/\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220712.16.30.20"}