{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Public Health Officer: Pandemic Not Over, Continue Precautions", "description": "As people prepare to celebrate the holiday weekend, County health officials are reminding the public to continue taking precautions to avoid getting and transmitting COVID-19.", "datePublished": "2021-05-28T15:51:20-07:00", "url": "https://www.countynewscenter.com/public-health-officer-pandemic-not-over-continue-precautions/", "keywords": ["health", "coronavirus", "covid-19", "drawing", "memorial day", "prizes", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-05-28T15:51:20-07:00", "articleType": "article", "articleContent": "\nAs people prepare to celebrate the holiday weekend, County health officials are reminding the public to continue taking precautions to avoid getting and transmitting COVID-19.\nWhile the number of local COVID-19 cases has significantly decreased in recent weeks, not enough San Diegans have been vaccinated for the region to achieve herd immunity.\n“The pandemic is not over. We must continue taking precautions to protect San Diegans who can’t or won’t get vaccinated,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People who have not been vaccinated should be wearing a mask, keeping their distance and avoiding large gatherings.”\nPrizes for Getting Vaccinated\nSan Diegans who get vaccinated against COVID-19 will be able to participate in the state’s drawing to distribute $116.5 million in prizes.  The state will be including all the names in the San Diego Immunization Registry in its drawing.\nTwo million Californians who have not gotten vaccinated will be eligible to get a $50 gift card if they get vaccinated by June 15. The $100 million in gift cards will be distributed when they are fully vaccinated.\nThe names of people who are fully vaccinated will be entered into a drawing on June 4 and June 11. Fifteen people will each win $50,000 on each date. That’s $1.5 million.\nAnd on June 15, the state will draw 10 winners who will each receive $1.5 million for a total of $15 million.\nVisit the state’s Vax for the Win for complete details.\nEmily Cao, 15, braces for her COVID-19 vaccination from registered nurse Mark Stell.\nVaccination Progress:\n\nDoses delivered: Nearly 4.1 million.\nDoses administered: Over 3.63 million.\nReceived at least one shot: Almost 1.93 million or 68.8% of San Diegans 12 and older.\nFully vaccinated: Nearly 1.51 million or 53.8%.\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people.\nTo date, 91.8% of the goal population has received at least one vaccine and 71.8% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 2.4 cases per 100,000 residents, placing the County in the Orange Tier.\nThe testing positivity percentage is 1.5% and the County is in the Yellow Tier.\nThe health equity metric is 1.8%, placing the County in the Yellow Tier.\nWhile two of the three metrics qualify the County for the Yellow Tier, the state assigns counties to the more restrictive tier, in this case the Orange Tier.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, June 1.\n\nCommunity Setting Outbreaks:\n\nTwo new community outbreaks were confirmed May 27 in college/university settings.\nIn the past seven days (May 21 through May 27), 7 community outbreaks were confirmed.\nThe community outbreaks trigger is seven or more in seven days.\n\nTesting:\n\n12,644 tests were reported to the County on May 27, and the percentage of new positive cases was 0.7%.\nThe 14-day rolling average percentage of positive cases is 0.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 10,343.\n\nCases, Hospitalizations and ICU Admissions:\n\n83 COVID-19 cases were reported to the County on May 27. The region’s total is now 280,042.\n15,397 or 5.5% of all cases have required hospitalization.\n1,704 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new deaths were reported on May 27, 2021. The region’s total is 3,756.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210528.15.51.20"}