{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Get in on the Ground Floor, Help Shape County’s Housing Blueprint", "description": "County officials want San Diegans to help turn a house―or rather, the County’s draft housing blueprint―into a “home” by filling it with their opinions and advice.", "datePublished": "2023-03-14T10:39:09-07:00", "url": "https://www.countynewscenter.com/get-in-on-the-ground-floor-help-shape-countys-housing-blueprint/", "keywords": ["housing", "affordable housing", "engage san diego county", "housing", "housing blueprint"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-03-14T10:39:09-07:00", "articleType": "article", "articleContent": "\nCounty officials want San Diegans to help turn a house―or rather, the County’s draft housing blueprint―into a “home” by filling it with their opinions and advice.\nSan Diegans can take a survey on the County’s Engage San Diego County webpage to help shape the County’s housing blueprint.\nThe blueprint’s overarching goals were adopted from the San Diego Association of Government’s Housing Acceleration Program Strategy. They aim to curb the region’s housing crisis by finding ways to build more housing and more housing around transit hubs; build and retain affordable housing; reduce housing prices overall; and help people afford to stay in their existing homes.\nCounty supervisors approved a draft housing blueprint in December that was created with public input. But the County would like more public engagement as it works toward a completed plan.\nThe survey on the Enagage San Diego County’s Housing Blueprint site asks people to weigh in on those goals and objectives to help reach them. And to add what they think is missing or should be added to a completed plan.\nHome building in San Diego County and many other parts of California haven’t kept up with population growth and housing demand across income levels for decades. That has caused housing costs to skyrocket, making it financially hard, if not impossible, for people to buy, or stay, in homes.\nThe County has taken numerous actions to add affordable housing in recent years, including announcing a goal last October of working with the City of San Diego to build 10,000 affordable housing units by 2030.\nIn February, the County secured an additional $24.5 million from the state to boost $29 million already set aside for four affordable housing and related developments that are being planned in National City, San Ysidro and Rancho Bernardo.\nIn 2022 the County spent millions of dollars and worked with numerous other cities and organizations to build housing to help people with low-incomes, people experiencing homelessness, seniors and veterans. There were affordable housing communities in City Heights, in Carlsbad, Vista and downtown San Diego. In a first of its kind project for the County, it used its own surplus property to begin transforming an empty lot into a site for low-income affordable housing.\nSince 2017, the County has leveraged about $1 billion in federal and state funding by investing more than $175 million on 44 affordable housing projects in 24 communities. Many are completed, others are under construction and more are on the way.\nThe County’s Engage San Diego County webpage was created to make it easier for the public to be involved in the planning process of County projects and initiatives. People can find information about active and upcoming public projects, forums and links to numerous ways to take part and weigh in on those projects.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230314.10.39.09"}