{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Record COVID-19 Cases Reported as Total Surpasses 100K", "description": "A record 2,867 COVID-19 cases were reported Dec. 10, bringing the region’s overall total to 102,466, the County Health and Human Services Agency announced today.", "datePublished": "2020-12-11T17:53:11-08:00", "url": "https://www.countynewscenter.com/record-covid-19-cases-reported-as-total-surpasses-100k/", "keywords": ["health", "coronavirus", "covid-19", "record cases"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-14T09:11:55-08:00", "articleType": "article", "articleContent": "\nA record 2,867 COVID-19 cases were reported Dec. 10, bringing the region’s overall total to 102,466, the County Health and Human Services Agency announced today.\nThe new one-day total eclipses the previous record set on Dec. 4 when 2,287 cases were reported.\n“The extremely high number of cases shows that San Diegans are not following the guidance we’ve given. Protect yourself and others. The virus is everywhere,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Staying at home with people from your own household is a must. People should not be out in public unless it is absolutely necessary.”\nWooten reiterated San Diegans should not be having gatherings of any size since they are prohibited by the Regional Stay Home Order and are contributing to the spread of the virus.\nShe encouraged people to continue doing the following to prevent getting COVID-19 and passing it to others:\n\nIf you’re sick, stay home and isolate yourself from others.\nIf you need to be in public, you must use a face mask if you are close to people outside your household. The masks help prevent asymptomatic carriers from spreading the virus.\nMaintain social distance from others.\nAvoid crowded places to decrease your risk of exposure.\nCover your cough or sneeze with a tissue, throw it away and wash your hands.\nWash your hands properly and regularly or use hand sanitizer.\nIf you’re out and about and notice that a business is not following the health guidance, report them by calling (858) 694-2900 or emailing SafeReopeningComplianceTeam@sdcounty.ca.gov.\n\n“Our actions matter and can impact our local hospitalizations and intensive care bed capacity,” Wooten said.\nICU Capacity and Stay Home Order:\n\nThe current ICU capacity for the Southern California region is now 6.2% and will be updated by the state daily.\nThe Regional Stay Home Order is now in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last for at least three weeks or until the region’s ICU capacity meets or exceeds 15%. The order will be assessed by the state after the three-week period.\n\nCommunity Setting Outbreaks:\n\n10 new community outbreaks were confirmed on Dec. 10: three in business settings, two in faith-based settings, two in restaurant/bar settings, one in a TK-12 school setting, one in a daycare/preschool/childcare setting and one in a food/beverage processing setting.\nIn the past seven days (Dec. 4 through Dec. 10), 64 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n25,002 tests were reported to the County on Dec. 10, and the percentage of new laboratory-confirmed cases was 11%.\nThe 14-day rolling average percentage of positive cases is 8.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 24,698.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n2,867 new cases were reported to the County on Dec 10. The region’s total is now 102,466.\n5,064 or 4.9% of all cases have required hospitalization.\n1,098 or 1.1% of all cases and 21.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n23 new COVID-19 deaths were reported to the County on Dec. 10. The region’s total is now 1,137.\n13 men and 10 women died between Dec. 2 and Dec. 10, and their ages ranged from mid-40s to early 100s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201211.17.53.11"}