{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, State Address Wage Theft Crisis", "description": "The County and the State of California are joining forces to fight a wage theft crisis that costs local employees millions of dollars.", "datePublished": "2023-03-23T16:06:49-07:00", "url": "https://www.countynewscenter.com/county-state-address-wage-theft-crisis/", "keywords": ["government", "alor calderon", "brandon butler", "ca labor secretary", "da", "district attorney summer stephan", "office of labor standards and enforcement", "olse", "wage therft", "week of action"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-03-24T10:23:09-07:00", "articleType": "article", "articleContent": "\nThe County and the State of California are joining forces to fight a wage theft crisis that costs local employees millions of dollars.\nIn honor of labor rights activist César Chávez, the County’s Office of Labor Standards and Enforcement (OLSE) and the State of California’s Labor Commissioner’s Office announced Thursday they’re stepping up efforts to help workers get the pay they’re due.\nBoard Vice Chair Terra Lawson-Remer said workers can’t always fight wage theft themselves because they’re too busy trying to take care of their families. But said these workers have an ally at the County.\nShe pointed to the new Office of Labor Standards and Enforcement and a proposed wage theft fund.\nShe said it’s about fairness and she had a message for every honest San Diego business.\n“These rules help you because unscrupulous employers who cheat their employees have an unfair advantage and honest companies can’t compete. So together we can change that,” said Vice Chair Terra Lawson Remer.\nThe DA’s office opened a Workplace Justice Division in 2021 and learned from the community that when it comes to wage theft, people don’t really know it’s a crime.\n“When your wages are stolen, if they’re under $950 that is still a crime, a misdemeanor crime,” said District Attorney Summer Stephan. “But if it’s over $950, that’s a felony crime that your DA’s office is going to bring and there’s real accountability.”\nThe state is also making changes to make sure workers know their rights especially those in underserved communities. It launched an outreach campaign called “Reaching Every Californian.”\n“We need to get out of our offices and go out into the community and meet workers where they are. All workers, not just workers who know their rights…” said Lilia García-Brower, Labor Commissioner of the California Department of Industrial Relations. “…It is our obligation to get to them because if workers don’t understand their rights, how are they going to exercise them? So outreach is foundational to enforcement.”\nThe Office of Labor Standards and Enforcement reaches out to educate workers and businesses countywide on their rights and responsibilities, too.\n“We’ve also created the Fair Place Collaborative bringing together both businesses and worker advocacy organizations and stakeholders to help chart the course for our office,” said Brandon Butler, Deputy Director, County’s Office of Labor Standards and Enforcement. “We developed new policies with our County Department of Purchasing and Contracting to implement anti wage theft rules within our key contracting procedures. And we also ensured that County contract vendors comply with workers’ rights laws here in the county.”\nDuring Thursday’s event, a proclamation was presented to a close County partner, the director of the Employee Rights Center, Alor Calderon. The news conference also kicked off a Week of Action designed to educate people about workers’ rights.\nFor additional information on workers’ rights and how to file a claim, you can reach the County Office of Labor Standards and Enforcement through its advice line at 619-985-1597 or at OLSE@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230323.16.06.49"}