{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches New ‘Getting to Zero’ App for HIV Resources ", "description": "The County has a new free app to help San Diegans find HIV resources like testing locations and treatment providers.", "datePublished": "2023-10-12T15:42:54-07:00", "url": "https://www.countynewscenter.com/county-launches-new-getting-to-zero-app-for-hiv-resources/", "keywords": ["health", "getting to zero", "hiv", "new app", "resources", "stds"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-10-12T15:42:54-07:00", "articleType": "article", "articleContent": "\nThe County has a new free app to help San Diegans find HIV resources like testing locations and treatment providers.\nThe Getting to Zero Mobile App, launched by the County’s Public Health Services in collaboration with 2-1-1 San Diego, is designed to increase access to HIV, STD and hepatitis related information.\nThe app helps San Diegans and anyone living with HIV or at-risk of contracting HIV, organizations and people working in HIV-related fields, with easy-to-access resources.\nPeople using the app can search from their mobile phone for service providers based on their location or needs. The app can also provide information about transportation routes, other available services and resources and much more. It is available in multiple languages.\n“Public Health Services has been dedicated to equity and innovation with Getting to Zero since launching the campaign more than seven years ago,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “I’m excited about this new app and encourage people to download it and share it with others so we can continue our journey toward ending HIV infections.”\nA new Getting to Zero Resource Guide is also available online and in print version in English and Spanish. It has information about existing HIV resources including HIV support, prevention, care, and treatment, as well as how to access other essential services like food, housing, and transportation, as well as resources for behavioral and emotional health.\n“HIV is highly preventable and treatable. The new Getting to Zero App is another way that we are working to lower barriers and increase access for people to receive the care they need.” said Patrick Loose, County Public Health Services Chief of HIV, STD and Hepatitis Branch. “The app is also integrated with 2-1-1 San Diego, putting a wealth of information at people’s fingertips.”\nThe Getting to Zero app is available for download in the Apple App Store and Google Play.\nGetting to Zero Initiative \nThe Getting to Zero App is part of the Getting to Zero Initiative adopted by the County of San Diego Board of Supervisors, in March 2016, to work toward ending the HIV epidemic.\nThe initiative focuses on ensuring HIV testing is widely available and providing access to treatment and supportive services.\nFor more information about HIV and AIDS in San Diego County, visit the County of San Diego HIV, STD, and Hepatitis Branch website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231012.15.42.54"}