{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Leaders Report Progress Fighting Wage Theft", "description": "Local workers who fall victim to wage theft now have a better chance of getting the pay that is due them. County and state leaders reported advances on addressing the region’s wage theft crisis Tuesday outside the County Administration Center.", "datePublished": "2024-03-19T18:08:46-07:00", "url": "https://www.countynewscenter.com/county-leaders-report-progress-fighting-wage-theft/", "keywords": ["government", "branden butler", "d.a. s office", "da summer stephan", "office of labor standards and enforcement", "supervisor lawson-remer", "wage theft"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-03-20T09:21:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesLocal workers who fall victim to wage theft now have a better chance of getting the pay that is due them.\nCounty and state leaders reported advances on addressing wage theft within the region Tuesday outside the County Administration Center.\nThe event was part of a Week of Action honoring labor rights activist César Chávez.\nThe County cited the Workplace Justice Fund as one of its most successful programs. The fund helps workers who won legal judgments for lost wages but are still waiting for the money from their employers.\nThe justice fund offers these workers checks up to $3,000 to help pay rent and other bills. Once the judgment is assigned to the County for collection, the County will seek to recover money that is owed to the worker.\nOne program applicant said it’s important to hold employers responsible, so they don’t take wages from others.\n“I’m finally receiving justice for my case. The financial assistance of the Workplace Justice Program is providing me with the hard-earned money I should have received many years ago from my employer.” said Sandra Cruz, program applicant.\n“When an employer cheats a worker out of fair wages, they cannot afford to pay for their basic needs, which hurts our local economy…,” said County Supervisor Terra Lawson-Remer. “So, our Office of Labor Standards Enforcement is now here to ensure that if these things do happen, if you are a victim, there is a place for you to go.”\nThe County’s Office of Labor Standards and Enforcement (OLSE) used the Workplace Justice Fund to help more than 34 workers.\nThe Good Faith Restaurant Owners Program is another way the office holds bad-faith businesses accountable.\n“In 2023, the Office of Labor Standards launched the program to combat wage theft in the restaurant industry,” said OLSE Director Branden Butler. “As of March 2024, OLSE has assisted in recovering $100,000 in unpaid wages from seven restaurants in collaboration with the Labor Commissioner’s office.”\nAccording to the District Attorney’s office, wage theft can take many forms. For example, paying less than minimum wage, not paying for overtime or not allowing for meal and rest breaks.\n“When you think about wage theft, it is on a continuum. You start with wage theft abuses…” said District Attorney Summer Stephan. “Then you move all the way up to labor trafficking when that wage theft and those abuses escalate to the point of being one of the most serious human rights violations of labor trafficking, that’s when you add force, fraud and coercion…”\nThe D.A. urges people who think they have a case of labor trafficking to contact their office at 866-402-6044.\nButler said the office is also working with the Sheriff’s Department to educate job seekers who have been involved in the justice system on their rights under the State’s Fair Chance Act.\nThe County regularly works with both the Employee Rights Center and the State Department of Industrial Relations to advance workers’ rights.\n“We are all working together, and we are very proud to see that we are, in part, the connection that brings all these resources together, all this attention together so hopefully there will be no stories like Sandra in the future,” said Employee Rights Center Director Alor Calderón.\n“So, the collaboration with OLSE, the DA’s office, at least with my office here in San Diego, that is the magic,” said Labor Commissioner Lilia García-Brower. “That’s exactly where we’re able to protect the most vulnerable workers and law-abiding employers.”’\nAfter the event, the OLSE honored a local business with a certificate. Mujeres Brew House is a female-run and Latina-owned brewery in San Diego that was recognized for showing exceptional support for its employees.\nEmployers and workers who want more information about workers’ rights or wage theft can contact the Office of Labor Standards and Enforcement at 619-531-5129.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240319.18.08.46"}