{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Seniors Brush Knees in Tai Chi", "description": "Older adults who stay active and fit can significantly improve their quality of life as they age. Physical activity strengthens muscles, improves bone density and builds cardiovascular health which means greater independence. It can also reduce the risk of falls and fractures. Even light activities like walking, gardening or gentle yoga can make a significant difference.", "datePublished": "2025-01-06T11:46:10-08:00", "url": "https://www.countynewscenter.com/local-seniors-brush-knees-in-tai-chi/", "keywords": ["health", "ais", "exercise classes", "feeling fit", "healthy living", "older adult", "seniors", "tai chi"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-01-06T11:50:27-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteOlder adults who stay active and fit can significantly improve their quality of life as they age. Physical activity strengthens muscles, improves bone density and builds cardiovascular health which means greater independence. It can also reduce the risk of falls and fractures. Even light activities like walking, gardening or gentle yoga can make a significant difference.\nExercise is not only good for the body, and it also promotes brain health and socialization. Activities that combine movement with mental engagement double the benefits by stimulating both the brain and the body together.\nThe County offers a variety of exercise options for older adults who want to keep physical activity a priority in their life, including Tai Chi classes. Tai Chi has become a popular choice of exercise for older adults because it is low impact and helps improve balance, aerobic endurance, and flexibility.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250106.11.46.10"}