{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 2-10-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Feb. 9, 2021.", "datePublished": "2021-02-10T16:43:53-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-2-10-2021/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-02-11T08:23:59-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Feb. 9, 2021.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 34.2 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 9.1%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 12.1% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers, but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 16.\n\nCommunity Setting Outbreaks:\n\nNine community outbreaks were confirmed Feb. 9: four in business settings, two in construction settings, one in a faith-based agency setting, one in a government setting and one in a retail setting.\nIn the past seven days (Feb. 3 through Feb 9), 70 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n19,461 tests were reported to the County on Feb. 9, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 6.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,772.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n810 cases were reported to the County on Feb. 9. The region’s total is now 248,861.\n11,011 or 4.4% of all cases have required hospitalization.\n1,529 or 0.6% of all cases and 13.9% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFifty-one COVID-19 deaths were reported Feb. 9. The region’s total is 2,904.\nSixteen women and 35 men died between Jan. 9 and Feb. 8.\nOf the 51 new deaths reported today, 17 people who passed away were 80 years or older, 12 people were in their 70s, 12 people were in their 60s, eight people were in their 50s and two people were in their 40s.\nForty-eight had underlying medical conditions, one did not and two had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210210.16.43.53"}