{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Advances Plans for 224 Affordable Housing Units on Surplus Land", "description": "The County of San Diego is moving forward with plans to build 224 affordable homes on surplus County-owned land.", "datePublished": "2025-05-09T13:23:47-07:00", "url": "https://www.countynewscenter.com/county-advances-plans-for-224-affordable-housing-units-on-surplus-land/", "keywords": ["housing", "affordable housing", "county surplus property", "homekey"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2025-05-12T14:28:01-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County of San Diego is moving forward with plans to build 224 affordable homes on surplus County-owned land.\nThe Board of Supervisors voted Wednesday to advance two affordable housing developments that will bring deed-restricted homes to the City of San Diego’s Mid-City area and downtown Escondido.\nThe Mid-City development at 5202 University Ave. will provide 90 affordable units for low-income seniors on County-owned property. An additional 150 units for families and/or seniors will be built on the adjacent property owned by the San Diego Housing Commission.\nThe Escondido project at 620 E. Valley Parkway will include 134 affordable units for low-income seniors and a childcare center open to the public.\nThe two developments are part of the County’s broader strategy to convert surplus public land into affordable housing. While the sites are located within the cities of San Diego and Escondido, the projects are led by the County in coordination with those cities and affordable housing partners.\nConstruction on both projects is expected to begin in 2028.\nOn Tuesday, Supervisors also voted to contribute $12.5 million for an 81-unit permanent supportive housing development on Starling Drive, in partnership with the San Diego Housing Commission and the City of San Diego. The project is the seventh County-supported affordable housing development since 2020 approved under the State’s Homekey and new Homekey+ programs.\nSince 2017, the County has invested more than $325 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal and local funding. Those funds have helped open doors to more than 2,588 homes with 3,292 more on the way.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250509.13.23.47"}