{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County in Danger of Falling into Purple Tier", "description": "The local COVID-19 adjusted case rate has steadily increased and has reached 7.0 cases per every 100,000 residents, placing the County in danger of being moved into the state’s more restrictive Purple Tier or Tier 1.", "datePublished": "2020-10-16T17:58:11-07:00", "url": "https://www.countynewscenter.com/county-in-danger-of-falling-into-purple-tier/", "keywords": ["health", "case rate", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-10-19T10:05:23-07:00", "articleType": "article", "articleContent": "\nThe local COVID-19 adjusted case rate has steadily increased and has reached 7.0 cases per every 100,000 residents, placing the County in danger of being moved into the state’s more restrictive Purple Tier or Tier 1.\nShould the case rate reach 7.1 or higher for two consecutive weeks, indoor activities will not be allowed at restaurants, movie theaters, gyms and a number of other locations.\nCounty health officials are asking San Diegans to be vigilant and continue following the local health guidance to slow the spread of the novel coronavirus.\n“San Diegans must take action and do it now. We need everyone’s support so that we can prevent the region from moving into the most restrictive level,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should stay home as much as possible, telework if they can and avoid gatherings to prevent the spread of COVID-19.”\nThe County’s COVID-19 unadjusted case rate for the week of Oct. 4 through Oct. 10 increased from 7.2 to 7.8.  The adjusted metric also rose from 6.8 to 7.0 cases per 100,000 people during the same time.\nShould the region post Purple Tier numbers for two weeks in a row, the County would be forced to follow the more restrictive state guidance.\n“We must bring our numbers down and the only way to do that is to limit our contact with people outside our households,” Wooten said. “San Diegans who need to be out in public should wear a mask and maintain their distance from people outside their household. Avoid large crowds or gatherings to prevent getting or passing the virus.”\nGiven the data reported for the week of Oct. 4 through Oct. 10, the County is expected to still be in the Red Tier when the state announces the region new standing Oct. 20.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.8 per 100,000 residents. Limit for Tier 2 is 7.0.\nThe testing positivity percentage is 3.0%, placing it in Tier 3 or the Orange Tier.\nThe state’s health equity metric looks at the testing positivity for areas with the lowest healthy conditions.\nThe County’s health equity testing positivity percentage is 5.7. This metric does not move counties to more restrictive tiers but is required to advance.\nThe California Department of Public Health will assess counties on a weekly basis, with the next report scheduled for Tuesday, Oct. 20.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed on Oct. 15 in a restaurant/bar setting.\nIn the past seven days (Oct. 9 through Oct. 16), 40 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n6,724 tests were reported to the County on Oct. 15, and the percentage of new laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 3.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 9,085.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n311 new cases were confirmed among San Diego County residents on Oct. 15. The region’s total is now 51,781.\n3,740 or 7.2% of all cases have required hospitalization.\n865 or 1.7% of all cases and 23.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nThree new COVID-19 deaths were reported in San Diego County on Oct. 15. The region’s total is now 850.\nTwo men and one woman died between Oct. 10 and Oct. 15, and their ages ranged from early 60s to early 90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201016.17.58.11"}