{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County opens first Safe Parking Site for Homeless in East County", "description": "A new overnight option has opened for people experiencing homelessness in East County. The safe parking lot is designed to help persons experiencing homelessness who have cars but no place to safely park them at night.", "datePublished": "2022-08-10T18:08:44-07:00", "url": "https://www.countynewscenter.com/?p=209204", "keywords": ["health", "equitable communities", "homelessness", "magnolia", "safe park"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2022-08-10T18:08:44-07:00", "articleType": "article", "articleContent": "\nA new overnight option has opened for people experiencing homelessness in East County.\nThe safe parking lot is designed to help persons experiencing homelessness who have cars but no place to safely park them at night.\nSecond District County Supervisor Joel Anderson, who represents the East County, was joined at the opening by the County’s Department of Homeless Solutions and Equitable Communities and others. Those included a team of local organizations, community partners and other county departments who worked on the project and that provide outreach in the surrounding area.\nThis is the first Safe Parking program opened by the County. It includes hygiene facilities, 24/7 security, two hot meals for overnight guests and access to local YMCA facilities.\n“I am thankful to my Board colleagues for supporting my ‘Compassionate Emergency Solutions’ board letter that made this Safe Parking a reality in East County,” Anderson said. “This safe parking lot is an incredibly important step in the right direction toward us solving this homelessness crisis – and creating a safer community.”\nThe 17-space site is located on North Magnolia Avenue in El Cajon in an unincorporated area of San Diego County. Parking spaces are assigned by referral only through the County’s Homeless Solutions and Equitable Communities outreach teams. The lot opens nightly at 5:30 p.m. Guests must exit each morning by 7:00 am.\nDreams for Change, a local homeless service provider, has been contracted by the county to run the program. Its case managers will assist customers with housing navigation and connect them to resources to help them transition to a more permanent housing solution.\n“This is just one example of the County’s commitment to homelessness, behavioral health and substance use,” said Nick Macchione, Director of the County’s Health and Human Services Agency. “More plans are underway in East County for Mobile Crisis Response Teams and a new East County Crisis Stabilization Unit.”\nEarlier this year, the Magnolia Avenue site was part of a large homeless encampment that spread below the overpass and spilled into the street.\nCounty homeless outreach teams walked the area for two months, offering support and direct services to everyone living here. Those teams issued EBT cards, distributed 219 hygiene and 178 Narcan kits, provided 48 vaccines and connected 103 individuals to shelter and housing.\n“This project has been so rewarding, and a tremendous, shared learning experience to get to where we are today,” said Barbara Jiménez, Community Operations Officer for the County Department of Homeless Solutions & Equitable Communities. “It is a testament to how collaboration can lead to successful results in a short amount of time and will be a model for future projects.”\nIf you come in contact with someone in need of a referral to this new Safe Parking facility, please call (619) 980-4168 or email HSEC-OHS.HHSA@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220810.18.08.44"}