{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Names New Registrar of Voters", "description": "No stranger to running local elections, Interim Registrar Cynthia Paes has now been appointed as the new San Diego County Registrar of Voters.", "datePublished": "2021-11-10T17:39:58-08:00", "url": "https://www.countynewscenter.com/county-names-new-registrar-of-voters/", "keywords": ["elections", "cynthia paes", "election", "registrar", "voting"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-11-10T17:41:21-08:00", "articleType": "article", "articleContent": "\nNo stranger to running local elections, Interim Registrar Cynthia Paes has now been appointed as the new San Diego County Registrar of Voters.\nPaes has been acting as interim registrar since January and has shepherded her team through four elections, including the recent statewide gubernatorial recall election.\nPaes also successfully launched several firsts after the Board of Supervisors decided to move the County to the Voters Choice Act.\nAll of the County’s 1.97 million voters received mail-in ballots during the recall election. Assigned polling places were replaced with voting locations allowing voters to cast their ballot at any one of more than 200 sites and ballot marking devices were introduced to all in-person voters.\n“She has more than thirty elections under her belt and will continue the County’s excellent record of administering fair, accurate, accessible, transparent and secure elections with the highest level of care and integrity,” said Chief Administrative Officer Helen Robbins-Meyer.\nPaes will also continue to foster community engagement efforts to ensure every qualified individual can gain access to the voting process and learn their many options for casting a ballot.\nPaes started with the County in 2002 with the Health and Human Services Agency. In 2011, she became the Chief Deputy of the Election Services Division and within two years, she was promoted to Assistant Registrar of Voters. She became the interim registrar when the former registrar, Michael Vu, became the County’s assistant chief administrative officer.\nPaes has a Master of Public Administration degree from California State University, Stanislaus and is a Certified Elections/Registration Administrator with the National Association of Elections Officials.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211110.17.39.58"}