{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "32 COVID-19 Variant Cases Identified in San Diego County", "description": "Twenty-four confirmed and four probable cases of the more contagious strain of SARS-CoV2, the virus that causes COVID-19, have been identified, the County Health and Human Services Agency announced today.", "datePublished": "2021-01-05T12:39:02-08:00", "url": "https://www.countynewscenter.com/32-covid-19-variant-cases-identified-in-san-diego-county/", "keywords": ["health", "coronavirus", "covid-19", "new strain", "new variant"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-05T14:11:50-08:00", "articleType": "article", "articleContent": "\nTwenty-four confirmed and four probable cases of the more contagious strain of SARS-CoV2, the virus that causes COVID-19, have been identified in San Diego County, the Health and Human Services Agency announced today.\nThe new cases of the variant that emerged in the United Kingdom, known as B.1.1.7, bring the region’s total to 32. Sixteen are men and 16 are women. The new total includes 28 cases confirmed by whole genome sequencing and four probable cases that are directly linked to the confirmed cases and have positive diagnostic nucleic acid tests, but are not yet sequenced.\nTwo dozen new variant cases were confirmed on Jan. 4 from specimens collected from Dec. 27 through Dec. 31 and tested at the San Diego-based laboratory Helix and its partner Illumina under a Centers for Disease Control and Prevention surveillance project.\nThere have been no COVID-19 deaths connected to the variant, but one woman had to be hospitalized. She is now at home recovering.\nThe 24 newly confirmed patients are believed to have no travel history and to have come from 19 different households, but the investigation and contact tracing are ongoing.\nNew cases have been identified in San Diego, Chula Vista, La Mesa, and Lakeside.  The cases are among multiple age groups. While the four youngest cases are under 10 and the oldest is over 70, the average age of the variant cases to date is 36, the same as the overall average for all confirmed cases in the county to date.\n“The fact that these cases have been identified in multiple parts of the region shows that this strain of the virus could be rapidly spreading,” said Wilma Wooten, M.D., M.P.H. County public health officer. “People should be extra cautions to prevent getting and spreading COVID-19, especially this variant, which research has shown is more contagious.”\nThe variant was first identified Dec. 30 in a man in his 30s with no travel history. Three additional cases were announced Dec. 31.\nThe County has asked all testing labs that have the capability to identify suspect cases of the new strain to forward specimens for genome sequencing to determine if they are indeed cases of the variant. Local doctors have also been requested to forward COVID-19 positive tests from patients with a travel history to the United Kingdom or other places overseas where variants have been detected.\n“We are doing everything we can to determine how fast this new strain is spreading, especially since the region’s daily case count has dramatically increased in recent weeks,” Wooten said.\nAt this time, it believed that the vaccines currently available will offer protection against newly emerging variants. Scientists continue to study the new strains of the novel coronavirus to determine their potential impact.\nCounty health officials say San Diegans should do the following now more than ever:\n\nKeep your distance from others and leave your household only for essential activities\nWear a mask\nWash your hands\nIf you’re sick, get tested, and then stay home and isolate yourself\n\nFor more information about COVID-19, testing locations and vaccine distribution, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210105.12.39.02"}