{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Animal Services Offer Microchip and Vaccine Clinic in Valley Center", "description": "County Animal Services assisted 100 pets and microchipped 75 of them at a free pet clinic this week in Valley Center.", "datePublished": "2025-01-24T11:05:03-08:00", "url": "https://www.countynewscenter.com/county-animal-services-offer-microchip-and-vaccine-clinic-in-valley-center/", "keywords": ["animals", "animal services", "das", "microchipping", "pet preparedness"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-01-24T11:54:38-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty Animal Services assisted 100 pets and microchipped 75 of them at a free pet clinic this week in Valley Center.\nWhile this clinic was planned well in advance of the fires that are burning up in Los Angeles, Rachael Borelli, assistant director at County Animal Services said it is critical to prepare before any disaster and make sure your pet is microchipped and vaccinated.\nIf a pet gets separated from their family, a simple scan of a microchip could help reunite them. It is important to remember that most emergency animal shelters will request vaccination records for animals to make sure they are okay to be around other animals.\nWednesday’s clinic went for four hours at the Valley Center Tractor Supply store.\n“That’s an area where there aren’t a lot of microchipped pets, but now there are 75 more,” Borrelli said.\nSo many people showed up, that they ran out of the microchips on hand, she added.\nPet owners also took advantage of the free vaccines that included rabies shots.\nIn addition to Valley Center residents, Animal Services also helped residents who traveled there from Ramona, Escondido and Vista.\nTo learn more about pet vaccination and microchipping, visit the County Animal Services site for locations and hours.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250124.11.05.03"}