{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Are You a Safe Thanksgiving Chef? Take the Quiz!", "description": "We’re still rightfully being vigilant about COVID-19, but Thanksgiving is here again — so if you're cooking, cook safely!", "datePublished": "2021-11-22T09:58:26-08:00", "url": "https://www.countynewscenter.com/are-you-a-safe-thanksgiving-chef-take-the-quiz/", "keywords": ["consumer", "food safety", "lueg", "thanksgiving"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-11-22T10:08:23-08:00", "articleType": "article", "articleContent": "\nWe’re still rightfully being vigilant about COVID-19, but Thanksgiving is here again — so if you’re cooking, remember to cook safely!\nSmart cooks know you always want to avoid simple mistakes that can let bacteria like E. coli, listeria and salmonella turn your feast into heaping helpings of food-borne illness for your family and friends.\nSo remember to use safe-cooking rules like, “keep hot foods hot and cold foods cold; keep meats and veggies separated during food prep; and practice good hygiene.”\nTo help you all be safe and thankful, the County’s Department of Environmental Health and Quality is offering it’s annual — and we hope fun — safe-Thanksgiving cooking quiz to help you prepare!\nHere you go!\nWhat’s the best way to thaw frozen meat? \n\nPut it out on the counter, don’t let anyone touch it and wait till the outside is mushy.\nRun hot water over it — until the outside is mushy.\nLet it sit in a pot of water until the outside gets (you guessed it…) mushy!\nLet it defrost in the fridge. Meats, poultry and fish should be defrosted in the refrigerator. (If it’s a big turkey, for at least 24 hours for every five pounds in weight.)\n\nAnswer: D, of course. Using the refrigerator to thaw slowly and evenly is the best, safest way to defrost any meat. Because bacteria can grow exponentially at room temperatures.  Note: The United States Department of Agriculture says that you can also thaw meats in cold water. But — and this is important — the water must be cold, under 40 degrees, and should be changed every 30 minutes to keep it cold. Thawing in the fridge is easier!\nHow often should you wash your hands and cutting boards when preparing food?\n\nYou don’t have to wash your hands and cutting boards. Just wipe them off on your shirt or pants.\nBefore you start cooking.\nAfter you pet the dog. The cat. The gerbil. Or pick up the kids.\nIf you sneeze, blow your nose or have to run to the restroom.\nThe answer is everything except answer A, but mainly, “OFTEN!”\n\nAnswer: Definitely E. (PLEASE tell me you did NOT answer “A.”) You should wash your hands and cutting boards before and after everything in B, C and D. Handwashing is always a key part of safe cooking. And let’s face it, as we continue to fight COVID-19, it’s important to wash your hands even if you’re not cooking! So break out that soap and do it. Harmful bacteria, from E. coli to salmonella and staphylococcus aureus, as well as viruses, can be removed from people’s hands through proper handwashing.\nHere are just a few other things you should wash your hands after doing: coughing, blowing your nose, using the restroom handling money, eating, drinking, smoking and handling or preparing raw food.\nShould you rinse off fruits and vegetables?\n\nNah. If they look clean they’re good.\nWhy? The supermarket washes them, right?\nNo way! Fruits and vegetables are always better when they’re a little crunchy.\nYes. You should rinse fruits and vegetables with cold water to remove lingering dirt that can carry bacteria.\n\nAnswer: Absolutely D. Rinsing with cold water cleans off dirt and other contaminants. But don’t wash them with detergents or soap, even dishwashing soap. You could end up eating residues from those cleaners if they’re absorbed by fruits and vegetables.\nWhy should you keep raw meats and meat products separated from fruits and vegetables when cutting them up or preparing them?\n\nYou know, meats and fruits and vegetables just don’t like each other. Last thing you need on Thanksgiving is a food fight.\nVeggies can make your meat taste weird. Just. Weird.\nBecause raw meats, meat products and blood can carry bacteria like E. coli and salmonella that can contaminate fruits and vegetables — and make people sick.\nYou do not have to. Juice from meats is called “marinade.”\n\nAnswer: The correct answer is C. (If you said D — you should seriously think about staying out of the kitchen.) Cross-contamination is one of the most common causes of food-borne illness, according to the USDA. That is, the transfer of harmful bacteria from one food, particularly raw meats, poultry and shellfish to other foods. When preparing food, you need to keep raw meats and their juices away from fruits and vegetables and all ready-to-eat foods.\nIf you can, use separate cutting boards for meats and produce. If you can’t use separate cutting boards, wash yours with hot, soapy water after using them on raw meats and before using them to cut fruits and vegetables!\nWhat is the Danger Zone? And what does it have to do with Thanksgiving dinner?\n\nAll you people from the 1980s, stand up! It’s from Top Gun! Tom Cruise, Kenny Loggins!  “Highway to the DANGER ZONE! Riiiide into the DANGER ZONE!” \nIt’s that toy-strewn, carpet-rippled, child-filled distance you must navigate to get the Thanksgiving food from your kitchen to the table, without dropping everything!\nIt’s the range of temperatures between 40 degrees Fahrenheit and 140 degrees Fahrenheit — the temperatures where bacteria can grow like crazy in foods, doubling in number in as little as 20 minutes.\n\nAnswer: The correct answer is C. We love Top Gun too. But the real “Danger Zone” is the range of temperature between 40 degrees and 140 degrees Fahrenheit that allows bacteria to breed exponentially — not a good thing. If hot foods cool or cold foods heat up enough to enter that zone, your food can become a bacteria-fest. And you can end up getting sick. So keep hot foods safely heated with chafing dishes, preheated steam tables, warming trays, slow cookers and ovens. Place cold foods in containers on ice, or in the fridge. And refrigerate leftovers as soon as you can, but definitely within two hours.\nAnd finally, we end with an age-old bonus question:\nIs the “five-second rule” real? Can you eat something you’ve dropped on the floor if you pick it up in less than five seconds?\n\nOf course it’s real. Just pick it up quick and blow on it. Nothing can contaminate your food in less than five seconds. My dogs eat everything off the floor and I’ve never seen them get sick.\nNo, no no. It’s not real. You really shouldn’t eat anything you’ve dropped on floor.\n\nAnswer: B. It’s OK for the dog to eat food that’s fallen to the ground but it’s not safe for people. Truth is, almost any contact is long enough for food to be contaminated by bacteria that can be found on the ground or in your house. According to research conducted by Rutgers University, bacteria can transfer from a surface to food in less than a second!\nSo there you have it. Now you’re an expert. But if you’re still interested, you can get more information about food safety tips at FoodSafety.gov’s “Food Safety by Types of Food” webpage, or by calling the USDA’s Meat and Poultry hotline at 1-888-674-6854.\nBe safe. Cook safe. And have a great Thanksgiving!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211122.09.58.26"}