{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What Does the Danger Zone Have to Do with Thanksgiving Cooking? Take the Quiz!", "description": "There’s a chance that many of us will have more people around our Thanksgiving Day tables this year than we’ve had in a while. And that means it’s time to brush up on how to cook—safely, that is!", "datePublished": "2022-11-17T08:24:32-08:00", "url": "https://www.countynewscenter.com/what-does-the-danger-zone-have-to-do-with-thanksgiving-cooking-take-the-quiz/", "keywords": ["consumer", "dehq", "food safety", "lueg", "thanksgiving"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-11-17T12:22:58-08:00", "articleType": "article", "articleContent": "\nThere’s a chance that many of us will have more people around our Thanksgiving Day tables this year than we’ve had in a while. And that means it’s time to brush up on how to cook—safely, that is!\nBecause, you don’t want dangerous bacteria like E. coli, listeria and salmonella turning your beautiful banquet into a smorgasbord of food-borne illness.\nThe good news? You can keep that from happening just by following some simple rules. Here are the basics. Keep hot foods hot and cold foods cold. Keep meats and veggies separated during food prep. And practice good hygiene.\nBut to be on the safe side, here’s a safe-Thanksgiving (and holidays) cooking quiz to refresh your safe-cooking skills and help you prepare, from the County Department of Environmental Health and Quality.\nIt all starts with the thaw! What’s the best way to thaw frozen meat?\n\nSit it out on the counter. Give it a few hours till the outside is nice and squishy.\nNot fast enough! Run it under hot water. Until the outside is you know, squishy.\nPut it in a big pot of water until the outside is—wait for it—nice and squishy.\nPlan ahead and let meat defrost in the fridge. Meats, poultry and fish should be defrosted in the refrigerator. If you’re cooking a big turkey, you should allow at least 24 hours for every five pounds in weight.\n\nAnswer: D. (If you chose any of the other three, you may want to seriously consider just ordering pizza.) Thawing meat in the refrigerator is absolutely the best and safest method. That’s because a refrigerator allows meat to thaw slowly and evenly, rather than leaving portions of defrosted meat to stand at room temperature where bacteria can grow exponentially.\nNote: The United States Department of Agriculture says that you can also thaw meats in cold water. But — and this is important — the water must be cold, under 40 degrees, and should be changed every 30 minutes to keep it cold. Thawing in the fridge is easier!\nHow often should you wash your hands and cutting boards when preparing food?\n\nYou don’t have to wash your cutting boards. And wiping your hands off on your shirt or pants is good enough.\nBefore you start cooking.\nAfter you pet the dog — or the cat. Or pick up the kids.\nAfter you sneeze, blow your nose or have to run to the bathroom.\nThe answer is B, C and D; but mainly, “OFTEN!”\n\nAnswer: Definitely E. You should wash your hands and cutting boards before and after everything in A, B and C, and pretty much as often as you can in the kitchen. Handwashing is always a key part of safe cooking. So break out that soap and do it. Harmful bacteria, from E. coli to salmonella and staphylococcus aureus, as well as viruses, can be removed from people’s hands through proper handwashing.\nHere are just a few other things you should wash your hands after doing: coughing, handling money, eating, drinking, smoking, and handling or preparing raw food.\nShould you rinse off fruits and vegetables?\n\nNot necessary. The supermarket washes them. Right?\nYou should rinse fruits and vegetables with cold water to remove lingering dirt that can carry bacteria.\nNah. They look clean to me.\nNo way! I like my fruits and vegetables natural.\n\nAnswer: Yes. B, of course. Rinsing with cold water cleans off dirt and other contaminants. But don’t wash them with detergents or soap, even dishwashing soap. You could end up eating residues from those cleaners if they’re absorbed by fruits and vegetables.\nWhy should you keep raw meats and meat products separated from fruits and vegetables when cutting them up or preparing them?\n\nVeggies can make your meat taste weird. Just weird.\nKeep them together. Juice from meats is called “marinade.”\nYou know, meats and fruits and vegetables really don’t trust each other. It could end badly.\nBecause raw meats, meat products and blood can carry bacteria like E. coli and salmonella that can contaminate fruits and vegetables — and make people sick.\n\nAnswer: The correct answer is D. Cross-contamination is one of the most common causes of food-borne illness, according to the USDA. That is, the transfer of harmful bacteria from one food, particularly raw meats, poultry and shellfish to other foods. When preparing food, you need to keep raw meats and their juices away from fruits and vegetables and all ready-to-eat foods.\nNote: If you can, use separate cutting boards for meats and produce. If you can’t use separate cutting boards, wash yours with hot, soapy water after using them on raw meats and before using them to cut fruits and vegetables. Or use your cutting board to chop vegetables first, then use it to prepare your uncooked meat, then wash it with hot, soapy water.)\nWhat is the Danger Zone? And what does it have to do with Thanksgiving dinner?\n\nIt’s that great song from “Top Gun: Maverick”!! (Thank you, Tom Cruise for making this joke relevant again 36 years after the original Top Gun.) “Highway to the DANGER ZONE! Riiiide in—to the DANGER ZONE!”\nIt’s that distance you have to walk—through kids, over toys, past the pets and without tripping on the rippled carpet—to get your Thanksgiving feast from the kitchen to the table. Without. Dropping. A thing.\nIt’s the range of temperatures between 41 degrees Fahrenheit and 135 degrees Fahrenheit—the temperatures where bacteria can grow like crazy in foods, doubling in number in as little as 20 minutes.\n\nAnswer: C; it’s C. Top Gun is cool. But the real “Danger Zone” is the range of temperature between 41 degrees and 135 degrees Fahrenheit that allows bacteria to breed exponentially—not a good thing. If hot foods cool or cold foods heat up enough to enter that zone, your food can become a bacteria-fest. And you, your family and friends can end up getting sick. So keep hot foods safely heated with chafing dishes, preheated steam tables, warming trays, slow cookers and ovens. Place cold foods in containers on ice, or in the fridge. And refrigerate leftovers as soon as you can, but definitely within two hours.\nAnd finally, we end with an age-old bonus question!\nIs the “five-second rule” real? Can you eat something you’ve dropped on the floor if you pick it up in less than five seconds?\n\nOf course it is. Just pick it up quick and blow on it. Nothing can contaminate your food in less than five seconds. My dogs eat everything off the floor and they never get sick!\nTrick question. It’s “less than” five—so, four seconds…\nNo. It is NOT real. You really shouldn’t eat anything you’ve dropped on floor.\n\nAnswer: C. Eating food off the floor is OK for the dogs, but NOT people. Truth is, almost any contact is long enough for food to be contaminated by bacteria that can be found on the ground or in your house. According to the USDA and Rutgers University, bacteria can transfer from a surface to food in less than one second!\nSo there you have it. Now you’re an expert. But if you’re still interested, you can get more information about food safety tips at FoodSafety.gov’s “Food Safety by Types of Food” webpage, or by calling the USDA’s Meat and Poultry hotline at 1-888-674-6854.\nNow you’re cooking! Be safe. Cook safe. And have a great Thanksgiving!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221117.08.24.32"}