{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Honors 17 Public Health Champions", "description": "San Diego County’s Health and Human Services Agency honored 17 people and organizations Monday as Public Health Champions for their work in advancing public health and protecting and promoting the health and safety of San Diegans.", "datePublished": "2023-04-03T14:37:04-07:00", "url": "https://www.countynewscenter.com/county-honors-17-public-health-champions/", "keywords": ["health", "public health", "public health champions"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-04-03T16:01:07-07:00", "articleType": "article", "articleContent": "\nSan Diego County’s Health and Human Services Agency honored 17 people and organizations Monday as Public Health Champions for their work in advancing public health and protecting and promoting the health and safety of San Diegans.\nThe Agency’s 2023 Live Well San Diego Annual Public Health Champion Awards Ceremony coincided with National Public Health Week. The annual observance is an initiative of the American Public Health Association and runs from April 3 to April 9 this year.\nMonday’s gathering marked the first in-person celebration of the event since the start of the COVID-19 pandemic in 2020.\nCounty Board Chairwoman Nora Vargas, Health and Human Services Agency (HHSA) Director Nick Macchione and County Public Health Officer Wilma J. Wooten, M.D., M.P.H., hosted the event.\nSome of the award winners included state Senate Toni G. Atkins D-San Diego; City of San Diego Mayor Todd Gloria; Tamera Kohler, Chief Executive Officer of the Regional Task Force on Homelessness and Hala Madanat, Vice President for Research and Innovation at San Diego State University.\nThe 17 winners honored were people or organizations in San Diego County for their outstanding contributions in preventing disease or injury and promoting public health. The awards included Director’s Awards; Public Health Services Awards for individuals and organizations; and Aging and Independence Services and Regional Awards.\nIt was the 22nd year the County presented the awards that embody the Health and Human Services Agency’s efforts to promote healthy, safe and thriving communities.\nDirector’s Awards\nToni G. Atkins, state senate president pro tempore\nSen. Atkins has served as the state senate’s president pro tempore since 2018. She also served as the speaker of the California state assembly from 2014 to 2016, and as a councilmember on the San Diego City Council from 2000 to 2008.\nTodd Gloria, Mayor of San Diego \nGloria has served as the City of San Diego’s mayor since 2020 and has spent years on both the San Diego City County and in California Assembly. As mayor, Gloria has focused on issues including solving homelessness, the housing crisis, housing affordability, public transportation and climate change.\nHala Madanat, Ph.D., M.S., San Diego State University\nDr. Madanat is the vice president for research and innovation at San Diego State University (SDSU) and core-investigator of Institute for Behavioral and Community Health. A professor of health promotion and behavioral science, Madanat leads the SDSU/UC San Diego Comprehensive Cancer Partnership and is the evaluation lead of the San Diego Alzheimer’s-related resource centers for minority aging research. Her research addresses health disparities. During the COVID-19 pandemic, Madanat co-led a $5.5 million contact tracing program funded by the County HHSA, aimed at enhancing support in underserved communities and curbing the spread of the novel coronavirus.\nTamera Kohler, Regional Task Force on Homelessness\nKohler is the chief executive officer of the Regional Task Force on Homelessness. She has 19 years of senior leadership roles in state and local government, specializing in poverty and homelessness, nonprofit and mortgage lending experience, including spending more than eight years helping lead nationally noted homelessness reduction programs in the State of Utah.\nPaul Sisson, San Diego Union Tribune\nSisson covers health care for The San Diego Union-Tribune. He is a member of the Association of Health Care Journalists. In 2021, the San Diego chapter of the Society of Professional Journalists named Sisson the San Diego Journalist of the Year for his comprehensive coverage of the COVID-19 pandemic in San Diego County, including the virus, treatment and vaccinations.\nMatt Hoffman, KPBS\nMatt Hoffman is KPBS’ health reporter and covers a variety of health-related stories in the region. He is also the host of “KPBS Roundtable” a weekly half-hour show that features local journalists talking about the big stories affecting the San Diego region.\nPublic Health Services Awards\nSan Diego LGBT Community Center\nCreated in 1972, the San Diego Lesbian, Gay, Bisexual, and Transgender (LGBT) Community Center is one of the oldest and largest LGBT community centers in the nation. The center’s main goals are promoting LGBT health and human rights. It has provided HIV services for nearly 40 years and was a key stakeholder and community leader that worked with the County during the monkeypox health emergency. It took early steps to protect and educate the community and provided a safe space for people to get emotional support. It also partnered with the County to provide community-focused sites for nearly 1,400 people to get vaccinations.\nAnthony N. DeMaria, Sulpizio Cardiovascular Center\nDr. DeMaria is the Judith and Jack White Chair in Cardiology and founding director of the Sulpizio Cardiovascular Center at UC San Diego and has devoted his 25-year career to the prevention and treatment of cardiovascular disease. As a Professor of Medicine at UCSD, he has trained many physicians who have gone on to distinguished careers in cardiology and, as an esteemed researcher, has over 700 publications about cardiovascular science and serves on numerous editorial boards. He has been an inspiration to clinicians, public health professionals, and community partners for more than a decade.\nCathryn Nacario, National Alliance on Mental Illness San Diego\nNacario is the chief executive officer of National Alliance on Mental Illness San Diego, one of the alliance’s largest affiliates, and has more than 40 years of promoting and protecting the health of County residents. Nacario leads a team of more than 150 employees who operate 25 programs in 13 locations that provide free, top-rated mental health programs and resources. Nacario is a leader and forceful local and national advocate to help people who live with behavioral health problems.\nEric Paredes Save A Life Foundation\nThe Eric Paredes Save A Life Foundation focuses on preventing sudden cardiac arrest in young people―the only such organization in San Diego County and part of a national movement to address this issue through education, awareness and action. The foundation’s free prevention programs have been helping students, parents, teachers, teams and medical professionals understand the issue and take action to keep it from happening for more than a decade.\nAging and Independence Services and Regional Awards\nCarrie McClellan, Aging Well\nMcClellan has been actively involved in many of County Health and Human Service’s Age Well theme teams, offering her expertise on older adult issues as well as support for the County’s Aging Roadmap, programs and initiatives. In mid-2022, McClellan volunteered to facilitate both the San Diego Community Action Network and the East County Community Action Network and continues to serve as the interim facilitator.\nEpiscopal Community Services Paras Las Familias\nEpiscopal Community Services’ Para Las Familias is an outpatient behavioral and mental health clinic serving families in the South Region of San Diego County. The program provides outpatient bicultural and bilingual therapy services to children and their families in low-income communities. Services include screenings, family and group therapy, teacher/provider consultation, school observation, and parenting groups. Through the program and its expansion, ECS has improved the accessibility of behavioral and mental health services that have a positive impact on the bond between children and their families.\nTransFamily Support Services\nKathie Moehlig, a certified life coach, ordained minister, support group leader and parent advocate for her transgender son, founded the nonprofit TransFamily Support Services in 2015. The nonprofit provides individual and family coaching to help acceptance and support; helps with healthcare and insurance issues; helps families navigate the legal system; and advocates for resources and support at schools for transgender and gender-nonconforming youth and their families. TransFamily Support Services’ vision is “A world where ALL genders are accepted & treated EQUALLY.”\nGraciela Moreno, Palomar Family Counseling Service\nMoreno is a case manager at Palomar Family Counseling Service, Inc., which has offices in Escondido, Fallbrook and Vista. Moreno goes above and beyond to help her “kinship families” and Grandparents Raising Grandchildren (GRG) families, not only linking them with support and resources, but hosting events on improving caregiver’s health and wellness.\nBeatriz Villareal, Mano a Mano Foundation\nVillareal is the founder and director of the Mano a Mano Foundation, a nonprofit that provides support and education to the Latino community. The foundation offers a range of conferences on numerous educational topics. They work closely with UC San Diego, San Diego State University and San Marcos State University and produce free educational videos for the community addressing topics that affect the Latino Community, such as teen pregnancy prevention, gang awareness, sexual abuse, sex trafficking, and truancy.\nRose Ceballos, Bayside Community Center\nCeballos is the director of programs and operations at the Bayside Community Center, an independent 90-year-old, nonprofit, neighborhood-based organization that serves people in Linda Vista. The center provides social services, educational opportunities and advocacy efforts to empower people and create abundant lives.\nJoyce Moore, Thrive Lemon Grove\nMoore is president of Thrive Lemon Grove, a proactive, community-based, multi-sector group dedicated to working in partnerships to advance public health and safety initiatives to raise the quality of life in Lemon Grove. Moore is a youth advocate and inspirational leader who loves working in underserved communities and advocating for policy changes to improve public health and safety.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230403.14.37.04"}