{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Issues Proclamation in Anticipation of Tropical Cyclone Hilary Impacts", "description": "The County of San Diego is proclaiming a local emergency on behalf of Chairwoman Nora Vargas and the Board of Supervisors in anticipation that resources and assistance from the state and federal governments may be needed as a result of Tropical Cyclone Hilary.", "datePublished": "2023-08-20T12:11:45-07:00", "url": "https://www.countynewscenter.com/county-issues-proclamation-in-anticipation-of-tropical-cyclone-hilary-impacts/", "keywords": ["government", "emergency proclamation", "hilary", "storm", "tropical cyclone"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2023-08-20T12:11:45-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is proclaiming a local emergency on behalf of Chairwoman Nora Vargas and the Board of Supervisors in anticipation that resources and assistance from the state and federal governments may be needed as a result of Tropical Cyclone Hilary. A local proclamation is our way of communicating to the state that we are anticipating significant impacts to both public and private property.\n“The County wants residents to take this storm seriously, to recognize the potential severity, and to follow the guidance of local first responders. We urge everyone to register for AlertSanDiego.org and download the SD Emergency mobile app to receive emergency notifications, updates and preparedness information, like a personal disaster plan and go-kit in case of evacuation,” said Board of Supervisors Chairwoman Nora Vargas.\nThe County’s proclamation follows Governor Gavin Newsom’s proclamation earlier today of a state of emergency for much of Southern California to support Hurricane Hilary response and recovery efforts. The County’s Emergency Operations Center continues to monitor conditions and coordinate among County departments, with cities, and responders in the days leading up to the storm’s arrival to prepare the region.\nGet the latest updates on storm conditions, response and preparedness at AlertSanDiego.org.\nProclamation attached here: Tropical Cyclone Hilary_Proclamation of Local Emergency_19 AUG 2023\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230820.12.11.45"}