{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Joins in Breaking Ground on Affordable Housing in Carlsbad for Families", "description": "The County of San Diego joined multiple partners today in breaking ground on a 70-unit affordable housing development for families in Carlsbad. ", "datePublished": "2023-04-26T17:01:37-07:00", "url": "https://www.countynewscenter.com/county-joins-in-breaking-ground-on-affordable-housing-in-carlsbad-for-families/", "keywords": ["housing", "groundbreaking", "hcds", "housing"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-04-26T17:01:37-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego joined multiple partners today in breaking ground on a 70-unit affordable housing development for families in Carlsbad. \n\nThe $36 million Aviara Development will provide housing for low-income families, with 1-3 bedroom floorplans. The County Housing and Community Development Services Department invested $1.3 million through its HOME Investment Partnerships Program which is designed to increase affordable housing for low-income households. \n“Partnering to build affordable housing is more important than ever, across our entire region,” said Nick Macchione, director of Health and Human Services. “Last week we opened affordable housing for families in San Marcos on Thursday, and broke ground on a downtown midrise for seniors Friday. The County is creating and preserving affordable housing at a pace I’ve not seen in my career, and it’s exciting to be part of keeping that momentum.”  \nAviara is a development of Bridge Housing. Information on how to sign up for updates on the development, including when a waiting list will be established, is available on the nonprofit builder’s website. \n\nSan Diego County Housing and Community Development Services provides affordable housing opportunities to more than 40,000 people each year, through various housing programs and affordable housing efforts. Since 2017, the County has invested more than $240 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund. Efforts since then have resulted in the opening of 1,125 new units with an additional 3,144 units on the way. When upcoming developments are complete, the total number of affordable units supported by the County will reach nearly 7,600, providing homes to more than 16,700 people.  \nThese and other endeavors are part of the County’s ongoing response to the region’s housing affordability crisis. Efforts also are underway at the County to create a roadmap, or Housing Blueprint, to guide our ongoing response. Community input remains vital to the County’s efforts to address the crisis to date. People are encouraged to review the Housing Blueprint to help inform final recommendations for its goals and objectives before it is presented later this year to the Board of Supervisors.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230426.17.01.37"}