{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Selects Local Projects for $21 Million in Grants to Improve Air Quality", "description": "The Air Pollution Control District has selected projects from 49 organizations to receive $21.3 million in grants that would keep 692 tons of climate-changing, greenhouse gas and pollution — roughly the weight of six space shuttle spacecraft — out of local skies.", "datePublished": "2020-08-12T10:30:39-07:00", "url": "https://www.countynewscenter.com/county-selects-local-projects-for-21-million-in-grants-to-improve-air-quality/", "keywords": ["environment", "air quality", "clean air for all", "portside neighborhoods", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-08-12T10:48:59-07:00", "articleType": "article", "articleContent": "\nThe County’s Air Pollution Control District has selected projects from 49 organizations to receive $21.3 million in grants that would keep 692 tons of climate-changing, greenhouse gas and pollution — roughly the weight of six space shuttle spacecraft — out of local skies.\nThe grants, part of the County’s Clean Air for All campaign, will reimburse the selected businesses, local governments, schools and utilities for swapping out high-polluting, heavy-duty equipment for low-polluting or zero-polluting vehicles, boats and machinery.\nThe District has notified all the organizations that their projects have been selected to receive the grants funded by California’s Air Resources Board and Department of Motor Vehicles. All the organizations must still sign contracts to start their projects; seven of the projects must still receive final approval from the California Air Resources Board. The organizations are reimbursed once their projects are completed.\nDistrict officials estimate that if all 138 selected projects are completed they would improve local air quality over their lifetime by preventing the emission of 562.5 tons of nitrogen engine emissions (NOx), 103.5 tons of Reactive Organic Gases (ROG) that affect ozone production; and 26.1 tons of diesel particulate matter (PM), small particles of carbon like soot.\nA list of the selected projects can be seen on the District’s website.\nMost of the grant money, roughly $14.3 million, is targeted to help the County’s Portside Environmental Justice Neighborhood communities and projects from other state-designated disadvantaged communities. Those include the Portside communities of Barrio Logan, Logan Heights, Sherman Heights and western National City, and El Cajon and San Ysidro.\nThe Portside Environmental Justice Neighborhood was one of the first 10 such neighborhoods to be selected by the California Air Resources Board to be part of its Community Air Protection Program. That program provides special funding for neighborhoods that are disproportionately harmed by air pollution because they’re near ports, shipping, freeways, rail yards, freight, warehouses and industries. The Air Resources Board created its program in response to California’s 2017 passage of Assembly Bill 617, which aimed to help local communities threatened the most by air pollution.\nSome of the selected Portside and disadvantaged communities’ projects include truck, school bus, port equipment and marine replacements.\nThe remaining $6.98 million in grants come from a mixture of state air quality improvement funds and will primarily be spent to upgrade off-road vehicles, agricultural equipment and marine equipment for 36 organizations.\nFor more information about the Air Pollution Control District go to its website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200812.10.30.39"}