{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Prioritizing Prevention During Child Abuse Awareness Month", "description": "In observance of Child Abuse Prevention Month, a beautiful pinwheel garden was on display during a press conference today in the Waterfront Park. 400 pinwheels were placed in the lawn to represent the 400 investigations weekly of children in San Diego County who may be victims of child abuse and neglect.", "datePublished": "2024-04-23T17:18:09-07:00", "url": "https://www.countynewscenter.com/prioritizing-prevention-during-child-abuse-awareness-month/", "keywords": ["health", "child abuse and neglect", "child abuse prevention month", "child and family well-being", "pinwheels", "promises2kids"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-04-24T08:37:45-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteIn observance of Child Abuse Prevention Month, a beautiful pinwheel garden was on display during a press conference today in the Waterfront Park. 400 pinwheels were placed in the lawn to represent the 400 investigations weekly of children in San Diego County who may be victims of child abuse and neglect. Approximately fifteen percent of those investigations become active cases.  \nChairwoman Nora Vargas, Promises2Kids and the County’s Child and Family Well Being Department teamed up for the annual event to raise awareness about child safety, early intervention and the importance of families and communities working together to protect our children.  \nDuring 2022-2023, the child abuse hotline received over 39,000 calls to report possible abuse and neglect. More than 20,000 of those reports were investigated. Child abuse and neglect can cause long-term psychological, emotional, and physical effects that have lasting consequences for victims.  \nThe County’s Child and Family Well Being Department is changing the way children, youth and families are supported so they can be successful. Through partnerships and strong relationships, prevention is the priority. The hope is that early intervention, education and easy access to critical resources will keep families together and stop children from ever needing to enter the child welfare service system. \nChild abuse and neglect are preventable. If you believe a child you know is experiencing abuse or neglect, contact the County’s Child Abuse Hotline at 858-560-2191 or 800-344-6000. You can also call 2-1-1 San Diego. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240423.17.18.09"}