{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Paves Way for Future of San Pasqual Academy", "description": "The County Board of Supervisors voted Tuesday to sustain the future of San Pasqual Academy and expand the services provided at the residential education campus for foster youth.", "datePublished": "2022-01-25T17:09:04-08:00", "url": "https://www.countynewscenter.com/board-paves-way-for-future-of-san-pasqual-academy/", "keywords": ["families", "foster youth", "resource families", "san pasqual academy"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-01-25T17:09:04-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted Tuesday to sustain the future of San Pasqual Academy and expand the services provided at the residential education campus for foster youth.\nThe State of California had directed the County to close the group home located in the San Pasqual Valley near Escondido by the end of last year, but a San Diego Superior Court judge placed an injunction on the closure in December, allowing the campus to continue operating for the foreseeable future.\nThe plan approved by the Board today will allow the campus to maintain existing services for current students while adapting to changing guidance and regulations from the state.\nThe Board’s actions let the academy transition to a continuum of care multipurpose campus. It will be able to keep its existing group home license while extending its services to a wider population of youths, including temporary shelter care for foster youths needing emergency or temporary care.\nUnder the proposed changes, the campus will seek to create onsite family homes, or resource family homes, where youths would live in a homelike environment with several of their peers and one or multiple resource parents. Resource parents are specifically trained to care for youths in the foster care system.\nThe new plan would also establish transitional housing for current and former foster youths ages 18-24 and allow them to learn self-sufficiency skills in a safe environment. Furthermore, the campus would be able to offer educational, career readiness, mentoring, physical and mental health services to all youths entering the facility and throughout their length of stay.\nOnce fully operational, the proposed initial stage of the new plan would enable the academy to serve up to 116 youths and eight alumni households. The campus would maintain about 80 beds in the existing education-based residential group home setting and would create an additional 36 beds in resource family home settings.\nSan Pasqual Academy is a public-private partnership between the County of San Diego, New Alternatives, Inc., San Diego County Office of Education, and Access, Inc. Since the campus opened in 2001, more than 425 students have graduated from the on-site high school and the academy is considered a national model for guiding foster youth on a path toward success.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220125.17.09.04"}