{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "100 Affordable Housing Units Coming to San Marcos", "description": "One hundred more affordable housing units for low-income people and families are coming to San Marcos, thanks to the County and Affirmed Housing.", "datePublished": "2022-02-01T11:26:55-08:00", "url": "https://www.countynewscenter.com/100-affordable-housing-units-coming-to-san-marcos/", "keywords": ["housing", "affordable housing", "alora", "hud", "innovative housing trust fund", "san marcos"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-02-01T12:52:18-08:00", "articleType": "article", "articleContent": "\nOne hundred more affordable housing units for low-income people and families are coming to San Marcos, thanks to the County and Affirmed Housing.\nA groundbreaking was held today for Alora, a nearly $40 million complex at 604 Richmar Ave. The project includes the demolition of 40 older units which are being replaced by 100 one-, two- and three-bedroom apartments for families earning 30-80% of area median income.\n“The loss of affordable units, coupled with the continuously rising rents, is creating housing instability for thousands of San Diegans across the region,”said David Estrella, director of Housing and Community Development Services at the County Health and Human Services Agency. “It is very important, now more than ever, that the County take significant steps to preserve and create affordable housing opportunities throughout the region. And Alora is a significant step in this effort.”\nThe four, 3-story walk-up buildings will have laundry rooms, a pool, community room, tot lots and 171 parking spaces. Alora is expected to open in summer 2023.\n\nAlora’s funding includes $6.25 million from the County’s Innovative Housing Trust Fund and funding from the U.S. Department of Housing and Urban Development. The development will remain affordable in the community of San Marcos for 99 years, ensuring that the residents have an opportunity for safe affordable housing.\nThe Innovative Housing Trust Fund was established by the County to provide gap financing for developments that create or preserve affordable housing. To date, the $50 million invested in the fund has leveraged $567 million in other public and private funds to create and preserve 1,397 permanent affordable housing units within 20 developments in 15 communities throughout San Diego County. In Aug. 2021, the Board of Supervisors increased funding by $20 million for a total of $70 million.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220201.11.26.55"}