{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Parents Opening Home to Children in Foster Care Hope to Inspire Others", "description": "A couple who have been resource parents for the County of San Diego for 17 years shares why they continue to open their home to youths in foster care.", "datePublished": "2021-05-27T12:15:51-07:00", "url": "https://www.countynewscenter.com/parents-opening-home-to-children-in-foster-care-hope-to-inspire-others/", "keywords": ["families", "foster care", "resource families"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-05-27T12:15:51-07:00", "articleType": "article", "articleContent": "\nFor Rita and Juan Mejia, opening their home to children in foster care has been a lifelong passion. Over the course of 17 years, the couple have provided care to dozens of children for the County of San Diego.\nBut for Rita the commitment to caring for children in foster care started long before she and her husband became what is known as resource parents. Rita’s mother was a resource parent for more than 20 years and Rita often helped drive the children to appointments or activities.\nRita enjoyed the experience so much that she and Juan decided to start their own journey as resource parents in 2004. Since then, they have cared for 70 children of all ages and they’re not thinking of quitting anytime soon.\n“I stay in touch with almost all of our foster children and it gives me so much joy to see them succeed,” Rita said. “A lot of them regularly visit or call, some of them now have families of their own and have brought over their children for dinner so we could meet them.”\nToday, Rita and Juan have five children in their care. The children’s ages range from 4 to 12 years old. While no one day is like the other, especially in the last year of COVID-19 restrictions, they love the variety the children bring into their lives.\n“During the week the children are all doing virtual learning and we help them with their classes and homework,” Rita said. “On the weekends we like to take the kids to the beach or to SeaWorld. We really want our foster children to feel like they’re part of the family, so we make sure we give them some of the experiences our own three kids had when they were growing up.”\n“Many foster children lack a strong support system and foster families can make such a huge difference for those kids,” Juan said. “To me and my wife, the love these children give is the best gift anyone could ask for.”\nThe County of San Diego is always looking for new parents willing to open their home to a child or teen. Getting started is easy and the County offers orientation meetings on an ongoing basis to help families who are interested in fostering determine if they are a good fit.\nTo learn more about becoming a resource parent, visit sdcares4kids.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210527.12.15.51"}