{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Sheriff’s Dogs Trained to Sniff Out Bombs, Guns", "description": "Four new dogs trained in detecting explosives and firearms are now on duty with the K-9 Unit of the San Diego County Sheriff’s Office.", "datePublished": "2024-08-26T16:34:42-07:00", "url": "https://www.countynewscenter.com/new-sheriffs-dogs-trained-to-sniff-out-bombs-guns/", "keywords": ["public safety", "k-9 unit", "san diego county sheriff s department"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-08-26T16:35:43-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesFour new dogs trained in detecting explosives and firearms are now on duty with the K-9 Unit of the San Diego County Sheriff’s Office.\nK-9s Archer, Bear, Dexter and Nalla are exclusively trained in detecting explosives and firearms. They are a regional resource which means they can answer calls from other law enforcement agencies to keep San Diego County safe.\nThe Explosives Detection K-9s completed a ten-week academy and undergo testing and routine training to ensure their skills remain sharp.\nMeet Archer, he works with Deputy Jovonni Silva.\nTheir specialized roles make them essential in large crowd situations like concerts, sporting events, festivals, parades, airports, transportation hubs, dignitary visits, active shooter incidents and other high-risk scenarios. They can detect even the slightest traces of explosives materials and gun powder, providing a critical layer of protection in our communities.\nDeputy Thomas Nelson shows off his explosives detecting K-9., Nalla.\nAll the dogs are a year old. The yellow and red Labrador Retrievers each cost around $6,500. The non-profit organization Honorary Deputy Sheriff’s Association funded the purchase of the dogs and contributed an additional $12,000 for specialized equipment.\nDexter waits for information or a command from Deputy Darryl Patmon.\nThe Sheriff’s K-9 Unit was established in 1967. It has a total of 28 dogs. They are trained in protection, article searches, tracking suspects or evidence, firearms, explosives and drug detection. To become a K-9 handler, a deputy must have at least two years of experience working in patrol, detentions or courts. The deputy handler and K-9 must pass an academy and required to complete yearly certifications in each specialty. Learn more about our K-9 Unit. To apply as a deputy, visit joinsdsheriff.net.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240826.16.34.42"}