{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Campaign Aims to Save Black Babies, Mothers", "description": "Black infants in San Diego County are three times more likely to die at birth and 60% more likely to be premature than white infants.", "datePublished": "2021-01-28T16:35:47-08:00", "url": "https://www.countynewscenter.com/county-campaign-aims-to-save-black-babies-mothers/", "keywords": ["health", "black babies", "black legacy now", "black moms", "perinatal equity initiative"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-28T16:54:53-08:00", "articleType": "article", "articleContent": "\nBlack infants in San Diego County are three times more likely to die at birth and 60% more likely to be premature than white infants.\nTo continue to drive these numbers down, the County Health and Human Services Agency (HHSA) today launched Black Legacy Now, an education and outreach campaign to improve health outcomes for Black babies and their mothers in the region.\nThe new campaign supports the County’s Perinatal Equity Initiative, which is being funded with a $1.45 million grant from the California Department of Public Health to reduce racial bias to improve birth and maternal health outcomes for Black families. The initiative’s goals are to:\n\nAddress the causes of persistent inequality and identify best practices\nPromote the use of specific interventions designed to fill gaps in current programming\nProvide funding to County health departments to promote leadership and coordination for widespread and lasting change in public awareness\n\nBlack mothers in California are more than three times more likely to die due to pregnancy and delivery complications than white mothers, according to the Centers for Disease Control and Prevention. These health outcome disparities persist regardless of factors, such as the mother’s income or education.\n“These disparities are unjust, inexcusable and cannot be allowed to persist,” said Chair Nathan Fletcher, County Board of Supervisors. “Racism is a significant threat to the health and vitality of our community and none of us can stand idly by while babies and mothers continue to die.”\nBlack Legacy Now aligns with Live Well San Diego, the County’s vision of healthy, safe and thriving residents and communities. The campaign is bringing together San Diego County’s top health care, government, public policy and maternal and infant health experts to address these disparities and create concrete plans for reducing systemic bias and improving health outcomes for Black families in San Diego County.\n“While it is often said, ‘it takes a village to raise a child’, it will take each and every one of us to stand up to long-standing inequities,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The first step is education, followed by community-wide action. This launch is the first step in what will be a long-term campaign focused on driving real, measurable change for Black families in San Diego County.”\nDr. Kelly Elmore, Perinatal Equity Initiative Community Advisory Board member and board-certified OB/GYN, outlined potential changes for local health care systems including:\n\nStandardization of maternal and infant care protocols for physicians and patient education\nAn increase in remote patient monitoring for new parent support\nIncorporating mental health counseling into routine post-partum care\nUpdates to patient discharge instructions to provide new mothers with simple instructions and tips for knowing when to seek medical help\nIncreased access to alternative birthing centers and midwifery\n\n\nHHSA already funds the San Diego County Black Infant Health Program, which offers social support, stress management and empowerment through prenatal/postpartum groups and one-on-one sessions— to help women to understand their risks and try to reduce them. Additionally, PEI supports a Fatherhood Initiative for soon-to-be fathers and fathers with an infant up to 1 year of age and whose partner is Black, as well as implicit bias training for medical providers to improve services for Black pregnant and parenting women.\nVisit www.blacklegacynowsd.com to get the facts, Know Your Rights, and commit to action by advocating for Black women, babies and families in San Diego.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210128.16.35.47"}