{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccination Sites Open in Del Mar, San Marcos", "description": "Two new COVID-19 vaccinations sites are coming to Del Mar and San Marcos.", "datePublished": "2021-02-11T17:14:07-08:00", "url": "https://www.countynewscenter.com/covid-19-vaccination-sites-open-in-del-mar-san-marcos/", "keywords": ["health", "coronavirus", "covid-19", "del mar", "super station", "vaccination"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-12T09:20:51-08:00", "articleType": "article", "articleContent": "\nTwo new COVID-19 vaccination sites are coming to Del Mar and San Marcos.\nA vaccination super station will open Feb. 12 at the Del Mar Fairgrounds, 2260 Jimmy Durante Blvd. The drive-up and walk-up site, operated by Scripps Health, will be open from 9 a.m. to 1 p.m. Friday and 8 a.m. to noon on Saturday and Sunday and can ramp up to deliver 5,000 doses daily. Appointments are required.\nThe COVID-19 vaccination site in San Marcos is now immunizing seniors 65 years of age and older, especially those who do not have access to a computer or someone to assist them.\nWhen fully operational, the site will be offering about 500 doses daily from 7 a.m. to 5 p.m. Monday through Friday. The clinic is located at 1706 Descanso Ave. in San Marcos and requires appointments which can only be made by calling 2-1-1 San Diego. This San Marcos clinic will be open Monday through Friday from 7 a.m. to 5 p.m., including holidays.\nThe clinic is a public-private effort between the Gary and Mary West Foundation, West PACE, the Gary and Mary West Senior Dental Center, West Health, the County of San Diego, City of San Marcos and 211 San Diego.\nAll County vaccination super stations and points of dispensing, or PODs, are currently vaccinating people in Phase 1A – mostly health care workers – and people 65 years and older in Phase 1B. All require appointments which can be made at vaccinationsuperstationsd.com.\nHow to Request Second Dose Appointment\nIf you were not able to schedule the second dose appointment at the time you scheduled or received your first, you should get an email on how to schedule your second dose within five days of the due date.\nIf you don’t get the email five days before your due date, you can complete a form with 2-1-1 San Diego, so that they can schedule your second appointment.\nBefore you do that, please make sure you have checked all your email folders, including your junk/spam folder, before submitting a request through the form.\nAlso, County-funded community health workers, known as promotoras, will be reaching out to people 65 and older in National City, Chula Vista, Imperial City and San Ysidro directly to help them make vaccination appointments.\nThe Metropolitan Transit System is offering free rides to people with proof of a vaccination appointment. 2-1-1 San Diego and promotoras also have the capacity to arrange for transportation.\nAn older man gets his COVID-19 vaccine at County Oceanside clinic.\nTo date, more than 703,000 COVID-19 doses have been delivered to the region. Of those, nearly 551,000 have been administered, including more than 95,000 San Diegans who are fully vaccinated and 15.5 percent of the population over age 16 who have received at least one dose. More information about vaccine distribution can be found on the County’s vaccination dashboard.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 34.2 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 9.1%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 12.1% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers, but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 16.\n\nCommunity Setting Outbreaks:\n\n17 community outbreaks were confirmed Feb. 10: 10 in business settings, two in faith-based settings, one in a hotel/resort/spa, one in a restaurant setting, one in a government setting, one in a retail setting and one in a healthcare setting.\nIn the past seven days (Feb. 4 through Feb 10), 76 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n21,356 tests were reported to the County on Feb. 10, and the percentage of new positive cases was 5%.\nThe 14-day rolling average percentage of positive cases is 6.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,738.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n1,113 cases were reported to the County on Feb. 10. The region’s total is now 249,974.\n11,193 or 4.5% of all cases have required hospitalization.\n1,532 or 0.6% of all cases and 13.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n51 COVID-19 deaths were reported Feb. 10. The region’s total is 2,955.\n33 men and 18 women died between Dec. 14 and Feb. 10.\nOf the 51 new deaths reported today, 19 people who passed away were 80 years or older, 14 people were in their 70s, nine people were in their 60s, five people were in their 50s, two people were in their 40s and two people were in their 20s.\n47 had underlying medical conditions, two did not and two had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210211.17.14.07"}