{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Receives National Recognition for 54 Programs", "description": "The County of San Diego won 54 Achievement Awards this year for standout programs from the National Association of Counties, which recognizes excellence in county government.", "datePublished": "2023-06-06T10:00:11-07:00", "url": "https://www.countynewscenter.com/county-receives-national-recognition-for-54-programs/", "keywords": ["government", "awards", "naco"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-06-06T14:45:44-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego won 54 Achievement Awards this year for standout programs from the National Association of Counties, which recognizes excellence in county government.\nThe County won awards in 15 categories including county resiliency, human services, information technology, health, community and economic development, criminal justice and public safety, children and youth, risk and emergency management, and civic education and public information.\n“I am proud of our county employees that show up every day to meet the needs of our communities. This is a well-deserved recognition of the work we are doing and the high standard we strive for in delivering services and resources in San Diego County.” Board of Supervisors Chairwoman Nora Vargas said. “I am especially proud that many of the programs recognized reflect our commitment to transformational work that puts equity and inclusivity at the forefront. I see you and celebrate you! ¡Enhorabuena!”\nFeatured below are just providing a small sample of how the County is responding to emerging issues and priorities.\nThe County’s yearly online report highlights the County’s accomplishments and goals to deliver essential services, and use funds responsibly for health and social services, public safety and land use.  The interactive, engaging and accessible report, produced by the County Communications Office, invited the public to “Connect With Us to Build a Better Future” and focused priority projects that the public can help shape and influence through community engagement.\nA new policy developed by the Health and Human Services Agency requiring daily document translation services and culturally responsive communications was expanded to include all departments and is helping the County reach people who did not previously have access to information.\nA new tool developed by the Office of Sustainability and Environmental Justice called StoryMap allows people to go online and express the environmental health concerns they see in neighborhoods. This information is layered with socioeconomic data such as race and income using mapping tools. This combined information better guides planning, advocacy and education in communities.\nIn support of San Diego’s diverse region and new arrivals, the San Diego Sheriff’s Department collaborated with the International Rescue Committee, a resettlement agency, to create and provide “What to Expect” monthly public presentations for refugee newcomers in their native languages. The presentations are focused on basic public safety education and creating an environment of inclusivity for newcomers.\nThe full list of programs that won 2023 Achievement Awards is below:\n\nComprehensive Broadband Plan\n$10 Million Capital Emergency Housing Solutions Grant Program\nA Systems-Focused Approach to Enhancing Behavioral Health Care\nApiary Training Video\nBeach & Bay Program DDPCR Testing\nBridging the Digital Divide to Promote Social Inclusion\nCareer Days: Information Sessions Series – HHSA HR The Knowledge Center\nCommunity Care Coordination Straight to Home Program\nCommunity Harm Reduction Team and Harm Reduction Interim Shelter\nCommunity Health Worker Model: A Pathway to Equity\nCompassionate Leadership Toolkit and Workshop – HHSA HR The Knowledge Center\nCooperative Grant for Removal of Trees Infested with Fusarium Fungus and ISHB\nCrisis Stabilization Unit Services\nDetector Dog Team Training Innovations\nDeveloping the San Diego Native Landscape Program to Foster Environmental Stewardship\nEmail Encryption Training – HHSA HR The Knowledge Center\nEmergency Operations Center Playbook\nExperience the Outdoors Program\nGreen Streets Clean Water Plan\nGuns for Gift Cards\nHHSA New Supervisor Onboarding – HHSA HR The Knowledge Center\nHomeless Pop-Up Resource Fairs\nHousing and Disability Advocacy Program\nIldica County Park\nIncorporating Equity into A Local Roadway Safety Plan\nIntegrated Pest Management Rodenticide Pilot\nJustice-Involved Parents & Children Program\nLet’s Get Out There: A Guide for Collective Climate Action Across Our Region\nLive Well Through Self-Care Wellness Workshop Series – HHSA HR The Knowledge Center\nMagnolia Safe Parking Program\nMaintenance Gardener Community Needs Assessment\nMeaningful Engagement through Regional Community Coordination\nMexican Fruit Fly Hold Notices\nMobile Crisis Response Team\nNo-Cost Senior Transportation Program\nOptimal Care Pathways Model\nOrganic Materials Ordinance Update\nPeer Reentry Leadership Academy\nPlan Check Inquiry Form\nPopulation Health Unit\nPOS Scanner App\nPreventing Pet Overpopulation through Accessible Spay/Neuter\nSoutheastern Live Well Center Input Tours – Creating Space With Community\nSubcontractor Disclosure\nSupporting Staff in Changing Work Environment During the Pandemic & Beyond\nTech Connect\nThe Southeastern Live Well Center Project\nTime Accounting Query\nTransportation Study Guide\nYouth-Led Town Halls\n“What to Expect” Safety Courses for Refugees\nCounty Annual Report – Connect With Us to Build a Better Future\nEnvironmental Justice StoryMap for the San Diego Region\nEquity in Communication: Translation, Language & Culture Connection Program\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230606.10.00.11"}