{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Love Your Heart Week of Action Promotes Heart Health with Events, Information & More", "description": "This year Love Your Heart events and no-cost blood pressure screenings will be available over the course of several days in locations throughout the county and Mexico.", "datePublished": "2023-02-09T09:55:01-08:00", "url": "https://www.countynewscenter.com/love-your-heart-week-of-action-promotes-heart-health-with-events-information-more/", "keywords": [], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-02-09T09:55:01-08:00", "articleType": "video.other", "articleContent": "\nThis year Love Your Heart events and no-cost blood pressure screenings will be available over the course of several days in locations throughout the county and Mexico.\nKnowing your blood pressure numbers is a vital first step toward heart health. Heart diseases are the leading cause of death in the United States, and the second leading cause of death in San Diego County. In 2021, nearly 5,000 people died in San Diego County from heart diseases.\nThis year the Love Your Heart Week of Action runs Feb. 11 through Feb. 19 and will include two community events – one in Chula Vista and another in Ramona – along with more than 300 locations across San Diego County and Mexico where you can get your blood pressure checked for free. Check your nearest location now.\n“We all have a responsibility to keep ourselves and our families healthy,” said Nora Vargas, Chairwoman, San Diego County Board of Supervisors. “Through this program our county is expanding access to healthcare beyond our borders and making it easy to get checked on your way to work or home from the store. Take charge of your health and keep your heart healthy, a 5-minute check can save your life! – ¡Cinco minutos pueden salvar tu vida!” \nLaunched 12 years ago, the Love Your Heart used the period around Valentine’s Day to encourage a deeper understanding of the importance of heart health. This year it continues as an expanded week of action to combat one of the more preventable causes of death: heart disease.  \n“I’m proud to say over the past 12 years we have been able to help thousands of people become aware of their blood pressure, and in the process save lives when they went to their doctor for follow up care,” Macchione said. “Our successes happened because of the diligent work by the county and through our incredible partners, but more needs to be done and we continue to urge everyone to become more heart healthy and aware.”   \nResearch showed three behaviors to be the most impactful on your health: \n\n Poor Diet\n Physical inactivity\n Tobacco use\n\nThose behaviors contribute to four chronic diseases: \n\n Cancer\n Heart disease and stroke\n Type 2 Diabetes\n Lung diseases (like asthma)\n\nCombined, those four diseases cause more than half of all deaths worldwide. \nAmong people in San Diego County, heart disease remains the second leading cause of death, equating to nearly 5,000 loved ones lost in 2021.  \n“While the statistics may seem grim, efforts like Love Your Heart have driven a 12 percent reduction in the percentage of deaths associated with preventable death threats from 2007 to 2019,” Dr. Ankita Kadakia, Deputy Public Health Officer. “By making small lifestyle changes and knowing your blood pressure numbers you can take control of your health.”  \nHeart health is top of mind for many Americans after NFL player Damar Hamlin collapsed during the Buffalo Bills game last month. That is why San Diego County and Live Well partners are also impressing the importance of learning CPR and knowing where AEDs are around your workplace and in other public spaces. \nFor people interested in learning about CPR, the Community Emergency Response Team will demonstrate hands-only CPR at the Ramona Love Your Heart fair.  \nThe two community events will bring Live Well partners together to provide blood pressure screenings, flu vaccines, Narcan distribution and other resources to educate our neighbors and empower them to take control of their health. \nSaturday, February 11, 2023\n12 p.m. – 3 p.m.\nSan Diego PACE Chula Vista\n880 3rd Avenue, Chula Vista, CA, 91911\n \nSaturday, February 25, 2023\n12 p.m. – 3 p.m.\nRamona Library\n1275 Main St. Ramona, CA, 92065 \nThe County looked into the California Healthy Places Index when planning the location of community events and screening sites to focus on areas with an above-average recorded incidence of high blood pressure. \nKnowing your numbers and making small changes to your daily life, including diet and exercise, important in the prevention of heart disease, cardiac arrest, and stroke. \nLast year’s Love Your Heart campaign reached more than 7.5 million people, through the combined mediums of print, radio, billboard, transit and social media. It gave community partners more than 6,000 blood pressure monitors to give to underserved residents and supplied Love Your Heart educational packets at all COVID-19 testing sites. The campaign also reached more than 500 people through community events including the Refugee & Newcomer Fair.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230209.09.55.01"}