{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: More than 400 Households Impacted by Storm Damage Visit County’s Local Assistance Center on Opening Day", "description": "The County’s Local Assistance Center opened Sunday offering in-person support and services from more than 25 agencies to those impacted by storm damage.", "datePublished": "2024-01-29T10:10:51-08:00", "url": "https://www.countynewscenter.com/more-than-400-households-impacted-by-storm-damage-visit-countys-local-assistance-center-on-opening-day/", "keywords": [], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-01-29T10:10:51-08:00", "articleType": "video.other", "articleContent": "\nReading Time:  < 1 minuteThe County’s Local Assistance Center opened Sunday offering in-person support and services from more than 25 agencies to those impacted by storm damage.\nMore than 400 households visited the Spring Valley County Library located on 836 Kempton Street on its first day.\nThe Local Assistance Center will open again Monday, Jan. 29 through Wednesday, Jan. 31 at the same location from 10 a.m. to 7 p.m.\nPeople who visited the center met with County representatives for help with things like household hazardous waste disposal, replacing lost EBT cards or signing up for benefits, and even picking up pet supplies.\nOther government resources available at the assistance center include the Department of Motor Vehicles and the California Department of Insurance, who is answering general questions about claims and processes.\nFamilies can also pick up canned food and produce from Feeding San Diego, connect with the Red Cross about emergency shelter and other resources, and meet with the Air Pollution and Control District about safe debris removal and asbestos information.\nThose who attended could also complete a voluntary online survey to help the County assess flood damages throughout the region. If you were affected by damage, you’re encourage to complete the form online survey. The survey will only be used to gather information to determine if the County is eligible for state and/or federal assistance.\nCompleting the form does not guarantee that you will be eligible to receive any disaster relief assistance and is not a substitution for filing a claim with your insurance. You should check with your own insurance first to check for coverage.\nFor additional recovery resources and emergency preparedness information, especially with rain in the forecast visit AlertSanDiego\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240129.10.10.51"}