{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Cases of Omicron Identified, Mask Mandate Takes Effect", "description": "While the Delta strain of COVID-19 remains dominant in the region, the County Health and Human Services Agency is reporting an additional four local cases of the Omicron variant, bringing the total to six.", "datePublished": "2021-12-15T17:03:04-08:00", "url": "https://www.countynewscenter.com/new-cases-of-omicron-identified-mask-mandate-takes-effect/", "keywords": ["health", "coronavirus", "covid-19", "omicron", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-12-17T08:53:45-08:00", "articleType": "article", "articleContent": "\nWhile the Delta strain of COVID-19 remains dominant in the region, the County Health and Human Services Agency is reporting an additional four local cases of the Omicron variant, bringing the total to six.\nThe two previously reported cases were fully vaccinated and received their booster shots, while the four cases reported today were fully vaccinated but had not received booster shots.\nOverall COVID-19 cases are also on the rise, with an additional 646 cases reported today.\n“The holidays and colder temperatures mean San Diegans are spending more time indoors, where COVID-19 spreads more easily,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “I urge our community to continue taking the recommended precautions so that we can all have a safe and happy holiday season.”\nIn light of the increase in cases and hospitalizations, and the spread of the Omicron variant, the California Department of Public Health has implemented a new statewide mask mandate, which went into effect Wednesday.\nThe mandate requires that Californians age two and older wear a facial covering in all public indoor spaces. The indoor face covering mandate is scheduled to last at least through Jan. 15, 2022 and will be reevaluated.\nIn addition to wearing a mask indoors in public places, the following measures also help to protect against all varieties of COVID-19, including the Omicron variant:\n\nGet vaccinated and get a booster if you qualify. The vaccine is widely available in the region, including at health care providers, retail pharmacies and community clinics. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the My Turn website.\nWear a mask, especially in public indoor settings, regardless of vaccination status.\nGet tested if you’ve traveled or have any symptoms, whether you’ve been vaccinated or not. You can make a free test appointment or find a walk-up test clinic at coronavirus-sd.com.\nGet CA Notify to receive alerts if you were in close contact with someone who tests positive for COVID-19.\nWash your hands frequently and stay home if you’re sick and distance yourself from others.\n\nVaccination Progress:\n\nDoses administered: Over 5.89 million.\nReceived at least one shot: Over 2.72 million or 86.5% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.42 million or 76.9 %.\nBoosters administered: 601,951.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n26 new deaths were reported since the last report on Dec. 8, 2021. The region’s total is 4,395.\n11 women and 15 men died between Aug. 1 and Dec. 9, 2021.\n11 were age 80 or older, three were in their 70s, five were in their 60s, four were in their 50s and three were in their 40s.\nEight of the people who died were fully vaccinated and 18 were not fully vaccinated.\nAll but one had underlying medical conditions.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n646 COVID-19 cases were reported to the County on Dec. 14, 2021. The region’s total is now 395,723.\n4,719 cases were identified the previous week (Dec. 8 through Dec. 14) compared to 5,418 cases reported in the past week (Dec. 1 through Dec. 7).\nDuring the 30-day period between Nov. 2 to Dec. 1, there were 440 COVID-19 hospitalizations; 319 people were not fully vaccinated and 121 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 12.9 overall, 7.0 for fully vaccinated people and 23.6 for not fully vaccinated San Diegans.\n21,767 tests were reported to the County on Dec. 14, and the percentage of new positive cases was 3.0%.\nThe 14-day rolling percentage of positive cases among tests is 3.4%.\n\nCommunity Setting Outbreaks:\n\n30 new community outbreaks were confirmed in the past seven days (Dec. 8 through Dec. 14): 11 in TK-12 grade school settings, seven in business settings, two in daycare/preschool/childcare settings, two in government settings, two in hotel/resort/spa settings, two in retail settings, one in a faith-based agency setting, one in a food/beverage processing setting, one in a restaurant/bar setting and one in a social club setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211215.17.03.04"}