{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County’s District 4 Community Will Continue to be Served", "description": "The nearly 700,000 residents living in San Diego County’s Fourth Supervisorial District will continue to be served by County government after Supervisor Nathan Fletcher’s resignation at 5 p.m. tonight.", "datePublished": "2023-05-15T15:00:48-07:00", "url": "https://www.countynewscenter.com/san-diego-countys-district-4-community-will-continue-to-be-served/", "keywords": ["government", "special election", "supervisorial district 4"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-05-15T15:00:48-07:00", "articleType": "article", "articleContent": "\nThe nearly 700,000 residents living in San Diego County’s Fourth Supervisorial District will continue to be served by County government after Supervisor Nathan Fletcher’s resignation at 5 p.m. tonight.\nAccess to mental health care, self-sufficiency services, parks and recreation, child welfare services and every other County service will still be available to residents, businesses and nonprofits. And the District 4 Office that represents part of the City of San Diego, the cities of Lemon Grove, La Mesa and some unincorporated areas will continue to be open to serve constituents.\n“Our County government will continue to deliver excellent service and support to the District 4 community during the transition of their elected leadership,” said Helen Robbins-Meyer, Interim Chief Administrative Officer, County of San Diego. “The remaining staff of the District 4 Office are County of San Diego employees and will continue to meet the needs of residents, businesses and nonprofits. The Board of Supervisors agrees this is the best course of action to ensure the community is taken care of.”\nAnyone who lives or does business in District 4 can still rely on that office to provide valuable County information, receive and respond to their requests, and attend community meetings. They will also assist the new Supervisor during their transition later this year.\nThe District 4 Office will be operational Monday-Friday. Contact the office at (619) 531-5544, or email at District4Office@sdcounty.ca.gov and visit https://www.sandiegocounty.gov/district4.\nOn May 2, 2023, the Board of Supervisors voted unanimously (4-0) to hold a special election to fill the vacant District 4 Supervisor seat. On May 23, 2023, the Board of Supervisors will vote on an ordinance to ratify that a special election will be held this year. \nServices the District 4 Office provides include: \n\nRespond to constituent requests.\nProvide useful information to constituents about the County of San Diego budget and department services, etc.\nServe as liaison between the constituents in District 4 and County departments.\nAttend community meetings in District 4.\nCoordinate with Chairwoman Nora Vargas’ Office to provide proclamations and certificates to District 4 entities that request them.\nSend a weekly electronic newsletter on Thursdays to District 4 constituents with important County updates. Visit here to sign-up for the newsletter.\nProvide residents updates by posting daily on Twitter, Facebook and Instagram using new office handles: Facebook: San Diego County D4 (SDCountyD4); Twitter: San Diego County D4 (SDCountyD4); Instagram: San Diego County D4 (SDCountyD4).\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230515.15.00.48"}