{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Budget Goes Before County Supervisors", "description": "The first of two virtual public hearings on the County’s budget took place at the Board of Supervisors meeting Monday.   The County transformed its new budget to meet rising demands amidst COVID-19, the economic crisis and worldwide calls for social justice and racial equality.  ", "datePublished": "2020-08-10T15:01:22-07:00", "url": "https://www.countynewscenter.com/new-budget-goes-before-county-supervisors/", "keywords": ["government", "2020-21 budget", "board of supervisors meeting", "coronavirus", "county budget", "covid-19", "economic crisis", "fiscal year 2020-21", "new county budget", "public hearing", "racial equality", "social justice"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-08-10T15:57:26-07:00", "articleType": "article", "articleContent": "\nThe first of two virtual public hearings on the County’s budget took place at the Board of Supervisors meeting Monday.\nThe County transformed its new budget to meet rising demands amidst COVID-19, the economic crisis and worldwide calls for social justice and racial equality.\nThe recommended $6.4 billion budget for fiscal year 2020-21 shows an increase of $159 million or 2.5% over last year and includes $100 million to fight the COVID-19 public health crisis. The recommended budget also calls for dipping into the County’s reserves.\n“There are not many new programs or capital investments, and it eliminates some vacant staff positions. The County is not cutting core services and we will boost our commitment to assisting vulnerable populations,” said Chief Administrative Officer Helen Robbins-Meyer. “We are able to do this at a time when many local governments are struggling to stay afloat.”\nThe pandemic coupled with the economic downturn are slashing revenue at a time when costs are rapidly rising. Despite these challenges, the County is required by law to balance the budget.  \nTo address major revenue shortfalls and expenditure needs, the County’s budget strategy relies on spending available one-time funds from the County’s General Fund reserves and from balances outside of the General Fund while also slowing down or stopping non-essential services and projects.  \nThe County’s top budgetary priority is battling COVID-19. The Health and Human Services Agency will see an increase of $100 million to reduce the pandemic’s spread and allow for responsible reopening. The funding will go toward efforts tied to responding to COVID-19, including the Testing, Tracing and Treatment Strategy (T3), food distribution, medical supplies, personal protective equipment (PPE) and shelter.  \nAnother $15 million will pay for technology needs to support behavioral health services, including: telehealth, electronic health record upgrades, outreach and engagement, workforce recruitment and retention. \nThe County is also providing a wide array of online services to customers that range from help for behavioral health issues, to permitting, to digital library books. Parks is offering virtual programs as well, including Movies in the Park. \nThe Registrar of Voters office is busy planning for the November presidential election but this time, needs to ensure it is conducted in the safest way possible during this pandemic.   \nWhile COVID-19 appears to overshadow many aspects of our lives, the County is still supporting vulnerable people. \nTo strengthen children and families, the County will continue to serve over 1 million San Diegans every month with Medi-Cal, CalFresh, CalWORKs and General Relief, and also help enroll low income families and others affected by the pandemic’s economic fallout. Child Welfare Services will expand upon efforts to strengthen families and address disproportionality and disparities. Seniors will be supported through efforts such as the Geriatric Emergency Department Accreditation program and Alzheimer’s awareness.  \nA $23.7 million increase will address homelessness in the unincorporated area and another $0.4 million will be used to develop a Flexible Housing Subsidy Pool in collaboration with the Regional Task Force on the Homeless to help move those experiencing homelessness into permanent housing.  \nA $3 million increase will help address homelessness among youth up to the age of 24, with a focus on youth transitioning from foster care and young parents experiencing homelessness. The Sheriff’s Homeless Assistance Resource Team (HART) will see a $2.6 million increase to expand its program.  \nIn the area of behavioral health, the County continues to transform the multi-sectoral system of care from one driven by crisis, to one of continuous care and prevention, by providing coordinated resources to keep people connected, stable and healthy. This includes increased investments for diversionary services, such as the expansion of Crisis Stabilization Units, and increases to help community providers expand their capacity for long–term treatment. The County will also continue its partnership with UC San Diego Health to develop a behavioral health hub on County-owned property in Hillcrest.   \nNationwide conversations are driving change in public safety. De-escalation training for law enforcement agencies is a priority to strengthen community trust, equity and racial justice. By the end of the year, nearly 3,000 officers are expected to complete training through the District Attorney’s office, with an additional 1,600 through the Sheriff’s Department. The Citizens’ Law Enforcement Review Board will have increased authority and expanded resources to provide independent oversight of the Sheriff’s Department and Probation. \nThe Board of Supervisors created a new Office of Equity and Racial Justice to examine bias within the County organization, which will also work with the newly formed Human Relations Commission. The Commission will collaborate with community organizations to address disparities and create more equitable programs, services and resources for all. \nPlans are in the works to create the District Attorney North County Family Justice Center to further protect victims of crime. The County is also designing an earthquake early warning system pilot program and building two fire stations, one in Mt. Laguna and the other at Palomar Mountain.   \nThe County is on track to nearly double the number of affordable housing units in its portfolio over five years to help low income, special needs and homeless residents using local, state and federal funds. Pre-approved plans, permit and impact fee waivers are available for the construction of granny flats or accessory dwelling units to help ease the affordable housing shortage.  \nThe budget includes funds to protect and improve the region’s air quality, including $5.0 million for addressing vehicle emissions and $21.1 million to implement the Community Air Protection Program that continues to monitor air quality in communities most vulnerable to air pollution.  \nThe capital program includes:   \n\n$22.3 million to enhance and renovate the Rock Mountain Detention Facility \n$15.0 million for design and construction of Innovative Residential Rehabilitation Program \n$14.9 million for multiple facilities major maintenance capital projects  \n$7.2 million for construction of Mt. Laguna and Palomar Mountain Fire Stations and planning of the East Otay Mesa Fire Station \n$9.3 million for expansion and improvements at various County parks including Lincoln Acres Park expansion \n$1.7 million for expansion and construction at the Rancho San Diego Library and Casa de Oro Library \n$0.6 million for electric vehicle installation and improvements at County facilities \n\nThe Fiscal Year 2020-21 Capital Program also includes partial funding for the following capital projects: \n\n$14.5 million for the County Administration Center (CAC) phased renovations \n$7.5 million for North Coastal Live Well Health Center improvements \n$2.0 million for planning the Third Avenue Mental Health Inpatient Facility Hub, Hillcrest \n$2.0 million for the Edgemoor Psychiatric Unit \n$0.4 million for the San Diego Juvenile Justice Campus (Phase II) \n\nAn evening virtual hearing will take place at 5:30 p.m. on Wednesday, Aug. 12.  \nThe public can see today’s presentation in advance of Wednesday’s evening hearing and get additional details about the recommended operational plan through the online budget portal. The public can also submit comments to the Board through e-comment. The online comments can be submitted until budget hearings close at 5:00 p.m. on Wednesday, Aug. 19.\nThose who want to participate in the virtual Board meetings and speak via teleconference must fill out the online Board of Supervisors tele-comments form and submit it before the start of the meeting. After submitting the form, you will receive instructions on how to call in to the meeting. \nFollowing the close of budget hearings, the Board will deliberate and is scheduled to adopt the budget at a virtual public hearing at 2 p.m. on Tuesday, August 25. \nFor more information, visit the Clerk of the Board’s website or call 619-531-5434. \n2020 Budget Infographic\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200810.15.01.22"}