{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Officers Save Life of Local Man with Overdose Antidote", "description": "A group of San Diego County probation officers helped to save a life last week during a routine home visit, administering two doses of the drug naloxone to a 38-year-old local man who was suffering from a suspected opioid overdose.", "datePublished": "2021-05-05T13:08:42-07:00", "url": "https://www.countynewscenter.com/probation-officers-save-life-of-local-man-with-overdose-antidote/", "keywords": ["public safety", "law enforcement", "living safely", "naloxone", "probation"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-05-06T09:11:33-07:00", "articleType": "article", "articleContent": "\nA group of San Diego County probation officers helped to save a life last week during a routine home visit, administering two doses of the drug naloxone to a 38-year-old local man who was suffering from a suspected opioid overdose.\nBoth opioid abuse and opioid-related drug overdoses have been steadily on the rise in the county for the past few years, including a growing trend of fentanyl-laced methamphetamine, heroin, ecstasy, and other recreational drugs identified by law enforcement.\nDenise Huffhines, Deputy Chief of Adult Reintegration and Community Supervision services, said all field service officers have been carrying naloxone since 2019 and receive regular training on its proper use, but this is the first time one of their officers has administered it to save a life.\n“Our officers were conducting a home visit on a client who had recently tested positive for methamphetamine,” said Huffhines. “During the contact, the client began to show signs of being under the influence and suddenly became unconscious.”\nHuffhines said officers requested medical assistance and tried to wake the client who was not responding.  Suspecting that the client was overdosing, she said officers administered one dose of Narcan (naloxone) and the client briefly responded before becoming unconscious again.  \n“Our officers administered a second dose of Narcan, and the client subsequently responded and became alert,” said Huffhines. “The client was then transported to a local hospital by paramedics.”\nHuffhines said during a subsequent search of the client’s possessions, a replica handgun, stun-device, pills and drug paraphernalia were found.  While no fentanyl was found at the location, officers said they suspected that the overdose may have been related to pills found in the client’s possession.\nLiza Enjambre, a supervising probation officer with the county, was the senior officer on the scene during the incident. She credited the entire team of officers and an additional training unit that just happened to be with them that night for being able to handle the situation.\n“They knew exactly what to do in this type of situation to help save a life,” said Enjambre. “This included administering the drug and keeping the man awake and alert until medical assistance arrived on the scene.”\nEnjambre said probation officers having access to naloxone and knowing how to administer it is important due to the recent rise in people struggling with opioid addiction and the presence of fentanyl in many street drugs.\n“We went through this training initially over two years ago,” said Enjambre. “In my job, I always do mental rehearsals and I knew that one day I would have to use it. The training helped tremendously for both me and my team.”\nWhile this was the first time probation officers have administered naloxone since the policy was implemented in 2018 and grant funding made the drug available to the department in 2019, the San Diego Sheriff’s Department first began carrying the drug in 2014. Deputies in the Law Enforcement Services Bureau used it a total of 47 times in 2020. Detention Bureau deputies also used naloxone an additional 75 times, making the department’s total reported use at 122 incidents for 2020.\nRuben Leyva, Assistant Chief Probation Officer, said he was encouraged to see officers have success with a tool that aids their ability to serve vulnerable populations who may be struggling with addiction.\n“Oftentimes unseen, our officers continually do great work in support of our clients and the community,” said Leyva. “As law enforcement personnel who often come into contact with people at risk for opioid overdoses, having naloxone readily available and knowing how to use it can help save lives.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210505.13.08.42"}