{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Free4Me Program Recognized with Award", "description": "The County of San Diego’s Free4Me program was awarded the 2023 California State Association of Counties Challenge Award. The program provides free menstrual products in County bathrooms. ", "datePublished": "2023-12-15T10:17:36-08:00", "url": "https://www.countynewscenter.com/countys-free4me-program-recognized-with-award/", "keywords": ["health", "free4me", "office of strategy and innovation"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-12-15T10:21:49-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Free4Me program was awarded the 2023 California State Association of Counties Challenge Award. The program provides free menstrual products in County bathrooms. \nThe Challenge Awards is an annual celebration recognizing innovative and creative programs across the state. \nNearly two-thirds of low-income people in the United States report being unable to afford menstrual products at some point during the previous year and have faced a decision between purchasing food or other necessities and menstrual products. This challenge, referred to as “period poverty” disproportionately impacts people experiencing homelessness, transgender people, youth, and low-income individuals. \n\nThe County of San Diego identified this need, garnered input from community partners, and surveyed users across multiple County facilities. The County’s Health and Human Services’ Office of Strategy and Innovation led the pilot effort which crossed multiple County departments, including General Services and Public Health. \nThe Free for Menstrual Equity, or Free4Me pilot program, was launched May 28, 2021 in restrooms at 24 County-owned buildings and included the installation of 58 tampon and menstrual pad dispensers. The locations of the dispensers were featured on a website and shared with local period poverty advocates. \nThe pilot generated a lot of positive user feedback. Those who responded ranged in age from 18 to 63 years old and more than half said they had worried about paying for menstrual products in the previous year. \n\nThe pilot program, budgeted at $70,000, provided more than 277,500 menstrual products over its first two years.  \nThe program is now expanding, with dispensers in all female and gender-neutral restrooms, along with one centrally located male restroom in each facility. More than 1,000 dispensers will be installed in over 300 County owned and leased facilities by May 2024. \nThe County shared resources and materials with other counties and cities with interest in replicating the program. In consultation with the County, the City of San Diego adopted the same Free4ME program model and name in October. \nIn all, 14 programs from 11 counties were recognized with 2023 California State Association of Counties Challenge Awards.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231215.10.17.36"}