{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two COVID-19 Triggers Improving; Community Outbreaks Continue to Increase", "description": "Since early July, the County has been on the state’s Monitoring List because of a case rate above 100 cases per 100,000 population, causing additional restrictions on some local businesses. A second County trigger resulted in the hiring of more case investigators and a third, related to outbreaks, continues to be elevated.", "datePublished": "2020-08-03T18:16:32-07:00", "url": "https://www.countynewscenter.com/two-covid-19-triggers-improving-community-outbreaks-continue-to-increase/", "keywords": ["health", "coronavirus", "covid-19", "triggers improving"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-03T18:16:32-07:00", "articleType": "article", "articleContent": "\nSince early July, the County has been on the state’s Monitoring List because of a case rate above 100 cases per 100,000 population, causing additional restrictions on some local businesses. A second County trigger resulted in the hiring of more case investigators and a third, related to outbreaks, continues to be elevated.\nToday, County health officials announced the case rate has been steadily dropping. After reaching a high of 158.5 on July 23, the rate for the region has declined to 118.2.\n“The results over the past seven days are promising and are due to everyone doing their part to change this metric,” said Wilma Wooten, M.D., M.P.H., County public health officer. “So, keep up the great work, San Diego.”\nFor the County to be off the state’s watchlist, it would have to report 240 cases or fewer for 14 days in a row.\nAnother trigger that has been improving is the seven-day average percentage of case investigations initiated within 24 hours after a positive case is assigned. After reaching a low of 7% July 18, the percentage has dramatically increased in the past few days and is now at 48%, after the County added more than 200 case investigators. More case investigators will be coming onboard in the days and weeks to come.\nThis investigation metric, Wooten said, is likely to be normal in the next week or two.\n“We’re adding new staff, and this is helping to improve this particular metric,” Wooten said.\nThe third trigger that has been consistently in the red and is trending in the wrong direction is the number of COVID-19 outbreaks in a community setting over a seven-day period.\nOver the past seven days, 39 community outbreaks have been confirmed, the highest seven-day total since the pandemic began. Fifteen of the 39 outbreaks were reported in restaurant/bar settings, seven in businesses, four in restaurants without bars and the rest in other settings.\nCounty Opens Testing Site in Pacific Beach\nThe County is opening a COVID-19 testing site in Pacific Beach due to the increasing number of cases in the area.\nThe drive-up site will offer free testing Tuesdays from 9 a.m. to 3 p.m. at the Pacific Beach/Taylor Branch Library, located at 4275 Cass Street in San Diego.\nAppointments are required and can be made five days in advance. They can be made online at www.211sandiego.org or by calling 2-1-1. For a complete list of other testing sites, visit coronavirus-sd.com.\n\nCommunity Setting Outbreaks:\n\nFour new outbreaks were identified on Aug. 2: one in a higher education setting, one in a government setting and two in business settings.\nIn the past seven days, 39 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n6,536 tests were reported to the County on Aug. 2 and the number of laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 5.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,454.\n\nCases:\n\n343 new cases were reported in San Diego County for a total of 30,226.\n2,599 or 8.6% of cases have required hospitalization.\n656 or 2.2% of all cases and 25.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported in San Diego County on Aug. 2 and the region’s total remains at 565.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200803.18.16.32"}