{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Head of County Law Enforcement Review Board Announced", "description": "An attorney with twenty years’ investigative experience as a special agent with the Federal Bureau of Investigation, will serve as the new Executive Officer of the San Diego County Citizen Law Enforcement Review Board (CLERB).", "datePublished": "2024-08-28T09:37:41-07:00", "url": "https://www.countynewscenter.com/new-head-of-county-law-enforcement-review-board-announced/", "keywords": ["government"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-08-28T11:10:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAn attorney with twenty years’ investigative experience as a special agent with the Federal Bureau of Investigation, will serve as the new Executive Officer of the San Diego County Citizen Law Enforcement Review Board (CLERB).\nBrett Kalina’s start date is September 3, said CLERB Chairperson, MaryAnne Pintar, who served on the selection committee.\n“Brett has extensive experience with complex, high-profile investigations involving narcotics trafficking, violent crimes, complicated forensic evidence, and diverse communities,” said Pintar.  “Since CLERB’s primary function is investigative, Brett’s deep well of knowledge will serve CLERB’s mission extremely well.”\nKalina most recently served as an FBI Supervisory Special Agent.\nCLERB’s primary role is to investigate citizen complaints against San Diego County sheriff and probation officers, as well as any incident of death or serious bodily injury connected to the actions of either department. Based on the cases it reviews, as well as trends observed in the community, CLERB also recommends new policies or policy changes to the departments to improve policing practices, prevent harm and support equity.\n“Kalina has been recognized for nurturing equal opportunity in the workplace and for his work to promote diversity and inclusivity in policing,” Pintar said, adding that Kalina served for five years as President of Bureau of Equality.  In this role, Kalina was dispatched to train teams tasked with investigating the mass homicide at the Pulse nightclub in 2016. Kalina’s role was to ensure culturally sensitive and thoughtful engagement with Orlando’s diverse communities.\nKalina is a certified instructor in diversity and inclusion and headed initiatives that led to updated language policies within the Bureau. He is also a specialized instructor in criminal enterprise and organized crime as well as active shooter training.\nKalina earned his juris doctor from the University of North Dakota School of Law, and a bachelor’s degree from the University of North Dakota.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240828.09.37.41"}