{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Holocaust Exhibit Finds New Home at County Library", "description": "An exhibit remembering the stories of local Holocaust survivors is now open to the public at the Rancho San Diego Library. A ribbon cutting marked the opening Sunday.", "datePublished": "2023-05-26T09:11:44-07:00", "url": "https://www.countynewscenter.com/holocaust-exhibit-finds-new-home-at-county-library/", "keywords": [], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-05-26T09:11:44-07:00", "articleType": "video.other", "articleContent": "\nAn exhibit remembering the stories of local Holocaust survivors is now open to the public at the Rancho San Diego Library. A ribbon cutting marked the opening Sunday.\nCounty officials, Holocaust survivors and the curator of the RUTH Remember Us the Holocaust exhibit were on hand for the occasion. The event coincides with Jewish American Heritage Month.\nThe curator is the daughter of a Holocaust survivor, and she created the exhibit in memory of her mother, Ruth Goldschmiedova Sax.\n“Education is the key to accepting and understanding differences,” said Sandy Scheller, Curator.\n“We are honored and humbled to host this exhibit. A library is an ideal place for our community to engage with history, not only through our collection but through events and exhibits such as this,” said Migell Acosta, County Library Director. “We welcome the public to visit and interact with the information and materials on display and to absorb the lessons of the past.”\nThe display will stay at the library for a year. The County put $25,000 in Neighborhood Reinvestment Program funding toward helping the Jewish Federation of San Diego pay for the exhibit.\nThe County’s new Arts and Culture Commission also played a role in bringing the exhibit to the library. The commission was created in June 2022, and it promotes the value and benefits of the arts, cultural equity, access and inclusion.\nThe exhibit will be on display during the library’s regular business hours. Tours will be available from 10 a.m. to 12 p.m. on Thursdays or upon request. For more information, contact the Arts and Culture Commission at arts@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230526.09.11.44"}