{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Hospitalizations Rapidly Rising as County Waits for Vaccine", "description": "Due to the increasing number of cases and hospitalizations, County health officials continue to urge San Diegans to follow the recommended guidance to prevent getting and spreading the novel coronavirus.", "datePublished": "2020-12-02T17:31:20-08:00", "url": "https://www.countynewscenter.com/covid-19-hospitalizations-rapidly-rising-as-county-waits-for-vaccine/", "keywords": ["health", "coro", "coronavirus", "covid-19", "hospitalizations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-03T10:32:28-08:00", "articleType": "article", "articleContent": "\nDue to the increasing number of cases and hospitalizations, County health officials continue to urge San Diegans to follow the recommended guidance to prevent getting and spreading the novel coronavirus.\nOver the past seven days, the region has averaged more than 1,300 COVID-19 cases each day.\nHospitalizations have also steadily risen in recent weeks. A total of 739 San Diegans was hospitalized for COVID-19 as of Dec. 1, compared to 288 Nov. 1, an increase of 451 in the hospitalized population, or 156.6%. This figure is likely to go up since hospitalizations lag behind confirmation of cases.\nThe number of people in intensive care units has also increased. While there were 93 San Diegans in the ICU at the beginning of November, the figure has more than doubled in the past 30 days to 209.\n“Unfortunately, with the increase in cases, there have been more hospitalizations and ICU admissions,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nSan Diegans are encouraged to follow the following guidelines to prevent getting and spreading COVID-19:\n\nIf you’re sick, stay home and isolate yourself from others.\nIf you need to be in public, you must use a face covering if you are close to people outside your household. The coverings help prevent asymptomatic carriers of the virus from spreading it.\nMaintain physical distance from others.\nAvoid crowded places to decrease your risk of exposure.\nCover your cough or sneeze with a tissue, throw it away and wash your hands.\nWash your hands properly and regularly or use a hand sanitizer.\n\nCOVID-19 Vaccine Arriving in San Diego\nThe state anticipates getting approximately 327,000 doses in mid‐December during the first distribution round. Of those, the County is expected to get about 28,000 doses.\nDistribution of COVID-19 vaccine will be done in phases, with the first doses going to health care personnel and nursing home residents and employees. The initial distribution will not be sufficient to vaccinate all eligible health care workers.\nThe state anticipates the second round of vaccines to follow about three weeks after the first round.\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure of case rate or testing positivity to assign tiers regarding what activities are permitted. Indoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed.\nThe County’s state-calculated, adjusted case rate is currently 15.3 cases per 100,000 residents and the region is in Purple Tier or Tier 1 for that metric.\nThe testing positivity percentage is 2.3%, placing it in Tier 3 or the Orange Tier for that metric.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 10.6% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health announces tier assignments at least once a week.\n\nCommunity Setting Outbreaks:\n\n18 new community outbreaks were confirmed on Dec. 1: six in faith-based settings, four in retail settings, four in business settings, one in a grocery setting, one in government setting, one in a TK – 12 school setting and one in a daycare/preschool/childcare setting.\nIn the past seven days (Nov. 25 through Dec. 1), 89 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n21,701 tests were reported to the County on Dec. 1, and the percentage of new laboratory-confirmed cases was 6%.\nThe 14-day rolling average percentage of positive cases is 6.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,237.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n1,217 new cases were confirmed among San Diego County residents on Dec. 1. The region’s total is now 84,638.\n4,726 or 5.6% of all cases have required hospitalization.\n1,038 or 1.2% of all cases and 22% of hospitalized cases had to be admitted to an intensive care unit.\nA COVID-19 case rate map shows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\n16 new deaths were reported in the County on Dec. 1. The region’s total is now 1,035.\n11 men and five women died between Nov. 21 and Dec. 1, and their ages ranged from early 60s to early 90s.\nAll underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201202.17.31.20"}