{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Residents Learn About County Budget, Services", "description": "County residents had a chance to ask questions and learn about the role of the County budget in their daily lives at an evening open house in Kearny Mesa Thursday.", "datePublished": "2025-04-18T14:13:01-07:00", "url": "https://www.countynewscenter.com/county-residents-learn-about-county-budget-services/", "keywords": ["government", "4/17/25 budget open house", "budget", "county budget", "open house"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-04-18T15:26:06-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty residents had a chance to ask questions and learn about the role of the County budget in their daily lives at an evening open house in Kearny Mesa Thursday.\nThe Chief Administrative Officer’s recommended budget won’t be released until May 1, but staff members were on hand to spotlight some of the County’s many services, talk about where funding comes from, and speak to how decisions are made in developing and adopting the County’s budget.\nVisitors could also give their feedback.\nRegionally, County government provides services like:\n\nSocial services and health programs\nCriminal prosecution, detention facilities and emergency preparedness\nFood and restaurant inspections and beach water monitoring\nElections\n\nIn the unincorporated area, County government provides things a city government would typically do like:\n\nLaw enforcement and fire protection\nRoads, parks and libraries\nBuilding permits\nAnimal shelters and protection\n\nSome cities also contract with the County to provide some of these services\n\n \n \n \n \n \nAttendees were invited to bring their kids and explore how the County helps the community. They visited with adoptable animals, met a live owl, watched a K9 demonstration and saw emergency vehicles up close, and more.\nAnother budget open house is scheduled from 5 to 7 p.m. on Thursday May 22 at the County Operations Center. A virtual community budget meeting will take place at 5:30 p.m. on Wednesday, May 28.\nMore information on how to register for these events or request language and accessibility services can be found in the upcoming weeks on Engage San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250418.14.13.01"}