{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "High Risk for COVID-19 in San Diego County", "description": "The continued increase in local coronavirus cases has prompted the Centers for Disease Control and Prevention to move San Diego County to its high-risk level for COVID-19.", "datePublished": "2022-07-14T15:59:10-07:00", "url": "https://www.countynewscenter.com/?p=208987", "keywords": ["health", "coronavirus", "covid19", "high risk", "red level", "vaccines"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-07-14T16:10:41-07:00", "articleType": "article", "articleContent": "\nThe continued increase in local coronavirus cases has prompted the Centers for Disease Control and Prevention to move San Diego County to its high-risk level for COVID-19.\nThe CDC tracks community levels of the virus based on geographic regions to determine the impact of COVID-19 in communities, and to allow individual jurisdictions to implement preventive strategies based on the latest local data.\nSan Diego had been in the medium-risk category since the end of May, but recent spikes in hospitalizations and new cases have led the CDC to increase the risk level for the region.\nActions You Can Take\nThe high-risk level means COVID-19 is widespread throughout the region and San Diegans should continue taking precautions to slow the spread of the virus. You should:\n\nWear a mask indoors when in public\nGet all the vaccine doses and boosters\nStay home if you are sick and get tested\nAvoid crowded places\nTake other precautions, such as washing your hands and staying away from people who are visibly sick\n\nThe County continues to follow the California Department of Public Health’s SMARTER plan, which recommends vaccination, use of masks, testing and treatment among other things.\n“San Diegans should take every precaution necessary to slow the spread of COVID-19,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Most San Diegans have been vaccinated, but with this virus, and with the prevalence and infectivity of the new variants, a booster is highly recommended, especially for people who are immunocompromised or have other comorbidities.”\nGot COVID? Get Treatment \nIf you do get COVID-19, County health officials say treatment is available. Treatment can help prevent high-risk individuals from getting sick enough to need hospital services and even from dying from COVID.\nOral medications, in the form of pills, and monoclonal antibodies, in the form of an intravenous infusion, are available at multiple locations and community pharmacies across San Diego. Antiviral medications require a doctor’s prescription and should be started within five days of developing symptoms of COVID-19. Monoclonal antibodies should be given no more than seven days after the onset of symptoms.\nTo determine which treatment is best for you, talk to your doctor or health care provider, or call 2-1-1 to find a provider.\nVaccination Progress:\n\nReceived at least one shot: Over 3.0 million or 89.7% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: Nearly 2.65 million or 79.2%.\nBoosters administered: 1,396,563 or 57.8% of 2,418,004 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n13 additional deaths were reported since the last report on July 7. The region’s total is 5,370.\nOf the 13 additional deaths, four were women and nine were men. They died between May 23 and July 7, 2022; five deaths occurred in the past two weeks.\nEight of the people who died were 80 years or older, two were in their 70s, two were in their 60s and one was in their 40s.\n11 were fully vaccinated and two were not.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n5,576 COVID-19 cases were reported to the County in the past three days (July 11 to July 13, 2022). The region’s total is now 857,182.\n12,948 cases were reported in the past week (July 7 through July 13) compared to 9,763 infections identified the previous week (June 30 through July 6).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 43.95 for people fully vaccinated and boosted, 27.01 for fully vaccinated people and 87.71 for not fully vaccinated San Diegans.\n12,747 tests were reported to the County on July 9, and the percentage of new positive cases was 14.9% (Data through July 9).\nThe 14-day rolling percentage of positive cases, among tests reported through July 9, is 14.5%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220714.15.59.10"}