{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Debuts Labor, Wage Theft Data Information Site", "description": "Employees and employers across the region can now learn more about workers’ rights, labor law compliance, and see which local businesses have wage theft judgments against them. ", "datePublished": "2022-09-21T15:08:15-07:00", "url": "https://www.countynewscenter.com/?p=209543", "keywords": ["government", "employee rights", "fgg", "labor laws", "office of labor standards and enforcement", "wage theft", "wage theft data information", "workers rights"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-09-21T18:03:18-07:00", "articleType": "article", "articleContent": "\nEmployees and employers across the region can now learn more about workers’ rights, labor law compliance, and see which local businesses have wage theft judgments against them.\nThe County’s new Office of Labor Standards and Enforcement created a website that answers labor law questions on the minimum wage, meal and rest breaks, sick leave, overtime, COVID-19 vaccination requirements, workers’ compensation requirements and more.\nThe site also features an embedded dashboard on the status of wage claims judgments issued by the California Division of Labor Standards and Enforcement. Users can search for local employers who violated the California Labor Code, the employer’s type of industry, judgment date, and judgment amount. This site will be updated monthly.\nIn the near future, employers can sign up to attend free educational labor compliance trainings for businesses that will be hosted throughout the County and available virtually.\n“This office and this site are important because questions regarding labor laws come up over and over again,” said Deputy Director Branden Butler. “We will be a one-stop information shop for both employees and businesses to get answers to important questions about the workplace.”\nFor additional information on workers’ rights and how to file a claim, you can reach the County Office of Labor Standards and Enforcement through its advice line at 619-985-1597 or email OLSE@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220921.15.08.15"}