{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What are the Benefits of New Fru-hen-ds? Chick out this Backyard Chicken Webinar!", "description": "Been feeling “cooped up?” Looking for some new fru-hen-ds? Or maybe you’re just looking for ways to reduce waste, save money and even improve the quality of your soil? Check out this backyard chicken webinar!", "datePublished": "2020-06-11T13:10:55-07:00", "url": "https://www.countynewscenter.com/what-are-the-benefits-of-new-fru-hen-ds-chick-out-this-backyard-chicken-webinar/", "keywords": ["environment", "chickens", "recycling", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-06-11T14:19:08-07:00", "articleType": "article", "articleContent": "\nBeen feeling “cooped up?” Looking for some new fru-hen-ds? Or maybe you’re just looking for ways to reduce waste, save money and even improve the quality of your soil?\nWell, the County of San Diego’s recycling section and the nonprofit Solana Center have just the thing for you — a free webinar from 2 p.m. to 3 p.m. on Thursday, June 18 and 2 p.m. to 3 p.m. Sunday, June 21 — where you can learn all about the benefits of owning backyard chickens.\nAll you need is a computer, smartphone or laptop, access to Zoom, the free teleconferencing app, and to register to take part at the Solana Center’s events website. Once you register, you’ll get an email with the webinar’s link and password the day before the event.\nThen you can learn how chickens can improve the quality of your soil, save you money and even reduce waste.\nObviously, chickens lay eggs — so you can shave that cost off your grocery bill. But did you know they can also protect your garden by eating unwanted pests?\nOr that they can help you reduce household waste and keep unwanted trash from filling up our landfills?  Owners say their chickens love to eat many different kinds of table scraps that you’d ordinarily toss into the trash. Just make sure you check the numerous lists out there that tell you what you can and cannot feed them.\nAnd chickens can make cool pets.\nSo, don’t miss the “cluckinar”-webinar, where you can learn about local regulations for keeping backyard chickens; the basics for making a home-sweet-chicken home; how to feed and keep chickens healthy and happy; and hear about local and online resources.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200611.13.10.55"}