{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Johnson & Johnson COVID-19 Vaccine Arrives in San Diego", "description": "The arrival on the Johnson & Johnson COVID-19 vaccine will make it easier for San Diegans to be vaccinated against the virus.", "datePublished": "2021-03-08T18:16:58-08:00", "url": "https://www.countynewscenter.com/johnson-johnson-covid-19-vaccine-arrives-in-san-diego/", "keywords": ["health", "coronavirus", "covid-19", "johnson and johnson", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-08T18:16:58-08:00", "articleType": "article", "articleContent": "\nThe arrival of the Johnson & Johnson COVID-19 vaccine will make it easier for San Diegans to be vaccinated against the virus.\nThe one-shot vaccine has arrived in the region and is being distributed the same way as the Pfizer and Moderna vaccines.\nSome people have shown hesitancy to getting the latest COVID-19 vaccine given that it was 72% effective in research trials in the United States, compared to about 94% for Moderna and 95% for Pfizer after those vaccines’ required two doses.\nHowever, health officials say the Johnson & Johnson vaccine is just as effective as its counterparts at preventing serious illness from COVID-19 and was tested against virus variants. Also, all currently available vaccines were 100% effective at preventing hospitalizations and deaths during trials.\n“San Diegans should get whichever vaccine is available when it’s their turn to get vaccinated,” Wilma Wooten, M.D., M.P.H., County public health officer. “All three vaccines are excellent at preventing people from getting seriously ill from COVID-19.”\nLocal vaccination sites are currently providing vaccine to San Diegans in Phase 1A and Phase 1B. Supplies remain limited.\n“Regardless of which shot you get, you’ll be protected from serious complications from COVID-19 and will be able to protect others who are waiting their turn to be vaccinated,” Wooten said.\nVaccination Progress:\n\nMore than 1.15 million COVID-19 vaccine doses have been delivered to the region, and over 1.04 million have been logged as administered. Of those vaccinated to date, nearly 342,000 people, or 12.7% of San Diegans 16 and older, are fully immunized.\nOverall, more than 643,000 County residents have received at least one shot of two-dose vaccine. That’s 23.9% of those eligible.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit vaccinationsuperstations.dom.\n\nA COVID-19 vaccination is administered at the Grossmont Center Vaccination Super Station.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 10.8 cases per 100,000 residents (as of March 2) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 4.2%, placing the County in Tier 3 or the Orange Tier. While the testing positivity rate for the County qualifies it for Tier 3, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 6% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 9.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed March 7.\nFour community outbreaks were confirmed March 6: two in business settings and two in retail settings.\nNo community outbreaks were confirmed March 5.\nIn the past seven days (March 1 through March 7), 24 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n9,770 tests were reported to the County on March 7, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,835.\n\nCases, Hospitalizations and ICU Admissions:\n\n307 cases were reported to the County on March 7. The region’s total is now 263,275.\n13,259 or 5% of all cases have required hospitalization.\n1,613 or 0.6% of all cases and 12.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported March 7. The region’s total is 3,390.\nFive COVID-19 deaths were reported March 6.\nThree men and two women died between Jan. 28 and Jan. 30.\nOf the five deaths, one person who died was 80 years or older, two people who died were in their 70s and two were in their 60s.\nAll had underlying medical conditions.\n14 COVID-19 deaths were reported March 5.\n10 men and four women died between Jan. 16 and March 4.\nOf the 14 deaths reported March 5, four people who died were 80 years or older, six were in their 70s, one was in their 60s, two were in their 50s and one was in their 40s.\n12 had underlying medical conditions and two did not.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210308.18.16.58"}