{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "The Heat is On, Here’s How to Protect Yourself", "description": "Summer and even the fall months in San Diego County can bring extremely high temperatures that can be dangerous to people and pets. So, here are tips that can help keep you, your friends and loved ones safe!", "datePublished": "2024-07-03T09:46:36-07:00", "url": "https://www.countynewscenter.com/the-heat-is-on-how-to-protect-yourself/", "keywords": ["health", "cool zones", "equity and access", "excessive heat", "heat safety tips", "hhsa", "public health", "public safety"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-07-03T09:47:15-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSummer and even the fall months in San Diego County can bring extremely high temperatures that can be dangerous to people and pets.\nExcessive heat can spike body temperatures that can cause heatstroke, exhaustion, dizziness, nausea, confusion, headache and even death. Children and the elderly are particularly at risk.\nSo, here are tips that can help keep you, your friends and loved ones safe.\n\nThe County’s Cool Zones, including the County’s 33 branch libraries, community centers and other locations, offer people safe, air-conditioned sanctuaries from the heat. Here is a complete list and map of County Cool Zone sites, their hours and locations. People can also call 2-1-1 to find a location, and—if they cannot get to a Cool Zone site—ask for help with free transportation.\n\nResponding to Signs of Heatstroke or Heat Exhaustion\n\nFirst and foremost, if you find someone who is suffering from symptoms of heatstroke or heat exhaustion—dizziness, nausea, confusion, headache—call 9-1-1 and start cooling them. But DO NOT give them fluids to drink. A person with heatstroke may not be able to swallow. Fluids could run down their tracheas into their lungs and make it hard for them to breathe.\nAfter calling 9-1-1, start cooling the person by moving them into the shade, spraying them with cool water and fanning. Place them in a cool shower if they are alert, monitor their body temperatures and continue cooling them.\n\nTips to Help People Avoid Heat-Related Problems\n\nStay in an air-conditioned area during the hottest hours of the day. Even a few hours spent in air conditioning can help your body stay cooler. Do not rely on electric fans for cooling if temperatures exceed 90 degrees.\nWear light, loose-fitting clothing.\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty.\nTake cool showers.\nNever leave a child, elderly person, or pet unattended in a car.\nAvoid unnecessary hard work or activities outside during the hottest part of the day.\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun.\nAvoid using the oven to cook.\n\nTips to Keep Your pets cool in hot weather\n\nKeep your pets indoors if the temperature is lower inside.\nExercise pets in early morning hours or early evening to avoid prolonged exposure to the heat. Avoid strenuous runs or hikes.\nKeep your pets’ water supply in a tip-proof container, always topped off, and be sure it stays cool (pets will not drink water that is too hot).\nConsider a misting system to keep the outdoor areas cooler.\nBe sure your pet has shade ALL DAY, if they are outside. Remember, the sun’s position changes during the day.\nDo not take your pets for car trips unless absolutely necessary. A car can heat up very quickly. On an 85-degree day, a car can reach 102 degrees in 10 minutes and soar upward even with the windows down an inch or two.\nDon’t take your dogs for walks on the hot pavement. If it is too hot for you to walk barefooted, then don’t make your dogs do it either.\nConsider adding a child’s wading pool for your dog. Many dogs will keep cool by “taking a dip.”\n\nSo, remember, the sun is beautiful, but it can be dangerous. Stay cool; be cool!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240703.09.46.36"}