{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Expands Open Space Near El Capitan County Preserve", "description": "The County took steps Wednesday to add more space and species protection to land at El Monte Road in Lakeside. The Board of Supervisors approved the donation of 75 acres of land next to El Capitan County Preserve.", "datePublished": "2024-04-10T14:40:22-07:00", "url": "https://www.countynewscenter.com/board-expands-open-space-near-el-capitan-county-preserve/", "keywords": ["parks and rec", "county parks", "open space", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-04-10T15:24:40-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County took steps Wednesday to add more space and species protection to land at El Monte Road in Lakeside. The Board of Supervisors approved the donation of 75 acres of land next to El Capitan County Preserve.\nCounty Parks Department officials said the land fits into the County’s Multiple Species Conservation Plan (MSCP) area. The additional acreage expands the County’s MSCP preserve to nearly 46,300 acres.\nThe new acreage will connect El Capitan County Preserve, the Historic Flume Corridor, and El Monte County Park. It will also improve regional trail opportunities and protect the native habitat.\nThe County entered into an agreement with Lakeside’s River Park Conservancy for the land donation, which appraised at $1,500,000.\nThe open space will support sustainability goals for species conservation that will:\n\nReduce greenhouse gas emissions by approximately 95 metric tons of carbon dioxide equivalent per year—equivalent to the annual number of emissions produced by about 20 gasoline-powered passenger vehicles.\nExpand opportunities for outdoor recreation in nature.\nExpand open space next to native ecosystems and habitats.\n\nThe Department of Parks and Recreation looks at many factors when considering obtaining open space land, including biology, connectivity, accessibility and value.\nA core aspect of the Parks Department’s conservation program is to have a positive impact on public health and provide open space lands to protect native habitats and improve water and air quality for future generations.\nFor more information, visit the MSCP webpage.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240410.14.40.22"}