{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "To Protect Mental, Physical Wellness, Stay Close from Afar", "description": "The novel coronavirus pandemic has forced us into isolation and kept us away from family and friends. That can make for a difficult holiday season, which is usually spent gathering with others and is often the only time some family members see each other.", "datePublished": "2020-12-18T09:49:19-08:00", "url": "https://www.countynewscenter.com/to-protect-mental-physical-wellness-stay-close-from-afar/", "keywords": ["health", "coronavirus", "covid-19", "holidays", "mental health"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-18T10:41:08-08:00", "articleType": "article", "articleContent": "\nThe novel coronavirus pandemic has forced us into isolation and kept us away from family and friends.\nThat can make for a difficult holiday season, which is usually spent gathering with others and is often the only time some family members see each other.\nMental health experts say it’s important to stay connected and reinforcing those relationships can make it easier to get through this challenging time.\n“Reach out to your loved ones and do it often,” said Luke Bergmann, director of Behavioral Health Services for the County of San Diego Health and Human Services Agency. “It can help you, and them, feel less lonely and isolated while the stay-at-home order is in place.”\nBergmann emphasized that it is particularly important that we not pit our mental health against our public health.\n“The most important thing we can do for the community’s long-term mental wellness is to observe public health orders and get this pandemic under control,” Bergmann said.\nBut in the shorter-term, the COVID-19 pandemic will continue to be stressful for people and communities. Bergmann said it’s important for people to monitor their physical and mental health and to stay as connected as possible while staying physically distant.\n“We are encouraging everyone to be in contact with their friends and loved ones, but to please do it from afar,” he said.\nBehavioral Health Services offers the following tips for managing mental wellness while being isolated:\n\nPause, take deep breaths and notice how you feel.\nTalk or video chat with people you trust about your feelings and concerns.\nDon’t be glued to the radio, TV or other news outlets. Take a break from content that might be upsetting.\nMake time for yourself and unwind. Listen to music and do other activities you enjoy while following the public health guidance.\nTake care of your body and exercise on a regular basis. Moderate-to-vigorous physical activity can help to reduce anxiety and stress.\nRest and get plenty of sleep. Try to go to bed and wake up at the same time, even on weekends.\nEat healthy and well-balanced meals. Avoid drugs and, if you drink, do it in moderation.\n\nIf you or someone you care about are feeling overwhelmed with sadness, depression or anxiety, seek professional help, especially if distress is impacting your daily activities for days or weeks.\nDespite the COVID-19 pandemic, mental health resources and support are still readily available through County Behavioral Health Services and its many service providers.\nYou can talk to a trained counselor by calling the County’s 24-hour, multi-lingual Access and Crisis Line at (888) 724-7240. Other resources are available on Behavioral Health Services’ COVID-19 Resources for Families, Parents & Caregivers webpage or the It’s Up to Us website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201218.09.49.19"}