{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tips to Keep Your Pets Safe in Disasters", "description": "San Diego County Animal Services reminds residents to be prepared to evacuate with their pets or livestock animals in the event of a disaster such as the Pacific Palisades wildfire, in Los Angeles.", "datePublished": "2025-01-08T17:30:57-08:00", "url": "https://www.countynewscenter.com/tips-to-keep-your-pets-safe-in-disasters/", "keywords": ["animals", "animal control officer", "animal evacuations", "das", "fire preparedness", "healthy and safe communities", "pet preparedness"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-01-10T15:59:47-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County Animal Services reminds residents to be prepared to evacuate with their pets or livestock animals in the event of a disaster such as the Pacific Palisades wildfire in Los Angeles.\nDuring Santa Ana wind conditions fire danger increases. And County Animal Services have been preparing by outfitting animal control officers who work in the field with protective fire gear. Earlier this year, the department offered comprehensive trainings to a group of dedicated volunteers and participated in emergency response and preparedness fairs to offer guidance and resources for pet disaster preparedness to the general public.\nIf you must evacuate your home during an emergency, do not leave your pets. You may not be able to return to your home or animal enclosure for an extended period. The animals are not safer at home since fire or winds could damage your home or animal enclosure and allow your pet to escape or to permit other animals, or the natural elements, to enter and hurt your pet.\nDo not wait for an official evacuation notice; evacuate if you feel unsafe. Do not wait until the last minute because smoke or winds could lessen visibility on the roads or road conditions could be poor due to damage or congestion.\nTake these five actions to keep your pets and animals safe in a disaster:\n\nCreate or update a pet emergency evacuation kit that includes essential items such as pet food, water and medications, if any. It is also recommended that you include a collar with an identification tag, leash, carrier and a first aid kit as well as a folder with their vaccination records and microchip information. A complete list of items for the kit is available here.\nKnow multiple evacuation routes from your home in case one is closed; have the pet carrier ready and stay up to date on pet-friendly pet shelters.\nStay informed on local disasters that may affect your community, especially those in high-risk areas. This will allow you to evacuate immediately.\nWildfire smoke is harmful for pets, just like it is for people, especially if they have respiratory issues. If this is a concern, limit their times outdoors and keep them indoors with clean air as much as possible. Close windows, doors and vents to prevent smoke from entering the house.\nIf your pet is not microchipped, you should do it before a disaster strikes. It will allow you to reunite with your pet if they somehow escape or cannot be found while evacuating.\n\nBefore a wildfire or other disaster, Animal Services also recommends people start a buddy system with neighbors to check on each other’s animals in case someone is not home during an emergency.\nTo learn more about livestock considerations, visit Animal Services disaster page. Download the free County AlertSanDiego app and register for emergency notifications.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250108.17.30.57"}