{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "If COVID-19 Symptoms Arise, Don’t Wait to Get Tested", "description": "A recent analysis of San Diego County data revealed that San Diegans are waiting an average of 3.5 days after symptoms develop before they get a COVID-19 test.", "datePublished": "2020-10-14T17:43:59-07:00", "url": "https://www.countynewscenter.com/if-covid-19-symptoms-arise-dont-wait-to-get-tested/", "keywords": ["health", "coronavirus", "covid-19", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-10-14T17:43:59-07:00", "articleType": "article", "articleContent": "\nA recent analysis of San Diego County data revealed that San Diegans are waiting an average of 3.5 days after symptoms develop before they get a COVID-19 test.\nThe delay could result in further COVID-19 exposures, especially if people do not isolate themselves from others.\n“People should get tested immediately after they start feeling sick,” said Wilma Wooten, M.D., M.P.H., County public health officer. “They should also isolate themselves to avoid exposing those around them.”\nBecause there is substantial spread of COVID-19 in the community, people who start feeling sick should assume it’s because of the novel coronavirus, get tested right away and isolate themselves from other people, including their families.\nPeople with COVID-19 can have no symptoms, mild symptoms, or severe illness. Common symptoms include:\n\nFever or chills\nCough\nDifficulty breathing\nFatigue\nNew loss of taste or smell\nBody aches\nRunny nose\nCongestion\nHeadache\nSore throat\n\nSymptoms may appear two to 14 days after exposure to the virus.\n“People experiencing symptoms should be in isolation while they wait for their test results, and, if they are positive, they should continue to be away from others,” Wooten said. “If you have severe symptoms, like difficulty breathing, contact your doctor immediately.”\nCounty public health nurse administers a COVID-19 test.\nPeople who test positive should remain in isolation until 10 days after onset of symptoms and no fever for at least 24 hours without use of fever-reducing medications and improvement of other symptoms.\nAnyone who is sick or infected should separate themselves from others by staying in a specific “sick room” or area and using a separate bathroom (if available). Close contacts of people who test positive for COVID-19 should quarantine themselves for 14 days and monitor for symptoms.\nFor people who are not able to isolate or quarantine themselves at home, the County has public health rooms for the public.\nThe County operates about 40 COVID-19 testing sites and most do not require an appointment. To find a no-appointment site near you, or to make an appointment, visit www.211sandiego.org or call 2-1-1. You can view the testing sites by day here.\nState Metrics:\n\nThe state issued its weekly assessment of risk levels yesterday, and San Diego County remains in Tier 2, also referred to as the Red Tier.\nSan Diego’s state-calculated, adjusted case rate is 6.8 per 100,000 residents, up from 6.5 in the previous assessment. Limit for Tier 2 is 7.0.\nThe testing positivity percentage is 3.0%, down from 3.5% last week, placing it in Tier 3 or the Orange Tier.\nThe state’s health equity metric looks at the testing positivity for areas with the lowest healthy conditions. This metric does not move counties to more restrictive tiers but is required to advance.\nThe County’s health equity testing positivity percentage is 5.7, down from the 6.2 percent reported Oct. 6.\nThe California Department of Public Health will assess counties on a weekly basis, with the next report scheduled for Tuesday, Oct. 20.\n\nCommunity Setting Outbreaks:\n\nFour new community outbreaks were confirmed on Oct. 13: two in businesses, one in a restaurant and one in a restaurant/bar.\nIn the past seven days (Oct. 7 through Oct. 13), 47 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n9,662 tests were reported to the County on Oct. 13, and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 10,472.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n303 new cases were confirmed among San Diego County residents on Oct. 13. The region’s total is now 51,327.\n3,710 or 7.2% of all cases have required hospitalization.\n858 or 1.7% of all cases and 23.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFour new COVID-19 deaths were reported in San Diego County on Oct. 13. The region’s total is now 844.\nFour women died between Oct. 8 and Oct. 12, and their ages ranged from late 50s to late 80s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201014.17.43.59"}