{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Offices to Close for Thanksgiving", "description": "County offices, including family resource centers, library branches and animal shelters, will be closed on Thursday, Nov. 24 and Friday, Nov. 25 for the Thanksgiving holiday.", "datePublished": "2022-11-18T15:36:48-08:00", "url": "https://www.countynewscenter.com/county-offices-to-close-for-thanksgiving/", "keywords": ["government", "county closure", "thanksgiving"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-11-19T16:13:45-08:00", "articleType": "article", "articleContent": "\nCounty offices, including family resource centers, library branches and animal shelters, will be closed on Thursday, Nov. 24 and Friday, Nov. 25 for the Thanksgiving holiday.\nEssential services including Sheriff’s Department patrols and animal control emergency response will continue during the holidays.\nAll County COVID-19 vaccination sites will be closed Thursday through Sunday with the exception of the South Region Live Well Center at 690 Oxford St. in Chula Vista which will be open on Sunday. All vaccination sites will resume normal hours Monday, Nov. 28. Vaccinations are still available through healthcare providers and at pharmacies.\nCounty- and state-operated COVID-19 testing sites will be closed Thursday. Information on testing Friday through Sunday is available on the testing schedule site.\nAll County parks and campgrounds will also be open during normal business hours on Thursday and Friday with some exceptions listed below:\n\nThe Fallbrook Community Center will be closed Thursday and Friday.\nThe Lakeside Community Center will be closed Thursday and Friday.\nThe Lakeside Teen Center/REC Club will be closed Monday, Nov. 21 through Friday, Nov. 25.\nThe Spring Valley Community Center will be closed Thursday and Friday.\nThe Spring Valley Teen Center/REC Club will be closed Monday, Nov. 25 through Friday, Nov. 29.\nThe Spring Valley gym will be closed Wednesday through Friday.\nThe 4S Ranch Sports Park recreation office is closed on Thursday and Friday. The ranger office and park will be open both days.\n\nParks’ reservation phone line will not be available Thursday and Friday, but you can make reservations online at sdparks.org.\nParks is extending Thanksgiving with Green Friday encouraging people swap shopping plans for outdoor experiences, including free family-friendly activities at County parks. Learn more about the various Green Friday activities.\nCounty animal shelters will resume their regular business hours starting Saturday, Nov. 26. All other County offices will reopen for regular business hours on Monday, Nov. 28.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221118.15.36.48"}