{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Immigrant and Refugee Welcome Center Opens in North County", "description": "The Inland Immigrant and Refugee Welcome Center opened in Escondido Thursday, making it the second location in the region where people can go, regardless of immigration status, and receive help accessing services they are eligible to receive.  ", "datePublished": "2024-12-05T16:16:42-08:00", "url": "https://www.countynewscenter.com/immigrant-and-refugee-welcome-center-opens-in-north-county/", "keywords": ["health"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-12-05T18:17:12-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe Inland Immigrant and Refugee Welcome Center opened in Escondido Thursday, making it the second location in the region where people can go, regardless of immigration status, and receive help accessing services they are eligible to receive.  \nHere in San Diego County, immigrants, including refugees, make up more than 20 percent of the population. \nThe newest Welcome Center is located inside the North Inland Live Well Center and offers a safe, trauma-informed, and culturally responsive environment for immigrants and refugees.  \nThe Welcome Center provides a comprehensive service hub with vital resources and information for immigrants and refugees and is located near key County departments such as Aging and Independence Services, Child Family and Wellbeing, a Family Resource Center, Public Health Center, and Military and Veterans Resource Center. \nServices include resettlement assistance, legal aid, employment support, family health and wellness, and access to self-sufficiency programs like CalWORKS, Medi-Cal, and CalFresh.   \nThe Welcome Center’s space also allows for partnerships with community organizations who offer workshops, presentations and often use space within the Welcome Center to provide services.    \nThe County’s first Welcome Center opened in March 2023 and is located at the South Region Live Well Center in National City.   \nThe two Welcome Centers were developed out of ongoing community listening sessions over the past two years, to help better understand gaps between what immigrant and refugee families are eligible for and services received.  \nThe Welcome Center is open Monday through Friday, 8 a.m. to 5 p.m. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241205.16.16.42"}