{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Encourages Indoor Mask Wearing, Regardless of Vaccination Status", "description": "Amid a sharp increase in COVID-19 cases due to the spread of the more contagious Delta variant of the virus, the County of San Diego Health and Human Services Agency is recommending all San Diegans wear facial coverings in indoor public settings.", "datePublished": "2021-08-25T17:51:29-07:00", "url": "https://www.countynewscenter.com/county-encourages-indoor-mask-wearing-regardless-of-vaccination-status/", "keywords": ["health", "coronavirus", "covid-19", "delta variant", "indoor masking", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-08-25T17:51:29-07:00", "articleType": "article", "articleContent": "\nAmid a sharp increase in COVID-19 cases due to the spread of the more contagious Delta variant of the virus, the County of San Diego Health and Human Services Agency is recommending all San Diegans wear facial coverings in indoor public settings.\nWhile vaccinated people are no longer required to wear a face covering in most settings, the California Department of Public Health updated its guidance for those who are fully vaccinated to strongly encourage the continued use of face coverings indoors.\nThe guidance recommends that all Californians, regardless of vaccination status, wear a mask in indoor public settings. People who are immunocompromised or at increased risk for severe disease from COVID-19 should be particularly cautious, as well as people who share a household with someone who is immunocompromised, at increased risk of severe disease, not fully vaccinated, or not yet eligible for vaccination.\nIndoor masking for vaccinated people is also supported by the Centers for Disease Control and Prevention, which notes that individual and community-level prevention measures, in addition to vaccination, have been shown to help reduce the spread of SARS-CoV-2.\nThe new guidance is in addition to CDPH mandates requiring masks on public transit, in transportation hubs like airports, indoors in K-12 schools and childcare centers, emergency shelters, cooling centers, healthcare settings, state and local correctional facilities and detention centers, homeless shelters, long term care settings and adult and senior care facilities.\nAdditionally, masks are required for unvaccinated individuals in indoor public settings and businesses, retail, restaurants, theaters, family entertainment centers and state and local government offices serving the public.\n“Indoor masking, regardless of vaccination status, adds an additional layer of protection and reduces the risk of transmission of COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “If you are not fully vaccinated yet, I urge you to get your shot now, so we can slow the spread of this more contagious strain of COVID-19.”\nNo-cost COVID-19 vaccines are widely available in the region. They can be found at medical providers, retail pharmacies, community clinics and County public health centers for people who do not have a medical provider. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\nVaccination Progress:\n\nDoses administered: More than 4.5 million.\nReceived at least one shot: About 2.38 million or 85% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Close to 2.09 million or 74.4%.\nThe goal: vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 113.4% of the goal population has received at least one vaccine and 99.2% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nDeaths:\n\n25 new deaths were reported since the last report on Aug. 18. The region’s total is 3,859.\n10 women and 15 men died between Aug. 11 and Aug. 22, 2021.\nSix were 80 years of age or older, one was in their 70s, six were in their 60s, nine were in their 50s and three were in their 40s.\n20 had underlying medical conditions, two did not and three had medical history pending.\n\nCases, Case Rate and Testing:\n\n1,327 COVID-19 cases were reported to the County on Aug. 24. The region’s total is now 327,166.\nSan Diego County’s case rate per 100,000 residents is 35.2 overall, 9.3 for fully vaccinated people and 66.9 for not fully vaccinated San Diegans.\n16,915 tests were reported to the County on Aug. 24, and the percentage of new positive cases was 7.8%.\nThe 14-day rolling percentage of positive cases among tests is 7.3%.\n\nCommunity Setting Outbreaks:\n\n41 new community outbreaks were confirmed in the past seven days (Aug. 18 through Aug. 24): 12 in business settings, six in restaurant/bar settings, five in government settings, five in TK-12 school settings, four in daycare/preschool/childcare settings, two in healthcare settings, one in a community-based organization setting, one in an emergency services setting, one in a faith-based setting, one in a hotel/resort/spa setting, one in a restaurant setting, one in a retail setting and one in a social club setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m. on Wednesdays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210825.17.51.29"}