{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches New Vaccination Appointment Map", "description": "To make it easier for San Diegans to make an appointment to get vaccinated against the novel coronavirus, the County today launched a new interactive map showing all the vaccination sites.", "datePublished": "2021-01-28T17:25:42-08:00", "url": "https://www.countynewscenter.com/county-launches-new-vaccination-appointment-map/", "keywords": ["health", "appointment map", "coronavirus", "covid-19", "san marcos", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-01T08:47:25-08:00", "articleType": "article", "articleContent": "\nTo make it easier for San Diegans to make an appointment to get vaccinated against the novel coronavirus, the County today launched a new interactive map showing all the vaccination sites.\nPeople in Phase 1A and 65 years and older can now make appointments through the new English and Spanish site, which, when fully developed, will be very similar to the one used to find testing sites.\nThe new map allows users to pick a location and connects them to the appointment system for that site. You can access the map from a link on  www.vaccinationsuperstationsd.com.\n“We’re trying to make it easier for people to make an appointment and get vaccinated when it’s their turn,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The vaccine is safe and effective and it’s the best tool we have to slow the pandemic.”\nCounty to Open Vaccination Clinic in San Marcos\nStarting Jan. 31, a new COVID-19 vaccination super station will be up and running on the California State University San Marcos campus.\nThe new pedestrian site will be vaccinating people, with appointments, from 9:30 a.m. to 5:30 p.m. Sunday through Thursday at the Sports Center and Clarke Field House, located at 333 South Twin Oaks Valley Road in San Marcos.  Free parking will be available in Parking Structure 1 on levels 2 and 3 and disabled parking in Lot L next to the Sports Center,\nThe County-run site is a collaboration between the County and CSU San Marcos, with staff support from Palomar Health, UC San Diego Health and Tri-City Medical Center. It will offer about 1,000 doses daily depending on vaccine availability but can ramp up to vaccinate 5,000 people daily when more vaccine is available. Appointments are required and can be scheduled at www.vaccinationsuperstationsd.com. Appointments for this site will become available Saturday afternoon.\nIn Borrego Springs this weekend, a CAL FIRE team as part of “Operation Collaboration” will provide 250 COVID-19 doses both Saturday and Sunday. Appointments are necessary.\nOperation Collaboration is a consortium of local fire agencies using County vaccine. CAL FIRE and other groups will also be going to other communities soon, especially to vaccinate people in nursing and long-term care homes.\nAll County clinics are vaccinating people in Phase 1A and people 65 years and older in Phase 1B and require appointments, which can be made at vaccinationsuperstationsd.com. People 75 and older who don’t have access to a computer or Internet can call 2-1-1 for assistance in scheduling an appointment.\nSan Diegans without transportation can use the Metropolitan Transit System to travel to a vaccination site for free by showing proof of their appointment.\nVaccination appointments fill up quickly, so County health officials are urging San Diegans to wait their turn and get vaccinated when more doses become available.\n“Be patient. Your turn will come,” Wooten said.\nAn older man gets vaccinated against COVID-19 at the vaccination super station in Chula Vista.\nThe County plans to open two more vaccination super stations in East and North County in February.\nSome doctors, pharmacists and other health care providers may administer vaccinations to those 65 and older, if they have doses available.\nThrough Jan. 27, about 486,000 doses have been shipped to the region and more than 269,000 have been entered into the immunization data base as having been administered. More information on vaccine distribution can be found on the County vaccination dashboard.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 49.6 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 12.6%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 16.7% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 2.\n\nCommunity Setting Outbreaks:\n\nEight community outbreaks were confirmed Jan. 26: five in business settings, two in food/beverage processing settings and one in a government setting\nIn the past seven days (Jan. 21 through Jan. 27), 54 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n22,162 tests were reported to the County on Jan. 27, and the percentage of new positive cases was 7%.\nThe 14-day rolling average percentage of positive cases is 9.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 24,403.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases:\n\n1,489 cases were reported to the County on Jan. 27. The region’s total is now 232,970.\n9,725 or 4.2% of all cases have required hospitalization.\n1,395 or 0.6% of all cases and 14.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n69 new COVID-19 deaths were reported Jan. 27, the second highest one-day total. The region’s total is 2,534.\n38 men and 31 women died between Jan. 8 and Jan. 26.\nOf the 69 deaths reported today, 31 people who passed away were 80 years or older, 19 people were in their 70s, 12 people were in their 60s, five people were in their 50s and two people were in their 40s.\n65 had underlying medical conditions and four had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210128.17.25.42"}