{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Recipients of Equity Impact Grants Announced", "description": "Ten local small grassroots organizations have been selected to receive support grants through the County’s Equity Impact Grant Program. ", "datePublished": "2024-05-01T15:49:25-07:00", "url": "https://www.countynewscenter.com/recipients-of-equity-impact-grants-announced/", "keywords": ["government", "equity impact grant program", "grassroots", "nonprofit", "oerj", "office of equity and racial justice", "small business"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-05-01T15:49:25-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesTen local small grassroots organizations have been selected to receive support grants through the County’s Equity Impact Grant (EIG) Program. \nThe pilot program is a partnership between the County’s Office of Equity and Racial Justice (OERJ) and The Nonprofit Institute at the University of San Diego (NPI).  \nEach grantee organization will receive $100,000 in general operating support grants, along with capacity-building coaching provided by NPI. \n“This program is a critical first step to support our small nonprofit organizations,” said Andrew Strong, Director of the Office of Equity and Racial Justice. “We are excited to see the outcomes of this first round, yet we know we still have a lot of work to do.” \nOERJ and NPI developed the program in response to community feedback about the challenges that small and grassroots organizations experience when applying for government contracts and philanthropic funding.    \nThe EIG program supports organizations led by people with lived experiences that represent the communities they seek to help. \n“This is only the beginning,” said Dr. Novien Yarber, Senior Research Associate, Nonprofit Institute. “My hope is that this process not only positively impacts the awardees but has a transformative impact on everyone involved.” \nThe first cycle of the program received 325 applications.  The program will have two groups, so organizations that were not selected during the first cycle have been encouraged to reapply. \n“The number of applications shows the significant need for support for small and BIPOC–led nonprofits,” said Strong. \nApplications for the second grant cycle will open later this year. A link to apply will be available on the Equity Impact Grant Program website. \nBelow is a list of the 10 recipients of the Equity Impact Grant Program: \n\nBuilding Justice (HoMEwork) – A Southeast San Diego organization that supports people transitioning out of incarceration by prioritizing their personal development, creating a support system, and providing opportunities to amplify their voices and influence policy decisions.  \nFirst Gen Scholars – An organization helping first-generation, low-income Black, Latinx, and Southeast Asian students navigate the college admissions process and graduate debt-free.   \nFree Thought Revolution – A community-driven effort to “bridge the divide of humanity through storytelling, community, and social action.” In addition to their podcast, their vision includes educational initiatives and housing programs to provide a safe space for marginalized individuals to engage in healing and community-building.   \nGarden 31 – This organization trains and mentors youth and adults that are considered at-risk, formerly incarcerated, justice-impacted, and socioeconomically disadvantaged in regenerative agriculture, sustainable food systems, and life skills to improve community health and wellness. \nInner-Tribal Treatment – To address the needs of the Native American population impacted by the opioid crisis, this organization provides one of the only culturally-based treatment programs in Southern California.  \nLived Experiences – A North County community-based organization that utilizes data-proven methods to advocate for change by investing in people’s microsystems and addressing the root causes of physical and emotional trauma.  \nMajdal Arab Community Center of San Diego – Through advocacy and cultural programs, this East County organization works to empower and uplift the Arab community in San Diego.   \nPaddle for Peace – An organization conceived to create a nurturing space where BIPOC children could not only access coastal environments for recreation, physical fitness and mental healing but also envision and explore careers in Marine Biology and Environmentalism. To date, they have provided over 600 first time coastal experiences for BIPOC, underserved youth.   \nSan Diego Community Birth Center – This is the only Black-owned birth center in San Diego County, providing access to midwifery care, doula and lactation services, among other resources that ensure healthy births.   \nSan Diego Black LGBTQ Coalition – A volunteer-led organization that not only serves over 500 Black LGBTQ people and families yearly but works to address the acute needs of the Black transgender community.   \n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240501.15.49.25"}