{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Register to Vote by Feb. 20 for March Presidential Primary Election Mail Ballot", "description": "If you want to vote in the March presidential primary election, you must register by Tuesday, Feb. 20 to receive a ballot in the mail.", "datePublished": "2024-02-16T12:01:37-08:00", "url": "https://www.countynewscenter.com/register-to-vote-by-feb-20-for-march-presidential-primary-election/", "keywords": ["elections", "county registrar of voters", "fgg", "march 5 presidential primary", "registration deadline", "registration deadline for mail ballot", "voter registration"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-16T12:19:24-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIf you want to vote in the March presidential primary election, you must register by Tuesday, Feb. 20 to receive a ballot in the mail. Otherwise, you will need to make a trip in person to the Registrar’s office in Kearny Mesa or visit a vote center starting Saturday, Feb. 24 to conditionally register and vote provisionally through March 5.\nThe Registrar’s office will be open 8 a.m. to 5 p.m. Monday through Friday except Monday, Feb. 19 when it will be closed in observance of Presidents Day. Due to major construction at the County Operations Center, those who wish to visit the Registrar’s office are encouraged to allow for extra time to find parking.\nRegistering to vote is quick and easy and can be done online at sdvote.com. You will need to register to vote if you:\n\nare not registered in San Diego County\nrecently moved\nchanged your name\nwant to change your political party preference\n\nIf your signature is confirmed through records at the California Department of Motor Vehicles, your registration will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the form, sign it and return it to the Registrar’s office by 5 p.m. on Feb. 20.\nRegistration forms must be postmarked or delivered to the Registrar’s office by Feb. 20. Voters may also register online until midnight.\nIf you don’t have access to a computer, you may request a registration form. Call (800) 696-0136 or email rovmail@sdcounty.ca.gov.\nNot sure if you’re registered to vote? Check your registration status online at sdvote.com.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday.\nIf you prefer to vote in person and avoid long lines, 39 vote centers will open daily from 8 a.m. to 5 p.m. starting Saturday, Feb. 24.\nOn Saturday, March 2, an additional 179 vote centers will open for a total of 218. The locations will be open daily from 8 a.m. to 5 p.m. through March 4. On the final day of voting, March 5, all vote centers and official ballot drop boxes will be open from 7 a.m. to 8 p.m.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nIf you plan to vote for president, the Registrar urges voters to review each political party’s rules.\nLearn more about voting in the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240216.12.01.37"}