{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on Mira Mesa Epicentre Renovation", "description": "County officials and community members broke ground Wednesday on a project to revitalize the Mira Mesa Epicentre as a County-operated community center.", "datePublished": "2025-01-30T14:17:48-08:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-mira-mesa-epicentre-renovation/", "keywords": ["parks and rec", "county parks and recreation", "epicenter", "equity and access", "mira mesa", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2025-01-30T14:17:48-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty officials and community members broke ground Wednesday on a project to revitalize the Mira Mesa Epicentre as a County-operated community center.\nThe County will rebuild and operate a portion of the property located at 8450 Mira Mesa Boulevard as an open recreation center for youth.\nDesigned with community input, features will include a multifunctional pickleball and basketball court, a community garden, open lawn area, rentable community space, music room, game room, practice kitchen, and flexible study and work areas.\nThe new center will offer innovative youth and intergenerational programming, recreation and entertainment opportunities, improve access to public services and increase public safety in the Mira Mesa community.\nThe facility will also serve as the home for the County’s SD Nights – short for Safe Destination Nights – which provides safe places throughout the county where teens can go for youth-centered activities during critical hours.\nThe County’s Department of Parks and Recreation gathered community input and engaged residents, businesses and other stakeholders about their needs for the facility. This feedback helped to shape the design and types of features planned for this location.\nConstruction will begin next month for completion in Fall of 2026. For more information about the project, visit sdparks.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250130.14.17.48"}