{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Distributing COVID-19 Vaccines Equitably ", "description": "The County is continuing to expand its efforts to equitably distribute COVID-19 vaccines to populations who have suffered the worst outcomes from the pandemic. In February, the County began piloting multiple health-equity focused methods to ensure that eligible County residents who live in the hardest-hit communities can get vaccinated outside of the traditional online appointment system. ", "datePublished": "2021-03-30T12:18:35-07:00", "url": "https://www.countynewscenter.com/distributing-covid-19-vaccines-equitably/", "keywords": ["health", "coronavirus", "covid", "covid vaccines", "equity", "hhsa", "project save", "public health"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-03-30T12:18:35-07:00", "articleType": "article", "articleContent": "\nThe County is continuing to expand its efforts to equitably distribute COVID-19 vaccines to populations who have suffered the worst outcomes from the pandemic. In February, the County began piloting multiple health-equity focused methods to ensure that eligible County residents who live in the hardest-hit communities can get vaccinated outside of the traditional online appointment system. \nTo reach these populations, the County launched Project SAVE (Scheduling Assistance for Vaccine Equity). As part of Project SAVE, a certain number of appointments are set aside each day for people who are eligible, at vaccination sites in communities most impacted by COVID-19.  \nThe pilot focused on South County, an area that included National City, Chula Vista, Imperial Beach and San Ysidro, some of the local communities with the highest COVID-19 case rates and deaths.  \nCounty-funded community health workers, sometimes known as promotoras, began reaching out to residents and workers in these areas to assist with scheduling vaccination appointments and providing information and other resources. The County saw a need for this program because many community members in those areas have language barriers or need other assistance from someone who can navigate the vaccination signup process.  \nHaving a trained member of the community, from a trusted community-based organization, helps to break down barriers to vaccine access. Project Save partners include The Chicano Federation, San Diego Latino Health Coalition, Mental Health America of San Diego, Multicultural Health Foundation, Somali Family Services of San Diego, United Women of East Africa, Union of Pan Asian Communities (UPAC), Southern Indian Health Council, San Diego American Indian Health Center, Indian Health Council Inc., San Diego Refugee Communities Coalition, True Care and Casa Familiar.  \nFor the hard-hit border community, the County opened the Border View YMCA in Otay Mesa as the region’s first no-appointment vaccination site with a capacity to serve up to 500 people a day.  \nThe Health and Human Services Agency divides the county into six administrative regions. The vaccine efforts resulted in the South Region having the highest percentage of vaccinated seniors and second-highest per capita vaccination rate of all the regions. \nIn recent weeks, Project SAVE has expanded to include the 92058 ZIP code, surrounding the North Coastal Live Well Health Center in Oceanside; two ZIP codes in City Heights and Mid-City (92105 and 92115), for the College Area Viejas Arena site and, this week, three ZIP codes south of downtown and in southeastern San Diego (92113, 92102 and 92114), for the Educational Cultural Complex site in Mountain View. Appointments are also being set aside under Project SAVE for vaccinations at the Mexican Consulate in downtown San Diego.   \nSoon to be added to Project SAVE are communities served by the following vaccination sites: Linda Rhoades Recreation Center in Vista, North Inland First United Methodist Church of Escondido, Lemon Grove Community Center, and Tubman Chavez Community Center. \n“We started the Project SAVE pilot with the knowledge that residents of the South Bay experienced some of the worst health outcomes during the course of this pandemic,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The County is committed to health equity and our goal remains to make vaccines available to every San Diegan, as quickly as possible, with a special focus on those residents who are at the highest risk for severe outcomes from COVID-19.” \nIn addition to Project SAVE, other ongoing equity initiatives include: serving long-term care facilities; Homeless Outreach Teams for people experiencing homelessness; mobile teams for homebound individuals; 2-1-1 to secure appointments for seniors; and Operation Collaboration first responders visiting farms to vaccinate the workforce. The County also provides vaccine to equity-focused organizations, such as the San Diego Black Nurses Association and Champions For Health.  \nWhile vaccine availability is expanding, the number of doses available daily at each site can vary based on actual vaccine supply. More information about vaccine distribution can be found on the County’s COVID-19 vaccination dashboard. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210330.12.18.35"}