{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update", "description": "Today’s COVID-19 update from the County Health and Human Services Agency with data through Sept. 15.", "datePublished": "2020-09-16T17:43:38-07:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update/", "keywords": ["health", "coronavirus", "covid-19", "sdsu", "update"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2020-09-17T12:42:01-07:00", "articleType": "article", "articleContent": "\nBelow is today’s COVID-19 update from the County Health and Human Services Agency with data through Sept. 15.\nNew State Metrics:\n\nUnder the new state monitoring metrics, San Diego County is currently in Tier 2, also referred to as the Red Tier.\nSan Diego’s state-calculated, unadjusted case rate is 7.9. The testing positivity percentage is 4.5%.\nShould the County have an unadjusted rate higher than 7.0 next week, it could be moved into the Purple Tier and more state-imposed restrictions could be implemented on recently-opened businesses.\nThe state will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 22.\n\nCommunity Setting Outbreaks:\n\nFive new community outbreaks were confirmed on Sept. 15: three in business settings, one in a grocery/retail and one in a faith-based setting.\nIn the past seven days (Sept. 9 through Sept. 15), 17 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n8,644 tests were reported to the County on Sept. 15 and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 4.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,838.\n\nCases:\n\n264 new cases were confirmed among San Diego County residents on Sept. 15. The region’s total is now 43,445.\n37 of the 264 new cases are connected to San Diego State University. The total number of cases connected to SDSU students is here.\n3,349 or 7.7% of cases have required hospitalization through Sept. 15.\n787 or 1.8% of all cases and 23.5% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSix new COVID-19 deaths were reported in San Diego County on Sept. 15, and region’s total is now 748.\nThree men and three women died between Sept. 9 and Sept. 14, and their ages ranged from early 50s to early 90s.\nAll had underlying medical conditions.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200916.17.43.38"}