{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens Budget Public Hearings", "description": "The County of San Diego opens public hearings for its $7.15 billion recommended budget next week at two meetings at the County Administration Center — 9 a.m. Monday, June 13 and a special night session at 5:30 p.m. Thursday, June 16.", "datePublished": "2022-06-09T10:22:40-07:00", "url": "https://www.countynewscenter.com/?p=208718", "keywords": ["government"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-06-09T10:26:43-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego opens public hearings for its $7.15 billion recommended budget next week at two meetings at the County Administration Center — 9 a.m. Monday, June 13 and a special night session at 5:30 p.m. Thursday, June 16.\nThe County introduced its 2022-23 recommended spending plan May 5. It builds on commitments to address mental health, homelessness, equity, racial justice and climate change while upholding essential public safety, land use and social services.\nCounty departments presented their individual budgets to the Board of Supervisors and the public May 19 and May 20. The Board of Supervisors is scheduled to adopt a new budget at its June 28 public meeting.\nCounty services touch nearly all residents. Some of those include providing public health, health and social services, law enforcement through the Sheriff’s department, running probation, elections, investigating suspicious deaths through the County Medical Examiner’s office, monitoring beach water quality and overseeing regional disaster preparedness.\nCounty leaders are urging the public to participate in finalizing the new budget. There are many ways available for people to take part.\nPeople can attend the meetings and comment in person at the County Administration Center, or watch the meetings live online and make a request to speak via teleconference or submit a written eComment. Online comments on the budget will be accepted until 5 p.m. on June 22, when the public comment period ends.\nAttend the Meeting in Person\nThe budget meetings will take place in the Board of Supervisors chamber, room 310, at the County Administration Center located at 1600 Pacific Highway, San Diego, CA 92101.\nSpanish language translation services for public speakers are available at Board of Supervisors meetings. Spanish, Filipino, Chinese, Vietnamese and Arabic translations of the overall proceedings are also available upon request at least 72 hours prior to the meeting. Contact the Clerk of the Board’s office at (619) 531-5434 or via e-mail at PublicComment@sdcounty.ca.gov.\nWatch Online\nThere may be a 45-second or more delay when viewing the broadcast online, depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo Livestream\nYouTube\nFacebook\nTwitter\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nCurrently not available on AT&T U-Verse\n\nListen on the Phone\n\nA call-in line is also available to listen to the live Board meeting while it is in session at 619-531-4716. This is a listen-only line.\n\nComment Online or by Phone\nMembers of the public can use the eComment service to submit comments.\nThose who want to participate in the meeting and speak via teleconference must fill out the online Board of Supervisors tele-comments form and submit it before public comment begins. After submitting the form, you will receive instructions on how to call in to the meeting to provide your comments.\nFor more information, visit the Clerk of the Board website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220609.10.22.40"}