{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Hosts First Budget Open House Since Numbers Released", "description": "Residents had a chance to learn about the County’s $8.62 recommended budget during an open house Thursday at the County Operations Center.", "datePublished": "2025-05-23T13:40:30-07:00", "url": "https://www.countynewscenter.com/county-hosts-first-budget-open-house-since-numbers-released/", "keywords": ["government", "2025-26 budget", "2025-27 recommended budget", "2025-27 recommended operational plan", "engage san diego county", "family-friendly", "may 22 budget open house", "virtual budget hearing"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-05-23T13:53:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteEditor’s Note: Budget hearings are scheduled for 9 a.m. and 5:30 p.m. on Tuesday, June 3. This reflects an update to the previous schedule when the evening hearing was scheduled for June 9.\nResidents had a chance to learn about the County’s $8.62 billion recommended budget during an open house Thursday at the County Operations Center.\nThis was the first open house to take place since the budget was publicly released on May 1.\nResidents learned what services the County provides, how the budget was created, where funding comes from and saw some proposed numbers for budget priorities.\nThose priorities include housing and homelessness, behavioral health, public safety, infrastructure, support for vulnerable populations and environmental sustainability. The open house also featured budget information on roads, parks and libraries.\nStaff members were on hand to answer questions and visitors could also give their written feedback on the budget.\nThe family-friendly open house provided an opportunity to visit adoptable animals, meet a park ranger with a live owl, see emergency vehicles and take part in other activities.\nA third budget session with the same information as the open house will be held virtually on Zoom at 5:30 p.m. on Wednesday, May 28.\nIf you would like to attend, register at Engage San Diego County. You can also request language and accessibility services.\nBudget hearings will take place before the Board of Supervisors at 9 a.m. and on 5:30 p.m. on Tuesday June 3.\nThe Board is scheduled to hold deliberations and adopt the budget on June 24. The adopted budget takes effect July 1.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250523.13.40.30"}