{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Receives Update on County’s COVID-19 Response", "description": "The County Board of Supervisors received its first update of the year on the region’s COVID-19 response.", "datePublished": "2021-01-12T17:18:56-08:00", "url": "https://www.countynewscenter.com/board-receives-update-on-countys-covid-19-response/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-01-12T17:18:56-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors received its first update of the year on the region’s COVID-19 response. This was also the first public COVID-19 briefing for the three new board members who were sworn in last week.\nThe Board voted to increase enforcement on businesses and operations that are not in compliance with the safe reopening plans and extended the Great Plates Delivered program providing free meals and income stipend programs. The Board also voted to ensure that enforcement efforts are being applied consistently based on scientific data around how and where COVID-19 spreads.\nBoard members also directed staff to look into whether it is possible to exclude businesses that have repeatedly violated public health orders from eligibility for COVID-19 financial assistance programs.\nTo date, the County has received more than 17,000 complaints about health order violations and the County’s Safe Reopening Compliance Team has issued 335 cease and desist orders. Complaints about violations have exponentially increased since the region moved into the Purple Tier in November, with more than half of all complaints made in the past month.\nCOVID-19 Vaccine Rollout\nRight now vaccine supply remains limited and only San Diegans who fall into Phase 1A of the COVID-19 vaccine distribution can get vaccinated. This includes primarily people who work in health care and employees and residents of long-term care facilities. Healthcare personnel who are eligible to be vaccinated at this time are encouraged to contact their medical provider first to request a vaccination.\nPhase 1A eligible residents who are unable to get vaccinated through their health care provider, can make an appointment online at www.VaccinationSuperStationSD.com. Appointments are limited and individuals are encouraged to check the website regularly if they cannot secure an appointment right away.\n“We understand that demand for the COVID-19 vaccination is high and that our community has many questions about the vaccination process,” said Nick Macchione, director of the County Health and Human Services Agency. “The County will roll out a website feature soon that will clarify the tier system and allow the general public to sign up for notifications about when and where they can get their COVID-19 vaccine. A dashboard is also being developed that will show how many San Diegans have been vaccinated with their first and second dose of the COVID-19 vaccine.”\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\nSix new community outbreaks were confirmed on Jan. 11: two in business settings, one in a distribution warehouse setting, one in a faith-based agency setting, one in a government setting and one in a health care setting.\nIn the past seven days (Jan. 5 through Jan. 11), 48 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n18,119 tests were reported to the County on Jan. 11, and the percentage of new positive cases was 19%.\nThe 14-day rolling average percentage of positive cases is 13.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 27,474.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n3,524 cases were reported to the County on Jan. 11. The region’s total is now 198,319.\n6,313 or 3.2% of all cases have required hospitalization.\n1,273 or 0.6% of all cases and 20.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n41 new COVID-19 deaths were reported to the County on Jan. 11. The region’s total is now 1,898.\n14 women and 27 men died between Dec. 17 and Jan. 10.\nOf the 41 new deaths reported, 16 people who passed away were 80 years or older, eight people were in their 70s, 14 people were in their 60s, two people were in their 50s and one person was in their 40s.\n34 had underlying medical conditions, one did not and six had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210112.17.18.56"}