{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting This Weekend, Polls Open for Four Days – Vote Early", "description": "In a first for a County of San Diego election, the polls for the Nov. 3 Presidential General Election will open for four days, starting this weekend", "datePublished": "2020-10-28T10:33:27-07:00", "url": "https://www.countynewscenter.com/starting-this-weekend-polls-open-for-four-days-vote-early/", "keywords": ["elections", "covid-19", "covid-19 protocols", "fgg", "nov. 3 presidential general election", "polls open", "polls open for four days", "san diego county registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-10-28T13:15:28-07:00", "articleType": "article", "articleContent": "\nIn a first for a County of San Diego election, the polls for the Nov. 3 Presidential General Election will open for four days, starting this weekend.\nIn light of COVID-19, voters are encouraged to vote from home using their mail ballot. But those who want to vote in person can vote early at their assigned polling place from Saturday, Oct. 31 through Monday, Nov. 2 from 8 a.m. to 5 p.m.\nDue to the pandemic and a predicted high voter turnout, the Registrar’s office is urging you to avoid long lines and crowded polling places by voting before Election Day itself.\nThere are fewer polling places than in past elections, and the location of your poll has most likely changed so check the back of your sample ballot and voter information pamphlet for your assigned poll before you head out to vote this weekend.\nYour assigned poll was also included on the Registrar’s postcard reminder sent to voters last week or you can look it up at sdvote.com.\nThe hours at the polls and the Registrar of Voters office will change to 7 a.m. to 8 p.m. on Election Day, Nov. 3. You should prepare for long lines.\nTo vote in person, be prepared.\n\nGo to your assigned polling place.\nBe vote ready. Mark your selections on your sample ballot in advance so when you go inside the voting booth, you can quickly fill in the official ballot.\nWear your face mask and maintain social distance. If you forget your mask, poll workers will give you one. Voters who are unable or unwilling to wear a facial covering or mask will be assisted outside at a social distance and will be able to vote outside.\nFollow all instructions provided by poll workers.\n\nThe Registrar of Voters is adhering to the County’s public health orders and has put in place protocols to ensure the health and safety of election workers, voters and observers at the Registrar’s office, polling places and mail ballot drop-off locations. This includes:\n\nHand sanitizer when entering and exiting the facility\nMasks and gloves\nPlexiglass barriers and floor markers to ensure social distancing\nA defined path of travel throughout the facility\nRegular cleaning/disinfecting of frequently touched objects and surfaces\nPoll workers wearing gloves, masks and in some cases, face shields\nPoll workers undergoing a temperature screening before their shift\n\nRemember campaigning or electioneering within 100 feet of a polling place or mail ballot drop-off location is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or measure on the ballot.\nVoters can still save themselves the trip and mark their ballot from home. Be sure to sign and date the return envelope, seal your completed ballot inside and return it to a mail ballot drop-off location or your assigned polling place.\nYou can confirm your ballot was received by the Registrar’s office online at sdvote.com.\nTo learn more about voting in the Nov. 3 election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201028.10.33.27"}