{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports 530 New Cases, Region on Brink of Purple Tier", "description": "The number of lab-confirmed COVID-19 cases continues to increase in San Diego County and health officials are urging San Diegans, especially those with any symptoms, to get tested for the virus.", "datePublished": "2020-11-05T16:04:33-08:00", "url": "https://www.countynewscenter.com/county-reports-530-new-cases-region-on-brink-of-purple-tier/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-11-05T16:04:33-08:00", "articleType": "article", "articleContent": "\nThe number of lab-confirmed COVID-19 cases continues to increase in San Diego County and health officials are urging San Diegans, especially those with any symptoms, to get tested for the virus.\n“The sooner a positive individual gets tested, the sooner we can start the contact tracing efforts, which helps slow the spread of COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer.\nCOVID-19 testing is now widely available across the county and those with insurance can get tested by their provider at no cost. Testing takes only a few minutes and results generally come back within 3 days.\nRise in Cases\nAfter weeks of being on the brink of slipping into the most restrictive Purple Tier, the County’s case rate rose above 7.0 cases per 100,000 this week. While a single week of a high score does not move a county into a more restrictive tier, the region will be moved if numbers do not improve.\nA move to the Purple Tier would close indoor operations at restaurants, gyms, churches, theaters and other locations.\n“Cases are increasing in the region and it is vital that we take this virus seriously and recommit ourselves to the strategies that are proven to work,” Wooten said. “Wear a face covering when you go out in public, stay six feet away from others and avoid crowds and large gatherings.”\nCommunity Setting Outbreaks:\n\nSix new community outbreaks were confirmed on Nov. 4: three in business settings, two in retail settings, and one in a faith-based setting.\nIn the past seven days (Oct. 29 through Nov. 4), 23 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n15,905 tests were reported to the County on Nov. 4, and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.1%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,440.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n530 new cases were confirmed among San Diego County residents on Nov. 4. The region’s total is now 58,636.\n3,995 or 6.8% of all cases have required hospitalization.\n923 or 1.6% of all cases and 23.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new deaths were reported in the County on Nov. 4. The region’s total remains at 904.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201105.16.04.33"}