{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Percentage of Positive COVID-19 Among Tested Continuing Down", "description": "Nearly 4,000 COVID-19 tests were reported May 13, the highest daily total since testing began to be conducted in the region.", "datePublished": "2020-05-14T17:51:51-07:00", "url": "https://www.countynewscenter.com/percentage-of-positive-covid-19-among-tested-continuing-down/", "keywords": ["health", "coronavirus", "covid-19", "rolling percentage"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-15T09:51:51-07:00", "articleType": "article", "articleContent": "\nNearly 4,000 COVID-19 tests were reported May 13, the highest daily total since testing began to be conducted in the region.\nAt the same time, the percentage of positive COVID-19 cases has been going down, a sign that the region is moving in the right direction in containing the spread of the novel coronavirus.\nThe number of positive cases in comparison to the number of tests administered daily is important because that is one of the federal metrics the County is using to determine when to further ease restrictions in the local Health Officer Order.\nThe 14-day, rolling percentage has been trending downward and has decreased from 6.2% to 4.6% over the past two weeks.\n\n“San Diegans have been following the guidance we’ve provided and this has helped to slow the spread of COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “If this downward trajectory continues, we’ll be able to move forward with additional reopening steps and give people a greater sense of normalcy.”\nCounty health officials expect that as more local residents are being tested for COVID-19 – the goal is to test about 5,200 people daily – the percentage of positive cases will go down because testing now includes a wider sampling and not just people exhibiting symptoms who are more likely to be infected with the virus.\nIn light of the trends, the Board of Supervisors on Tuesday will discuss asking the state to let the County develop a plan to accelerate the reopening local businesses in a safe manner. The goal is for the County to submit alternative data that supports a faster reopening that protects both workers and the public.\nSome County Libraries to Provide Door-side Service\nEmployees from some County departments will return to work from their respective offices starting May 15, although most people who have been working at home or remotely will initially continue to do it.\nStarting May 26, some County libraries will be providing door-side service to residents. People can reserve library materials through the County Library online catalog. Library staff will contact patrons to schedule a pick-up date. Beginning June 6, six more libraries will be providing the same service. You can find the list of branches on the Library website.\nFree Food Delivery Program\nThe County also launched Great Plates Delivered, a program that connects qualified older adults in the region with local restaurants to receive three free and healthy meals a day, delivered to their home.\nWhere to Get Tested for COVID-19\nCOVID-19 testing is available through your medical provider, at local hospitals, some community clinics and private labs. If you don’t have a medical provider, call 2-1-1 and they’ll connect you to one.\nThe County’s Live Well Mobile Office will be in Southeastern San Diego from 9 a.m. to 3 p.m. Sat., May 16 at the Euclid Health Center, located at 292 Euclid Ave. An appointment is required and can be set up by calling 2-1-1 and asking to speak to a public health nurse. Seventy appointments are available and will be filled in a first-come, first-served basis.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,998 tests were reported to the County May 13 and 113 or 3% were positive.\n4.6% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n113 new cases were reported for a San Diego County total of 5,391.\n1,047 or 19.4% of the total cases have required hospitalization.\n321 or 6% of all cases had to be placed in intensive care.\n\nDeaths:\n\nSix COVID-19 deaths were reported today, bringing the region’s total to 200.\nThe new reported deaths were four men and two women. Their ages ranged between 73 and 98 years. One died May 2, one on May 11 and four on May 12.\nAll the people who died had existing chronic conditions.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n68 active outbreaks, 46 at congregate living facilities and 22 in community settings.\n1,241 cases, including 93 deaths in congregate living facilities.\n258 cases, including five deaths in community settings. \n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200514.17.51.51"}