{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Leaders Present Awards to 25 Most Remarkable Teens in San Diego", "description": "The San Diego County Public Defender’s Office named its recipients of the 25 Most Remarkable Teens from around San Diego County for their civic contributions and efforts in categories such as environmental activism, community service, perseverance, mental health activism, courage to overcome personal adversity, arts and culture, and science.", "datePublished": "2021-11-15T13:21:30-08:00", "url": "https://www.countynewscenter.com/leaders-present-awards-to-25-most-remarkable-teens-in-san-diego/", "keywords": ["public safety", "most remarkable teens", "public defender s office"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-11-15T13:21:30-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Public Defender’s Office named its recipients of the 25 Most Remarkable Teens from around San Diego County for their civic contributions and efforts in categories such as environmental activism, community service, perseverance, mental health activism, courage to overcome personal adversity, arts and culture, and science.\n“I didn’t think teens could be any more inspiring than past years remarkable teens, but this year’s nominees were beyond incredible, each and every one of them. Choosing just 25 to celebrate in 2021 was extremely difficult,” said Randy Mize, San Diego County Public Defender. “San Diego teens continue to blow me away with their dedication, commitment, resilience and passion.”\nThe program recognizes youth ages 13 to 19 for their accomplishments. The community submitted more than 150 teen nominations. Every nominee was interviewed by the San Diego County Public Defender Youth Council panel. Nominees all received a certificate of recognition.\nCivic leaders and elected officials from San Diego County and the City of San Diego presented the awards Wednesday evening at the San Diego Central Library. This is the third year teens have been selected for the program. Due to the pandemic, last year’s awards were delivered personally to the teens at home by attorney advisors and youth council members.\nThe 25 Most Remarkable Teens for 2021 are:\nStephan Abrams\nStephan Abrams, 18, a Del Norte High School graduate and freshman at George Mason University, received the Public Defender’s Award of Excellence for his accomplishments as part of Team ENOUGH, a nationwide youth organization that lobbies for gun violence prevention policies. Stephan has helped pass multiple gun safety ordinances and laws in San Diego and throughout the state. Most recently, he worked with the San Diego City Council to pass an ordinance ending the proliferation of ghost guns in San Diego.\nSita Antel\nSita Antel, 17, Mission Bay High School, received her award in the community service category for her hundreds of hours of volunteer service to the National Park Service. She serves as a docent at the Old Point Loma Lighthouse and recently created an award-winning exhibit for the 100th anniversary of women’s right to vote at the Cabrillo National Monument. She is also president of her school’s Model United Nations club and a member of the mock trial team.\n \nCaden Barnes\nCaden Barnes, 17, Carlsbad High School, received the award in the category of creativity: filmmaking. He is the executive producer for his school’s television network, which is the number one high school live broadcast in the nation, producer of its “Daily Show,” and commentator for the livestreams of the school football and basketball games. One film he wrote, directed and produced in a global film challenge won first place in San Diego, first place in the United States, and third place globally.\nRohan Bosworth\nRohan Bosworth, 15, Poway High School, received his award in the technology category. He leads his school’s award-winning robotics team, a global finalist for inventing an application that turns exercise into a game for autistic children. He leads computer-aided design activities at multiple San Diego schools and is a mentor for robotics teams in developing countries. He also produced face shields and ear savers during the pandemic using 3D-printer technology. He is working on a project to make self-driving cars more viable.\nWendy Brizuela\nWendy Brizuela, 17, Gompers Preparatory Academy, received her award in the category of creativity: art. She is active in the Mid-city CAN (Community Advocacy Network) youth council. Wendy is an artist who uses her experiences to make art. Her art is rooted in both her heritage and community. Wendy is especially reflective of the struggles people face in her community, including drug abuse and socio-economic inequality.\n \nKellen Bynes\nKellen Bynes, 17, San Marcos High School, received his award in the campus leadership category. He has been in student leadership for more than seven years both at his school and in various organizations. He was one of four students chosen nationally to present at the 2020 “Speak Up” Congressional Briefing. He has created four resource packs with leadership curriculum including a workshop on how school campuses can be more culturally competent.\n \nFei Chan\nFei Chan, 17, at Canyon Hills High School, received her award in the leadership category. She is a leader for the County of San Diego’s newly created youth sector cohort. She is also a leader for a district student-led committee focusing on mental health and helped pass a resolution that allows mental health days as an excused absence and mental health education for students. Fei also has journalism and communication skills and was selected as one of 10 San Diego Union-Tribune community journalism scholars last year.\nRhea Chhabra\nRhea Chhabra, 17, Scripps Ranch High School, received her award in the most enterprising category. She invented an award-winning virtual-reality driving simulator for teens. She and her team joined the Regional Entrepreneurship Center Innovation Lab at Miramar College where they learned how to market her company, build a network of investors, and gain resources to help in the patenting process. She then partnered with a technology consulting company to help her further. Rhea is planning launch the app in 2022. Her team is auditioning the app for “Shark Tank.”\nJonathan Eppert\nJonathan Eppert, 18, at Hilltop High School, received his award in the category of personal determination. He is recovering from Hodgkin’s lymphoma and has had to work hard to keep up with his classes. He now ranks first of 416 in his class at Hilltop High. He spent the last summer as a counselor at a camp for children with cancer and serves on the Junior Council for an organization called Oncology and Kids. He also leads a support group called “thrivorship” for teens at Rady Children’s Hospital and helps raise money and spread awareness for cancer support programs offered at the hospital.\nKara Fan\nKara Fan, 16, Westview High School, received the award in the category of inventor. She developed a liquid bandage that uses nano-silver to kill bacteria and contains no antibiotics. The patent for her bandage is pending. She won the title of “America’s Top Young Scientist” and was awarded $25,000 and a trip to the New York Stock Exchange to ring the closing bell. Kara is raising awareness about antibiotic resistance as a global health crisis with an online escape room game.\n \nLeonardo Garcia\nLeonardo Garcia, 14, Kearny School of Engineering, Innovation and Design, received his award in the citizenship category. Leonardo has been recognized as a student leader since he was in second grade, helping reward positive behavior in other students. He has also tutored his sister, and at-risk, struggling kindergarten children, all while maintaining an excellent academic record.\n \nAidan Hallinan\nAidan Hallinan, 18, Mission Bay High School, received his award in the mental health activist category. He is autistic and suffered from depression. He has been working tirelessly on his recovery with therapy. He launched a personal campaign on mental health awareness to help other teens experiencing depression and anxiety. He also created a website called “Hopesparkk” to help struggling teens and adults dealing with mental health issues find hope and acceptance.\nSamira Hassan\nSamira Hassan, 16, Patrick Henry High School received her award in the youth activism category. She is active in No Place for Hate, the Muslim Club and the Black Student Union groups on campus. She also wrote an opinion piece about what it’s like to be a Muslim in San Diego published in the San Diego Union-Tribune and discussed being a target of hate crimes and blatant racism. Samira, who suffers from anxiety, is a member of a youth organization that is dedicated to destigmatizing mental health issues.\nDivinity Hawkins\nDivinity Hawkins, 17, San Pasqual Academy, received his award in the category of courage to overcome adversity: personal situation. He overcame a difficult life, dealing with poverty and being different. He was placed in foster care after his mother lost her job and they were living in her car. Divinity now is involved in theater and works with several local companies. He is also involved in his student body council.\n \nElijah Hudson\nElijah Hudson, 17, Rancho Buena Vista High School received his award in the category of community empowerment. He is an active member of the NAACP Youth Council and currently serves as the president. The organization works for the improvement of communities and life for people of color and children in need. He is active in the causes of ending gun violence, supporting the environment and adapting to the impacts of climate change.\n \nIlan Jinich\nIlan Jinich, 17, San Diego Jewish Academy received his award in the social conscience category. He uses art and filmmaking to bring awareness to the social and environmental challenges faced by marginalized communities. He makes documentaries on the plight of undocumented migrants, climate change, and environmental injustice. He has won international awards for his work. He also works with school administrators to increase sustainable development awareness and curricula for classrooms.\nSree Kandhadai\nSree Kandhadai, 16, Francis Parker School, received her award in the category of environmental activism. She is a volunteer with the San Diego Audubon Advocacy Program where she works to protect birds and       other wildlife and helps restore habitat. She is an advocate for clean air and water and educates the public about climate change and other environmental threats. She is working to protect golden eagles that nest in the Ramona Grasslands.\nDenisse Lopez\nDenisse Lopez, 18, a graduate of Hoover High School and current UCSD student, received her award in the category of civic engagement. She is a member of the Mid-City CAN (Community Advocacy Network) youth council. She advocated for free transit passes for youth and a 24 hour bus through City Heights. Last month, SANDAG approved the Social Equity Early Action Transit Pilot Program which will do both those things. She also ran and was elected to sit on the City Heights Area Planning Committee and advocated for vaccines and vaccine education in her community.\nJocorey Mitchell\nJocorey Mitchell, 17, West Hills High School received his award in the category of performing arts: actor. Jocorey has performed as an actor, singer and dancer in seven productions at West Hills High School in the last four years. He recently was awarded a scholarship for acting from the American Music and Dramatic Academy. He is an active member in the high school theater club and is a peer mentor to new members. Despite many personal obstacles, he remains positive and credits acting with helping him deal with life’s challenges.\nKieran Pearson\nKieran Pearson, 17, Torrey Pines High, received his award in the LGBTQ activist category. He always knew he was different, even at a young age, but as he grew older, he didn’t recognize himself and became depressed. With the help of his family, Kieran came out as transgender and is living his life authentically. He joined the school’s Gender Sexuality Alliance club to help make it a safer space for future transgender students. He also volunteers with Trans Family Support Services, an organization that was instrumental in his own success and current relationship with his family.\nVanessa Russell\nVanessa Russell, 18, a graduate of Valley High School and student at Palomar College, received her award in the category of perseverance. She became a teenage mother, and soon after the baby’s birth, the father became abusive to Vanessa. She ultimately felt she had no other choice but to file charges against him so her daughter would not grow up in an abusive family. Vanessa focused on getting her high school diploma, despite being three years behind in school. She is the first in her family to get a diploma and to attend college.\nZane Trubick\nZane Trubick, 19, a graduated of Point Loma High and a student at the University of California San Diego, received his award in the category of courage to overcome adversity: family situation. Zane’s early childhood was traumatic, and he spent much time in foster care. Finally, he went to live with a court appointed special advocate and he was able to refocus his life path. He joined the Naval Junior Reserve Officer’s Training Corps in school which helped him obtain a full five-year Naval scholarship to UCSD where he is studying electrical engineering.\nXiomara Villarreal-Gerard\nXiomarra Villarreal-Gerardo, 19, a graduate of Eastlake High and a San Diego State University student, received her award in the journalism category. Xiomarra attended Southwestern College at age 16 and earned two Associate of Arts degrees. At Southwestern College, she was the editor of the El Sol Magazine and held various editor positions for the SWC Sun newspaper. She won various journalism awards including being named as one of the top College Media Journalists. She now writes for the Daily Aztec in both English and Spanish and is the social media editor for the National Association of Hispanic Journalists SDSU chapter.\nNicole Warkentien\nNicole Warkentien, 17, San Diego School of the Creative and Performing Arts, received her award in the category of performing arts: musical theatre. She has performed onstage since the age of four. She is an accomplished singer, dancer, actor and pianist. She has had lead roles in many local youth productions of musical theater and dance productions including “Les Misérables,” “Billy Elliot,” “Legally Blonde,” and as a ballet dancer as Clara in “The Nutcracker.” She plans to study theater in New York and pursue a career as a professional actress.\nFlora Yuan\nFlora Yuan, 17, Del Norte High, received her award in the category of music: vocalist. Flora has won numerous vocal awards including first place in the American Protégé International Vocal competition. She is the co-founder and president of “Music4Kids San Diego,” a non-profit youth organization that brings music education opportunities to underprivileged children. The organization invites students to take free online music lessons from musically gifted high school students.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211115.13.21.30"}