{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Deaths Increase to 53, Cases Rise to 1,930", "description": "Fifty-three San Diegans have died from complications of COVID-19 and the number of local cases increased by 83, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-14T17:02:02-07:00", "url": "https://www.countynewscenter.com/covid-19-deaths-increase-to-53-cases-rise-to-1930/", "keywords": ["health", "coronavirus", "covid-19", "six indicators"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-15T12:30:28-07:00", "articleType": "article", "articleContent": "\nFifty-three San Diegans have died from complications of COVID-19 and the number of local cases increased by 83, the County Health and Human Services Agency announced today.\nAll six people who died from the novel coronavirus had underlying medical conditions.\n“COVID-19 continues to take a toll on our residents and communities,” said Eric McDonald, M.D., M.P.H., medical director of the County Epidemiology and Immunization Services branch. “Our condolences go out to the families and loved ones of those who perished because of this novel virus.”\nThe age, gender and race and ethnic breakdown of the local COVID-19 deaths are:\nAge:\n\n80 and older: 27\n70 to 79: 14\n60 to 69: 5\n50 to 59: 4\n40 to 49: 1\n20 to 29: 2\n\nGender:\n\n30 Men\n23 Women\n\nRace and Ethnicity:\n\n22 White\n16 Hispanic\n2 Asian\n1 Multiple races\n12 Unknown\n\nCounty COVID-19 Cases Now at 1,930\nEighty-three new COVID-19 cases were announced today, bringing San Diego County’s total to 1,930.\nOf the local cases, 971 (50.3%) were men and 954 (49.4%) were women. The gender of five people is unknown. Of the reported cases, 450 (23.3%) have required hospitalization and 164 (8.5%) of the total number of cases had to be placed in intensive care. Fifty-three (2.7%) have died.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nOther measures and resources to deal with COVID-19 include:\n\nMore than 27,000 tests have been administered to San Diegans.\nThe County has distributed more than 2 million personal protective equipment items to local health care providers, including nearly 810,000 N-95 respirators, almost 400,000 surgical face masks and about 746,000 gloves.\nA total of 2,029 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,582 rooms for County Public Health Services use, 201 are occupied by 213 guests.\nOf the 447 rooms assigned to the Regional Task Force on the Homeless, 194 are being occupied by 322 people who are at higher risk of developing complications from COVID-19.\n\n6 Things to Consider Before Modifying Stay-at-Home Orders\nCalifornia Gov. Gavin Newsom today announced six indicators the state will use when determining whether to modify the stay-at-home orders, and although he gave no timeline as to when this might occur, he did indicate it would be in phases.\nThese indicators, which can be modified by local public health officers and will be in place until community immunity is achieved, include having the ability to:\n\nMonitor and protect communities through testing, contact tracing, isolation and supporting people who test positive or have been exposed.\nPrevent infection in people who are at risk for more severe COVID-19.\nHandle surges in cases by hospitals and health systems.\nDevelop treatments options to meet the demand.\nSupport physical distancing by businesses, schools and childcare facilities.\nDetermine when to reinstitute certain measures, such as the stay-at-home orders, if necessary.\n\n“We will follow the state’s recommendations and guidelines and adapt them as necessary to continue protecting our local residents,” McDonald said. “We understand people want to return to their normal lives, but we must continue to stay at home until the novel coronavirus is no longer a threat to the public.”\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data is also broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200414.17.02.02"}