{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Boosters Keeping San Diegans Out of Hospitals", "description": "Recently released research from the Centers for Disease Control and Prevention shows that COVID-19 vaccine boosters prevent severe illness and hospitalizations. Despite that, only 1,021,730 or 49.9% of San Diegans who are fully vaccinated have received a booster.", "datePublished": "2022-01-26T16:54:18-08:00", "url": "https://www.countynewscenter.com/boosters-keeping-san-diegans-out-of-hospitals/", "keywords": ["health", "coronavirus", "covid-19", "covid-19 boosters", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-01-26T17:20:35-08:00", "articleType": "article", "articleContent": "\nRecently released research from the Centers for Disease Control and Prevention shows that COVID-19 vaccine boosters are effective at preventing severe illness and hospitalizations.\nDespite that, only 1,021,730 or 49.9% of San Diegans who are fully vaccinated have received a booster, according to the County Health and Human Services Agency. That means 1,026,439 are due for a booster. Boosters are currently available for everyone 12 years and older.\n“While we’re seeing more breakthrough infections due to the COVID-19 omicron variant, research has shown that significantly fewer people who have received their booster are getting seriously ill and ending up in the hospital,” said Wilma J. Wooten, M.D., M.P.H., County public health officer.\nOf the 996 hospitalizations reported in the 30-day period Dec. 14, 2021 through Jan. 12, 2022, a total of 91 (9.1%) San Diegans who were boosted ended up in the hospital.\n“San Diegans should get a booster immediately, if they are eligible,” Wooten said.\nThe region has plenty of COVID-19 vaccines and booster doses. The county has more than 400 vaccination sites including pharmacies, medical providers, clinics, and County locations. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nDoses administered: Close to 6.58 million.\nReceived at least one shot: Over 2.85 million or 90.8% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.51 million or 79.9%.\nBoosters administered: 1,021,730 or 49.9% of 2,048,169 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n69 new deaths were reported since the last report on Jan. 19, 2022. The region’s total is 4,622.\n46 men and 23 women between Dec. 29, 2021 and Jan. 20, 2022.\n31 were age 80 or older, 14 were in their 70s, 18 were in their 60s, three in their 50s, two were in their 40s and one was in their 30s.\n26 of the people who died was fully vaccinated and 43 were not fully vaccinated.\n59 had underlying medical conditions, two did not and eight had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n6,108 COVID-19 cases were reported to the County on Jan. 25, 2022. The region’s total is now 675,250.\n60,548 cases were reported last week (Jan. 19 through Jan. 25, 2022) compared to 69,151 COVID-19 infections identified the previous week (Jan. 12 through Jan. 18, 2022).\nSan Diego County’s case rate per 100,000 residents is 185.1 for people fully vaccinated and boosted, 336.4 for fully vaccinated people and 504.0 for not fully vaccinated San Diegans.\n25,426 tests were reported to the County on Jan. 23, 2022, and the percentage of new positive cases was 21.6%.\nThe 14-day rolling percentage of positive cases among tests is 24.7%.\n\nCommunity Setting Outbreaks:\n\n57 new community outbreaks were confirmed in the past seven days (Jan. 19, 2022 through Jan. 25, 2022): 23 in TK-12th grade school settings, 12 in daycare/preschool/childcare settings, five in government settings, four in business settings, three in restaurant/bar settings, three in emergency services settings, two in community-based organization settings, two in retail settings, two in health care settings and one in a faith-based setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220126.16.54.18"}