{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Cool, Have Fun, Explore Summer at Your Library", "description": "School’s out for summer and wait… the kids are bored already? Check out Summer at Your (County) Library.", "datePublished": "2024-07-03T14:36:31-07:00", "url": "https://www.countynewscenter.com/stay-cool-have-fun-explore-summer-at-your-library/", "keywords": ["library", "county library", "instant digital library cards", "library", "library programs", "lueg", "summer at the library"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-07-03T14:36:31-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSchool’s out for summer and wait… the kids are bored already? Check out Summer at Your (County) Library.\nThe County Library is offering a wide array of fun things to do. The programs cater to grade schoolers, high school kids and even little ones. Grownups will find classes designed just for them, too.\nBasically, the Library has something for everyone this summer. Depending on the branch, you might find musical performances, puppet and magic shows, puzzle time, a Lego Lab, a teen escape room, gaming, teen henna, kids’ bingo, chess and other board games, pastel chalk art, arts and crafts, t-shirt decorating for teens and the list goes on.\nThat’s on top of programs that the Library offers year-round, like yoga, Tai Chi, Mah-Jong, tech classes, concerts, writing groups, book clubs, after school activities and 3D printing. Kids can practice their reading skills by reading to dogs.\nAnd of course, there’s always story time. For babies, for toddlers, and for bigger kids. Little ones can even shake it up at a dance time-story time.\nNot all branches offer all classes. See what the closest one offers. Or you’re welcome to visit another branch to attend a program.\nYou can visit the County Library’s website, choose a branch, age range, type of event and program and see what appeals to you and your kids.\nSummer at Your Library programs run through Aug. 31.\nYou can also check out the Summer Learning Program. All ages can take part, but it’s especially designed for kids and teen to offset learning loss during summer break. All 33 branch locations offer the program. Those who register can win achievement badges for reading and other activities. Earn enough achievement badges and you can win a prize.\nAll the classes and programs are free.\nIf group activities aren’t your thing, you’re still welcome to drop by. Take advantage of the free Wi-Fi and air conditioning, sign up to use a desktop PC and check out the many books, audiobooks and movies.\nThe County Library will be closed for the Fourth of July. But all branches open again on Friday.\nMeantime, you can join more than five million County Library customers who download e-books, audiobooks and magazines. It’s easy and again it’s free. You can get an Instant Digital Library card online.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240703.14.36.31"}