{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is the Deadline to Register to Vote", "description": "If you want to vote in the March 3 Presidential Primary Election, register by Tuesday, Feb. 18.    ", "datePublished": "2020-02-13T14:44:11-08:00", "url": "https://www.countynewscenter.com/tuesday-is-the-deadline-to-register-to-vote/", "keywords": ["elections", "deadline", "fgg", "march 3 2020 election", "presidential primary election", "register to vote", "registrar of voters", "vote for president"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-13T15:18:53-08:00", "articleType": "article", "articleContent": "\nIf you want to vote in the March 3 Presidential Primary Election, register by Tuesday, Feb. 18.    \nYou will need to register to vote if you:  \n\nare not registered in San Diego County  \nrecently moved \nchanged your name \nchanged your political party status \n\nIf you want to vote for president, make sure your ballot has the option you want. Political parties decide who may vote in their presidential primaries.  \nIf you are registered with a political party that is different from the presidential candidate you want to vote for, you will need to register to vote with that party and should do so by Tuesday. \nIf you are registered as Nonpartisan (also known as independent, no party preference or decline to state), the presidential contest won’t be listed on your ballot. You may request either an American Independent Party, Democratic Party or Libertarian Party ballot at your designated polling place to vote for one of their presidential candidates. These parties are allowing Nonpartisan voters to vote in their primaries.   \nHowever, if you want to vote for a presidential candidate in the Green, Peace and Freedom or Republican parties, you must re-register with that party, and you should do so by Tuesday. These three parties are allowing only those registered with their party to vote in their presidential primary.  \nIf you’re not sure about your registration, check your registration status at sdvote.com. If you’re not registered or need to change your registration, you’ll find that information there, too. If your signature is confirmed through records at the Department of Motor Vehicles, it will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the online form, sign it and mail it to the Registrar.  \nFor voters without access to a computer, registration forms are also available at the offices of the Registrar of Voters, U.S. Postal Service, City Clerk, public libraries and Department of Motor Vehicles. For voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.  \nRegistration forms must be postmarked or delivered to the Registrar by Feb. 18. The Registrar of Voters office will be open until 8 p.m. that day. Voters may also register online until midnight. \nEarly voting is already underway at the Registrar’s office in Kearny Mesa, located on the County Operation Center campus at 5600 Overland Ave., San Diego, 92123. Voters can cast their ballots there from 8 a.m. to 5 p.m. Monday through Friday until Election Day, when the voting hours will change to 7 a.m. to 8 p.m. to reflect the hours at the polls. The Registrar will also be open between 8 a.m. and 5 p.m. on Saturday, Feb. 29 and Sunday, March 1 for weekend voting. \nThere is still time to apply for a mail ballot if that is more convenient. Registered voters can request a mail ballot until Feb. 25.  \nIf you miss the deadline to register, you may still conditionally register and vote provisionally through Election Day.  \nFor additional information, call (858) 565-5800 or visit sdvote.com. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200213.14.44.11"}