{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Investigating First Bird Flu Case in Cat", "description": "County Public Health officials are investigating a suspected case of bird flu (H5N1) in a house cat from East County.  ", "datePublished": "2025-02-26T11:25:50-08:00", "url": "https://www.countynewscenter.com/county-investigating-first-bird-flu-case-in-cat/", "keywords": ["health", "bird flu", "cat", "district 2", "h5n1", "healthy and safe communities", "public safety and justice reform"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-02-27T11:22:48-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesCounty Public Health officials are investigating a suspected case of bird flu (H5N1) in a house cat from East County.  \nPreliminary test results show the cat, which got sick and died in mid-January 2025, was positive for bird flu.  The indoor cat ate a raw pet food that is suspected to be the source of the infection.  \nThis is the first case of bird flu in a cat in San Diego County. Several other unconnected cases have happened in cats throughout the state, and all are suspected to be the result of eating raw food or raw milk.\nBird flu or H5N1 is a highly contagious virus that can sicken or kill birds and other animals. In 2024, there were six cases of bird flu in wild gulls in San Diego County. No wildlife cases have been confirmed so far in 2025. No local cases in humans have been reported.  \nWhile rare, it can be spread to people when the virus gets in someone’s eyes, nose or mouth, or when it is inhaled.  No local cases in humans have been reported and the risk to people remains low.   \n“Bird Flu has been devastating for wildlife populations around the globe, poultry and dairy cattle in our country and has infrequently affected people and cats,” said Dr. Seema Shah, Medical Director of County Epidemiology and Immunization Services Branch. “The County is actively monitoring wild birds and expanding testing, along with keeping tabs on people exposed to those animals in case they exhibit symptoms. We are also working with veterinarians, healthcare providers, farmers and wildlife groups to provide guidance and resources.”  \nWhile cases of bird flu in people and cats are rare, there are steps you can take to lower the risk of bird flu for yourself, family and pets. \n\nAvoid consuming raw milk or dairy products or feeding them to your pets because raw milk is not pasteurized. Pasteurization is a heating process that kills harmful pathogens like bird flu or bacteria like salmonella, toxin producing E. coli. and listeria \n\n\nAvoid feeding raw pet food products to pets and talk to your pet’s veterinarian about safe and healthy diets \n\n\nThoroughly wash your hands with soap and water when handling raw foods like meats and poultry and cook them to recommended temperature before serving  \n\n\nAvoid touching sick or dead birds or animals and report them to animal control \n\n\nDon’t let your pets eat or touch sick or dead bird or animals \n\n\nKeep your cats indoors and supervise pets outdoors \n\n\nGet the seasonal flu vaccine. While it does not protect against bird flu, it can protect you from getting both the season flu and bird flu at the same time.  \n\nOn the West Coast, house cats have died from bird flu caused by consuming raw milk or food products including in Santa Barbara County, San Mateo, Los Angeles, Washington and Oregon. \nSigns of bird flu in cats include neurologic issues like lack of coordination, tremors, seizures or blindness, loss of appetite, discharge from the eyes and nose and other respiratory issues like breathing fast, sneezing or coughing. Pet owners should tell their veterinarian if their pet is sick and has eaten a raw food diet, has interacted with poultry or dairy cattle, or hunts wild birds or other wild animals.  \nThose most at risk for bird flu are farmworkers, people with backyard flocks, wildlife workers and those who work around animals. Those that work with ill animals can use personal protective equipment to reduce their likelihood of exposure to the virus.  \nMore information about bird flu is posted on the County’s website including guidance for healthcare professionals, employers and veterinarians.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250226.11.25.50"}