{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Applications Open for a New Environmental Justice Workgroup", "description": "The County’s Office of Sustainability and Environmental Justice is looking for people who would like to be part of a new Environmental Justice Workgroup.", "datePublished": "2024-09-03T11:55:11-07:00", "url": "https://www.countynewscenter.com/applications-open-for-a-new-environmental-justice-workgroup/", "keywords": ["environment", "environment", "environmental justice", "sustainability", "workgroup"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-09-03T11:55:11-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Office of Sustainability and Environmental Justice (OSEJ) is looking for people who would like to be part of a new Environmental Justice Workgroup.\nParticipation in the Workgroup is an opportunity to help shape sustainability policies, programs and services with a social equity focus.\nThe group will advise County of San Diego departments, along with other jurisdictions on climate justice topics like air quality, healthy food, and access to safe, clean and green outdoor spaces.\nThis group is intended to give all people, including those from communities most impacted by environmental injustices, a say in advancing the regions climate efforts.\n“The most equitable and informative way to shape climate action in the region is with direct participation of the people facing daily climate challenges in their communities,” said the County’s Chief Sustainability Officer Eden Brukman. “Our team is eager to learn and share with this group to improve livability and long-term resiliency in San Diego County.”\nThe Workgroup will be made up of 21 members selected through an application process. Members must live in San Diego County or within a Tribal nation in the San Diego region and meet at least one of the following criteria:\n\nResident with lived experience with environmental injustices\n\n\nMember of a local Tribe\n\n\nBe between the ages of 16-24\n\n\nLeader from community-based or Tribal organizations working in health, social, economic, or environmental fields that focus on equity\n\n\nAcademic or researcher with expertise in addressing the underlying causes of health, social, economic, or environmental disparities in communities impacted by unjust systems\n\n\nOther self-identified characteristics will be considered to strengthen diverse representation particularly for groups often marginalized or under-represented in public participation processes (i.e., people who identify as Black, Indigenous, and people of color; LGBTQ+; youth; immigrants and refugees; unhoused; low-income; or live in an unincorporated or rural area)\n\nThe group will include people who have formal education and experience in eco-friendly and social justice subject areas.\nMembers will receive a $150 stipend per meeting for their participation.\nApplications are open from Sept. 3 to Nov. 11. OSEJ will host two virtual information sessions, one on Sept. 24 and another Oct. 24. Both will be from 4:30-5:30 p.m.\nFor more information, visit the Environmental Justice Workgroup website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240903.11.55.11"}