{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Vaccinations To Open to Teachers, Law Enforcement, Food Workers on Saturday", "description": "The County of San Diego announced Wednesday that COVID-19 vaccinations will open Saturday, Feb. 27, to people who work in emergency services, child care and education, and food and agriculture (including grocery stores).  ", "datePublished": "2021-02-24T18:26:07-08:00", "url": "https://www.countynewscenter.com/vaccinations-to-open-to-teachers-law-enforcement-food-workers-on-saturday/", "keywords": ["government", "02-24-21 covid-19 update", "agriculture", "childcare", "covid-19", "education", "emergency services", "farm workers", "food", "grocery stores", "law enforcement", "teachers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-02-24T18:26:07-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego announced Wednesday that COVID-19 vaccinations will open Saturday, Feb. 27, to people who work in emergency services, child care and education, and food and agriculture (including grocery stores).\nCurrently, health care personnel, long-term care facility staff and residents, and those who are 65 years and older are eligible for vaccines.\nThe County decided to open the vaccines to more people in Phase 1B, Tier 1 as vaccine supplies increase and more progress is made in vaccinating those currently eligible.\nThree agencies will take the lead in vaccinating some of the newly eligible groups.\nThe San Diego County Office of Education and the California Schools VEBA will exclusively schedule appointments for transitional kindergarten (TK) through 12th grade teachers and staff through vebavaccinates.com. The priority will be schools open and planning to open, and then those closed, starting with those in the fourth quartile of the California Healthy Places Index (HPI).\n“The state called for setting aside 10% of vaccine supply for education but the County of San Diego is going further,” said County Public Health Officer Wilma Wooten. “We are setting aside 20% to get teachers back in schools.”\nAppointments exclusive to the law enforcement community will be organized by Scripps Health.\nFor farm workers in fields and rural locations, CAL FIRE and Operation Collaboration will take the lead in scheduling remote vaccination events.\nAll others eligible in the these groups can sign up for appointments through vaccinationsuperstationsd.com. However, patience is advised as the newly opened tier includes half a million people. Not everyone will be able to get an immediate appointment, but more time slots will open as additional vaccines arrive.\nPeople with underlying conditions can begin signing up for vaccinations on March 15.\nTo date, over 828,000 COVID-19 doses have been delivered to the region with more than 777,000 administered. The difference between the two numbers represents approximately what is expected to be administered the next seven days and doses still to be entered in the record system. More than 6,200 doses were administered and pending documentation.\nThose vaccinated to date include more than 196,000 San Diegans who are fully vaccinated, while 19.6% of the population over age 16 has received at least one dose.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 15 cases per 100,000 residents (as of Feb. 23) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 5%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.4% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 2.\n\nCommunity Setting Outbreaks:\n\n10 new community outbreaks were confirmed Feb. 23 in eight businesses, one retailer and one Tk-12 grade school.\nIn the past seven days (Feb. 17 through Feb. 23), 29 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n14,926 tests were reported to the County on Feb. 23, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 4.6%.  Target is less than 8.0%.\nThe 7-day, daily average of tests is 14,609.\n\nCases, Hospitalizations and ICU Admissions:\n\n658 cases were reported to the County on Feb. 23. The region’s total is now 258,463.\n13,072 or 5.1% of all cases have required hospitalization.\n1,575 or 0.6% of all cases and 12.0% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n12 new COVID-19 deaths were reported Feb. 23. The region’s total is 3,230.\nEight men and four women died between Dec. 7 and Feb. 21.\nOf the 12 deaths reported Feb. 23, two people who died were 80 years or older, two were in their 70s, five were in their 60s and three were in their 50s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210224.18.26.07"}