{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Help County Set Budget Priorities", "description": "It is not released until May, but the County is already working on the budget for the next fiscal year. And thinking about what to prioritize in a volatile economy. That’s where you come in. The County wants your help.  ", "datePublished": "2024-02-23T17:05:06-08:00", "url": "https://www.countynewscenter.com/help-county-set-budget-priorities/", "keywords": ["government", "2024-25 operational plan", "budget", "budget engagement survey", "fgg", "operational plan"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-23T18:37:21-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIt is not released until May, but the County is already working on the budget for the next fiscal year. And thinking about what to prioritize in a volatile economy.  \nThat’s where you come in. The County wants your help.  \nYou’re invited to fill out a survey on Engage San Diego County to tell us which services are most important to you. Your responses will be considered in balance with other critical factors to set budget priorities for this and future budget cycles. \nAnd you can stay informed by telling us how you prefer to receive additional budget information. For example, email, text or some other form of communication.  \nThe survey will remain open through March 17. \nA balanced recommended budget will be released to the public on May 2. And it’s no small matter. Last year, the budget for Fiscal Year 2023-24 came to $8.17 billion. \nMeanwhile, County staff is examining data, assessing available resources, reviewing community feedback from 2023 and bearing equity in mind when identifying funding priorities.    \nThe County’s budget encompasses the unincorporated areas and services provided throughout the region.  \nIn the unincorporated areas, the County provides things a city typically would, like roads, parks, libraries and more. \nRegionally, the County has even larger responsibilities. For example, it provides services for mental health and substance use issues and provides food and medical assistance to those who need them. \nThe County addresses homelessness and affordable housing, monitors public health for disease outbreaks and inspects restaurants, buildings, gas stations, price scanners, harmful insects and beach water. \nThe District Attorney’s Office, Probation, Office of Emergency Services and Child Support provide services to the entire county too. The Sheriff’s Department oversees the unincorporated area but is also paid by some cities for law enforcement. The County runs elections, collects property taxes, keeps vital records and the list goes on. \nFunding must support all existing programs and cover new ones. The state and federal government provide a large share. But those tax dollars must be spent on certain programs. Some money comes in from property taxes, fees for services and other sources. \nOnce the state and federal dollars are accounted for, the County looks at what funds are left to spend and considers how to get the most out of the remaining funds.  \nCounty staff does a lot of the legwork preparing a recommended budget, but residents get a say all along the way.  \nOnce the recommended budget is released on May 2 and through June 13, the public can submit comments online through the budget page on Engage San Diego County.   \nYou can also give your feedback at upcoming community meetings or by attending or calling into the Board of Supervisors budget meetings. A list of key days and times is listed on our open budget website. You’ll also see last year’s adopted budget. \nThis year, departments will give their budget presentations to the Board of Supervisors at meetings on May 14 and May 16. The Board will hold public hearings on June 4 and June 6. Budget deliberations and adoption take place on June 25. \nYou can also visit the Clerk of the Board’s website or call 619-531-5434 for information on Board meetings and to request translation services. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240223.17.05.06"}