{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "29 Ballot Drop Boxes Open for District Four Special Primary Election", "description": "Starting Tuesday, July 18, registered voters in the Fourth Supervisorial District can return their mail ballot at any one of 29 official ballot drop boxes located around the district.", "datePublished": "2023-07-18T11:24:23-07:00", "url": "https://www.countynewscenter.com/29-ballot-drop-boxes-open-for-district-four-special-primary-election/", "keywords": ["elections", "aug. 15 special primary election", "county registrar of voters", "district 4", "fourth supervisorial district", "registrar of voters", "supervisorial district 4"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-07-18T15:06:55-07:00", "articleType": "article", "articleContent": "\nStarting Tuesday, July 18, registered voters in the Fourth Supervisorial District can return their mail ballot at any one of 29 official ballot drop boxes located around the district.\nMail ballots are enroute to nearly 400,000 registered voters in the Fourth Supervisorial District for the Aug. 15 special primary election and some voters may have received theirs as early as Monday.\nWhat do the Registrar’s official ballot drop boxes look like?\nThe Registrar’s official ballot drop boxes are red, white, and blue and feature the Registrar’s logo along with the County seal. All boxes are labeled “Official Ballot Drop Box” and constructed from high grade, heavy gauge stainless steel.\nEach ballot drop box is designed to prevent physical damage and unauthorized access to mail ballots. The boxes feature double-locking access doors, anti-pry door jambs, and other anti-theft construction measures. The Registrar’s ballot retrieval team is responsible for collecting ballots inside the box.\nHow do I return my ballot to an official ballot drop box?\nMark your ballot, seal your completed ballot inside your return envelope, date and sign your name on the return envelope, and return it in the mail or to one of the Registrar’s 29 official ballot drop boxes around the district. Remember, your signature is required for your vote to count.\nTwenty-two official ballot drop boxes are located outdoors and are open 24-hours a day up until 8 p.m. on Election Day, Aug 15. Seven are located indoors and access to those is available during the individual facility’s hours of operation.\nWith that in mind, voters should check each location’s hours of operation before heading out to return their ballot. Find the closest one to you by visiting the Registrar’s online locator tool.\nOn Election Day, Aug 15, all of the Registrar’s official ballot drop box locations will be open from 7 a.m. to 8 p.m.\nEarly voting also began Monday at the Registrar of Voters office in Kearny Mesa. You can vote there between 8 a.m. and 5 p.m. Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nIf you prefer to vote early in person and avoid long lines, seven vote centers will open Saturday, Aug. 5. The vote centers will be open daily from 8 a.m. to 5 p.m. until the final day of voting, Tuesday, Aug. 15, when 14 vote centers will be open from 7 a.m. to 8 p.m.\nYou can find an official ballot drop box or vote center location near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nLearn more about voting in the District 4 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136. Get mobile updates by texting COSD D4Election to 468311.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230718.11.24.23"}