{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting Saturday, Seven Vote Centers Open for Special Primary Election", "description": "If you live in the County of San Diego’s First Supervisorial District, you can cast your ballot early at any one of seven vote centers in the district starting Saturday, March 29.", "datePublished": "2025-03-28T11:02:18-07:00", "url": "https://www.countynewscenter.com/starting-saturday-seven-vote-centers-open-for-special-primary-election/", "keywords": ["elections", "april 8 special primary election", "county registrar of voters", "d1", "d1 special primary election", "fgg", "vote centers open"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-03-28T11:02:18-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesIf you live in the County of San Diego’s First Supervisorial District, you can cast your ballot early at any one of seven vote centers in the district starting Saturday, March 29. The vote centers will be open daily from 8 a.m. to 5 p.m. through Monday, April 7, at the locations below:\nBonita-Sunnyside Branch Library – Community Room\n\n4375 Bonita Road\nBonita, 91902\n\nChula Vista City Hall\n\n276 4th Ave.\nChula Vista, 91910\n\nCounty of San Diego HHSA – Conference Room\n\n690 Oxford St.\nChula Vista, 91911\n\nWest View Elementary – Auditorium\n\n525 3rd St.\nImperial Beach, 91932\n\nMountain View Community Center – Back Meeting Room\n\n641 S Boundary St.\nSan Diego, 92113\n\nSan Ysidro Senior Center\n\n125 E Park Ave.\nSan Ysidro, 92173\n\nSpring Valley Community Center – Olsen Room\n\n8735 Jamacha Blvd.\nSpring Valley, 91977\n\nOn the final day of voting, April 8, six more vote centers will open for a total of 13 locations and the hours will change to 7 a.m. to 8 p.m. You can find a vote center or an official ballot drop box near you inside your voter information pamphlet, or look up your pamphlet online with the View Voter Information Pamphlet (Sample Ballot) tool at sdvote.com.\nVote centers have replaced polling places and provide more services. You can:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selection on ballot marking devices. When finished, the voter will print out the official ballot, review it, place it in a secrecy sleeve, and hand it to a poll worker to insert it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate on the ballot. Additionally, an individual may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nThe person elected will fill the district’s vacant seat for the remainder of the current term that ends in January 2029. If no candidate receives a majority vote at the April 8 election, the top two vote-getters will move on to the special general election on July 1. Only those who live in the district can vote in the election.\n\nDistrict 1 runs from the Pacific Ocean to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The district includes the cities of Chula Vista, Imperial Beach, National City, and some communities within the City of San Diego, including Barrio Logan, East Village, Golden Hill and more. It also includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside and La Presa.\nIf you’re not sure if you live in District 1, you can look it up at sdvote.com.\nDon’t delay! If you have been holding onto your ballot, act now. You can vote from home and return your ballot through the mail – no postage needed – or to any of the Registrar’s 29 official ballot drop boxes around the district. Remember to sign and date your return ballot envelope. You must sign your return envelope for your vote to be counted.\nThe Registrar’s official ballot drop boxes are open 24 hours a day up until 8 p.m. on the final day of voting, April 8. Visit sdvote.com to check the location list or the locator map to find a location near you.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nLearn more about voting in the District 1 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250328.11.02.18"}