{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Office of Military and Veterans Affairs Gears up for Stand Down", "description": "The County’s Office of Military and Veterans Affairs (OMVA) is one of many County departments gearing up for the region’s largest annual event for unhoused veterans, the Veteran’s Village of San Diego’s Stand Down. The event is scheduled August 9 to 11. It will include an array of resources, and County services, for unhoused veterans. ", "datePublished": "2024-08-02T14:12:01-07:00", "url": "https://www.countynewscenter.com/countys-office-of-military-and-veterans-affairs-gears-up-for-stand-down/", "keywords": ["veterans", "equity", "omva", "ray flores", "stand down", "veterans"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-08-02T15:06:25-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Office of Military and Veterans Affairs (OMVA) is one of many County departments gearing up for the region’s largest annual event for unhoused veterans, the Veteran’s Village of San Diego’s Stand Down. The event is scheduled August 9 to 11. It will include an array of resources, and County services, for unhoused veterans. \nAmong the services offered, there will be a first of its kind Landlord Hub, where the County, City of San Diego, and other veteran partners hope to encourage landlords to submit landlord interest forms and rent to voucher holding veterans. \nIn the last year, OMVA had more than 70,000 contacts with veterans and their families.  \n“Our goal is to provide comprehensive support to military veterans and their families, ensuring they receive the benefits they are entitled to from the federal Department of Veterans Affairs, the State of California, and other agencies,” said Ray Flores, the County’s Military and Veterans Affairs Officer. \nRay Flores\nFlores began his role in May 2024 and brings extensive military experience, having served 21 years in the U.S. Navy on warships, submarines and aircraft carriers. After retiring from service, he remained committed to supporting his military brothers and sisters and for the past decade served them in various leadership roles, including his time as an executive at the San Diego Veterans Coalition. \nHis leadership helps to support the second largest veteran population in the state. Since July 2023, OMVA answered more than 35,000 calls and 20,000 in person visits seeking support for veteran services. \nOMVA has grown to 44 employees providing support and services to veterans and their families. Team members help veterans file VA disability claims, attain veteran license plates and drivers license designations, college tuition fee waivers, property tax reductions, and support connections to other services and programs. \nOMVA has offices across the county including: \n\nOMVA Headquarters \n5055 Ruffin Road San Diego, CA 92123 \nPhone: 1-866-726-8831 \nHours: 8AM – 5PM Monday – Friday  \nNorth Inland Military & Veterans Resource Center \n649 W. Mission Avenue Escondido, CA 92025 \nPhone: 1-866-726-8831 \nHours: 8AM – 5PM Monday – Friday   \nSouth Region Military & Veterans Resource Center \n401 Mile of Cars Way, 2nd Floor National City, CA 91950 \nPhone: 1-866-726-8831   \nNorth Coastal Military & Veterans Resource Center \n3708 Ocean Ranch Blvd Oceanside, CA 92056 \nPhone: 1-866-726-8831  \n\nThey are also embedded virtually through Vet Connect at the Borrego Springs, Julian, Bonita-Sunnyside, Alpine, Imperial Beach, Lakeside, Poway, and Valley Center libraries. Veterans can call 858-694-3222 to make an appointment. \nEstablished in 1974, the County’s Office of Military and Veterans Affairs has maintained consistent services and programs for veterans, guided by the California Department of Veterans Affairs. \nOMVA is integrated with the County’s Self-Sufficiency Services department and actively collaborates with veterans’ coalitions, military bases, and participates in the San Diego Veterans Coalition, and Veterans Affairs (VA) Community Advisory Board meetings. This collaboration has strengthened relationships with VA directors and other regional entities to better address the needs of veterans. \nFor more information or to access services, veterans are encouraged to call 1-866-726-8831 or visit the OMVA website at Office of Military & Veterans Affairs. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240802.14.12.01"}