{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Advisory Workgroup for Climate and Social Equity", "description": "The County’s first grassroots advisory group focused on ways to make the region more livable and resilient will hold its inaugural meeting tomorrow, January 29.", "datePublished": "2025-01-28T10:39:44-08:00", "url": "https://www.countynewscenter.com/new-advisory-workgroup-for-climate-and-social-equity/", "keywords": ["environment", "climate equity", "environment", "environmental justice", "environmental sustainability", "equity", "workgroup"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2025-01-29T08:21:35-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County’s first grassroots advisory group focused on ways to make the region more livable and resilient will hold its inaugural meeting tomorrow, January 29.\nKnown as the Environmental Justice Workgroup (EJW), and made up of 21 members, the group is dedicated to benefitting the community through climate and resiliency efforts. The members were selected from 141 applicants by representatives from the County’s Sustainability and Environmental Justice, Equity and Racial Justice, and Immigrant of Refuge Affairs offices, along with the self-governing San Diego Air Pollution Control District.\nThe group members bring diverse perspectives and experiences from community organizations, Tribal Nations, youth, and academia, and have formal education and/or direct lived experience in ecological and social justice subject areas.\nWith a focus on social equity, the EJW is intended to help shape sustainability policies, programs and services across our region that impact air quality, healthy food, and access to safe, clean and green outdoor spaces.\n“It is critical for the people facing daily climate challenges and environmental burdens to have the opportunity to shape any formal response,” said the County’s Chief Sustainability Officer, Eden Brukman. “We are honored to partner with the members of this Workgroup and the greater community to advance a just, sustainable, and resilient future for the region.”\nThe 2025 EJW members serving two-or three-year terms are:\n\nVictoria Abrenica\nCaren Aguirre\nBianca Bonilla\nIan Bossenger\nJose Bravo\nBrenda Castruita\nAnthony Dang\nAdrienne Fusek\nStefan Gonzalez\nWilliam Madrigal\nFrancine Maxwell\nGeoffrey Moran\nHashim Navrozali\nNam Nguyen\nShuuluk Linton\nBernice Paipa\nNick Paul\nAnn Pierce\nAndrew Pitman\nIzzy Rosado\nMustafa Sharifi\n\nThe group will serve in an advisory capacity and its recommendations will be communicated to OSEJ for County efforts and to other jurisdictions directly. For more information, email osej@sdcounty.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250128.10.39.44"}