{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Offers Reminders of Summer Safety Tips for Children", "description": "Hot temperatures continue as summer is in full swing in San Diego County and children are spending more time outside.  ", "datePublished": "2024-07-12T09:46:16-07:00", "url": "https://www.countynewscenter.com/county-offers-reminders-of-summer-safety-tips-for-children/", "keywords": ["health", "children", "county cool zones", "summer safety", "swim safety"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-07-12T09:46:16-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesHot temperatures continue as summer is in full swing in San Diego County and children are spending more time outside.  \n“There are so many fun activities for children and families to enjoy together over the summer, but unfortunately this is also a time when a lot of preventable injuries can happen,” said Dr. Kelly Motadel, County Chief Pediatric Officer. “It’s important for parents and caretakers to be extra cautious of their children’s safety.”  \nThe County is sharing some summer safety reminders to help families with children make the most out of their time off school in a fun and healthy way. \n\nPractice water safety and always supervise children during water activities. Drownings can be silent and happen within 30 seconds. Visit sdswimsafer.org for safety tips, swim class resources and ways to keep your home pool secure. The County’s Fire Protection District Safe Swimming program provides free pool alarms to eligible residents. \n\nSecure windows -summertime brings warmer temperatures and you may be opening up windows. Open windows can be a hazard for small children. County partner The Children’s Initiative offers education and resources to prevent injuries like falls from windows. \n\nAhead of summer travel, make sure your child has received an updated measles, mumps, and rubella or MMR vaccine, particularly ahead of international travel. Contact your child’s healthcare provider or visit a County public health center if you do not have a healthcare provider to find the MMR vaccine.\n\nKeep your child safe from the sun and heat by applying and reapplying sunscreen several times a day, avoiding active play outside during the hottest parts of the day between 12 and 4 p.m. and providing plenty of water. Relief from the heat is available at County Cool Zones including County libraries which also offer fun summer activities for children. \n\nWear a helmet while riding a bike, skateboard or scooter, it is one of the best ways to protect children from serious injuries. Helmets should be properly fitted and equipment should be size-appropriate. There are programs funded through the County Department of Homeless Solutions and Equitable Communities, including Circulate San Diego and Vista Community Clinic programs that promote riding safety. \n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240712.09.46.16"}