{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 3-04-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through March 3, 2021.", "datePublished": "2021-03-04T17:47:59-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-3-04-2021/", "keywords": ["health", "coronavirus", "covid-19", "update", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-04T17:48:22-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through March 3, 2021.\nVaccination Progress:\n\nOf the 1.1 million COVID-19 vaccine doses delivered to the region, more than 997,000 have been logged as administered. Of those vaccinated to date, more than 303,000, or just over 11 percent of San Diegans 16 and older, are fully immunized.\nOverall, more than 608,000 County residents have received at least one shot of two-dose vaccine. That’s 22.6 percent of those eligible.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit vaccinationsuperstationsd.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 10.8 cases per 100,000 residents (as of March 2) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 4.2%, placing the County in Tier 3 or the Orange Tier. While the testing positivity rate for the County qualifies it for Tier 3, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 6% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 9.\n\nCommunity Setting Outbreaks:\n\nSix new community outbreaks were confirmed March 3: four in business settings and two in restaurant/bar settings.\nIn the past seven days (Feb. 25 through March 3), 29 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n17,763 tests were reported to the County on March 3, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,947.\n\nCases, Hospitalizations and ICU Admissions:\n\n508 cases were reported to the County on March 3. The region’s total is now 261,861.\n13,215 or 5% of all cases have required hospitalization.\n1,603 or 0.6% of all cases and 12.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n17 new COVID-19 deaths were reported March 3. The region’s total is 3,359.\n11 men and six women died between Feb. 25 and March 3.\nOf the 17 deaths reported March 3, four people who died were 80 years or older, six were in their 70s, six were in their 60s and one was in their 50s.\n16 had underlying medical conditions and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210304.17.47.59"}