{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Check Voter Registration Now to Get Mail Ballot Later", "description": "The California Gubernatorial Recall Election is fast approaching, and the Registrar of Voters is preparing election ballots for mailing. Voters are urged to check their voter registration now to get a mail ballot at their address later.", "datePublished": "2021-07-19T12:57:42-07:00", "url": "https://www.countynewscenter.com/check-voter-registration-now-to-get-mail-ballot-later-2/", "keywords": ["elections", "2021 recall election", "election", "governor", "registrar of voters", "sept. 14 election", "voter registration"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-07-19T13:13:49-07:00", "articleType": "article", "articleContent": "\nThe California Gubernatorial Recall Election is fast approaching, and the Registrar of Voters is preparing election ballots for mailing. Voters are urged to check their voter registration now to get a mail ballot at their address later.\nMail ballots start going out the week of Aug. 16. If your information is up to date, you can expect your ballot in your mailbox that same week.\nHave you moved since you last voted? Whether you are new to San Diego County or just moved down the street, you need to re-register to vote with your new information. You can do this by completing a new voter registration application online at sdvote.com. Registration forms are also available if you call (858) 565-5800 or email rovmail@sdcounty.ca.gov.\nMail ballots give voters the option to vote from the comfort of their homes. Voters can return their ballot in the mail, no postage necessary, or at one of many mail ballot drop-off locations around the county.\nIn-person voting locations will be open across the county for four days, Saturday, Sept. 11 – Tuesday, Sept. 14. Take advantage of early voting:\n\nAt the Registrar’s office beginning Aug. 16, 8 a.m. to 5 p.m., Monday through Friday\nAt a voting location near you or the Registrar’s office Saturday, Sept. 11 through Monday, Sept. 13, 8 a.m. to 5 p.m.\n\nAll again will be open on Election Day, Sept. 14, when hours change to 7 a.m. to 8 p.m.\nWhy are we having a recall election?  The recall process allows voters to decide whether to remove elected public officials from office before their term is over.\nVoters will see two parts on their recall ballot. In the first part, voters have the option to vote “yes” or “no” to the question of whether to remove the Governor from office.\nIn the second part, voters have an opportunity to select a replacement candidate. If more than 50% of voters vote to recall the Governor, then the replacement candidate with the most votes would be elected.\nFirst-time voter? You can register to vote in less than two minutes.\nLearn more about voting in the gubernatorial recall election at sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210719.12.57.42"}