{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Take Care to Secure, Calm Your Pets During Fireworks", "description": "Every year, dozens of dogs end up at shelters after Fourth of July fireworks shows.", "datePublished": "2022-06-29T11:29:26-07:00", "url": "https://www.countynewscenter.com/?p=208888", "keywords": ["animals", "das", "dog", "fireworks", "microchip", "pets"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-06-29T11:40:33-07:00", "articleType": "article", "articleContent": "\nEvery year, dozens of dogs end up at shelters after Fourth of July fireworks shows.\nIf you’re lucky, your dog doesn’t react to the explosions and shrill whistles of fireworks set off to celebrate the holiday. But for some dogs and other pets, the sounds can be terrifying due to their sensitive ears.\nDogs kept outdoors or that are unleashed often escape yards in a panic, digging under, breaking through, or jumping over fences. In extreme cases, they can even break through window screens, gates or screen doors from inside to run. They are then at risk for running into traffic, getting lost, or even being attacked by other animals.\nAt this point, their best bet is to be picked up by a neighbor or an animal control officer for safekeeping until the owner can reclaim their pet.\n“We suggest if your dog has a problem with loud noises or if you are not sure how your dog will react, it should be kept inside your home in the most noise-insulating room available to keep it secure and as calm as possible,” said County Animal Services Director Kelly Campbell. “As a backup plan, in case it still manages to run away, we recommend microchipping your pet.”\nPets that are microchipped and licensed are reunited with their owners much quicker than those that are not. If your dog is not microchipped, residents in the unincorporated areas can get their dogs microchipped for a $20 fee at the County’s two shelters in Carlsbad and Bonita by calling (619) 767-2675 for an appointment.\nSome additional tips on how to protect your pet this Fourth of July:\n\nStay home with your dogs or have someone they like stay with them.\nDo not take your pet to fireworks displays. Keep your pets indoors in a sheltered, quiet area.\nSome dogs become destructive when frightened so remove dangerous objects your pet may chew.\nIf you can’t stay with them, leave a television or radio playing at normal volume to keep your pet company while you’re away.\nNever leave pets outside unattended, even in a fenced yard. In their fear, pets that normally wouldn’t leave the yard may escape and get lost.\nIf you know your pet is seriously distressed by loud noises like thunder, consult your veterinarian to see if anxiety-relieving medication is appropriate.\nDo not leave your pet in the car. With only hot air to breathe inside a car, your pet can suffer serious health effects, even death, within minutes.\nIf you are walking your dog near fireworks displays, be sure your pet is secured on a leash in case it tries to bolt.\n\nIf you find a lost pet in the unincorporated area of the County after the fireworks, call County Animal Services’ 24-hour emergency dispatch number at (619) 236-2341 so the animal can be cared for at the shelter. If you lose your pet, check the department’s lost and found page online.\nIf you see your dog is at County Animal Services, you can pick up your pet starting at 9:30 a.m. on Tuesday, July 5.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220629.11.29.26"}