{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mentorship Program Pairs Local Youths and County Employees", "description": "A dozen youths are headed back to the classroom this fall with some hands-on work experience under their belts after they participated in the County’s first-ever Live Well San Diego Youth Mentorship and Internship Program over the summer.", "datePublished": "2021-09-13T12:00:08-07:00", "url": "https://www.countynewscenter.com/mentorship-program-pairs-local-youths-and-county-employees/", "keywords": ["government", "internship", "live well san diego", "live well san diego youth sector", "mentorship"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-09-13T12:00:08-07:00", "articleType": "article", "articleContent": "\nA dozen youths are headed back to the classroom this fall with some hands-on work experience under their belts after they participated in the County’s first-ever Live Well San Diego Youth Mentorship and Internship Program over the summer. The initiative, a component of the new Live Well San Diego Youth Sector’s year-long leadership program, paired local young people with County employees for a three-month period, during which they learned about their mentor’s job and about the role County government plays in the region.\nThe leadership program was created to amplify youth voices and foster youth civic engagement. It also empowers participants to provide input on issues that are important to young people in the region.\nThe youths who participated in the inaugural cohort of the mentorship program were placed in various divisions across the County, including health promotion, emergency services and parks and recreation.\nSixteen-year-old Nadeen Youhanan decided to apply for the mentorship program because it allowed her to meaningfully engage with County government while getting hands-on work experience.\n“As a current high school senior, it was the perfect way for me to get work experience and identify possible majors and careers that are of interest to me as I go into college,” said Youhanan. “Most importantly, I was able to connect with like-minded and talented youth and work with them in identifying ways to boost youth engagement within San Diego, as well as how we can support and improve our community.”\nHer mentor, Justine Kozo, is the County’s chief of the Office of Border Health. Kozo also oversees the County’s Partner Relay, a joint initiative between Public Health Services and the Office of Emergency Services focused on improving emergency communications with non-English speaking communities.\n“Many of our partners have told us that the communities they serve often rely on youth to understand what is happening during an emergency and also to translate important health and safety information for family members who may not speak or read English,” said Kozo. “Through her internship research, Nadeen has created recommendations on how to partner with youth to improve this communication pathway.”\nTwenty-year-old Beatriz “B” Yumul was excited to bring their diverse background to their internship at the County.\n“As a queer, nonbinary, first-generation, Filipinx, going into health care, I was excited to share my perspective and ideas,” Yumul said.\nYumul managed the Live Well San Diego social media accounts and compiled biweekly e-blasts containing resources and opportunities for young people throughout the region, as part of their internship. In addition to Yumul’s internship with the Live Well San Diego Youth Sector, they participated in a separate mentorship opportunity with Samantha Sonnich, a community health promotion specialist.\n“My favorite part was getting to connect with B and support their passions and interests and learn from each other’s experience,” said Sonnich. “I learned a lot from my mentee including how technology can help promote diversity and inclusion, how to involve youth in County programs and efforts, and how passionate and creative the younger generation is.”\nThe two met once a week for an hour to share successes and challenges and discuss topics related to the mentorship goals they had set together at the beginning of the program.\n“After my time with the County this summer, I will be a lot more aware of the possibilities of what I could pursue professionally in the realm of public health and with the County,” said Yumul. “I will be sharing these resources and doing my part to increase awareness and familiarity between my peers and members of my communities.”\nThe Live Well San Diego Youth Sector will begin recruitment for its next cohort of young leaders early next year. Kozo and Sonnich look forward to participating in future iterations of the program.\n“There are so many different careers through the County, and I’m hoping that we continue to expand these opportunities to share our love for public service and inspire, learn from, and give space to younger generations,” said Sonnich.\n“It’s exciting to incorporate work with youth leaders as their perspective is essential for constructive change and positive impact,” said Kozo.\nTo learn more about the Live Well San Diego Youth Sector, visit www.livewellsd.org/youth. You can also connect with the Youth Sector on Instagram and TikTok @LiveWell_SD.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210913.12.00.08"}