{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Artists Invited to Shape Creative Vision For Southeastern Live Well Center", "description": "Local artists are invited to participate in shaping the creative vision for the new Southeastern Live Well Center, which will serve as a hub for County and community services.", "datePublished": "2022-03-25T14:00:20-07:00", "url": "https://www.countynewscenter.com/artists-invited-to-shape-creative-vision-for-southeastern-live-well-center/", "keywords": ["health", "art", "art proposal", "live well san diego", "southeastern live well center"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-03-26T11:07:28-07:00", "articleType": "article", "articleContent": "\nLocal artists are invited to participate in shaping the creative vision for the new Southeastern Live Well Center, which will serve as a hub for County and community services. The County is looking for submissions from visual and multimedia artists and will commission artwork for numerous spaces in and around the new center.\nOnce the artist proposals are received, the Southeastern San Diego Live Well Center Public Art Advisory Committee will be instrumental in advising on artist selection for the commissioned artwork. The Advisory Committee includes community residents and leaders from local grassroot organizations – with members representing various social, ethnic and cultural backgrounds in Southeastern San Diego.\nThe selected art will be placed in the outdoor main entry plaza, meditation garden, corridors, waiting and conference rooms, and family play area of the 65,000-square-foot center.\nArt at the Southeastern Live Well Center will represent and celebrate the history, diversity and cross-cultural experiences of the community while educating, creating beauty, inspiration and healing.\n“Like many others, I’m really looking forward to seeing the art that results from the proposals,” said Barbara Jiménez, the County’s community operations officer who has been involved with this project for more than a decade. “This is an especially exciting part of the County’s commitment to community engagement for our newest Live Well Center.”\nThe County broke ground on the project at the corner of Market Street and Euclid Avenue in October of 2021. Construction is on schedule to be completed by next summer.\nOnce completed, the Southeastern Live Well Center will serve the community with a variety of services, including medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services. A short walk from a trolley station, the Center will feature shared space for community meetings.\nArtist proposals are due at 11:59 p.m. on April 25 and should reflect the County’s commitment to a healthy, safe and thriving region. For more information and to apply, visit the website for art consultant Leah Goodwin Creations. Questions should be directed to goodwin.leah@gmail.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220325.14.00.20"}