{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Include Pets, Animals in Your Disaster Plan", "description": "Ahead of peak wildfire season, County Animal Services is offering pet preparedness information at community fairs and is training community volunteers in pet rescues in the event of an emergency.", "datePublished": "2024-08-29T13:18:36-07:00", "url": "https://www.countynewscenter.com/include-pets-animals-in-your-disaster-plan/", "keywords": ["public safety", "das", "disaster preparedness", "pet preparedness"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-08-29T13:18:36-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAhead of peak wildfire season, County Animal Services is offering pet preparedness information to the public and is working with community volunteers who can assist in the event of an emergency.\nAnimal Services staff have participated in three emergency response and preparedness fairs to offer guidance and resources on pet disaster preparedness. Additionally, staff have hosted six comprehensive trainings for a dedicated group of about 70 volunteers. Trainings cover essential skills such as large animal handling, loading and unloading, scouting, trailer driving, and overall management during a disaster.\nThe County Department of Animal Services offer pet disaster preparedness information at a recent community resource fair.\nCounty experts suggest you prepare your family by making a plan to evacuate and gathering food and other supplies. The same can be done with family pets, even livestock. Planning is key to emergency preparedness for all.\nThe County Emergency and Animal Services departments recommend that you prepare and practice a disaster plan with all of your family members and assemble emergency supplies ahead of time. Household pet necessities include a supply of food and water, a crate or carrier, leash, medicines, copy of current veterinary records, and several recent photographs of your furry, feathered or scaly friend. See the full list of items that should be in each of your pets’ emergency kits.\nIf you have to evacuate your home during an emergency, do not leave your pets. You may not be able to return to your home or animal enclosure for an extended period. In addition, structural damage to your home or animal enclosure may allow your pet to escape or to permit other animals or the natural elements to enter and hurt your pet.\nBe prepared to quickly evacuate with your pets. If an evacuation seems possible, do it earlier rather than later. Do not wait until the last minute.\nAnimal Services has emergency preparedness recommendations for livestock owners. Moving horses and other large animals takes time and practice.\nMake sure your pet is wearing a collar with identification and an emergency contact. Having an ID on your animals may help reunite you if you are separated. Another safeguard is microchipping in case your pet loses its collar. Microchipping is available at the Animal Services’ shelters.\nWith these simple preparation steps, your entire family can be ready for the unexpected, including wildfires, earthquakes, flooding or other emergencies.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240829.13.18.36"}