{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Cases in County Rise 82% in One Week", "description": "The number of COVID-19 cases in San Diego has significantly increased in the past week, prompting County health officials to urge residents to continue getting vaccinated.", "datePublished": "2021-07-21T16:59:14-07:00", "url": "https://www.countynewscenter.com/covid-19-cases-in-county-rise-82-in-one-week/", "keywords": ["health", "coronavirus", "covid-19", "increase in cases", "vaccines", "variants"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-07-22T07:35:07-07:00", "articleType": "article", "articleContent": "\nThe number of COVID-19 cases in San Diego has significantly increased in the past week, prompting County health officials to urge residents to continue getting vaccinated.\nIn the past seven days, 3,465 COVID-19 cases were reported in San Diego County. That’s 1,566 or 82% more cases than the previous seven-day period.\nHospitalizations due to COVID-19 are also trending up. The daily total rose above 100 on July 6 and has remained above that threshold since. Hospitalizations are likely to rise higher since they typically do after increases in cases.\nThe rise in cases and hospitalizations is occurring primarily in San Diegans who are not vaccinated. These individuals are also being disproportionately impacted by the Alpha, Gamma and Delta COVID-19 variants of concern.\n“The best protection we have against COVID-19 is getting vaccinated,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The vaccines are extremely effective at preventing serious illness from COVID-19. If you have not gotten immunized, do it now.”\nThere has also been a very slight increase in post-vaccination infections, meaning people got infected with COVID-19 even though they were fully vaccinated.\nWooten said that was expected and that breakthrough cases typically have mild symptoms.\n“This does not mean the vaccine is not working. Quite the opposite, the vaccine is doing what it’s supposed to do: keep most people from being hospitalized, or worse, dying,” Wooten said.\nVaccination Progress:\n\nDoses administered: More than to 4.19 million.\nReceived at least one shot: Almost 2.25 million or 80.2% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Over 1.94 million or 69.2%.\nThe goal: vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 106.9% of the goal population has received at least one vaccine and 92.3% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nDeaths:\n\nOne new death was reported between July 14 and July 20. The region’s total is 3,787.\nA man in his 60s and with underlying medical conditions died June 12.\n\nCases, Case Rate and Testing:\n\n521 COVID-19 cases were reported to the County on July 21. The region’s total is now 288,681.\nSan Diego County’s case rate is 7.6 cases per 100,000 residents as of July 20.\n7,895 tests were reported to the County on July 20, and the percentage of new positive cases was 6.6%.\nThe 14-day rolling percentage of positive cases among tests is 5.1%.\n\nCommunity Setting Outbreaks:\n\n22 new community outbreaks were confirmed in the past seven days (July 14 through July 20): 10 in restaurant/bar settings, four in business settings, two in day camp settings, one in a campground setting, one in a restaurant setting, one in a construction setting, one in a government setting, one in a retail setting and one in a faith-based setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m. on Wednesdays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210721.16.59.14"}