{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Love Your Heart Event Encourages San Diegans to Know Their Blood Pressure Numbers", "description": "The County’s Love Your Heart campaign is celebrating 13 years of supporting  San Diegans in understanding the importance of heart health through a variety of ways, including hosting no-cost blood pressure screenings at locations throughout the county and Mexico. ", "datePublished": "2024-02-12T18:47:37-08:00", "url": "https://www.countynewscenter.com/countys-love-your-heart-event-encourages-san-diegans-to-know-their-blood-pressure-numbers/", "keywords": ["health", "blood pressure", "dr wooten", "dr. mcdonald", "love your heart"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-02-12T18:47:37-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Love Your Heart campaign is celebrating 13 years of supporting San Diegans in understanding the importance of heart health through a variety of ways, including hosting no-cost blood pressure screenings at locations throughout the county and Mexico. \nHeart disease is the leading cause of death in the United States, and the second leading cause of death in San Diego County and Mexico. In 2022, nearly 5,000 people died in San Diego County from heart diseases. \nKnowing your blood pressure numbers is vital to good heart health. This year Love Your Heart offers screenings starting Valentine’s Day, Feb. 14, and continuing through Feb. 29. People can check for their nearest location by clicking this link. \n“This simple five-minute test can save your life,” said Nora Vargas, Chairwoman, San Diego County Board of Supervisors. “¡Cinco minutos pueden salvar tu vida! Get checked for your health.” \nIn Mexico, heart disease is the leading cause of death both nationally and in the six states bordering the United States. Over the years, the County has worked binationally with partners in Mexico to increase awareness of heart disease and encourage blood pressure monitoring.  \nOver the last nine years, Mexico has conducted more than 228,000 blood pressure screenings at Love Your Heart events in all six Mexican border states and in health centers, called Ventanillas de Salud, within U.S. Mexican Consulates. \n“This year we have an extended timeline for people to get their blood pressure checked because we want as many neighbors as possible to learn about their blood pressure numbers,” said Dr. Eric McDonald, County interim director of the Health and Human Services Agency. “Heart disease is preventable, and we are so thankful to our partners, along with our County employees and volunteers who make this event bigger each and every year.” \nTo understand the regional impact and develop the most responsive strategies, the County tracks data. In the past several decades, data shows that three behaviors contribute to four chronic conditions resulting in nearly half of all deaths in San Diego County, also known as the 3-4-50 principle.  \n“While the numbers can seem grim, efforts like Love Your Heart are helping,” said Wilma Wooten, MD, MPH, County public health officer. “The campaign has helped drive an 18.9 percent reduction of 3-4-50 deaths from 2012 to 2022. By making small lifestyle changes and knowing their numbers, people can take control of their health.”   \nThe County used the California Healthy Places Index in planning Love Your Heart screening sites focusing on areas with residents who have higher average blood pressure levels.  \nKnowing your numbers and making small changes to your daily life, including diet and exercise, are important in the prevention of heart disease, cardiac arrest and stroke. \nLast year’s Love Your Heart campaign reached more than 7.8 million people. Through it, community partners were able to distribute more than 3,200 blood pressure monitors, at no cost, to at-risk, underserved residents. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240212.18.47.37"}