{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Up by Two, Cases by 98", "description": "Two additional COVID-19 deaths and 98 more cases were reported, bringing the region’s total to 113 and 3,141 respectively, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-27T19:19:00-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-up-by-two-cases-by-98/", "keywords": ["health", "beach closures", "beach openings", "coronavirus", "covid-19", "park openings"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-28T08:46:19-07:00", "articleType": "article", "articleContent": "\nTwo additional COVID-19 deaths and 98 more cases were reported, bringing the region’s total to 113 and 3,141 respectively, the County Health and Human Services Agency announced today.\nA woman in her early 60s died April 23 and a man in his mid-50s died April 25. Both had underlying medical conditions.\n“COVID-19 continues to be spread in our communities and, unfortunately, some people are dying,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should continue to stay at home and wear a facial covering when in public to keep the novel virus from spreading.”\nOf the people who have died, 98 were 60 years and older; 62 were men and 51 were women. Age, gender and ethnic/race breakdowns for cases and deaths are posted at coronavirus-sd.com.\nPositive Tests vs. Tests Administered\nOne of the federal criteria that the County is closely monitoring before easing or lifting restrictions in the local Health Officer order is the number of positive cases of COVID-19 in comparison to the number of tests administered over a 14-day period.\nSince April 13, a total of 19,628 tests have been administered and 1,294, or 6.6%, were positive for COVID-19, including the 98 cases announced today. The goal is for that rolling percentage to trend downward over time.\nTotal Cases\nOf the total local cases to date, 1,601 (51%) were men and 1,537 (48%) were women. The gender of three people is unknown. Of the reported cases, 706 (22.5%) have required hospitalization and 230 (7.3%) of the total cases had to be placed in intensive care. One hundred thirteen (3.6%) have died.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nBeaches Open with Some Restrictions\nThe County Monday opened the ocean and bays for swimming, surfing, kayaking and paddleboarding. Some coastal communities have opened their beaches. Walking and running on the sand are permitted.\nHowever, parking lots at beaches remain closed and sitting or lying on the sand is prohibited. Group activities like volleyball and other team sports are not permitted and boating is still banned.\nCoastal cities will oversee beach access in their communities and may impose stricter guidelines than those outlined by the County or choose not to grant beach access.\nThe County is also preparing to dial back other restrictions, starting May 1. They might include:\n\nRelaxing restrictions at parks and beaches if they can enforce social distancing.\nAllowing parks and beaches to reopen parking lots, with limitations\nAllowing visitors to parks and beaches to sit, lie down and picnic if they practice social distancing.\nAllowing members of the same family or household to play team sports, including volleyball and basketball.\nOpening golf courses that can follow social distancing protocol.\n\nThe County has developed a social distancing and sanitation protocol for parks and beaches.\nAlso, beginning May 1, all residents will be required to cover their face while in public and within six feet of someone who is not a household member.\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200427.19.19.00"}