{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccines, Boosters Strongly Recommended for Older San Diegans", "description": "  Vaccination Progress: Received at least one shot: Nearly 2.98 million or 94.6% of San Diegans age 5 and older are at least partially vaccinated. Fully vaccinated: Over 2.63 million or 83.7%. Boosters administered: 1,366,219 or 57.3% of 2,384,778 eligible San Diegans.", "datePublished": "2022-06-23T17:01:46-07:00", "url": "https://www.countynewscenter.com/?p=208829", "keywords": ["health", "50+ boosters", "boosters", "coronavirus", "covid-19", "vaccinations 50+"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-06-23T17:01:46-07:00", "articleType": "article", "articleContent": "\nCOVID-19 vaccinations and boosters help to prevent severe illness and hospitalization, especially in older adults over the age of 50.\nHowever, thousands of older San Diegans have yet to receive all the recommended doses and boosters.\nThe County Health and Human Services Agency conducted an analysis local COVID-19 vaccination data and found that as of June 20, 2022:\n\n89,647 San Diegans ages 50 and older or 8.42% of the estimated population in this age group were not fully vaccinated.\n352,732 residents who are 50 and older (33.1%) were fully vaccinated but have not gotten their first booster dose, even though 295,990 (83.9%) are eligible.\nOf the 711,749 San Diegans age 50 and older who received a first booster dose, 71.3% (507,398) are missing a second booster.\nOf the 507,398 people who are missing a second booster, 91.9% (466,232) are eligible to receive one, which may be administered at least four months after the first.\n\n“Because immunity from the COVID-19 vaccine wanes over time, boosters help to give you added protection against the virus and its strains, both in terms of reducing infections and severe outcomes,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “People over age 50 are more susceptible to severe illness and complications from COVID-19. If you are eligible, you should get the recommended boosters as soon as possible to protect yourself and those around you.”\nFurthermore, of all San Diegans who are fully vaccinated and eligible for their first booster, 42.7% have not received one. Currently, there are 2,384,778 people, 5 years and older, who are eligible for their first booster.\nEveryone 6 months and older can get COVID-19 vaccines at no cost. Boosters are also available for people 5 years and older. Parental consent is required for all eligible minors to be vaccinated.\nVaccination Progress:\n\nReceived at least one shot: Nearly 2.98 million or 94.6% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.63 million or 83.7%.\nBoosters administered: 1,366,219 or 57.3% of 2,384,778 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n14 additional deaths were reported since the last report on June 16. The region’s total is 5,332.\nOf the 14 additional deaths, eight were men and six were women. They died between Jan. 25 and June 21, 2022; three deaths occurred in the past two weeks.\nNine of the people who died were 80 years or older, three were in their 60s, one was in their 50s and one was in their 20s.\n12 of the people who died were fully vaccinated and two were not.\n13 had underlying medical conditions and one did not.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n3,262 COVID-19 cases were reported to the County in the past two days (June 21 and June 22, 2022). The region’s total is now 822,808.\n9,673 cases were reported in the past week (June 16 through June 22) compared to 9,672 infections identified the previous week (June 9 through June 15).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 43.99 for people fully vaccinated and boosted, 26.46 for fully vaccinated people and 76.42 for not fully vaccinated San Diegans.\n9,120 tests were reported to the County on June 18, and the percentage of new positive cases was 13.2% (Data through June 18).\nThe 14-day rolling percentage of positive cases, among tests reported through June 18, is 11.2%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220623.17.01.46"}