{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Recognizes World Tuberculosis Day on March 24 ", "description": "County Public Health is raising awareness about tuberculosis, a curable and preventable disease, ahead of World Tuberculosis Day on Sunday, March 24. ", "datePublished": "2024-03-22T16:59:34-07:00", "url": "https://www.countynewscenter.com/county-recognizes-world-tuberculosis-day-on-march-24/", "keywords": ["health", "tb", "tuberculosis", "world tb day"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-03-25T08:52:02-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Public Health is raising awareness about tuberculosis, a curable and preventable disease, ahead of World Tuberculosis Day on Sunday, March 24. \nTuberculosis (TB) is a disease that mostly affects the lungs and is passed through the air from person-to-person when someone who is sick with TB coughs, speaks, sings or breathes.   \nWorld TB Day marks the discovery of the TB germ by Dr. Robert Koch in 1882. The campaign aims to educate people about the impact of TB around the world and efforts to prevent people from getting sick with the disease.   \nThe San Diego County TB Elimination Initiative is working to end TB in the region. The County TB Control program is partnering with community organizations, healthcare providers, schools and others to teach people about TB and how to prevent it.  \nThe County is also working with people who may be at risk of getting sick with TB and providing testing and treatment. The TB Elimination Initiative’s Community of Practice recently received recognition as a 2024 Centers for Disease Control and Prevention TB Elimination Champion. \n“TB is a preventable and curable disease, and it takes all of us being aware of its symptoms in order to continue making strides toward its elimination,” said Wilma Wooten, M.D., County public health officer. “Public Health Services can’t do that alone, so World TB Day is an opportunity to thank partners and increase awareness.” \nSymptoms of active TB disease can include lasting cough, fever, night sweats and unexplained weight loss.  By comparison, latent TB infection is asymptomatic and not contagious, but without preventive treatment people with latent TB infection are at risk for developing active TB disease in the future. \nLast year, in San Diego County, 243 TB cases were reported.  This represents a return to pre-pandemic levels; on average there were 244 cases from 2015-2019.  \nThe County operates a TB Clinic at the North Central Public Health Center, 5055 Ruffin Road. Public Health Services also offers testing at regional public health centers throughout the County.  \nTo expand the efforts of this work, the County, along with Champions for Health, hosted the San Diego County TB Prevention Education and Community Engagement Summit today at the Southeastern Live Well Center.   \nThe County Administration Center will be lit up in red in honor of World TB Day, on March 24, joining other entities around the country and as far away as Canada and Australia.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240322.16.59.34"}