{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supports Federal Initiative to Protect Immigrant Military Families", "description": "The County’s Office of Military and Veterans Affairs is promoting a federal immigration program that supports immigrant families of U.S. service members.", "datePublished": "2024-01-05T15:37:47-08:00", "url": "https://www.countynewscenter.com/county-supports-federal-initiative-to-protect-immigrant-military-families/", "keywords": ["veterans", "military", "rick wanne", "veteran"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-01-05T15:37:47-08:00", "articleType": "article", "articleContent": "\nThe County’s Office of Military and Veterans Affairs is promoting a federal immigration program that supports immigrant families of U.S. service members.  \nThe Military Parole in Place (MPIP) program provides some members of U.S. military families temporary permission to remain in the country while seeking permanent residency.  \nThe temporary immigration status allows spouses, widow(er)s, parents and children of U.S. service members to stay, work and travel freely in the United States. The Board of Supervisors previously approved promoting the program to reaffirm the County’s support for service members and their families. \n“Families can be divided when a loved one serves in the U.S. armed forces,” said Rick Wanne, Director of County Self Sufficiency Services. “This program allows them to be reunited in our country and recognizes our military men and women for their honorable and selfless service.” \nPeople may be eligible for the program if the service member in their family is active duty in the U.S. armed forces, in the Selected Reserve of the Ready Reserve or has previously served as active duty or in the Selected Reserve and was not dishonorably discharged. Eligibility is available in single year increments. \nThose who apply for the MPIP program submit specific documents to the U.S. Citizenship and Immigration Services Office where they live. These include: \n\nCompleted Form I-131, Application for Travel Document (without fee). Applicants must hand write “Military PIP” in Part 2 instead of checking a box. \nEvidence of the family relationship, such as: \n\nMarriage certificate \nDocumentation of termination of previous marriage \nSon or daughter’s birth certificate \nCurrent or former service member’s birth certificate with parent’s name; or \nProof of enrollment in the Defense Enrollment Eligibility Reporting System (DEERS) \n\n\nEvidence that the family member is a current or former member of the U.S. armed forces, such as a photocopy of the front and back of the service member’s military identification card or DD Form 214. \nFor parents of current and former service members of the U.S. armed forces, evidence the current or former service member supports the application for parole in place. \nTwo identical, color passport-style photographs; and \nEvidence of any additional favorable discretionary factors that that an applicant would like to have considered.\n\nFor more information on support in San Diego for military members and their families, click here. To apply for the MPIP program, click here. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240105.15.37.47"}