{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Food Truck Provides Nutrition, Paid Job Training", "description": "A new Boys & Girls Clubs of Oceanside food truck, primarily funded through the County’s K-12 Community Grant Program, is complete and will soon be used in the community.  ", "datePublished": "2024-06-07T13:25:56-07:00", "url": "https://www.countynewscenter.com/new-food-truck-provides-nutrition-paid-job-training/", "keywords": ["families", "district attorney", "psg"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-06-07T14:02:55-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA new Boys & Girls Clubs of Oceanside food truck, primarily funded through the County’s K-12 Community Grant Program, is complete and will soon be used in the community.\nClub officials displayed the new truck and menu at a community barbecue June 1 in Oceanside. The truck, called the Lunch Box, will soon be on the streets providing fresh, healthy and free meals to children in the clubs’ surrounding neighborhoods.\nThe truck is part of the club’s Culinary Options and Opportunities for Kids program which offers culinary and job readiness skills to youth aged 14 to 18. Ultimately, they can apply for paid internships to help prepare the meals for children at the club or for catering on the Lunchbox truck.\nThe grant also helped to fund the Boys & Girls Clubs of Oceanside Youth CanTEEN Food Truck Mentorship program and a summer feeding program that prepared meals for over 600 children. The goal of the CanTEEN program was to provide the skills and mentorship connections at-risk teens need to gain the confidence necessary to become active members in the San Diego restaurant community. By the end of this year-long program, the Boys & Girls Clubs of Oceanside had a total of 55 youth who participated in its culinary arts mentorship program. Youth participating in the program experienced improvement in academics, work readiness and community connections.\nThe County of San Diego and the San Diego District Attorney’s Office awarded the Boys and Girls Club of Oceanside grant money as part of the K-12 Community Grant program. This opportunity was made possible by fines imposed by the court related to the District Attorney’s successful prosecution of one of the nation’s largest fraud schemes targeting state dollars intended for K-12 education. Additional funding and collaboration for the project came from the City of Oceanside, the Parker Foundation, First Citizens Bank and Buffalo Wild Wings Foundation.\n“Because of their commitment to the program, we can address food insecurity while investing in the future of young people by providing them with workforce readiness and on-the-job experiences,” said Jodi Diamond, CEO of the Boys & Girls Club of Oceanside.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240607.13.25.56"}