{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Urging Public, Businesses to Help Prevent COVID-19 Outbreaks", "description": "If seven or more outbreaks occur over a seven-day period, the County would be forced to modify the local Health Officer Order and take additional measures to prevent the spread of COVID-19.", "datePublished": "2020-06-15T16:42:23-07:00", "url": "https://www.countynewscenter.com/county-urging-public-businesses-to-help-prevent-covid-19-outbreaks/", "keywords": ["health", "businesses and restaurants", "contact tracing", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-23T10:09:56-07:00", "articleType": "article", "articleContent": "\nCommunity outbreaks of COVID-19 are one of 13 triggers the County is closely monitoring to determine whether to stop or dial back the reopening of the local economy.\nIf seven or more outbreaks occur over a seven-day period, the County would be forced to modify the local Health Officer Order and take additional measures to prevent the spread of COVID-19. An outbreak consists of three or more cases.\nOver the past seven days, four outbreaks have been traced back to community settings, such as people’s homes, food manufacturers, churches and restaurants. The County is contacting anyone at those locations identified as close contacts of positive cases.\nCounty health officials are asking the public and local businesses to adhere to the local public health guidance to prevent COVID-19 outbreaks.\n“If we start to see an increasing number of community outbreaks, that would be a sign that COVID-19 is spreading at a faster rate because people are not following the public health guidance,” said Wilma Wooten, M.D., M.P.H., County public health officer. “That could result in the closure of businesses or certain sectors or even a full stop in the reopening of the local economy.”\nHere’s how you can help to prevent COVID-19 outbreaks:\n\nIf you’re sick, stay home and isolate yourself from others.\nIf you need to be in public, you must use a face covering if you are close to people outside your household. The coverings help prevent asymptomatic carriers of the virus from spreading it.\nMaintain physical distance from others.\nAvoid crowded places to decrease your risk of exposure.\nCover your cough or sneeze with a tissue, throw it away and wash your hands.\nWash your hands properly and regularly or use a hand sanitizer.\nIf you’re out and about and notice that a business is not following the health guidance, report them to your local police department by calling the non-emergency number.\n\n“We all have a role in preventing the spread of COVID-19,” Wooten said. “If people don’t cooperate, we could see an increase in cases and outbreaks.”\nCounty Public Health Officer Wilma Wooten.\nState Says “I Do” to Weddings \nThe state has lifted its restriction on weddings, and they can now occur provided they follow the state guidance. No wedding receptions are permitted.\nIndoor weddings are not to exceed 25 percent of a facility’s capacity or 100 people and participants must wear a face covering and maintain physical distancing. Face coverings and social distancing are required for outdoor weddings.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n5,207 tests were reported to the County June 14 and 3% were positive new cases.\nThe 14-day, rolling average percentage of positive tests is 3%.\n\nCases:\n\n170 new cases were reported in San Diego County for a total of 9,610.\n1,530 or 15.9% of cases have required hospitalization.\n429 or 5% of all cases and 28.0% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nOne additional COVID-19 death was reported, bringing the region’s total to 320.\nThe 78-year-old man died June 7 and had underlying medical conditions.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200615.16.42.23"}