{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County of San Diego Releases Report with Strategies to Reduce Gun Violence", "description": "The County of San Diego today released a report that highlights data related to gun violence in San Diego County and outlines recommendations to reduce this violence.", "datePublished": "2023-06-28T14:15:51-07:00", "url": "https://www.countynewscenter.com/county-of-san-diego-releases-report-with-strategies-to-reduce-gun-violence/", "keywords": ["public safety", "and crimes", "final report", "firearms-related deaths", "gun violence reduction", "gun violence reduction community advisory group", "harc", "health assessment and research for communities", "injuries", "reccomendations"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-06-28T16:02:58-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego today released a report that highlights data related to gun violence in San Diego County and outlines recommendations to reduce this violence.\nThe Gun Violence Community Needs Assessment Final Report, authored by Health Assessment and Research for Communities (HARC), includes findings from more than 18 months of work with community and government leaders.\nAs stated in the report, between 2017-21, over 70% of firearm-related deaths in San Diego County were suicide and over 28% were homicide. The report details populations most impacted by firearm-related deaths, injuries, and crimes, including age, race, and geographic location.\nRecommendations in the report include prevention and intervention strategies tailored to specific populations at highest risk for violence, such as developing and sharing suicide prevention materials, domestic and intimate partner violence, and working to change norms about gun violence through outreach programs. It also highlights the need to partner with agencies that offer free gun locks.\nEnhancing community prevention services is also mentioned in the report, including expanding youth-focused programs, like mentorship and after school programs. Partnership building between trauma hospitals and community-based organizations that connect gun violence patients and their families to recovery services is also highlighted as a recommendation.\nCommunity engagement and collaboration is central to many of the recommendations. Continued coordination with a Gun Violence Reduction Community Advisory Group and organizing networking events for community organizations working to reduce gun violence is recommended.\nThe County is developing a work plan, using HARC’s recommendations, to advance gun violence reduction activities in the county. The report and work plan will be presented to the County Board of Supervisors on July 18.\nA link to the report can be found here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230628.14.15.51"}