{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 12-28-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 27.", "datePublished": "2020-12-28T16:40:02-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-12-28-2020/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-12-28T16:40:02-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 27.\nICU Capacity and Stay Home Order:\n\nThe current ICU capacity for the Southern California region is now 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order remains in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will remain in effect until the region’s ICU capacity meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed on Dec. 27.\nTen new community outbreaks were confirmed on Dec. 26: six in business settings, two in healthcare settings, one in an emergency services setting and one in a community-based organization.\nNine new community outbreaks were confirmed on Dec. 25: four in business settings, two in healthcare settings, two in faith-based agency settings and one in a distribution warehouse setting.\nFourteen new community outbreaks were confirmed on Dec. 24: three in business settings, three in healthcare settings, three in faith-based agency settings, one in a daycare/preschool/childcare setting, one in a preschool setting, one in a distribution warehouse setting, one in a restaurant and one in a hotel/resort/spa setting.\nIn the past seven days (Dec. 21 through Dec. 27), 59 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n18,972 tests were reported to the County on Dec. 27, and the percentage of new laboratory-confirmed cases was 9%.\nThe 14-day rolling average percentage of positive cases is 10.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 23,668.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n1,751 new cases were reported to the County on Dec 27. The region’s total is now 147,530.\n5,743 or 3.9% of all cases have required hospitalization.\n1,201 or 0.8% of all cases and 20.9% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nTwo new COVID-19 deaths were reported to the County on Dec. 27. The region’s total is now 1,404.\nTwo men died between Dec. 20 and Dec. 21, and their ages ranged from mid-30s to late 60s.\nBoth had underlying medical conditions.\nTwenty new COVID-19 deaths were reported to the County on Dec. 24.\nSix women and 14 men died between Dec. 18 and Dec. 24, and their ages ranged from mid-50s to mid-90s.\nSeventeen had underlying medical conditions and one did not. Two have medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201228.16.40.02"}