{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Fire Plays Key Role in COVID Vaccine Rollout", "description": "San Diego County Fire Protection District personnel have played a key role in helping to vaccinate more than 9,000 county residents against COVID-19 over the past month as part of “Operation Collaboration.”", "datePublished": "2021-02-11T09:32:49-08:00", "url": "https://www.countynewscenter.com/county-fire-plays-key-role-in-covid-vaccine-rollout/", "keywords": ["public safety", "covid", "fire district", "public safety"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-02-11T09:32:49-08:00", "articleType": "article", "articleContent": "\nSan Diego County Fire Protection District personnel have played a key role in helping to vaccinate more than 10,000 county residents against COVID-19 over the past month as part of “Operation Collaboration.”\nOfficially launched Dec. 29, Operation Collaboration is a combined effort between dozens of fire, emergency medical service, public health agencies and hundreds of personnel in the San Diego area to meet the COVID vaccination needs of some of the county’s most vulnerable residents.\n“Operation Collaboration is an important resource as we ensure vaccines are provided equitably to people throughout our entire County,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Just as they did during COVID-19 testing, the first responder community is again demonstrating its creativity and commitment to public health.”\nAccording to San Diego County Fire Chief Tony Mecham, the operation consists of two phases. The first phase involved getting the first responders who would administer the vaccines vaccinated themselves, and the second phase was to set up point of dispensing (POD) locations to administer the vaccine to those currently eligible.\n“We began the operation with the vaccination of EMTs and paramedics in the county, as part of San Diego County’s Phase 1A Tier 1, then had the opportunity to expand that effort into long-term care facilities, and now into our rural communities,” said Mecham. “To play a role in vaccinating some of our most vulnerable populations is incredibly rewarding. Our personnel have been working non-stop and seeing the value of their efforts with every dose makes it all worthwhile.”\nMecham said it’s not uncommon for County Fire to work alongside other partner agencies, but what makes this event different is the overall size of the operation.\n“To be side-by-side with over 25 departments and multiple EMS agencies working to support the vaccination process is incredible,” said Mecham. “With these partnerships, we’re able to reach large portions of the community regardless of where they live. In the past week, we’ve had vaccination events in locations across the county from Borrego Springs to El Cajon and Carlsbad.”\nAccording to Kenny Wheaton, a fire captain/paramedic with the Warner Spring Fire Station, the rural communities served by Operation Collaboration have been extremely grateful for the outreach efforts.\n“We serve in these areas every day, so there are plenty of familiar faces at these events,” said Wheaton. “To have the opportunity to provide vaccinations in these communities is an honor and has been a positive experience for everyone.”\nWheaton also said the effort has had its fair share of logistical challenges in planning and delivering the vaccine to rural communities and long-term care facilities.\n“These vaccines save lives and are the quickest way to get our communities back to some sense of normalcy,” said Wheaton. “The rural vaccination sites have been very successful thus far; lines and wait times are minimal and we work hard to get residents in and out in a timely manner.”\nCounty residents in rural locations who meet the vaccine criteria and are interested in making an appointment to receive the vaccine at either the fixed PODs or temporary sites are encouraged to check the County Fire Facebook page and County Fire Twitter for the most up-to-date locations on where the vaccine will be administered. All County and County partner sites, as well as information on groups eligible to receive vaccines, can be found at coronavirus-sd.com/vaccine.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210211.09.32.49"}