{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Take the Warrior Hike Challenge", "description": "Conquer what is arguably the toughest trail in the county this Memorial Day weekend. Trek up El Cajon Mountain in El Capitan County Preserve during the 10th annual Warrior Hike Challenge on Saturday, May 24.", "datePublished": "2025-05-16T15:14:34-07:00", "url": "https://www.countynewscenter.com/take-the-warrior-hike-challenge-4/", "keywords": ["parks and rec", "el cajon mountain", "el cap", "el capitan", "veteran", "warrior hike"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2025-05-16T15:14:34-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesConquer what is arguably the toughest trail in the county this Memorial Day weekend. Trek up El Cajon Mountain in El Capitan County Preserve during the 10th annual Warrior Hike Challenge on Saturday, May 24.\nThe adventure is designed to celebrate the physical and mental stamina that’s required to hike El Capitan, which is popular among active-duty military and veterans.\nThere are several levels to this challenge. Participants can choose their own adventure, navigating the length of trail that matches their individual interest and ability. “Celebration stations” will be at the 1-mile and 3-mile turnaround points. Extreme hikers can push on to the summit for an 11-mile roundtrip trek.\nWomen in the Wild will be leading the event kick off with a 7 a.m. flag raising and Pledge of Allegiance led by a local scout troop. Park rangers will then lead hikers through a pre-hike stretch and review hiking tips for this tough trail, followed by a guided hike to the 1-mile and 3-mile turn around points starting at 7:30 a.m.\nLaunched in 2015, the Warrior Hike Challenges take place twice a year on Memorial Day and Veterans Day weekends.\n\nThis year, participants can earn a 10th anniversary challenge coin for each hike completed in 2025. Finish both the Memorial Day weekend and Veterans Day weekend hikes and receive a champion coin.\nThe event is free and open to all ages and dogs on a leash. Parks and Recreation encourages all guests to consider the demands of the challenge, which include the trail’s steep inclines and lack of shade when selecting their hiking buddies. This is not an easy hike; it is rated moderate to difficult depending on how far you go.\nAttendees should bring ample water (1+ gallons for those headed to the summit) and wear sturdy hiking boots. Sunscreen, sunglasses, a hat, and a walking stick or poles are also recommended.\nThe Warrior Hike Challenge officially starts at 7 a.m. and staff will be onsite until 4 p.m. to answer questions.\nEl Capitan is located at 13775 Blue Sky Ranch Road in Lakeside. The parking area and trailhead are located at the intersection of Wildcat Canyon Road and Blue Sky Ranch Road. Overflow parking is at Oakoasis County Preserve across the street and along Wildcat Cayon Road.\nIf you are interested in volunteering for the Warrior Hike Challenge, fill out this volunteer form.\nSee the event flyer.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250516.15.14.34"}