{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccination Clinic to Open in Vista", "description": "A new COVID-19 vaccination site will open Feb. 14 in Vista, capable of providing up to 500 doses daily.", "datePublished": "2021-02-12T17:14:56-08:00", "url": "https://www.countynewscenter.com/covid-19-vaccination-clinic-to-open-in-vista/", "keywords": ["health", "coronavirus", "covid-19", "vaccinations", "vista clinic"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-12T17:14:56-08:00", "articleType": "article", "articleContent": "\nA new COVID-19 vaccination site will open Feb. 14 in Vista, capable of providing up to 500 doses daily.\nThe new clinic will be open from 9:30 a.m. to 3:30 p.m. Sundays and Mondays at the Linda Rhoades Recreation Center, 600 North Santa Fe Ave.\nAll County vaccination super stations and points of dispensing, or PODs, are currently vaccinating people in Phase 1A and people 65 years and older in Phase 1B. All require appointments which can be made at vaccinationsuperstationsd.com. Note that the vaccination super station at Petco Park will not be vaccinating people for three days due to a delay of a shipment of Moderna vaccine.\nCounty-funded community health workers, known as promotoras, are reaching out to people 65 and older in National City, Chula Vista, Imperial City and San Ysidro directly to help them make vaccination appointments.\nThe Metropolitan Transit System is offering free rides to people with proof of a vaccination appointment. 2-1-1 San Diego and promotoras also have the capacity to arrange for transportation.\nTo date, more than 703,000 COVID-19 doses have been delivered to the region with nearly 570,000 administered. The difference between the two numbers represents approximately what is expected to be administered the next seven days and doses still to be entered in the record system. Those vaccinated to date include more than 104,000 San Diegans who are fully vaccinated, while 15.8 percent of the population over age 16 have received at least one dose. More information about vaccine distribution can be found on the County’s vaccination dashboard.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 34.2 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 9.1%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 12.1% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers, but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 16.\n\nCommunity Setting Outbreaks:\n\nSeven community outbreaks were confirmed Feb. 10: four in business settings, two in TK-12th grade school settings and one in a community-based organization setting.\nIn the past seven days (Feb. 5 through Feb 11), 67 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n20,533 tests were reported to the County on Feb. 11, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 6.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,349.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n817 cases were reported to the County on Feb. 11. The region’s total is now 250,791.\n11,372 or 4.5% of all cases have required hospitalization.\n1,539 or 0.6% of all cases and 13.5% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n24 COVID-19 deaths were reported Feb. 11. The region’s total is 2,979.\n15 men and nine women died between Jan. 14 and Feb. 11.\nOf the 24 new deaths reported today, nine people who passed away were 80 years or older, six people were in their 70s, seven people were in their 60s and two people were in their 50s.\n23 had underlying medical conditions and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210212.17.14.56"}