{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County: $1.8 Mill Available to Youth Sports and Camps to Cut Kids’ Registration Fees", "description": "The County’s Department of Parks and Recreation wants to give youth sports and camp programs shares of $1.8 million to help get 15,000 to 20,000 kids back out to play in the wake of the COVID-19 pandemic.", "datePublished": "2021-10-20T14:18:26-07:00", "url": "https://www.countynewscenter.com/county-1-8-mill-available-to-youth-sports-and-camps-to-cut-kids-registration-fees/", "keywords": ["parks and rec", "county parks", "health", "healthy living", "live well", "youth camps", "youth sports"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-10-21T16:35:56-07:00", "articleType": "article", "articleContent": "\nThe County’s Department of Parks and Recreation wants to give youth sports and camp programs shares of $1.8 million to help get 15,000 to 20,000 kids back out to play in the wake of the COVID-19 pandemic.\nThe County’s Board of Supervisors approved using $1.8 million in American Rescue Plan Act funds earlier this month to reduce or eliminate sports and camp registration fees for children. The action recognized that the COVID-19 pandemic created financial hardships for many families and businesses that could keep children out of sports and camp activities.\nHow to Apply\nYouth sports and camp programs in unincorporated communities can apply for shares of the money at one of two reimbursement levels — up to $50 or $100 per youth participant — by filling out an online application form.\nPrograms must meet a handful of criteria to be eligible.\n\nThey must be operators of recreational youth sports or camps.\nThey must run those activities in an unincorporated community, including schools, or at a County-owned property.\nThey must have valid federal and/or state tax identifications.\n\nBusinesses and organizations that receive funding must use it to reduce registration fees for youth who want to attend their camps and programs.\nCounty officials expect the program will reduce or eliminate registration fees for 15,000 to 20,000 youth in camps and programs including: soccer, art/dance camps, football, cheer camps, baseball, softball and gymnastics.\nHelping Out in an Equitable Way\nParks will prioritize two-thirds of the programs funding — $1.2 million — to help teens and youth who live in areas that were likely to be the hardest hit by the COVID-19 pandemic, using the state’s Healthy Places Index as a guide. The Healthy Places Index rates census tracts within counties and gives them numerical scores to determine how healthy or unhealthy they are based on six metrics: economics, education, housing, health care access, neighborhood and clean environment.\nThe program will provide the $1.2 million to cover up to $100 per participant, to organizations and camps serving youth in the lower two quartiles of the Healthy Place Index.\nParticipants, facilities, and organizations in the upper quartiles would also be eligible for partial waivers and reimbursements, up to $50 per participant.\nParks officials said because youth sports and camp registration periods vary and often come months ahead of the actual events, Parks will reimburse organizations in two batches to ensure reimbursement helps youth and teens who actually participate in camps and programs, rather than estimates based on early sign-up projections.\nFor more information about the program and how to take part, go to the Parks Department’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211020.14.18.26"}