{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Removes Barriers to Housing Production", "description": "Today was a good day for housing in the County’s unincorporated area as the San Diego County Board of Supervisors adopted 22 promising actions designed to ultimately help renters and home buyers affected by our region’s housing crisis.", "datePublished": "2023-05-24T17:50:02-07:00", "url": "https://www.countynewscenter.com/county-removes-barriers-to-housing-production/", "keywords": ["housing", "affordable housing", "board of supervisors"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2023-05-25T14:14:41-07:00", "articleType": "article", "articleContent": "\nToday was a productive day for housing in the County’s unincorporated area as the San Diego County Board of Supervisors adopted 22 promising actions designed to ultimately help renters and home buyers affected by our region’s housing crisis.\nThe changes approved today are designed to deliver different types of housing faster and easier.  They reduce and guarantee review times for housing plans and permits, encourage innovation and technology, provide extra customer support and include financial incentives. The Board committed $14.5M in funding to carry out these efforts.\nThe actions will help builders save time and provide certainty in the development process – both identified as highly valuable for both market-rate developments as well as affordable housing projects. Others involve information technology changes that aid project tracking, transparency, and increased communication, as well as customer education, guidance tools and support.\n“Today’s Board actions reinforce the County’s commitment to improve housing opportunities in our area. We look forward to offering faster review times, greater efficiencies, and more support to our housing applicants so they can build the homes we desperately need in our community,” said Planning & Development Services Director Dahvia Lynch.\nGovernment-funded affordable housing, emergency shelters, workforce and infill housing stand to benefit from today’s actions.\nFor example, it will be easier to get a building permit if you have a previously approved home design.  If a housing project fits within the existing rules of the County General Plan, fewer approvals/permits will be needed.\nThere also will be extra professionals to make sure applications are complete and correct when submitted to save time going back and forth on corrections. In addition, projects needing septic tank approvals will have dedicated assistance to conduct safety reviews more efficiently.\nThe County will also be offering pre-approved plans for single family homes and accept tiny homes on wheels as an approved housing option.\nThe recommendations were generated by a multi-department County working group and shaped by stakeholder input. The working group included Planning & Development Services, Public Works, Environmental Health & Quality, County Counsel, County Fire, Housing & Community Development Services, Purchasing & Contracting, General Services, and the Office of Economic Development and Government Affairs.\nToday’s actions and other endeavors are part of the County’s ongoing response to the region’s housing affordability crisis. Efforts also are underway at the County to create a roadmap, or Housing Blueprint, to guide our ongoing response. Community input remains vital to the County’s efforts to address the crisis to date. People are encouraged to review the Housing Blueprint to help inform final recommendations for its goals and objectives before it is presented later this year to the Board of Supervisors.   In recognition of efforts to date, the County has received a Prohousing designation from the State. This is awarded to cities and counties that implement zoning and land use policies that favor development, accelerate housing production timeframes, reduce housing and production costs, and provide financial subsidies.\nHere is a snapshot of all adopted actions today.\nActions achievable within 12 months\n\nGuaranteed Timelines for 100% Affordable Housing & Shelters, VMT Efficient and Infill Areas and Workforce Housing\nPrioritization of Contracts to Support Housing\nProcess Improvements\nEnvironmental Health & Quality Temporary Contracting Authority\nOver-the-Counter Reviews for Previously Approved Home Designs\nPermit Specialists to Assist Applicants\nTools & Guidance for Applicants\nHousing Legislation Outreach, Promotion, & Implementation\nDevelopment Feasibility Analysis Liaisons (Economic Development)\nExpedite Implementation of the Housing Element\nGrading Ordinance Update\nFlexibility for Infrastructure Requirements (additional community engagement)\n\nActions achievable within 1 to 3 years:\n\nTiny Homes on Wheels\nPrepare Pre-Approved Home Plans\nInformation Technology Upgrades – Phase II\n\nActions achievable with three to five years:\n\nPrepare a Programmatic Environmental Impact Report (PEIR) for Key Areas\nPrepare Land Surveys\nGrading Ordinance Updates\n\nMore detail on this item can be found here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230524.17.50.02"}