{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Report Shows Slight Increase In Suicide Deaths", "description": "After years of declines, confirmed suicide deaths in San Diego County rose to 360 in 2022, slightly more than the 358 recorded in 2021, which was the lowest number of deaths in 10 years. ", "datePublished": "2023-09-07T17:10:00-07:00", "url": "https://www.countynewscenter.com/report-shows-slight-increase-in-suicide-deaths/", "keywords": ["health", "behavioral health", "mental health", "report to the community", "suicide prevention", "suicide prevention council", "suicide warning signs"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-09-07T17:10:00-07:00", "articleType": "article", "articleContent": "\nAfter years of declines, confirmed suicide deaths in San Diego County rose to 360 in 2022, slightly more than the 358 recorded in 2021, which was the lowest number of deaths in 10 years. \nChairwoman Nora Vargas and Behavioral Health Services Director Luke Bergmann shared those findings and others today during the Suicide Prevention Council’s annual Report to the Community press conference. The report is a compilation of the most recent data on suicide in San Diego County.  \nSuicides are tracked by rates, which is the number of deaths per 100,000 population. \nDespite the downward trend in suicides overall from 2012 to 2021, death rates increased 7 percent for youth and young adults between the ages of 10 to 24, and 3 percent for adults between the ages of 25 to 44. \nIn 2021, older adults 65 years and above had the highest suicide rate (16.4 per 100,000). \nWhite residents experienced the highest suicide rate in 2021 (16.5). For Hispanic residents, suicide rates  from 2012 to 2021 increased by 26 percent, from 4.5 to 5.6. \nSpeakers said the data trends highlight the need for continued and increased prevention efforts for populations who are especially vulnerable to suicide. Proactively seeking help and resources, talking openly and honestly, and staying connected as a community are crucial to reducing suicides in our region and ensuring everyone has the support they need.  \nTo view the complete 2022 Report to the Community, visit www.spcsandiego.org. \nSuicide can be prevented. If you or someone you know needs help, call the Access & Crisis Line at 888-724-7240, seven days a week/24 hours a day. Assistance is available in multiple languages. You can also call the national Suicide and Crisis Lifeline at 988.  \nSuicide prevention trainings to recognize warning signs, provide resource information, and assist loved ones through open and direct communication are offered free of charge. To find out more please visit www.SPCSanDiego.org to sign up for or host a training. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230907.17.10.00"}