{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Departments Help Unhoused Veterans at Stand Down Event", "description": "Several County departments are offering services at the Veterans Village of San Diego’s Stand Down 2024.", "datePublished": "2024-08-09T16:25:27-07:00", "url": "https://www.countynewscenter.com/county-departments-help-unhoused-veterans-at-stand-down-event/", "keywords": ["veterans", "homelessness", "stand down", "veterans", "veterans village of san diego"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-08-09T16:25:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSeveral County departments are offering services at the Veterans Village of San Diego’s Stand Down 2024.\nBeginning today, Aug. 9, and running through Sunday, Aug. 11, the three-day event will support unhoused veterans by providing a wide range of resources, including medical, legal, and mental health services, assistance with documents, voter registration, and more.\nThis year’s Stand Down takes place at 2400 Euclid Ave., National City, CA 91950.\nIn addition to the services the County will offer, veterans in attendance will have access to breakfast, lunch and dinner, clothing and shoes, employment information, hygiene items, pet services, haircuts and more.\nAmong the services offered, there will be a first-of-its-kind Landlord Hub, where the County, City of San Diego, and other veteran partners hope to encourage landlords to submit landlord interest forms and rent to voucher-holding veterans.\nBelow is a list of County departments and agencies that will be in attendance and the services they will offer:\nHomeless Solutions and Equitable Communities: \n\nConnect veterans with housing and community resources, social services programs, and case management services.\n\nDepartment of Child Support Services: \n\nChild support services\nDriver’s license releases and modification requests\nGeneral case status\nDebt relief options\nChild support legal assistance\n\nPublic Defender’s Office: \n\nMore than 60 attorney and staff volunteers\nHomeless Court program to clear barriers to exiting homelessness\nCriminal record clearance\nFine and fee clearance\n\nRegistrar of Voters:\n\nHelp veterans check on their voter registration\nHelp veterans register to vote\nInform veterans of their voting options\nProvide election information\n\nOffice of Military and Veterans Affairs:\n\nU.S. Department of Veterans Affairs compensation assistance\nDepartment of Motor Vehicle (DMV) driver’s licenses\nDMV disability license plates\n\nPublic Health Services (Friday and Saturday only):\n\nHepatitis A vaccines\nCOVID-19 vaccines for both insured and uninsured individuals\nMpox vaccines (limited supply)\n\nSelf-Sufficiency Services: \n\nCal-Fresh and Cash benefits support, including Electronic Benefit Transfer (EBT) card replacements\nHelp enrolling or renewing Medi-Cal health coverage\nCase support\n\nHousing and Community Development Services: \n\nVeterans Affairs Supportive Housing (VASH) voucher support to connect veterans with housing\nHCDS will invite housing providers to the Stand Down event where they can speak with the VASH team and the Landlord Liaison about the benefits of housing veterans. The purpose of having landlords attend the Stand Down is to gather information about current and upcoming vacancy leads that can be distributed to Veteran participants.\n\n San Diego Sheriff’s Department’s Homeless Assistance Resource Team:\n\nEducation for veterans on resources like food, housing, job programs, substance abuse counseling and mental health services.\nTransportation to the event for veterans who need assistance to get to the area\n\nRecorder/County Clerk:\n\nAssisting individuals experiencing homelessness in obtaining a free birth certificate under Assembly Bill 1733.\nAn affidavit must be completed by both the individual requesting the birth certificate and the homeless service provider onsite. For those not born in California counties, the Recorder/County Clerk can assist with completing the birth certificate application and affidavit. AB1733 does not apply to individuals born outside of California or the United States.\n\nMore information about Veterans Village of San Diego Stand Down 2024 can be found here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240809.16.25.27"}