{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Shigella outbreak reported in City of San Diego individuals experiencing homelessness", "description": "The County of San Diego Health and Human Services Agency is monitoring an outbreak of at least six cases of shigellosis in individuals experiencing homelessness since Sept. 30, 2021. The cases were found after the individuals were hospitalized. They are expected to recover.", "datePublished": "2021-10-11T18:57:25-07:00", "url": "https://www.countynewscenter.com/shigella-outbreak-reported-in-city-of-san-diego-individuals-experiencing-homelessness/", "keywords": ["health", "shigella", "shigellosis"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-10-11T18:57:25-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is monitoring an outbreak of at least six cases of shigellosis in individuals experiencing homelessness since Sept. 30, 2021.\nThe cases were found after the individuals were hospitalized. They are expected to recover.\nThe County has notified the City of San Diego and will work with the city and potential exposure sites and homeless service providers to ensure good hygienic precautions, identify any additional cases and connect ill individuals to treatment and housing.\nA health advisory to local providers also has also been issued.\n“Shigellosis isn’t usually serious, but in the wrong circumstances it can spread, and we want to ensure this vulnerable population is kept safe,” said Seema Shah, M.D., medical director of HHSA’s Epidemiology and Immunization Services branch.\nShigellosis is a contagious infection typically spread by contaminated surfaces, food or water, or sometimes person-to-person such as men who have sex with men (MSMs). In 2020, the County identified 243 total cases; to date in 2021, the County has identified 220.\nAlthough only a small number of organisms can make a person sick, casual contact is not the main way shigellosis bacteria are spread. Typical symptoms include diarrhea (sometimes bloody), fever and stomach cramps.\nThe infection is diagnosed with stool testing. Most people will recover fully without antibiotic treatment, though individuals with poor immune systems can develop life-threatening disease. If you have symptoms that resemble shigellosis, contact your primary care physician for assistance.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211011.18.57.25"}