{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Awarded Grant to Waive Permit Fees for Home Cooking Program", "description": "Are you interested in becoming a home kitchen operator? The County’s Department of Environmental Health and Quality received a grant from the state to waive permit fees for those who want to operate a Microenterprise Home Kitchen Operation.", "datePublished": "2024-12-10T11:52:29-08:00", "url": "https://www.countynewscenter.com/county-awarded-grant-to-waive-permit-fees-for-home-cooking-program/", "keywords": ["consumer", "consumers", "equity", "food", "home kitchen", "lueg"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-12-10T16:14:18-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAre you interested in becoming a home kitchen operator? The County’s Department of Environmental Health and Quality (DEHQ) received a grant from the state to waive permit fees for those who want to operate a Microenterprise Home Kitchen Operation (MEHKO).\nMEHKOs are home kitchens that operate as mini restaurants. The opportunity to run a business without the overhead costs and infrastructure required of a traditional brick-and-mortar restaurant facility is a game-changer for the existing MEHKOs participants.\n“There are so many people that have been able to enter the food industry and fulfill lifelong dreams about business ownership and provide food to the community that previously were unable to,” said Executive Director of the COOK Alliance Roya Bagheri, Esq.\nAll existing MEHKO permits at the start of the program were provided a fee waiver for their next health permit renewal.  All remaining funding will be put toward offsetting new MEHKO permit fees.\nFee waivers will be issued on a first come first served basis and will continue until available funds are exhausted or the waiver period ends, whichever comes first. The waiver period runs through May 2025.\nTo date, there have been 31 new MEHKO permits that have been issued as part of the fee waiver since the start of the fee waiver period. The County used 70% of the money that is available to offset permit fees for new MEHKO operators.\nThe program supports equitable access to self-employment to help avoid high start-up costs for many underrepresented groups, such as women, immigrants and people of color, to use their skills to generate income through a traditional restaurant space.\nNew operators interested in starting a MEHKO are required to submit a Health Permit Application, Standard Operating Procedures, and Food Safety Manager Certificate at the time of application.\nDEHQ oversees the MEHKOs program and ensures food safety through inspections, permitting and oversight of the rules of the program.\nDEHQ is committed to supporting San Diego’s home cooks and offers several resources to support those interested in the MEKHOs program. Visit the Home Kitchen Operations webpage to learn more.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241210.11.52.29"}