{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Seeking Public Input on How to Spend $14M  ", "description": "The County of San Diego’s Housing and Community Development Services (HCDS) wants to hear from you on how approximately $14 million in should be invested in the unincorporated areas and small cities of the County.", "datePublished": "2023-07-21T09:06:51-07:00", "url": "https://www.countynewscenter.com/county-seeking-public-input-on-how-to-spend-14m/", "keywords": ["housing"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-07-21T10:05:57-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Housing and Community Development Services (HCDS) wants to hear from you on how approximately $14 million should be invested in the unincorporated areas and small cities of the County. Funding can be used for homelessness services and shelters, public services, and community infrastructure. \nShare your thoughts at virtual and in person community meetings on how you would prioritize funding for housing, homelessness, and community infrastructure. \nIn Person: \n\nImperial Beach Library\nMonday, August 7\n5:30-6:30pm\n810 Imperial Beach Blvd., 91932\n\n\nFallbrook Library\nTuesday, August 8\n5:30-6:30pm\n124 Mission Rd., 92028  \n\n\nDel Mar Library  \nWednesday, August 9 \n4:30-5:30pm \n1309 Camino Del Mar, 92014 \n \nSpring Valley Library\nThursday, August 10\n5:30-6:30pm\n836 Kempton St., 91977 \n \nLakeside Library\nMonday, August 14\n4:30-5:30pm\n12428 Woodside Ave., 92040\n\nVirtual: \n\nSession One\nTuesday, August 8\n10:00-11:00am\nVirtual Meeting Link\n \nSession Two\nTuesday, August 15\n5:00-6:00pm\nVirtual Meeting Link  \n\nIf you cannot attend one of the 2024-2025 Annual Plan Strategy community forums, more information and engagement opportunities will be available on the San Diego County Engagement Center the week of August 7. \nHCDS administers four U.S. Department of Housing and Urban Development programs to support the region’s low- and moderate-income households throughout the region. Those federal entitlement programs include: \nCommunity Development Block Grant (CDBG) \nThese funds are used to improve community development by providing decent housing and a suitable living environmental for low- to moderate-income households. Potential projects include park development, sidewalk construction, and supportive services such as nutrition assistance. Applications for CDBG funding will open in September 2023. \nAreas Served: Unincorporated San Diego County, Coronado, Del Mar, Imperial Beach, Lemon Grove, Poway, and Solana Beach. \nHOME Investment Partnerships Program \nThese programs fund affordable housing opportunities such as the County’s First-Time Homebuyer Program and multi-family affordable housing. Notices of HOME funding availability are posted as money becomes available.  \nAreas Served: Unincorporated San Diego County, Carlsbad, Coronado, Del Mar, Encinitas, Imperial Beach, La Mesa, Lemon Grove, Poway, San Marcos, Santee, Solana Beach, and Vista. \nEmergency Solutions Grants \n These funds are for improving the quality and number of emergency housing solutions, including shelters and transitional facilities for the homeless and supportive services to prevent at-risk families or individuals from becoming homeless. \nAreas Served: Unincorporated San Diego County, Coronado, Del Mar, Imperial Beach, Lemon Grove, Poway, and Solana Beach. \nHousing Opportunities for Persons with HIV/AIDS \nThis funding is for housing and supportive services for those living with HIV/AIDS. Potential projects include housing operations assistance, tenant-based rental services and supportive services such as nutrition assistance.  \nAreas Served: All San Diego County.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230721.09.06.51"}