{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Announces $9 Million in Funding for Childhood Obesity Programs", "description": "The County of San Diego and its partners announced $9 million in funding to address childhood obesity.", "datePublished": "2021-10-04T17:51:48-07:00", "url": "https://www.countynewscenter.com/county-announces-9-million-in-funding-for-childhood-obesity-programs/", "keywords": ["health", "childhood obesity", "children", "teens", "youth obesity"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-10-04T17:51:48-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego and its partners announced $9 million in funding to address childhood obesity. The funding is a combination of three separate grants that will support programs that address the root causes of childhood obesity, including barriers to healthy eating and exercising.\nThe grants will fund the work of several organizations within the San Diego County Childhood Obesity Initiative, a public-private, multi-sector partnership bringing together over 400 entities to address youth health through a collective impact model.\n“I am so proud of these partnerships we have formed as a County and the work that is being done to make sure children can live healthy lives,” said Board of Supervisors Vice Chair Nora Vargas. “It is through these partnerships that we have an opportunity to transform policies so that our communities not only have access to healthy foods but that at a young age we help kids understand the nutritional value of what they’re eating.”\nThe funding includes:\n\nA $4 million COVID-19 Health Literacy grant from the US Department of Health and Human Services Office of Minority Health that will allow COI partners to create culturally inclusive COVID-19 health literacy initiatives to support vaccination, testing, and contact tracing efforts among racial and ethnic minority and other socially vulnerable communities.\nA $2 million Centers for Disease Control and Prevention-funded partnership between the San Diego County Office of Education and the County Health and Human Services Agency to address COVID-19 health disparities by improving the health literacy of students in traditionally underserved communities.\nA $3 million grant from the California Governor’s Office of Research & Planning to address adverse childhood experiences, build resilience against stress and reduce childhood obesity in the Latino community.\n\n“The pandemic has highlighted how health disparities have been magnified in our region, with our communities of color experiencing the worst impact,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Funding from these grants will support communities most vulnerable during the pandemic, improve access to COVID-19 resources and enhance programs related to food security and resilience against stress to support the overall health of children and their families.”\nEven before the COVID-19 pandemic, 30% of local children were considered obese. According to a recent study in the Journal of the American Medical Association, child and teen obesity rates further increased over the past 18 months of the pandemic.\n“It is hard to eat a nutritious diet when healthy foods like fruits and vegetables are hard to afford and it is hard to be active when your neighborhood does not have enough sidewalks or parks,” said Kelly Motadel, M.D., M.P.H., County child health officer. “We need to work together to make changes that lead us to healthier living and multi-sector, public-private partnerships like the Childhood Obesity Initiative are critical to make this happen.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211004.17.51.48"}