{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Doctor Appointed to Medi-Cal Children’s Health Advisory Panel", "description": "The County Health and Human Services Agency’s Child Health Officer has been appointed to a state board that provides advice on issues impacting children whose parents have limited income and resources.", "datePublished": "2021-01-27T09:38:35-08:00", "url": "https://www.countynewscenter.com/county-doctor-appointed-to-medi-cal-childrens-health-advisory-panel/", "keywords": ["health", "childrens health advisory panel", "medi-cal", "motadel"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-27T09:41:46-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency’s child health officer has been appointed to a state board that provides advice on issues impacting children whose parents have limited income and resources.\nDr. Kelly Motadel is one of 15 members on the Medi-Cal Children’s Health Advisory Panel, which advises the California Department of Health Care Services on policy and operational issues that affect children on Medi-Cal.\n“I’m really looking forward to this experience as a way to contribute on a broader level but also in order to be a more knowledgeable resource for San Diego County,” said Motadel, M.D., M.P.H., who was recently selected to be the Child Health Officer at the County Medical Care Services Division. \nThe 15 members on the advisory body are recognized experts and stakeholders in their fields, “practicing and/or certified medical professionals, advocates who represent the interest of children’s health, as well as parent members who provide feedback on topics that impact children in Medi-Cal.”\nWhile the term is usually three years, Motadel’s appointment will last through Dec. 31, 2022 because she is completing the term of a recently departed member.\nAs the Child Health Officer at the County Medical Care Services Division, Motadel is responsible for assisting in the planning, organizing and directing of all functions related to children’s health in the County of San Diego, including the enforcement of all related laws, ordinances and regulations.\nMotadel also provides consultation and medical direction to First 5 San Diego, Child Welfare Services and Public Health programs on children’s health topics and will serve as pediatric liaison to Behavioral Health Services – Children, Youth, and Families System of Care.\nThe Medical Care Services Division supports access to quality, timely and evidence-based care in San Diego County’s communities, a goal of Live Well San Diego, the County’s vision to improve the health, safety and well-being of area residents.\n“The County has been aggressively working to improve the health, safety and well-being of San Diego County children and residents in the region, and Dr. Motadel will advocate on our region’s behalf on this state advisory panel,” said Nick Macchione, director of the County Health and Human Services Agency.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210127.09.38.35"}