{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Register to Vote by March 21 for the 80th Assembly District Election", "description": "If you live in the 80th Assembly District and want to vote in the April 5 Special Primary Election, you must register by Monday, March 21 to receive a ballot in the mail.", "datePublished": "2022-03-18T11:19:33-07:00", "url": "https://www.countynewscenter.com/register-to-vote-by-march-21-for-the-80th-assembly-district-election/", "keywords": ["elections", "80th assembly district special primary election", "mail ballot deadline", "registrar of voters", "voter registration deadline"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-03-21T10:13:31-07:00", "articleType": "article", "articleContent": "\nIf you live in the 80th Assembly District and want to vote in the April 5 Special Primary Election, you must register by Monday, March 21 to receive a ballot in the mail. Otherwise, you will need to make a trip in person to the Registrar’s office in Kearny Mesa or visit a vote center to conditionally register and vote provisionally through Election Day.\nOnly those who live in the state’s 80th Assembly District under the 2011 district boundaries can vote in the election. The district covers portions of southern San Diego County and includes parts of the cities of Chula Vista, National City and San Diego. If you’re not sure whether you were in the 2011 district boundary, you can look it up at sdvote.com.\nRegistering to vote is quick and easy and can be done online at sdvote.com. You will need to register to vote if you:\n\nare not registered in San Diego County\nrecently moved\nchanged your name\n\nIf your signature is confirmed through records at the California Department of Motor Vehicles, your registration will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the form, sign it and return it to the Registrar’s office by 5 p.m. on March 21.\nRegistration forms must be postmarked or delivered to the Registrar’s office by March 21.  Voters may also register online until midnight.\nIf you don’t have access to a computer, you may request a registration form. Call (858) 565-5800 or email rovmail@sdcounty.ca.gov.\nNot sure if you’re registered to vote? Check your registration status online at sdvote.com.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese, and Chinese.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday. Some ballot drop box locations and the Registrar of Voters office will be closed on Thursday, March 31 in observance of Cesar Chavez Day.\nYou can also vote in person. Five vote centers will be open daily from 8 a.m. to 5 p.m. starting Saturday, March 26 until Election Day, Tuesday, April 5, when nine vote centers will be open from 7 a.m. to 8 p.m.\nYou can find a complete list of ballot drop box and vote center locations inside your voter information pamphlet or you can find a location near you using the locator map at sdvote.com.\nThis special election is to fill a vacancy in the 80th Assembly District for the remainder of the current term ending in December 2022. Even though recent redistricting changed assembly district borders, the boundaries used when the term began will determine who can vote to fill the seat to complete the term.\nLearn more about voting in the 80th Assembly District Special Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220318.11.19.33"}