{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Mini Home-Kitchen Program Reaches One-Year Anniversary Without a Hitch", "description": "It’s been one year and counting since hopeful chefs looking for a way to start a business in their homes found one through the County’s Microenterprise Home Kitchen Operations program.", "datePublished": "2023-07-31T12:22:25-07:00", "url": "https://www.countynewscenter.com/countys-mini-home-kitchen-program-reaches-one-year-anniversary-without-a-hitch/", "keywords": ["consumer", "consumers", "equity and access", "food", "health inspections", "home kitchen", "lueg", "mehko"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-07-31T12:28:59-07:00", "articleType": "article", "articleContent": "\nIt’s been one year and counting since hopeful chefs looking for a way to start a business in their homes found one through the County’s Microenterprise Home Kitchen Operations (MEHKO) program.\nOn February 25, 2022, the County opened its application process for the two-year temporary program that allows home chefs countywide to operate mini-restaurants with the ability to serve up to 30 in-person, take out or delivery meals a day for a maximum of 60 a week.\nAs of July 31, 2023, the County Department of Environmental Health and Quality (DEHQ) has issued 63 permits to successful MEHKOs operating throughout San Diego County. Food offerings by MEHKOs include a diverse array of cuisines from around the word including Japan, Egypt, Trinidad & Tobago, Italy, Indonesia, Mexican and American.\nThe County is the regional local authority that conducts health inspections for all restaurants and food facilities countywide. The County is also the governing body to consider MEHKO authorization for the unincorporated areas and the county’s 18 cities.\n“This program has opened the door, for the first time, to allow people who previously could not open their own restaurant the option to start a small food business,” said Ryan Johnson, Chief of Departmental Operations for DEHQ’s Food and Housing Division. “Our department is focused on helping these new business owners understand proper food safety practices related to operating a small restaurant as well as guiding them through the state law requirements for operating a home-based food operation.”\nAccording to DEHQ, none of the local jurisdictions or wastewater agencies in the region have reported any community impacts, such as traffic, parking, noise, grease disposal, trash, fire, fire risk or odor, related complaints that have resulted from MEHKO operations.\nThe County works with the MEHKO operator to help them return to compliance and continue their operation when there are complaints.\nThe County has conducted outreach and provided education in many languages to various local stakeholder groups, including the San Diego MEHKO Coalition, Cook Alliance and many others. This ongoing communication has helped MEHKO operators share helpful information about the program in their community.\n“Being able to operate an inspected and permitted home kitchen for selling homemade food to the community has been transformative for many families and individuals. The relatively low cost of entry has dismantled barriers and empowered entrepreneurs who were previously unable to be legal business owners, providing them and their families with economic sustainability,” said Karen Melvin with San Diego MEHKO Coalition.\nPrior to the temporary authorization of the MEHKO program ending on February 25, 2024, County staff plan to return to the Board to provide a report and receive direction on the future of a MEHKO program for the region and whether to make it permanent.\nFor more information, go to the Department of Environmental Health and Quality’s Home Kitchen Operations webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230731.12.22.25"}