{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Bancroft Safe Parking Program Provides Road to Housing", "description": "Gillie and Henry drove their gray sedan onto the County’s Bancroft Safe Parking site in Spring Valley in January and since then, they say they have been able to breathe a sigh of relief.  ", "datePublished": "2025-02-18T10:33:02-08:00", "url": "https://www.countynewscenter.com/countys-bancroft-safe-parking-program-provides-road-to-housing/", "keywords": ["housing", "bancroft", "homelessness", "housing", "safe parking", "spring valley"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-02-18T12:04:08-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesGillie and Henry drove their black sedan onto the County’s Bancroft Safe Parking site in Spring Valley in January and since then, they say they have been able to breathe a sigh of relief.  \nThe couple had spent months staying at various shelters or sleeping in their car on the side of the road after increased rent and a job loss forced them out of their long-term rental apartment and into their vehicle.  \n“No matter how we tried to keep our boat afloat, it was impossible,” Gillie explained. She says being at Bancroft Safe Parking “makes a whole world of difference to know that at five o’clock, we can come here, we get a shower, there’s a heater, there is coffee, oatmeal for the morning. It’s a relief.” \nGillie and Henry were referred to Bancroft Safe Parking by a County Office of Homeless Solutions outreach worker. The lot is operated by County contractor Dreams for Change. \n“Safe parking lots provide people with a place to park and sleep for the night, without the risk of being towed or asked to move,” said Dijana Beck, Director of the County Office of Homeless Solutions. “Participants also have support to get things like documents in order, reunifying with family and of course finding a more permanent housing solution.”  \n\nThose in the program are paired with a Dreams for Change case worker to help them find housing options. There are also employment, health and social services resources as well as flexible funding to help remove any barriers to housing. \nBancroft Safe Parking opened in August 2024. It has space for 27 cars that stay overnight only, starting at 5 p.m. There is security on the property, along with clean restrooms, hot showers, a dog run and a small kitchen. Dinner and breakfast also are provided.  \nThe goal is to help the families, couples, and other people find more stable housing. Pets are welcome, too. On average, residents stay at Bancroft Safe Parking between three to six months.  \nFor Gillie and Henry, their wait is over as they move into a studio thanks to support from the program.  \nCounty Efforts around Homelessness   \nThe County’s Bancroft Safe Parking Program is part of County’s broader efforts to expand emergency housing options for people experiencing homelessness in the unincorporated communities.  \nIn addition to Bancroft Safe Parking, these Compassionate Emergency Solutions and Pathways to Housing Efforts include Magnolia Safe Parking Program in El Cajon which opened in 2022. \nThe Magnolia location is being renovated to improve the site for staff and residents with updates to its bathrooms and shower, picnic and meeting areas and a new dog run. \nThe Troy Street Sleeping Cabins also are in development and anticipated to open in 2026. Learn more about programs and resources on the County’s Office of Homeless Solutions website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250218.10.33.02"}