{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two County-Sponsored Mpox Vaccination Events This Week", "description": "The County of San Diego is holding two Mpox (Jynneos) vaccination events this week in the South County in addition to providing 250 vaccinations throughout the week at County clinics.", "datePublished": "2022-08-29T14:14:39-07:00", "url": "https://www.countynewscenter.com/two-county-sponsored-mpox-vaccination-events-this-week/", "keywords": ["monkeypox", "mpox", "san diego county", "vaccinations", "jynneos"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-08-29T14:35:56-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is holding two Mpox (Jynneos) vaccination events this week in the South County in addition to providing 250 vaccinations throughout the week at County clinics.\nMore than 1,000 appointments were announced through the County Mpox text service this morning about 10 a.m. and were filled an hour later. The appointments were made through the state’s MyTurn vaccination site at myturn.ca.gov.\nThe two South County events are on Wednesday, Aug. 31 and Thursday, Sept. 1, between 1 p.m. and 6:30 p.m. each day.\nAbout 400 doses will be provided each day. The event location is Chula Vista Bayfront Park, 980 Marina Way, 91910, adjacent to and just north of the boat launch\nVaccinations will be given by intradermal injection.  The move to intradermal vaccinations allows up to five doses from a single vial, which formerly equaled a single dose. The California Department of Public Health recommends intradermal injection, except for people who have a history of developing keloid scars and people under the age of 18, both of whom would still require subcutaneous injection. People who are immunocompromised can receive intradermal injection.\nAppointments are expected to be released next week for a vaccination event in the North County.\nThe County appointments are in addition to those made available by healthcare providers to their patients who qualify for the vaccine and are scheduled directly by the provider. These provider appointments are not being made by the County or through 2-1-1 and are subject to vaccine availability.\n“As vaccine becomes available, the County will continue its efforts to vaccinate as many of those eligible as possible given the shortage of supply,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We will continue to request additional doses from the state. We continue to advise those at high risk to be cautious about their partners and those who have any signs of monkeypox to immediately get checked out by a physician.”\nCalifornia allocates vaccines to counties based on the number of Mpox cases in the county in the past two weeks, as well as the number of early syphilis cases in men reported in a region.\nA text message alert system is available for those seeking the latest information about monkeypox in the region. To sign up to receive the messages, text COSD MONKEYPOX to 468-311.\nFor more information on monkeypox, how to prevent it, and who should get vaccinated, visit the County’s Mpox website or call 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220829.14.14.39"}