{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "The Election is Tuesday – Do You Know Where to Vote?", "description": "The Presidential Primary Election is Tuesday, but you can find your polling place now. The location is listed on the back of the Sample Ballot and Voter Information Pamphlet sent to your home or you can look it up at sdvote.com. Type in your address and click submit to find your neighborhood polling place. Polling places can change from election to election, so it’s best to double check before going.", "datePublished": "2020-03-02T10:11:11-08:00", "url": "https://www.countynewscenter.com/the-election-is-tuesday-do-you-know-where-to-vote-5/", "keywords": ["elections", "fgg", "polling place", "presidential election", "presidential primary election", "voting", "where to vote"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-08-19T08:10:21-07:00", "articleType": "article", "articleContent": "\nThe Presidential Primary Election is Tuesday, but you can find your polling place now. The location is listed on the back of the Sample Ballot and Voter Information Pamphlet sent to your home or you can look it up at sdvote.com. Type in your address and click submit to find your neighborhood polling place.\nPolling places can change from election to election, so it’s best to double check before going.\nYou can also view your sample ballot online.\nIf you have a mail ballot but haven’t sent it, you can visit one of 61 mail ballot drop-off points around the county, many of which will become polling places on Election Day, or drop it off at any of 1,548 polling places.  If you have a mail ballot, but decide to vote at your polling place, bring the mail ballot with you to turn in.\nYou can also take your mail ballot and vote in person at the Registrar’s office located at 5600 Overland Ave., San Diego, 92123. Voters can cast their ballots between 8 a.m. and 5 p.m. Monday and 7 a.m. to 8 p.m. on Election Day.\n“So far, we have received 341,881 out of the more than 1.35 million mail ballots that were sent to voters. They’re being sorted and scanned now so they’ll be ready to count right when the polls close at 8 p.m. on Election Night.” said Registrar of Voters Michael Vu.\nIf you’re not registered and want to take part in the March 3 election, the Registrar of Voters urges you to visit the Registrar of Voters office or a satellite voting location to register and vote. These locations will have every ballot type available and are better equipped to help prospective voters needing to register and vote. If you need to take advantage of this service on Election Day you should expect long lines. Check wait times before heading out.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nTo learn more about voting in the March 3 election, visit sdvote.com or call (858) 565-5800.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200302.10.11.11"}