{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New 24/7 Library Kiosk Opens in Encinitas", "description": "Check out the latest County library in Encinitas. It comes in the form of a self-serve kiosk about the size of a bus shelter and holds hundreds of the latest books, DVDs and audiobooks.", "datePublished": "2021-12-06T17:02:56-08:00", "url": "https://www.countynewscenter.com/new-24-7-library-kiosk-opens-in-encinitas/", "keywords": ["library", "24/7 kiosks", "24/7 library kiosk", "county library", "encinitas", "ribbon cutting", "san diego county library", "sup. terra lawson-remer"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-12-06T17:02:56-08:00", "articleType": "article", "articleContent": "\nCheck out the latest County library in Encinitas. It comes in the form of a self-serve kiosk about the size of a bus shelter and holds hundreds of the latest books, DVDs and audiobooks.\nThe kiosk opened to customers after a ribbon-cutting ceremony on Monday.\n“Today is about bringing books closer to where people live — and doing it on a scale that is fast, efficient, and can be replicated throughout the County,” said Supervisor Terra Lawson-Remer. “With this 24/7 library kiosk, a whole new neighborhood can enjoy the benefits of a library just a few steps away from their home.”\n“The kiosk operates like a vending machine,” said County Library Director Migell Acosta. “You can check out and return books and DVDs, download audio and eBooks, and browse the entire library catalog 24 hours a day, 7 days a week.”\nThe 24/7 kiosk measures 8 feet tall, 13 feet wide and 5 feet deep yet it offers the full circulation functionality of a library. The structure is ADA accessible and offers Wi-Fi capability, too.\nThe County Library worked with the San Diego County Credit Union to bring the kiosk to the area. Customers can find it outside the credit union branch at 501 N. El Camino Real.\nThe County now offers five kiosks throughout the region. The four other kiosks are in Kearny Mesa, Bonsall, Boulevard and Chula Vista.\nThey were closed due to the COVID pandemic but reopened Monday as part of the ribbon-cutting celebration for the new kiosk in Encinitas.\nFor more information on the County Library, visit SDCL.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211206.17.02.56"}