{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Water Safety Reinforced on World Drowning Prevention Day", "description": "Local leaders gathered poolside today in Oceanside in observance of World Drowning Prevention Day. The County of San Diego, along with the Prevent Drowning Foundation of San Diego, City of Oceanside, and Black Star Water Polo were there to remind everyone that water safety saves lives.", "datePublished": "2023-07-25T16:06:47-07:00", "url": "https://www.countynewscenter.com/water-safety-reinforced-on-world-drowning-prevention-day/", "keywords": ["health", "drowning prevention", "swim lessons", "swimming pools", "water safety"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-07-26T08:53:08-07:00", "articleType": "article", "articleContent": "\nLocal leaders gathered poolside today in Oceanside in observance of World Drowning Prevention Day. The County of San Diego, along with the Prevent Drowning Foundation of San Diego, City of Oceanside, and Black Star Water Polo were there to remind everyone that water safety saves lives.  \nAmong San Diego County residents, the number of deaths from drowning was 31 in 2021, the most recent year with complete data. Also in 2021, there were 52 hospitalizations and 112 emergency room visits. The number of deaths in 2021 was down from 47 in 2018, but higher than the 29 in 2019 and 28 in 2020. \nEach year in California, over 400 people die from drowning and more that 1,200 are involved in non-fatal drowning incidents that require an emergency department visit or hospitalization.  \nDrowning is the single leading cause of death in children ages 1-4, and the second leading cause of unintentional injury death for children under 14.  \n“Forty-eight percent of all drowning deaths occur in June, July and August,” said San Diego County Supervisor, Jim Desmond. “And with so many of us enjoying the water to stay cool in these high temperatures, it is essential to prioritize water safety.” \nThe Centers for Disease Control and Prevention tracks annual data on its Drowning Prevention website that supports the peak months of danger.  \nAnyone can drown. No one should. Drowning is preventable through water safety education, swim instruction and learning how to provide CPR with rescue breathing. \n“Learning to swim is the best defense against drowning,” said Nicole McNeil, President Prevent Drowning Foundation of San Diego. “We provide a variety of swim lesson programs for individuals who have limited access and funding to this life-saving skill.” \nOther drowning prevention actions include pool fencing with self-closing, self-latching gates and alarms, wear properly fitted life jackets for all water sports, never swim alone and always supervise children around water.  \nFor more information about local swimming lesson resources visit the Prevent Drowning Foundation of San Diego. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230725.16.06.47"}