{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Encourages Skilled Nursing Facility Residents to Get All COVID-19 Boosters", "description": "Throughout the COVID-19 pandemic, older adults and those with compromised immune systems have been at the greatest risk of severe outcomes from COVID-19. New data released by the Centers for Disease Control and Prevention shows that these high-risk populations have a better survival chance when they are both vaccinated and boosted.", "datePublished": "2022-05-12T17:55:19-07:00", "url": "https://www.countynewscenter.com/?p=208510", "keywords": ["health", "coronavirus", "covid-19", "covid-19 boosters"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-05-12T17:55:19-07:00", "articleType": "article", "articleContent": "\nThroughout the COVID-19 pandemic, older adults and those with compromised immune systems have been at the greatest risk of severe outcomes from COVID-19. New data released by the Centers for Disease Control and Prevention (CDC) now shows that these high-risk populations have a better survival chance when they are both vaccinated and boosted.\nThe CDC report evaluated vaccination and infection data from close to 15,000 skilled nursing facilities during the height of the Omicron variant earlier this year. The data indicates that booster COVID-19 vaccine doses provided greater protection against Omicron than just the primary series of the two-dose Pfizer or Moderna vaccine, or one-dose Johnson & Johnson vaccine.\nBoosters are currently available for everyone age 12 and older. Anyone 50 and older, and those who are severely immunocompromised, can get an additional dose four months after their initial booster.\nMore than 600,000 County residents ages 50 and older are currently eligible to receive a second booster, but so far, less than one in five in that group has taken advantage of the additional shot.\nCounty health officials recommend that all immunocompromised San Diegans, especially those in skilled nursing facilities, get their booster doses when eligible.\n“The majority of our local deaths have been in unvaccinated San Diegans, or those who did not receive the recommended booster doses,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “As infection cases are beginning to trend up again in the region, I encourage anyone who is eligible for a booster to get it as soon as possible.”\nVaccination Progress:\n\nReceived at least one shot: More than 2.95 million or 93.8% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Close to 2.62 million or 83.1%.\nBoosters administered: 1,316,265 or 58.3% of 2,256,074 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n27 additional deaths were reported since the last report on May 4. The region’s total is 5,271.\nOf those 27 additional deaths, 13 were women and 14 were men. They died between Aug. 4, 2021 and April 6, 2022.\nThe majority of the newly-reported deaths were older cases discovered during the County’s routine quality assurance process.\n17 of the people who died were 80 years or older, five were in their 70s, one was in their 60s, two were in their 50s, one was in their 40s and one was in their 20s.\n22 of the people who died were fully vaccinated and five were not fully vaccinated.\n26 had underlying medical conditions and one has medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n2,236 COVID-19 cases were reported to the County in the past three days (May 9-11, 2022). The region’s total is now 768,368.\n4,995 cases were reported in the past week (May 5-May 11) compared to 4,110 infections identified the previous week (April 28-May 4).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 11.69 for people fully vaccinated and boosted, 6.98 for fully vaccinated people and 23.56 for not fully vaccinated San Diegans.\n8,306 tests were reported to the County on May 8, and the percentage of new positive cases was 6.2% (Data through May 8).\nThe 14-day rolling percentage of positive cases, among tests reported through May 8, is 4.9%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220512.17.55.19"}