{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Take Part in New Youth Suicide Reporting and Crisis Response Program", "description": "Hoping to find new ways to keep young people from attempting suicide, the County is poised to take part in a $4.1 million state youth suicide-focused pilot program.", "datePublished": "2023-06-14T11:53:35-07:00", "url": "https://www.countynewscenter.com/county-to-take-part-in-new-youth-suicide-reporting-and-crisis-response-program/", "keywords": ["health", "behavioral health", "behavioral health services", "hhsa", "pilot program", "suicide", "suicide prevention"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-06-14T13:13:05-07:00", "articleType": "article", "articleContent": "\nHoping to find new ways to keep young people from attempting suicide, the County is poised to take part in a $4.1 million state youth suicide-focused pilot program.\nThe program, County Health and Human Services Agency officials said Tuesday, could develop new prevention responses—like systems to continue contact and follow up care when youth experiencing thoughts of suicide, doing self-harm, or attempting suicide end up in hospital emergency rooms.\nOther actions could include expanding school-based suicide prevention programs like support, resources and mental health screenings for students and families; and increasing outreach, training and suicide risk screenings in rural communities, complementing the array of existing efforts the County is doing around suicide prevention.\nSupervisors Tuesday approved accepting the tentative $4.1 million from California Department of Public Health to “develop and test models for rapid reporting and comprehensive crisis response at the local level related to youth suicide and suicide attempts” for people under the age of 25. The state could approve the funding in its final budget deliberations.\nCounty health officials said Tuesday that the agency has and continues to create ongoing suicide prevention programs and efforts, and that local suicide rates have trended down. However, they said the county’s rates are still higher than state averages and that suicide remained an urgent, growing problem that needs addressing. Officials said the numbers of suicides between the ages of 15 and 19 increased 29% between 2017 and 2021, and that suicide remains a leading cause of death for San Diegans.\nPrograms the County has developed that could be used as bases in the pilot program include the “It’s Up to Us” multi-media campaign. The program aims to increase public awareness and understanding of suicide and the issues surrounding it. The County’s Mobile Crisis Response Teams send mental health experts to respond to people suffering a mental health crisis where they are to connect them to care. In addition, the County’s 24/7 Access and Crisis line — (888) 724-7240 — gives people a way to talk directly with a clinician to help them around the clock. That help was supplemented last year with the local introduction of the national 988 National Suicide Prevention Lifeline, a national network of local crisis centers that provides free and confidential emotional support to people in a suicidal, mental health and/or substance use crisis, 24 hours a day, 7 days a week.\nAnother County effort includes the San Diego County Suicide Prevention Council, which, among other efforts, coordinates mental health trainings and takes the lead in producing the annual Report to the Community that reports on suicide resources and data.\nMore information about the County’s behavioral health services can be found at its website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230614.11.53.35"}