{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Recognized in Statewide Study for Response to Medi-Cal Information Calls", "description": "San Diego County is being recognized for its Medi-Cal call center customer service efficiency.  ", "datePublished": "2024-08-08T08:33:01-07:00", "url": "https://www.countynewscenter.com/county-recognized-in-statewide-study-for-response-to-medi-cal-information-calls/", "keywords": ["health", "call center", "medi-cal", "rick wanne"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-08-08T10:45:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSan Diego County is being recognized for its Medi-Cal call center customer service response times.  \nThe Children’s Partnership, an organization that focuses on child health equity, conducted a study to learn how quickly call centers statewide answered and the best practices to support Californians enrolled in Medi-Cal. \nFor the study, secret callers reached out to 44 counties. The average hold time to speak to staff was 55 minutes across the state. \nBy contrast, wait times in San Diego County were less than one minute for 77% of the calls, with all calls being answered in under 10 minutes \nThe average hold time overall for San Diego County was just under one minute. \nThe results of the study are available here. \nSan Diego County is the second largest county in California with a population of 3,3 million. The region also is home to the second largest number of residents enrolled in Medi-Call, at 1.06 million. \n“I want to applaud all of our employees for their responsiveness and commitment to great customer service,” said Rick Wanne, director of Self Sufficiency Services. “We are grateful for this state-wide recognition and humbled at the opportunity to share best practices with our colleagues statewide.” \nFor more information on Medi-Cal visit the County of San Diego website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240808.08.33.01"}