{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisors Approve Plan to Address Illicit Fentanyl Crisis", "description": "San Diego County supervisors voted unanimously Tuesday to fight the fentanyl crisis by increasing education, outreach and early intervention, working to detect “outbreaks” or clusters of overdoses, and expanding distribution of overdose medication. ", "datePublished": "2022-12-13T17:06:49-08:00", "url": "https://www.countynewscenter.com/supervisors-approve-plan-to-address-illicit-fentanyl-crisis/", "keywords": ["health", "fentanyl", "hhsa", "public health"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-12-13T17:10:13-08:00", "articleType": "article", "articleContent": "\nSan Diego County supervisors voted unanimously Tuesday to fight the illicit fentanyl crisis by increasing education, outreach and early intervention, working to detect “outbreaks” or clusters of overdoses, and expanding distribution of overdose medication. \nTuesday’s action comes after the Board of Supervisors and County District Attorney’s office declared fentanyl deaths a public health crisis in late June. \nSupervisors asked County staff then to create a plan to address the rapidly increasing numbers of fentanyl overdose deaths, which spiked to 743 people in the county in 2021. That more than quadrupled the rate from 2019 and accounted for more than 70% of all overdose deaths in 2021.  \nAccidental fentanyl overdose deaths nationally have become the number one killer of 18-to 45-year-old people, surpassing deaths from car accidents, gun violence, heart disease and COVID-19, according to the Centers for Disease Control and Prevention. \nBoard Chair Nathan Fletcher said Tuesday’s action could give the fentanyl crisis the full attention it deserves and hopefully start progress in fighting it. \n“I’m completely supportive of everything in (this action),” Fletcher said, “the public health messaging, the Narcan (naloxone) distributions, the rapid response to overdose outbreaks.” \nFentanyl is a synthetic opioid that is 50 to 100 times more potent than morphine. Pharmaceutical fentanyl was approved for treating severe pain, typically for people suffering from advanced cancer, according to the CDC.  \nFentanyl overdoses and deaths have skyrocketed in recent years as illegal drug markets mix it with heroin and cocaine—without the user’s knowledge. \nCounty Health and Human Services Agency staff told supervisors Tuesday that they will move forward with a four-part strategy to build on the actions the County has already taken to address the problem.  \nConduct Overdose Prevention Education \nHHSA will continue outreach that began in 2021, including a fentanyl awareness campaign viewed more than 10 million times featuring billboards, advertisements in six languages, and social media connecting people to County websites with more information. The expanded campaign will include a media campaign focusing on young people, and presentations and naloxone trainings for parents and community groups. Naloxone is an FDA approved medication designed to rapidly reverse an opioid overdose. \nExpand Naloxone Distribution \nThe County launched an expanded naloxone distribution campaign in July that featured naloxone training and outreach. Starting next year, 12 naloxone vending machines will be installed around the county to help people experiencing overdoses.  \nNew efforts will include working with local colleges and universities to expand naloxone availability and working with County Emergency Medical Services on efforts to “leave behind” naloxone kits when emergency responders answer drug-related calls. \nEarly Intervention \nAnother key early intervention effort will be working with people who are at higher risk of suffering a fentanyl overdose. That would include people who go to emergency rooms and have suffered a non-fatal overdose. \nImprove Detections of Outbreaks of Overdoses \nHealth and Human Services will expand its surveillance and overdose data. That will allow it quickly identify clusters of outbreaks, rather than individual cases, which will allow it to respond rapidly to address outbreaks. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221213.17.06.49"}