{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "The County’s Multibillion-Dollar Budget – How It Works", "description": "Imagine trying to put together a budget for nearly 3.3 million people in a region about the size of Connecticut. It’s a big project and County staff has been working on it for months.", "datePublished": "2024-04-26T13:53:17-07:00", "url": "https://www.countynewscenter.com/the-countys-multibillion-dollar-budget-how-it-works/", "keywords": ["government", "2024-25 operational plan", "2024-25 recommended budget", "2024-25 recommended operational plan", "budget", "budget process", "county budget"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-04-26T14:16:44-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesImagine trying to put together a budget for nearly 3.3 million people in a region about the size of Connecticut.\nIt’s a big project and County staff has been working on it for months. They’re now putting the final touches on a balanced, recommended budget for the new fiscal year that starts July 1.\nThe numbers will be released May 2. Last year, the overall budget was $8.17 billion.\nHow does this affect you? If you go out to eat, visit the beach, own a home or vote then the County budget affects you. And that’s not all.\nThe County provides food and restaurant inspections, inspects beach and bay water, collects property taxes and conducts elections. It also provides child support services, safety net and health programs, foster care, veterans services, adult protective services and supports the justice system.\nThe County responds to regional disasters, and it addresses homelessness and affordable housing.\nIf you live in one of the county’s 18 cities, then those governments provide most of your services, including libraries, parks and roads. But the County even provides law enforcement services in nine of those cities.\nIf you live outside of those cities, your home may be in the unincorporated area. The County provides you with city-like services in addition to the regionwide services.\nFunding comes from a variety of sources. Almost half comes from the federal and state governments. But the County must follow certain rules on how to spend it.\nThe County can only make decisions on what remains, the funding from property taxes, fees for services and other sources.\nThe County must support existing programs and consider other factors, including equity, data and community feedback collected throughout the year, before committing to new ones. The economy may impact funding, and new and pressing needs may arise.\nStaff weighs all this before compiling the recommended budget. You can review it when it’s released early next month.\nLearn more about it when departments make budget presentations to the Board of Supervisors on May 14 and May 16. Community budget meetings will take place on May 23 and May 29, the Board holds public hearings on June 4 and June 6, and a revised budget is released June 13. Deliberations and adoption take place June 25.\nYou can stay informed throughout the budget process. Visit the budget page on Engage San Diego County and tell us if you prefer email, text or some other form of communication. Starting May 2 through June 13, you can offer your feedback through online comments at the same site. Or you can email engage@sdcounty.ca.gov.\nVisit the Clerk of the Board’s website or call 619-531-5434 to get details about the Board’s budget meetings and request translation services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240426.13.53.17"}