{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Important Reminder – County Urging Public to Take Precautions as More Rains Arrive", "description": "County officials are urging the public to be prepared and stay safe with more heavy rain and possible flooding in the forecast.  ", "datePublished": "2024-02-05T11:00:10-08:00", "url": "https://www.countynewscenter.com/county-urging-public-to-take-precautions-as-more-rains-arrive/", "keywords": ["government", "disaster preparedness", "rain"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-02-05T11:04:42-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesEditor’s note: this story has been updated to reflect another round of storms forecasted for San Diego County this week.\nCounty officials are urging the public to be prepared and stay safe with more heavy rain and possible flooding in the forecast.\nKnow your situation. If you don’t have to leave home, don’t. If you can work from home, do so.\nIf you don’t have to drive, stay off the streets and out of areas that could flood.\n“If you live in a flood prone area, take necessary precautions, protect your family and property, have a plan and a go kit so you are ready,” said County Emergency Services Director Jeff Toney.\nOther Tips To Stay Safe\n\nDo not walk, swim or drive through flood waters. Turn Around. Don’t Drown!\nStay informed: Monitor the weather and the news.\nIf you haven’t already, register your cell phone to receive alerts.\nGet local updates at AlertSanDiego.org, download the County emergency app to receive alerts, follow the County on social media and listen to local alerting systems for current emergency information and instructions regarding flooding.\nEvacuate immediately if told to evacuate or if you feel unsafe. In case you are separated during a disaster, discuss where to reunite because phone service may not be reliable during a disaster.\nIf evacuating, disconnect all electrical appliances; turn off electricity at the panel, gas service at the meter, and water at the main valve.\nGet to the highest level if trapped in a building. Only get on the roof if necessary and once there signal for help. Do not climb into a closed attic to avoid getting trapped by rising floodwater.\nHave contingency plans for different times of the day, such as an emergency while some family members are at work or school.\nContact your healthcare provider if you are sick and need medical attention. Wait for further care instructions and shelter in place, if possible. If you are experiencing a medical emergency, call 9-1-1.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240205.11.00.10"}