{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Residential KnoxBoxes Allow Firefighters to Get to Residents in Distress", "description": "If someone in a home suffers a medical emergency, they may be able to push a medical alert button or call 911, but unable to get to the door when help arrives.", "datePublished": "2020-12-18T12:47:33-08:00", "url": "https://www.countynewscenter.com/residential-knoxboxes-allow-firefighters-to-get-to-residents-in-distress/", "keywords": ["public safety", "backcountry", "county fire", "knoxbox", "risk reduction", "safety"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-12-18T12:47:33-08:00", "articleType": "article", "articleContent": "\nIf someone in a home suffers a medical emergency, they may be able to push a medical alert button or call 911, but unable to get to the door when help arrives.\nSan Diego County Fire is now offering qualifying residents a secure key safe called a KnoxBox that will allow first responders to gain access to a home within seconds in a life-threatening or critical situation.\n“When someone is having a medical emergency and becomes pulseless and apneic,  it’s really important for us to get in there and provide medical attention within 4-6 minutes and it’s costing us minutes to get in when we are having to break a door down,” said County Fire Deputy Chief Dave Nissen, who has worked in the rural East County communities for 30 years.\n“Looking at it from an evacuee position, we can get in there as well if a house is imminently threatened by fire or other types of emergencies and move people out who may not be able to move themselves,” said Nissen.\nCounty Supervisor Dianne Jacob, who represents communities protected by San Diego County Fire, said this program will truly benefit people in need in the backcountry.\n“For older folks with chronic health conditions or in need of help with basic activities, KnoxBoxes can be a lifesaver,” said Jacob. “These devices can also provide some peace of mind in a region where wildfire is a year-round threat.”\nThe program aligns with the County’s commitment to living safely, one of four strategic plan initiatives, and is offered at no cost to qualifying residents. County Fire installs the box just on or near the front door and can only be opened by local firefighters responding to life-threatening emergencies.\nThe KnoxBoxes can either be installed on a door or on a wall next to the front door.\nThe concern about firefighters being able to gain access to their home was on Nancy Weir’s mind when she called her local fire station on Palomar Mountain. Initially, she just wanted to make sure they could get past a complicated gate system used by several homes including her own. In talking to the captain, she mentioned that she is recovering from a concussion that can cause various degrees of dizziness and fainting.\n“I just wanted to be sure if I was home alone with the doors locked, the fire department could easily get in without busting my door down,” Weir said.\nShe said the captain came by to look at the gate and suggested she would be a perfect candidate for the residential KnoxBox program which she had not heard about. She signed up and soon enough someone from the fire station came by to install it.\n“I feel a lot safer now knowing they know how to get in the gate and how to get in my house and what my issues are,” Weir said. “It’s all great now, not only for medical relief but we have a super high fire risk here.”\nCounty Fire received a federal grant to help buy an initial 200 KnoxBoxes. The agency loans the boxes to participants to help reduce risk in their rural communities. The program launched in October and has received over 70 applicants so far, and more than 25 have been installed in communities such as Potrero, Jamul and Warner Springs. To qualify, residents must:\n\nLive in San Diego County Fire, Ramona Municipal Water District, or Deer Springs Fire Protection District coverage areas.\nBe any of the following:\n\nAt least 62 years old\nHave a disability\nNeed assistance with one or more Major Life Activity\n\n\n\nTo apply for the program or for more information, call San Diego County Fire at (858) 974-5744 or email FireCRR@sdcounty.ca.gov. People can also visit the San Diego County Fire Authority site to obtain an application and read more information on the program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201218.12.47.33"}