{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 1-27-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Jan. 26, 2021.", "datePublished": "2021-01-27T17:27:25-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-1-27-2021/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-27T17:27:25-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Jan. 26, 2021.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 49.6 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 12.6%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 16.7% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 2.\n\nCommunity Setting Outbreaks:\n\nEight community outbreaks were confirmed Jan. 26: two in business settings, two in TK -12th school setting, one in a daycare/preschool/childcare setting, one in a government setting, one in a faith-based setting and one in a healthcare setting.\nIn the past seven days (Jan. 20 through Jan. 26), 53 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n16,250 tests were reported to the County on Jan. 26, and the percentage of new positive cases was 9%.\nThe 14-day rolling average percentage of positive cases is 9.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 22,470.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases:\n\n1,415 cases were reported to the County on Jan. 26. The region’s total is now 231,481.\n9,669 or 4.2% of all cases have required hospitalization.\n1,387 or 0.6% of all cases and 14.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n44 new COVID-19 deaths were reported Jan. 26. The region’s total is 2,465.\n25 men and 19 women died between Dec. 31 and Jan. 26.\nOf the 44 deaths reported today, 18 people who passed away were 80 years or older, 12 people were in their 70s, eight people were in their 60s, four people were in their 50s and two people were in their 20s.\n43 had underlying medical conditions and one did not.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210127.17.27.25"}