{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Pet Licensing Easier, Adds Services with DocuPet", "description": "Customers who buy a dog license, either as a new adoption or for renewal through San Diego County Animal Services are getting added value with a new free 24/7 lost pet service that helps keep animals out of shelters and gets them safely back home.", "datePublished": "2025-04-18T16:54:09-07:00", "url": "https://www.countynewscenter.com/county-pet-licensing-easier-adds-services-with-docupet/", "keywords": ["animals", "adopt pets", "docupet", "pet licensing"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-04-18T17:26:00-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesCustomers who buy a dog license, either as a new adoption or for renewal through San Diego County Animal Services are getting added value with a new free 24/7 lost pet service that helps keep animals out of shelters and gets them safely back home.\nThe new DocuPet system makes it easier than ever. Pet owners can license their pets online, by mail, phone, or in person. Through this partnership, San Diego County gains a powerful tool to improve efficiency, boost pet reunification rates, and enhance public compliance.\n“This innovative system streamlines pet licensing and improves animal welfare across our community,” said Vaughn Maurice, County Animal Services director. “With fewer pets entering shelters, we can focus more resources on those that truly need our care. We’re thrilled to launch this partnership with DocuPet.”\nCali, 7, a shepherd mix is available at the South shelter.\nDog licensing and an up-to-date rabies vaccination is required in San Diego County, but too many pet owners overlook this essential step. The easier system could boost participation while providing a more convenient and beneficial experience for pet owners.\n“We’re proud to partner with San Diego County to support responsible pet ownership,” said Grant Goodwin, CEO of DocuPet. “Pets with DocuPet tags spend little to no time in shelters, compared to unlicensed pets. This partnership is a meaningful step toward reducing shelter intake and increasing return-to-owner rates.”\nWith the new system, residents can choose from hundreds of colorful, designer tags—or even create their own using a simple customization tool. Every tag includes DocuPet’s free HomeSafe® lost pet service, which links the tag’s unique code to a secure online profile. If a pet goes missing, the finder can use the tag to instantly file a Found Pet Report, while owners can do the same if their pet is lost. DocuPet’s 24/7 dispatch team is always available to help reunite pets with their families.\nCome adopt your new best friend at County animal shelters. This month, you can name your own adoption price for adult animals as part of Spring Break-Out for Shelter Pets. And if you dress in your favorite beach attire — think Hawaiian shirts, board shorts, or a sunny straw hat — you’ll receive a free beach party kit to get the party started. Plus, County shelters are offering 25% off adoption fees for puppies and kittens.\nLola, 2, is looking for a home. The Siberian Husky is at the Northern shelter.\nCounty Animal Services’ top priority is to protect the health, safety and welfare of animals and people. The department responds to the needs of the community and animals, promotes the humane and responsible care of pets, and works to find forever homes for every healthy and adoptable shelter animal.\nDocuPet provides pet identification, licensing, and lost pet recovery services with the mission is of ensuring every pet has a safe, happy home.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250418.16.54.09"}