{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Probation Awarded Grant to Supervise DUI Offenders", "description": "The San Diego County Probation Department received a $371,485 grant from the California Office of Traffic Safety to supervise high-risk, repeat DUI offenders.", "datePublished": "2020-10-23T10:20:59-07:00", "url": "https://www.countynewscenter.com/county-probation-awarded-grant-to-supervise-dui-offenders/", "keywords": ["public safety", "dui grant", "probation"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-10-23T10:20:59-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Probation Department received a $371,485 grant from the California Office of Traffic Safety to supervise high-risk, repeat DUI offenders.\nDUI Probation Officers supervise individuals in San Diego County seven days a week during non-traditional hours, including weekends and holidays. In addition to enforcing sobriety, officers work with community partners to provide appropriate resources for each person and to assist them with their overall compliance with the conditions of their grant of probation. The support provided by the Probation Department and collaboration with local agencies is essential for clients’ successful completion of probation without reoffending.\n“The grant partially funds our work to hold reoffenders accountable through supervision and enforcement,” said Ruben Leyva, Assistant Chief Probation Officer. “Our officers not only ensure compliance for court-ordered conditions but they also offer guidance to the offenders to help them on their path to rehabilitation and sobriety so we can make highways and roads safer.”\nThe one-year grant period started Oct. 1 this year. OTS has awarded San Diego County Probation Department DUI Grant funding for 14 years. Grant funding will be used to make sure offenders are following the court-ordered terms of their probation, including home, work and office visits, random alcohol testing, and warrant service operations.\nIn addition, funding will also be used to develop “hot sheets” that identify repeat DUI offenders, work with court officials to establish probation orders for DUI offenders on probation and provide Standard Field Sobriety Test training to officers.\nThis grant is aimed at reducing the number of persons killed and injured in alcohol-related collisions, as well as lower DUI recidivism rates.\n“Prevention is the best tool to address the significant traffic safety issue of DUI,” OTS Director Barbara Rooney said. “The goal of Probation programs is to help people convicted of DUI not put themselves in a position to make the same mistake again.”\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\nAs a member of the San Diego County Law Enforcement Task Force against Youth Access to Alcohol, the DUI Unit supports several alcohol enforcement activities in the community and works with local law enforcement and stakeholders to improve road safety and educate the public on the dangers of impaired driving.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201023.10.20.59"}