{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is the Last Day to Vote", "description": "Tuesday, Nov. 3 is the deadline to cast your ballot in the Presidential General Election. You can do so now at your assigned polling place or the Registrar’s office from 7 a.m. – 8 p.m.", "datePublished": "2020-11-03T07:00:19-08:00", "url": "https://www.countynewscenter.com/tuesday-is-the-last-day-to-vote/", "keywords": ["elections", "covid-19", "election day", "fgg", "nov. 3 presidential general election", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-11-02T17:15:45-08:00", "articleType": "article", "articleContent": "\nTuesday, Nov. 3 is the deadline to cast your ballot in the Presidential General Election. You can do so now at your assigned polling place or the Registrar’s office from 7 a.m. – 8 p.m.\nThe Registrar’s office reminds you that you can make voting decisions and complete your mail ballot in the comfort of your home and return it promptly to one of 126 mail ballot drop-off locations or at your polling place. Mail ballot locations will also be open from 7 a.m. to 8 p.m. for Election Day.\nAny voter who is in line at a polling place or drop-off location at 8 p.m. will be allowed to vote. However, no one can join the line to vote after the 8 p.m. deadline.\nTo vote in person, be prepared.\n\nGo to your assigned polling place. The location is listed on the back of your sample ballot and voter information pamphlet and also included on the Registrar’s postcard reminder sent to voters. Or you can find it online.\nBe “vote ready.” Mark your selections on your sample ballot in advance so when you go inside the voting booth, you can quickly fill in your official ballot.\nWear your face mask and maintain social distance. If you forget your mask, poll workers will give you one. Voters who are unable or unwilling to wear a facial covering or mask will be assisted outside at a social distance and will be able to vote outside.\nFollow all instructions provided by poll workers.\n\nThe Registrar of Voters is adhering to the County’s public health orders and has put in place protocols to ensure the health and safety of election workers, voters and observers at the Registrar’s office, polling places and mail ballot drop-off locations.\nAs in all elections, the Registrar’s office works collaboratively with local law enforcement agencies to ensure polling places and mail ballot drop-off locations are safe and voters can cast their ballot free from any interference, disruption or intimidation from others.\nTo learn about Vote Safer San Diego and voting in the Nov. 3 election, visit sdvote.com or call (858) 565-5800.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201103.07.00.19"}