{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Names New Public Health Officer ", "description": "Dr. Sayone Thihalolipavan has been named as the County of San Diego’s new Public Health Officer. Dr. Thihalolipavan most recently served as Public Health Medical Officer within the County’s Medical Care Services Department. ", "datePublished": "2025-05-12T14:46:05-07:00", "url": "https://www.countynewscenter.com/county-names-new-public-health-officer/", "keywords": ["health", "public health officer", "san diego public health", "sayone thihalolipavan"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-12T16:19:31-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDr. Sayone Thihalolipavan has been named as the County of San Diego’s new Public Health Officer. Dr. Thihalolipavan most recently served as Public Health Medical Officer within the County’s Medical Care Services Department. \n“We are excited to have Dr. Thihalolipavan accept this leadership position in the Public Health Services department,” said Kimberly Giardina, who leads the County’s Health and Human Services Agency as the deputy chief administrative officer. “He had a distinguished health career prior to joining the county and over the last decade has proven to be a leader in community engagement and collaboration on issues as diverse as the pandemic, opioid crisis and care coordination for vulnerable populations.” \nDr. Thihalolipavan (THIH-ha-lo-li-PA-van) replaces Dr. Ankita Kadakia, who had served as interim public health officer following the July 2024 retirement of Dr. Wilman Wooten. Dr. Kadakia will return to her previous position as deputy public health officer and the County is grateful for her leadership and contributions in the interim position. \n“I am humbled and honored to have been trusted with this opportunity,” said Dr. Thihalolipavan who will lead the County’s Public Health Services department. “I’m truly looking forward to continuing to serve San Diegans from our more populated coastline to our rural areas along with my amazing County colleagues and the broader public health community.” \nA board-certified physician in Public Health and Preventive Medicine, Dr. Thihalolipavan started his career in New York City’s Department of Health and Mental Hygiene as the Medical Director of Tobacco Control and Chronic Disease Prevention. He joined the County of San Diego’s Health and Human Services Agency in 2015 as the Deputy Public Health Officer in Public Health Services.  \nCommunity engagement is a key focus for Dr. Thihalolipavan. His efforts include focusing on a collective impact approach that brings stakeholders together to serve all San Diegans, including historically disenfranchised communities and populations. \n“Dr. Thihalolipavan is a great choice as the new Public Health Officer for San Diego County,” said Paul Hegyi, chief executive officer for the San Diego County Medical Society. “He knows this community well and always seeks out stakeholders to find the best solutions and help build a healthier San Diego region.” \nDr. Thihalolipavan played a pivotal role in multiple County public health responses, and these include the Covid-19 pandemic, Hepatitis A, meningococcal, Zika, and the opioid epidemic among others. During the Covid-19 pandemic, he drafted and reviewed health alerts, public communications and health orders, supported the reopening team, and routinely interfaced with various sectors.  \nHe led the development of the County’s first naloxone distribution program in 2018. He continues to actively support collaborative efforts with health and safety partners to end the opioid epidemic as an executive committee member on the County’s Substance Use and Overdose Prevention Task Force.    \nDr. Thihalolipavan holds a Master’s in Public Health from Columbia Mailman School of Public Health and a Medical Degree from New York University School of Medicine. He has been recognized with distinguished awards, including the San Diego County Top Doctors award in 2022 and the Kresge Foundation Emerging Leaders in Public Health award in 2018 and has led or contributed to various peer-reviewed publications. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250512.14.46.05"}