{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Homeless Outreach Teams to Serve North County Region", "description": "The County is expanding homeless outreach services by forming a North Region team to address the needs of people experiencing homelessness in North San Diego County.", "datePublished": "2021-11-15T17:09:12-08:00", "url": "https://www.countynewscenter.com/homeless-outreach-teams-to-serve-north-county-region/", "keywords": ["health", "framework for ending homelessness", "homeless outreach team"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-11-15T18:19:27-08:00", "articleType": "article", "articleContent": "\nThe County is expanding homeless outreach services by forming a North Region team to address the needs of people experiencing homelessness in North San Diego County.\nThis is part of the County’s newly adopted Framework to End Homelessness. Under the new approach, the County will focus on creating a person-centered system, one that uses a housing-first approach, maximizes social services interactions and follows evidence-based and data-driven solutions. This will be done to increase affordable and appropriate housing and to ensure homeless prevention and response is done with racial and social equity.\nSupervisor Tara Lawson-Remer, who coauthored a Board Letter for the new outreach program with Supervisor Jim Desmond, said Monday, “Homelessness is particularly challenging in North County. We have eight cities, and each city has a different plan, different staff and different resources. But starting today, for the first time, we are coordinating outreach across city and county lines so we can get people help and housing faster than ever before. It’s one united, collaborative effort to help the 1,500 people in North County without a home.”\nOutreach teams each have a social worker, a street case manager and an outreach human services specialist who work in partnership with cities and service providers to better connect unhoused people with critical services and support including housing opportunities.\n“This program is the first of its kind in the county and it will do better I believe, to help save lives and keep people off the streets and into the help and programs that they need,” said Supervisor Jim Desmond. “By partnering with the cities and the County of San Diego, this program is going to help triage those who are in desperate need of services that can be accessed by County social workers. They’ll be able to help transport clients, they’ll be able to access funds from the County to provide for incidentals such as clothing, food, help obtaining identification, and short-term motel/hotel vouchers.”\nLawson-Remer pointed out that the teams will be working in the streets, canyons and alleys to build trust with the people they hope to help.\nA team will be stationed in Escondido, with another team will launch in Oceanside in January.\nEscondido Mayor Paul McNamara, Oceanside Deputy Mayor Ryan Keim and Greg Angela with Interfaith Community Services also spoke in support of the new partnership.\nThe framework encompasses the County’s ongoing work and provides a vision to support forward, collaborative and impactful progress. The framework supports the County’s Live Well San Diego vision of healthy, safe and thriving residents. It will provide enhanced funding along with innovative new programming to guide existing and future regional efforts to address homelessness.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211115.17.09.12"}