{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County Celebrates New Affordable Housing Underway in San Ysidro", "description": "The County celebrated the beginning of construction on a new affordable housing complex in San Ysidro.  ", "datePublished": "2023-12-14T16:26:12-08:00", "url": "https://www.countynewscenter.com/county-celebrates-new-affordable-housing-underway-in-san-ysidro/", "keywords": [], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-12-14T16:26:12-08:00", "articleType": "video.other", "articleContent": "\nThe County celebrated the beginning of construction on a new affordable housing complex in San Ysidro.  \nThe Iris at San Ysidro will feature 100 units ranging from one to three bedrooms, including 15 fully furnished units reserved for people experiencing or at risk of experiencing homelessness.  \nThe development is a collaborative partnership with National CORE, the County of San Diego, the San Diego Housing Commission, and City of San Diego. \n“It is a good day when we can come together to take a step forward in ensuring San Diegans have a safe, supportive and affordable place to live,” said David Estrella, County Housing and Community Development Services Director. “The Iris at San Ysidro will be a welcoming new community for families and children close to transit, jobs and educational opportunities.”  \nThe County provided $10.5 million from the County’s Innovative Housing Trust Fund and No Place Like Home funds for the development. County Behavioral Health Services also committed to providing care at The Iris for the next 20 years.  \nThe Iris at San Ysidro is expected to be completed in 2025.  \nThe County has been a partner in breaking ground on eight other affordable housing projects so far this year. \nSince 2017, the County has invested more than $235 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund.   \nEfforts since 2017 have resulted in 1,660 new units opened with an additional 2,926 units on the way.   \nWhen all the developments in the pipeline are complete, the total number of affordable units supported by the County will reach nearly 7,600. This is expected to provide homes to more than 16,700 people.    \nThe development plans are in alignment with the County’s Housing Blueprint, which is currently being created. Once final, it will be the County’s guide to its ongoing response to the regional housing crisis. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231214.16.26.12"}