{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voting by Mail is Simple, Convenient, Secure", "description": "As ballots start showing up in mailboxes around San Diego County, the Registrar of Voters office is encouraging voters to vote early.", "datePublished": "2022-10-17T12:01:22-07:00", "url": "https://www.countynewscenter.com/voting-by-mail-is-simple-convenient-secure-2/", "keywords": ["elections", "fgg", "mail ballot drop box locations", "mail ballot drop-off locations", "nov. 8 statewide general election", "san diego county registrar of voters", "vote centers", "vote early", "voting by mail"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-10-17T12:30:30-07:00", "articleType": "article", "articleContent": "\nAs ballots start showing up in mailboxes around San Diego County, the Registrar of Voters office is encouraging voters to vote early.\nMore than 1.9 million ballots for the Nov. 8 Statewide General Election were sent out to registered voters last week. If you haven’t received yours by Oct. 17, contact the Registrar’s office.\n“San Diego County voters have more days and more ways to vote,” said Registrar of Voters Cynthia Paes. “You don’t need to wait until Election Day to vote. The sooner we get your ballot back, the sooner we can start processing it. Your ballot can be in the first release of election night results.”\nVoting by mail is:\n\nSIMPLE: A ballot, instructions and an “I Voted” sticker are included in your official ballot packet.\nCONVENIENT: Make voting decisions and mark your ballot comfortably at home.\nSECURE: Sign and date your envelope, seal your completed ballot inside and return it postage free to a trusted source:\nReturn your ballot through the mail, postage free. For a location near you, visit the U.S. Postal Service office or collection box website. Voters who return their mail ballot through U.S. Postal Service can track their ballot by signing up for “Where’s My Ballot?”.\nReturn it to one of the Registrar’s 141 official ballot drop boxes around the county. The new stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.” Find one close to you through the Registrar’s online locator tool or inside your information pamphlet. Check each location’s hours of operation before heading out at sdvote.com.\nReturn it to the Registrar’s office where early voting is already underway. Hours run from 8 a.m. to 5 p.m. Monday through Friday.\n\nYou can also vote in person at any vote center. Starting, Saturday, Oct. 29, 39 vote centers will be open daily from 8 a.m. to 5 p.m. On Saturday, Nov. 5, over 200 vote centers will be open daily from 8 a.m. to 5 p.m.\nAll vote center locations and the Registrar’s office will be open on Election Day, Nov. 8, when voting hours change to 7 a.m. to 8 p.m.\nLearn more about voting in the Nov. General Statewide Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221017.12.01.22"}