{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Flu Activity Extremely Low This Season Due to COVID-19 Measures", "description": "A total of 18 influenza cases have been reported in the county this season compared to 400 at the same time last year. County health officials believe this is the result of the preventive measures San Diegans are taking to fight the spread of COVID-19.", "datePublished": "2020-11-05T09:51:48-08:00", "url": "https://www.countynewscenter.com/flu-activity-extremely-low-this-season-due-to-covid-19-measures/", "keywords": ["health", "coronavirus", "covid-19", "flu", "flu vaccine"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-06T08:35:46-08:00", "articleType": "article", "articleContent": "\nA total of 18 influenza cases have been reported in the county this season compared to 400 at the same time last year.\nCounty health officials believe this is the result of the preventive measures San Diegans are taking to fight the spread of COVID-19.\n“When the stay-at-home order was issued last season, flu cases dropped dramatically. We’re seeing the same trend this season, and we hope it continues,” said Wilma Wooten, M.D., M.P.H., County public health officer. “It’s clear that wearing a face covering, maintaining social distance, avoiding large crowds and taking other preventative measures are also helping to slow the spread of influenza.”\nAlso, no influenza deaths have been reported this season, which began July 1 and will through June 30, 2021. In comparison, three flu-related deaths had been reported at the same time last year. A total of 108 San Diegans died from influenza last season.\nA greater number of San Diegans also are getting vaccinated this season compared to the same point last year. To date, nearly 818,660 people have gotten flu shots compared to 746,095 at the same time last year. A total of 1,234,474 people got a flu shot last season, the highest on record.\n“San Diegans are stepping up to get vaccinated against influenza and that is also a good thing,” Wooten said. “A flu shot helps to lower the risk of San Diegans getting influenza and the novel coronavirus at the same time and prevent the local health care system from being overwhelmed.”\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nWhere to Get a Flu Shot\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nThe influenza vaccine is now available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, sandiegocounty.gov/iz or call 2-1-1.\n“The influenza vaccine is safe and effective,” Wooten said. “Get vaccinated now so that you can get protected when influenza begins to spread.”\nTips to Prevent the Flu and COVID-19\nThe novel coronavirus and influenza are both spread from person to person, especially indoors and in crowded places.\nHere are some tips to help you prevent COVID-19 and the flu:\n\nWash your hands properly and regularly or use a hand sanitizer.\nCover your cough or sneeze with a tissue, throw it away and wash your hands.\nIf you’re sick, stay home and isolate yourself from others.\nUse a face covering when in public and close to others. They prevent spreading germs and viruses.\nMaintain physical distance from others.\nAvoid crowded places to decrease your risk of exposure.\n\nFor more information about influenza sandiegocounty.gov/iz. For more info on COVID-19, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201105.09.51.48"}