{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Check Your Mood Day Goes Virtual", "description": "Getting screened for behavioral health conditions is just as important as getting your blood pressure checked or seeing your medical provider for an annual physical.", "datePublished": "2021-10-04T11:00:13-07:00", "url": "https://www.countynewscenter.com/check-your-mood-day-goes-virtual/", "keywords": ["health", "check your mood day", "mental health", "self-care"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-10-04T11:00:13-07:00", "articleType": "article", "articleContent": "\nGetting screened for behavioral health conditions is just as important as getting your blood pressure checked or seeing your medical provider for an annual physical. Unfortunately, people experiencing depression, anxiety and other mental health challenges often experience stigma and other barriers to getting care.\nAnnually, the County of San Diego hosts Check Your Mood Day to engage and encourage San Diegans to monitor and assess their mental well-being, as well as raise awareness about behavioral health resources. This year’s event will be held virtually on Oct. 7, in conjunction with National Depression Screening Day.\nThe event will provide a variety of online activities, self-care tips, and resources. Community members across the county are encouraged to take an online self-assessment and participate in a social media campaign, with actionable steps and tips to stay mentally healthy.\n“The uncertainty and changes over the past 18 months due to the COVID-19 pandemic have intensified mental health challenges for many people,” said Luke Bergmann, Ph.D., director of the County’s Behavioral Health Services. “Screenings are the quickest and easiest way to spot the first signs of what could become a serious mental illness, and I encourage every San Diegan to take advantage of Check Your Mood Day.”\nAccording to Mental Health America, nearly one in five American adults suffers from a mental illness. Despite how common depression is, many Americans don’t realize they’re experiencing the condition, or they suffer in silence out of fear of being stigmatized.\nSymptoms of depression vary but include lack of energy, sadness, loss of interest in activities that previously brought joy, and trouble falling asleep or staying asleep. Many signs of clinical depression are overlooked or dismissed as something that will simply pass with time.\nSelf-care Tips \n\nSafely connect with family and friends\nGet outside for walks and hikes\nMeditate\nStay physically active\nEat healthy, nutritious meals\nListen to music and dance\n\nCheck Your Mood Day is part of the County’s Live Well San Diego health initiative. Visit the Check Your Mood Day page for details and more mental health tips and resources.\nIn addition to the virtual Check Your Mood event, the County’s multilingual Access and Crisis Line is available seven days a week, 24 hours a day at (888) 724-7240 to obtain support for all behavioral health needs.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211004.11.00.13"}