{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "“Love Your Heart” Aims to Reduce Risk of Severe COVID-19 Illness", "description": "Today, County leaders, regional officials and community partners had a virtual news conference to encourage people to get a blood pressure screening to make sure they are not suffering from hypertension often referred to as the “silent killer.”", "datePublished": "2021-02-08T14:35:21-08:00", "url": "https://www.countynewscenter.com/love-your-heart-aims-to-reduce-risk-of-severe-covid-19-illness/", "keywords": ["health", "blood pressure screenings", "love your heart", "mexican consulate"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-08T16:12:19-08:00", "articleType": "article", "articleContent": "\nNinety-five percent of all San Diegans who have died from the novel coronavirus had underlying medical conditions and hypertension or high blood pressure was the primary condition.\nThat’s why today, County leaders, regional officials and community partners had a virtual news conference to encourage people to get a blood pressure screening to make sure they are not suffering from hypertension often referred to as the “silent killer.”\n“This small step of knowing your numbers and the commitment to it has the potential to be a life-saving exercise,” said Chair Nathan Fletcher, County Board of Supervisors. “In the last year, we’ve seen that people who contract COVID who have an underlying health condition are most at risk.”\nTen years ago, the County launched the “Love Your Heart” campaign, an annual public health event that offers people an opportunity to get their blood pressure checked at hundreds of locations in San Diego and Mexico.\nThis year, due to the ongoing COVID-19 pandemic, the number of sites offering blood pressure screenings will be limited but the campaign will last an entire week, from Feb. 8 through Feb. 14. While some local businesses will have blood pressure screenings on site, San Diegans are encouraged to only get their blood pressure checked if they are out conducting essential activities.\nAlso, and thanks to The San Diego Foundation, 6,000 low-income families in the region will receive blood pressure cuffs to monitor their blood pressure numbers.\n“We are proud to bring funders together to support the ‘Love Your Heart’ campaign, especially at a moment when health disparities have never been more apparent,” said Mark Stuart, president and chief executive officer of The San Diego Foundation. “This announcement is part of a long-term effort to improve the quality of life for all San Diegans and to chip away at the health inequalities that have existed here in San Diego County for generations.”\nHigh blood pressure is known as the “silent killer” because it may show no symptoms. However, hypertension puts people at an increased risk for heart disease and stroke, two of the top causes of death in the region. Fifty-nine percent of San Diegans have hypertension.\n“It’s important that you know your numbers and to make your heart health a priority,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Being proactive can save your life and help protect you from the worst COVID-19 outcomes if you do become infected, including an extended hospitalization in the intensive care unit.”\nLast year, more than 56,000 people got their blood pressure checked at Love Your Heart sites in the United States and Mexico, which joined the campaign in 2015.\nA woman gets her blood pressure checked at the Mexican Consulate in Little Italy.\nLove Your Heart aligns with Live Well San Diego, the County’s vision for healthy, safe and thriving residents and communities.\nSan Diegans who participate in Love Your Heart are encouraged to submit their results and participate in online educational workshops throughout February. People can submit their results during the entire month of February to learn what they mean and receive a free face mask and hand sanitizer while supplies last.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210208.14.35.21"}