{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Declares Citrus Quarantine Expansion in Valley Center", "description": "The California Department of Food and Agriculture declared a citrus quarantine expansion in Valley Center on March 26, after detecting the fatal citrus tree disease known as Huanglongbing (HLB), or citrus greening, in two citrus trees in residential neighborhoods in the Valley Center area during regular inspections.   ", "datePublished": "2025-04-04T15:27:04-07:00", "url": "https://www.countynewscenter.com/state-declares-citrus-quarantine-expansion-in-valley-center/", "keywords": ["agriculture", "ag weights and measures", "citrus", "hlb", "quarantine"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2025-04-04T15:27:04-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe California Department of Food and Agriculture (CDFA) declared a citrus quarantine expansion in Valley Center on March 26, after detecting the fatal citrus tree disease known as Huanglongbing (HLB), or citrus greening, in two citrus trees in residential neighborhoods in the Valley Center area during regular inspections.   \nThis bacterial disease is a major threat to San Diego County’s $144 million annual citrus crop and can impact residential citrus tree owners. HLB causes misshapen, bitter fruit and eventually kills infected trees. There are over 350 businesses that may be affected by the quarantine expansion, including over 100 growers with approximately 1,700 acres of commercial citrus and three commercial nurseries.\nThis new quarantine expansion adds to the existing HLB quarantines in Fallbrook, Oceanside, Rancho Bernardo and Valley Center. The expanded quarantine will encompass portions of the citrus-growing regions of Pala and Pauma Valley. The maps for this HLB quarantine are available here.   \nThe quarantine protects the region’s food supply, agricultural economy, and environmental sustainability by restricting people and businesses from moving citrus nursery stock, plant parts and fruit outside the quarantine boundaries and off their properties. The only exception is for agricultural businesses that must adhere to specific requirements for treatment, cleaning and packing commercial fruit prior to movement. \nThe disease is not harmful to people or animals but is deadly to citrus and could be devastating to the county’s citrus industry. HLB is spread by tiny insects, the Asian citrus psyllid, if they are carrying the bacterium when they feed on citrus trees. Samples from trees on the property where HLB was confirmed—as well as the surrounding area—are undergoing tests for the disease. \n“Unfortunately, Huanglongbing is fatal to citrus,” said San Diego Agricultural Commissioner Ha Dang, “Our goal is to prevent this disease from spreading. By working together, we can all protect our food supply, local agriculture, and environment from this devastating disease. Partnering with state and federal regulatory partners, we are working closely with residents and agricultural operators and ask for everyone’s cooperation with the ongoing regulatory activities.”  \nCDFA will work with residents in the immediate area to arrange for treatment of citrus trees as a protective measure against the disease. County officials are also proactively notifying local citrus growers, plant nurseries, and other related businesses. If the disease is detected in additional citrus trees in the quarantine area, CDFA officials will contact properties regarding treatment and removal of the infected trees. Nearby trees will be treated, and detection efforts will be increased to prevent the spread of the disease in the area. \nInfected trees may have areas with mottled yellow leaves, generally seen in asymmetrical patterns and bear small, asymmetrical fruit, which is partially green, bitter, and not fit for sale or eating. The disease destroys the appearance and economic value of the trees and eventually causes their death, typically within a few years.  \nInside the quarantine area, the County urges residents to take the following steps: \n\nDo not move citrus plants, leaves or foliage into or out of the quarantine area. \n\n\nRemove all leaves and stems and thoroughly wash backyard citrus before moving from the property where it was grown. \n\n\nDry or double-bag plant clippings prior to disposal. \n\n\nCooperate with agricultural officials who are inspecting trees, taking samples, and treating for the pest. \n\n\nIf residents no longer wish to care for a citrus tree, consider contacting a tree removal service to discuss options to help ensure trees do not continue to be a host to the pest and disease.  \n\n\nOnly buy citrus trees from reputable local nurseries.  \n\n\nReport citrus trees that seem to be sick or dying even though they also appear to be well-watered and well-maintained by contacting CDFA’s toll-free Pest Hotline at (800) 491-1899 or visit www.cdfa.ca.gov/plant/acp. \n\n\nVisit CaliforniaCitrusThreat.org to learn more about the pest and disease and to see pictures.  \n\n\nFor questions regarding moving commercial citrus and HLB quarantine regulations, please contact the San Diego Department of Agriculture, Weights and Measures (AWM) at (858) 614-7770, email cqp.AWM@sdcounty.ca.gov, or visit www.sdcawm.org. \n\n\nCDFA and AWM will be holding public meetings on April 10 and April 11 from 3 p.m. to 5 p.m. at the North Coast Church Pauma Valley located at 32077 Community Church Dr, Pauma Valley, CA 92061. \n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250404.15.27.04"}