{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tips to Stay Safe During Desert Excessive Heat Warning", "description": "With the National Weather Service issuing an excessive heat warning in San Diego County deserts Friday and Saturday, the County is reminding people about County Cool Zones and offering tips to protect yourself from the heat.", "datePublished": "2024-06-14T13:18:32-07:00", "url": "https://www.countynewscenter.com/tips-to-stay-safe-during-desert-excessive-heat-advisory/", "keywords": ["health", "cool zones", "county library", "equity", "excessive heat warning", "heat safety tips", "libraries"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-06-14T13:19:32-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesWith the National Weather Service issuing an excessive heat warning in San Diego County deserts Friday and Saturday, the County is reminding people about County Cool Zones and offering tips to protect yourself from the heat.\nThe weather service said temperatures could reach dangerously hot conditions in county deserts—up to 112 degrees today and 116 degrees tomorrow—from 10 a.m. Friday until 8 p.m. Saturday.\nCounty health officials remind people in affected areas to take extra precautions to avoid heat-related illnesses and to pay extra attention to children, the elderly and pets.\nThe County’s Cool Zones, including the County’s 33 branch libraries, community centers and other locations, offer people safe, air-conditioned sanctuaries from the heat.\nSigns of an overly high body temperature (103 or higher), heatstroke and/or exhaustion can include dizziness, nausea, confusion and headache. If someone shows these signs, call 9-1-1 and begin cooling the individual by moving them to shade, spraying them with cool water and fanning, placing them in a cool shower if they are alert, monitoring their body temperatures, continue cooling efforts and NOT giving them fluids to drink.\nHere are some tips to help people avoid heat-related problems:\n\nStay in an air-conditioned area during the hottest hours of the day. Even a few hours spent in air conditioning can help your body stay cooler. Do not rely on electric fans for cooling if temperatures exceed 90 degrees.\nWear light, loose-fitting clothing.\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty.\nTake cool showers.\nNever leave a child, elderly person, or pet unattended in a car.\nKeeping pets cool in hot weather.\nAvoid unnecessary hard work or activities outside during the hottest part of the day.\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun.\nAvoid using the oven to cook.\n\nPet safety tips:\n\nKeep your pets indoors if the temperature is lower inside.\nExercise pets in early morning hours or early evening to avoid prolonged exposure to the heat. Avoid strenuous runs or hikes.\nKeep your pets’ water supply in a tip-proof container, always topped off, and be sure it stays cool (pets will not drink water that is too hot).\nConsider a misting system to keep the outdoor areas cooler.\nBe sure your pet has shade ALL DAY, if they are outside. Remember, the sun’s position changes during the day.\nDo not take your pets for car trips unless absolutely necessary. A car can heat up very quickly. On an 85-degree day, a car can reach 102 degrees in 10 minutes and soar upward even with the windows down an inch or two.\nDon’t take your dogs for walks on the hot pavement. If it is too hot for you to walk barefooted, then don’t make your dogs do it either.\nConsider adding a child’s wading pool for your dog. Many dogs will keep cool by “taking a dip.”\n\nA complete list and map of County Cool Zone sites, their hours and locations are located online. The site includes a map feature where people can type in their address to find locations near them. People can also call 2-1-1 to find a location, or, if they cannot get to a Cool Zone, ask for help with free transportation. People can also call 2-1-1 to find a location, and—if they cannot get to a Cool Zone site—ask for help with free transportation.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240614.13.18.32"}