{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Get Outside on Green Friday", "description": "Head outdoors this Friday, Nov. 24 for “Green Friday”. County Parks and Recreation is again hosting the annual holiday to encourage more quality time together outside on the day after Thanksgiving.", "datePublished": "2023-11-20T11:29:35-08:00", "url": "https://www.countynewscenter.com/get-outside-on-green-friday/", "keywords": ["parks and rec", "county parks", "free", "green friday", "thanksgiving"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2023-11-20T11:34:15-08:00", "articleType": "article", "articleContent": "\nHead outdoors this Friday, Nov. 24 for “Green Friday”. County Parks and Recreation is again hosting the annual holiday to encourage more quality time together outside on the day after Thanksgiving.\nParking fees will be waived that day so visitors can picnic, play and explore 380 miles of trails at dozens of County parks without worrying about fees!\nSo go green. Plan your own adventure or attend one of several events planned throughout the holiday weekend. Events are active, educational and open to residents and visitors of all ages, interests and abilities.\nFitness and Educational Events\nMountain Biking with a Ranger\nNoon – 2 p.m., Friday, Nov. 24\nMorrison Pond County Preserve, 5102 Sweetwater Road, Bonita, CA 91902 | 619-472-7572\nJoin a ranger-led mountain bike ride along the river, through the picturesque Sweetwater Valley. BYOB (bike) for this wheeled adventure, which will include safety information and fun facts about the land and local wildlife.\nStar Party \n6 – 8 p.m., Friday, Nov. 24\nSycamore Canyon (Highway 67 Staging Area), 13898 CA-67, Lakeside, CA 92040 | 858-513-4737\nJoin park rangers and the San Diego Astronomy Association for an evening of stargazing and out-of-this-world educational fun. Peer through giant telescopes to learn about the planets and stars above. Warm clothing and flashlights are encouraged. If you plan to stay for 2 hours, pack chairs and blankets. Inclement weather will cancel.\nJunior Rangers: Trees and Leaves\n2 – 3 p.m., Saturday, Nov. 25\nPotrero County Park 24800 Potrero Park Drive, Potrero, CA 91963 | 619-478-5212\nLearn about the seeds, leaves and the many parts of trees! Make a craft or a gift for our feathered friends while discovering the creatures that make their homes in and around roots, trunks and branches. This hands-on, all supplies provided workshop is designed for youth ages 5 to 12.\nKumeyaay Nature Hike\n4 – 5 p.m., Saturday, Nov. 25\nPotrero County Park 24800 Potrero Park Drive, Potrero, CA 91963 | 619-478-5212\nDuring this short hike along the Nature Trail, a ranger will discuss the Kumeyaay People who lived on this land many years ago, and the many native plants and animals that inhabit the park.\nVolunteer Opportunities\nGet your hands dirty while having fun and exercising your green thumb Thanksgiving weekend. There are more than a dozen opportunities to volunteer to plant trees in local parks.\nPlease note that days and times are subject to change. Inclement weather will cancel.\nFriday, Nov. 24\n\nPlanting at Heritage County Park \nTree Planting at Barnett Ranch County Preserve\nTree Planting at Dos Picos County Park\nTree Planting at Louis A. Stelzer County Park\nTree Planting at San Dieguito County Park\nTree Planting at San Elijo Lagoon Ecological Reserve\nTree Planting at Sweetwater Summit Regional Park\n\nSaturday, Nov. 25\n\nTree Planting at Eucalyptus County Park\nTree Planting at Goodan Ranch Visitor Center\nTree Planting at Louis A. Stelzer County Park\nTree Planting at Live Oak County Park\nTree Planting at Rancho Guajome Adobe\nClimate Action Day at Otay Valley Regional Park\n\nSunday, Nov. 26\n\nTree Planting at Louis A. Stelzer County Park\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231120.11.29.35"}