{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County Breaks Ground on New Southeastern Live Well Center", "description": "The County of San Diego broke ground Friday on the new Southeastern Live Well Center.", "datePublished": "2021-10-01T16:20:37-07:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-new-southeastern-live-well-center/", "keywords": [], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-10-01T16:20:37-07:00", "articleType": "video.other", "articleContent": "\nThe County of San Diego broke ground Friday on the new Southeastern Live Well Center. Located at the intersection of Market Street and Euclid Avenue, the 65,000-square-foot facility will serve as a one-stop shop for health and social services for residents.\nScheduled to be completed in the summer of 2023, the Southeastern Live Well Center will provide a full array of County and community services, including medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services.\nThe facility will also feature a 4,000-square-foot conference center, which includes a large main conference room and separate smaller meeting spaces. They will be available to the community for meetings and events.\nThe project will offer a wellness and meditation garden that connects to Chollas Creek Trail. Both will be open to the community seven days a week.\n“We’re here today to celebrate a step forward, an investment into our community,” said Chair Nathan Fletcher, County Board of Supervisors. “This project will stand the test of time and as we go into the future and we make this critical investment into our community, we will see the benefits of this project for decades and decades and decades to come.”\nThe County selected PCL Construction + Steinberg Hart for the project. They have hired two local subcontractors from the area to assist in building a facility that meets the needs of the community.\n“This center has been fashioned under a new and intensive community-focused model that’s really going to serve as a blueprint for all County projects that will follow,” said HHSA Director Nick Macchione.\nFriday’s event also served as a commemoration for the Tubman Chavez Community Center, which served as a community hub until it closed its doors ahead of the construction of the Southeastern Live Well Center.\n﻿﻿﻿\nThe mural featured on the rear wall of the Tubman Chavez Community Center will be memorialized inside the new Live Well Center. The Tubman Chavez Community Center was built in 1979 and most recently served as a site for COVID-19 testing and vaccinations.\n“I am honored to have worked so closely with so many dedicated residents of Southeastern San Diego to bring this project together,” said Barbara Jiménez, Community Operations Officer for the County Health and Human Services Agency. “I am convinced that the Southeastern Live Well Center will be the finest built to date in our County and grow every month and year into a welcoming and helpful neighbor for the entire community.”\nThe Southeastern Live Well Center will be the sixth regional community service hub. It will join existing Live Well Centers in National City, Chula Vista, Escondido, Lemon Grove and Oceanside.\nLearn more and get progress updates on the Southeastern Live Well Center website.\nWatch the full press conference.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211001.16.20.37"}