{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches Recycle Right Campaign", "description": "Of course, you recycle! You care; you want to protect the environment. But are you recycling right? You might not be. If you’re putting the wrong items into your curbside blue bin, or even the right item in the wrong way,  you could be trashing your good intentions. And other people’s too.", "datePublished": "2020-08-21T09:30:04-07:00", "url": "https://www.countynewscenter.com/county-launches-recycle-right-campaign/", "keywords": ["environment", "recycling", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-08-22T08:58:22-07:00", "articleType": "article", "articleContent": "\nOf course, you recycle! You care; you want to protect the environment. But here’s a question — are you recycling right?\nYou might not be. If you’re putting the wrong items into your curbside blue bin — or even the right item in the wrong way —  you could be trashing your good intentions. And other people’s too.\nTo help, San Diego County’s Solid Waste Planning and Recycling division has launched a “Recycle Right” newspaper-radio-social media campaign.\nIt features two easy-to-use messages. First, go Back to the Basics — know what  can be recycled in that blue recycling bin your waste hauler picks up at your curb.\nSecond, remember this simple phrase: “Empty, Dry, Loose.”\nHere’s what can be recycled in that blue bin: paper, cardboard and cartons (boxes should be broken down), glass bottles and jars, plastic bottles and containers, and metal/aluminum containers and foil.\nWhat can’t be recycled in your blue bin? Food, liquids, plastic bags, ropes, clothing, batteries and other items. Some of those things may be recycled in other ways, like returning plastic bags to stores, using compost bins and electronic waste recyclers.\nPutting plastic bags, clothing and cords into your blue bin can actually create a hazard to workers or machinery at recycling centers. Putting food and liquids in can contaminate the things you’re trying to recycle, and anyone else’s items they’re mixed with. That would ruin your good intentions, and others, by forcing the contaminated items to be tossed into the trash where they end up needlessly filling landfills.\nHere’s where the County “Recycle Right” campaign’s second message, “Empty, Dry, Loose,” comes in handy.\nFor example, let’s say you have a completely empty, dry, glass peanut butter jar. Put that in that blue bin! But if that jar is only “almost” empty, please, keep it out. It could contaminate all your items. Better yet, clean it out first (a spatula works great!) and put it in.\nSo, make sure cans, jars, milk cartons and other recyclable containers are empty and dry.\nAnd put those items into your blue bin loose, NOT in plastic bags that can foul up recycling machinery. While trash collectors want your trash contained in bags — that doesn’t work for recyclables.\nThat’s it! Recycling is still simple with the right tips.\nFor more information about recycling, go to the Solid Waste Planning and Recycling division’s Rethink Waste webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200821.09.30.04"}