{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Henry Winkler Shares Insights at Vital Ayyy-ging Conference", "description": "Best-selling author and Emmy Award-winning actor, director, and producer Henry Winkler delivered the keynote address at the County’s “Vital Aging 2021: Resilient and Ready!” conference Thursday.", "datePublished": "2021-06-25T10:28:56-07:00", "url": "https://www.countynewscenter.com/henry-winkler-shares-insights-at-vital-ayyy-ging-conference/", "keywords": ["health", "henry winkler", "older adults", "vital aging"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-06-25T10:28:56-07:00", "articleType": "article", "articleContent": "\nBest-selling author and Emmy Award-winning actor, director, and producer Henry Winkler delivered the keynote address at the County’s “Vital Aging 2021: Resilient and Ready!” conference Thursday. Winkler is best known for his role as Arthur Fonzarelli, aka “The Fonz,” on the TV show Happy Days.\nWinkler shared his thoughts and experiences about resiliency during difficult times, serving the community and enjoying the aging process.\n“You’ve got a choice, your glass is either half full or half empty and it is how you look at it, not how anybody else looks at it,” Winkler said.\nThe Vital Aging conference made its return virtually after a one-year hiatus due to COVID-19. Winkler and the other speakers addressed a variety of subjects, aiming to inspire attendees to re-energize their lives so they can thrive again after spending much of the last year at home.\nAmong his tips for living longer and healthier lives, Winkler recommended to stay connected and to “not allow your brain to go idle.” He also encouraged people to focus on what they can do, instead of what they are unable to do.\n“Don’t take the fact that something is not working and say everything is not working,” Winkler said. “You take something that is not working, you acknowledge it, and you take all the things that are working, and you keep them working. You are in control!”\nIf you missed the livestream of the event, it is not too late to watch some of the highlights. Register at www.vitalagingsandiego.com to receive a notification once the recordings of Thursday’s sessions are available.\nThe free virtual event was hosted by the County of San Diego Health and Human Services Agency Aging & Independence Services in collaboration with San Diego Oasis.\nAIS provides services to older adults, people with disabilities and their family members to help them live safe, healthy and vital lives. For more information on services and ways you can get involved, visit the AIS website or call 1-800-339-4661.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210625.10.28.56"}