{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Animal Services Helps Wrangle Up Piglets and Swine", "description": "Nine little piggies, their mom and a pot-bellied pig were found wandering through a residential neighborhood in Chula Vista. All 11 piggies are now safe at their temporary home at the San Diego County Animal Shelter in Bonita.", "datePublished": "2024-07-02T16:34:27-07:00", "url": "https://www.countynewscenter.com/county-animal-services-helps-wrangle-up-piglets-and-swine/", "keywords": ["animals", "government", "animal rescue", "das", "pigs"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-07-02T16:34:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesNine little piggies, their mom and a pot-bellied pig were found wandering through a residential neighborhood in Chula Vista. All 11 piggies are now safe at their temporary home at the San Diego County Animal Shelter in Bonita.\nOvernight Sunday, someone called Chula Vista Animal Services to report a small team of pigs wandering through a residential neighborhood off Woods Drive. After confirming the situation, the responding officer reached out for assistance from County Animal Services just before 5 a.m. Monday.\nCounty Animal Services Lt. Talia Padilla said she gathered up equipment and food to lure the pigs so they could catch them, along with an animal transport trailer. The lieutenant said the neighborhood is off a busy street and animal service officers were concerned that the pigs could run in that direction.\n“Mama hog, her babies and a random pot-bellied pig were all in a gated driveway area that led up to two properties,” Padilla said.\nThey reached out to the property owners where the pigs were found, but none of them owned any pigs. Pigs can be escape artists, Padilla said, but in this case it doesn’t seem they simply busted out of a pen.\nLuckily, the sow and eight of her nine piglets were easily lured into the trailer. One of her piglets and the pot-bellied pig were more skittish and faster runners, but Padilla, Chula Vista officer Manuel Mariscal and two other County animal services officers eventually lured the piglet to her family. The other pig was caught soon after. In total, it took about three hours to get them all rounded up.\n“They were very food-motivated,” Padilla said. “The mom hog liked her ears scratched and she was fairly affectionate.”\nSince they were found in Chula Vista, they are still the agency to handle lost calls about the pigs. Chula Vista’s policy is that they are kept for four business days for an owner to come claim them, and if not claimed by then, Chula Vista will determine placement or adoption options for the pigs, Padilla said.\nTo report a lost pet in Chula Vista, please visit the City of Chula Vista’s Animal Services page. To reach out about the pigs, please call (619) 691-5123.\nThe Department of Animal Services promotes the humane and responsible care of pets by providing the unincorporated areas of San Diego County with 24-hour animal rescues. County Animal Services also works with local jurisdictions to assist with animal rescues.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240702.16.34.27"}