{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Safari Park Visitor Potentially Exposed to Rabies", "description": "Sept. 8 Update: The park guest seen near the bat has been identified. Any other visitors who may have come in direct contact with a bat at the location and time described below should contact County Health and Human Services.", "datePublished": "2020-09-07T13:14:18-07:00", "url": "https://www.countynewscenter.com/safari-park-visitor-potentially-exposed-to-rabies/", "keywords": ["health", "rabid bat", "rabies"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2020-09-08T16:47:06-07:00", "articleType": "article", "articleContent": "\nSept. 8 Update: The park guest seen near the bat has been identified. Any other visitors who may have come in direct contact with a bat at the location and time described below should contact County Health and Human Services. \n \nThe County of San Diego Health and Human Services Agency (HHSA) is asking for the public’s help in identifying one person, and possibly others, who may have been exposed to rabies while visiting San Diego Zoo Safari Park in San Pasqual on Sunday, Sept. 6.\nA bat was witnessed flying around an unidentified female guest at 11:30 a.m. on Sunday, Sept. 6, at the Mombasa Cooker at Nairobi Village. It was later collected by a trained park employee and submitted to the County for rabies testing, and the County Public Health Laboratory confirmed the bat was infected with rabies. The bat was not one of the park’s collection animals.\nThe woman and another person who may also have had direct contact with the bat left before providing contact information. Anyone who knows the identity of these park visitors, or anyone who was at the park and believes they were potentially exposed to the bat, is urged to contact the County of San Diego Health and Human Services Agency as soon as possible at (619) 692-8499.\n“We are concerned about the health of this woman and any park patrons who were in direct contact with the bat,” said Eric McDonald, M.D., M.P.H., medical director of the County Epidemiology and Immunization Services branch. “We want to make sure they were not potentially exposed to this deadly disease.”\nHealth officials would like to interview anyone who may have come in contact with the bat as soon as possible to determine if they were potentially exposed to rabies. Park visitors who had no physical contact with the bat are not at risk for rabies.\nThere have been five rabid bats detected by the County in 2020, and the public is reminded to never handle any bat due to the possible risk of rabies.  Rabies is a preventable viral disease that is most often transmitted through the bite of a rabid animal. Although rare, transmission may also occur if the saliva from a rabid animal comes in contact with a person’s eyes, nose, mouth or open wound.\nSymptoms of rabies in people can take weeks to months to develop after exposure to a rabid animal has occurred. Once symptoms develop, rabies is almost always fatal. However, prompt post-exposure treatment following exposure to the virus will prevent the disease.\nFor more information about rabies and bats, please visit the Centers for Disease Control and Prevention (CDC) website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200907.13.14.18"}