{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board Approves Small Business Stimulus Program", "description": "Local small businesses and restaurants suffering financial losses due to COVID-19 can now apply for a grant from the County of San Diego.    ", "datePublished": "2020-07-07T17:51:18-07:00", "url": "https://www.countynewscenter.com/county-board-approves-small-business-stimulus-program/", "keywords": ["health", "behavioral health", "board meeting", "coronavirus", "covid-19", "small business", "small business stimulus program"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-07-08T09:22:48-07:00", "articleType": "article", "articleContent": "\nLocal small businesses and restaurants suffering financial losses due to COVID-19 can now apply for a grant from the County of San Diego.\nThe Board of Supervisors approved a new Small Business Stimulus Program Tuesday during a Board meeting that also included a report on the behavioral health aspects of COVID-19.\nSmall Business Stimulus Program\nFor-profit and nonprofit businesses can apply for grant money if they can show losses and costs are a direct result of the pandemic.\nTo qualify businesses must have:\n\n100 or fewer employees\nHeadquarters in San Diego County\nA minimum 1-year operating history as of Feb. 14, 2020\nDocumentation of financial hardship because of COVID-19\n\nBoard supervisors had approved using $17 million in CARES Act Coronavirus Relief Fund funds last May to help restaurants and small businesses. Tuesday, the supervisors approved the implementation of the program.\nBusinesses are urged to apply early. Applications are available now through Oct. 16 – subject to available funding.\nFor more information and the application, visit the stimulus website.\nCOVID-19 Behavioral Health  \nBehavioral health experts across the country are monitoring the effects of the COVID-19 health crisis and accompanying economic slowdown, especially the rates of suicide and drug overdose deaths.\nNationwide, surveys show a 200% increase in psychological distress compared to a comparable period last year due to COVID-19.\nLocally, the County of San Diego is reviewing statistics on the psychological impacts of COVID-19.\n“The data, rigorously collected and reviewed by our County Medical Examiner, are clear: suicide rates are static, and if anything, are trending downward,” said Luke Bergmann, Behavioral Health Services Director. “This doesn’t mean that we won’t see that trendline change. Suicide rates almost always increase with bad economic times; we will have to remain vigilant about suicide risk.”\nData shows the trend in accidental drug overdose deaths is going up. Bergmann says there was a 40% reduction in the use of the substance use disorder treatment system.\nCOVID-19 Update\nPublic Health Officer Wilma Wooten updated the Board on the COVID-19 situation in the County. Due to the region’s high number of COVID-19 cases, the County is now on the State’s Watch List for at least three weeks. As of midnight last night, San Diego County was required to close indoor activities at:\n\nRestaurants and bars\nWineries and tasting rooms\nZoos and museums\nMovie theaters\nFamily entertainment centers\nCard rooms\n\nCounty costs for the COVID-19 outbreak were $130 million for the fiscal year that ended June 30. The County is now eligible for $53.7 million in additional federal CARES Act money through the state.\nThe Board asked staff to prepare proposals on how the money could be spent on COVID-related issues such as childcare, testing for schools, food services and testing at the border. The report is expected to be reviewed at the Aug. 4 meeting.\nCommunity Setting Outbreaks:\n\nFive new outbreaks were reported July 6. Two were at restaurant/bars and there was one each at a restaurant, a business and a grocery store.\nIn the past seven days, 22 community setting outbreaks were identified.\nThe number of new community setting outbreaks is above the trigger of seven in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n5,530 tests were reported to the County July 6 and 10% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 5.9%.\nThe 7-day daily average of tests is 7,465.\n\n Cases:\n\n578 new cases were reported July 6 in San Diego County for a total of 17,578.\n1,923 or 10.9% of cases have required hospitalization.\n517 or 2.9% of all cases and 26.9% of hospitalized cases had to be admitted to an intensive care unit.\n\n Deaths:\n\n12 COVID-19 deaths were reported bringing the region’s total to 399.\nFive women and seven men died. Their ages ranged from late 40s to early 90s.\nAll but one had underlying medical conditions.\n\nMore Information:\nMore detailed data summaries can be found on the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200707.17.51.18"}