{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Leaving San Diego Riverbed for a New Home", "description": "A $17 million grant to the county from the state’s Encampment Resolution Fund to resolve encampments in the riverbed is creating results. Expanded outreach is helping people experiencing homelessness find safe and stable housing and connect to supportive services while the riverbed area is being cleaned up.", "datePublished": "2024-10-11T12:14:18-07:00", "url": "https://www.countynewscenter.com/from-the-san-diego-riverbed-to-a-new-home/", "keywords": ["health", "encampments", "homeless", "outreach", "permanent housing", "riverbed", "temporary housing"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-10-11T13:59:22-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSome of San Diego’s largest riverbed encampments are showing signs of progress and hope. A County partnership with the City of San Diego, City of Santee and California Department of Transportation is prioritizing homeless outreach and immediate shelter for people living in the riverbed area.\nThe County received a $17 million grant from the state’s Encampment Resolution Fund last fall to resolve encampments in the riverbed by helping people experiencing homelessness find safe and stable housing, connect to supportive services and to clean up the area.\nWith the new funding, the County’s Department of Homeless Solutions & Equitable Communities began expanding outreach efforts to an estimated 300 people experiencing homelessness living along the riverbed.\nSince January, 91 people have transitioned from the San Diego Riverbed to emergency housing and in July, moves to permanent housing began. 10 people have left emergency housing for permanent housing in the past three months.\nThe compassionate work in the riverbed is changing lives and providing safer, cleaner and healthier living conditions for people who are unhoused.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241011.12.14.18"}