{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Norovirus Cases Linked to Frozen Korean Oysters", "description": "County health officials have linked 11 confirmed and probable cases of norovirus illness to frozen oysters imported from South Korea. ", "datePublished": "2024-04-16T16:36:52-07:00", "url": "https://www.countynewscenter.com/norovirus-cases-linked-to-frozen-korean-oysters/", "keywords": ["health", "norovirus", "oysters", "public health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-04-17T06:51:00-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty health officials have linked 11 confirmed and probable cases of norovirus illness to frozen oysters imported from South Korea. \nCustomers who ate the oysters at 100s Seafood Grill Buffet in Mission Valley on March 3oth became sick, a couple days later one person went to the emergency department.  \nThe U.S. Food & Drug Administration (FDA) is now linking the San Diego illnesses to quick-frozen oysters.  \nThe FDA is cautioning all restaurants and stores that sell frozen, raw half-shell oysters to check their freezers and verify the origin of their oysters.  To identify their origin, look for shellfish tag or label information. Oysters processed by JBR (KR 15 SP) in Tongyeongsi, Republic of Korea on 11/27/2023, 1/4/2024 and 2/15/2024 with lot numbers B231126, B240103 and B240214 should not be consumed. The County of San Diego is working with the California Department of Public Health to identify other potential retailers in our region. \nThese items may be labeled “Amazing Sea Brand.” \n“If you have consumed these oysters and feel ill, it is important to see your doctor for evaluation,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “If you or someone you live with is sick with norovirus, it is important to wash your hands often and clean common areas to prevent spreading the infection.” \nThis comes four months after County of San Diego health officials linked 41 confirmed and probable cases of norovirus to raw oysters imported from a specific harvest location in Northwest Mexico. \nPeople infected with norovirus generally develop nausea, vomiting, diarrhea, stomach cramps, fever and body aches approximately 12 to 48 hours after consuming contaminated foods. The illness typically lasts for one to three days. The vomiting and diarrhea can lead to dehydration requiring medical attention, especially in young children, older adults and people with other illnesses.   \nThe County’s Epidemiology Program and Department of Environmental Health and Quality are working closely with California Department of Public Health, including the Shellfish Program, to continue investigating illnesses associated with oysters.   \nTo report illness to the County after dining out or purchasing from wholesale food locations call (858) 505-6814, or email fhdepi@sdcounty.ca.gov.\nMore information on seafood and shellfish safety is available here, for general information on norovirus click here, and information on how to prevent the spread of norovirus at home click here. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240416.16.36.52"}