{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Asks Residents, Schools, Businesses to Prepare for COVID-19", "description": "County health officials have been busy urging residents, local municipalities, schools, businesses and community and religious organizations to prepare for a potential outbreak of the novel coronavirus, which causes COVID-19.", "datePublished": "2020-03-05T14:23:04-08:00", "url": "https://www.countynewscenter.com/county-asks-residents-schools-businesses-to-prepare-for-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "novel coronavirus"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-09T16:30:02-07:00", "articleType": "article", "articleContent": "\nBe informed. Be prepared.\nThat’s what County and local health officials, business and school leaders want area residents to do should the novel coronavirus be detected in the region.\n“It’s important for everyone to educate themselves and their family and be prepared in case the new coronavirus makes its way to San Diego County,” said Chairman Greg Cox, County Board of Supervisors. “It’s also important for people not to panic as the risk for this new virus and the disease that it causes continues to be low.”\nCounty health officials have been busy urging residents, local municipalities, schools, businesses and community and religious organizations to prepare for a potential outbreak of the novel coronavirus, which causes the disease COVID-19.\nWorking with the Centers for Disease Control and Prevention, the California Department of Public Health, and the local medical community, the County Health and Human Services Agency has a plan in place to identify, isolate, inform and investigate a possible case of this respiratory illness.\n“We are prepared and conducting enhanced surveillance for this new virus, just as we do for other communicable diseases,” said Wilma Wooten, M.D., M.P.H., County public health officer, at a news conference with local elected officials, school and business leaders. “We’re in communication with all the appropriate entities and have a response plan to deal with any potential case or outbreak.”\nHowever, County and local leaders are urging their respective organizations to be prepared if the new coronavirus appears locally. Below is a list of things to do based on current CDC recommendations.\nWhat Residents Can Expect If They Come Down With COVID-19\nPatients with confirmed COVID-19 infection have reported symptoms ranging from mild to severe respiratory illness. Symptoms generally include:\n\nfever\ncough\nshortness of breath/difficulty breathing\n\nAt this time, the CDC believes that symptoms of COVID-19 may appear in as few as two days or as long as 14 days after exposure.\nWhat Residents Can Do to Prepare for COVID-19\nIt’s important for the public to be prepared should a COVID-19 outbreak occur in San Diego County. To limit the spread of infection, you should:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\n\nAlso, it is essential to plan now for community transmission of COVID-19 in our region. CDC has published “Interim Guidance: Get Your Household Ready for Coronavirus Disease.” Please note these following important tips to help residents prepare to respond to this public health threat.\n\nStore a two-week supply of food, beverages and water, including food for family pets. Ensure an adequate supply of prescribed and routine medications are on hand.\nPlan ways to care for those who are at greater risk for serious complications and who will take care of sick family members.\nIf you have family members with increased risk of getting seriously sick, check with your medical providers about symptoms and treatment.\nCreate an emergency contact list of family and friends, teachers and employers.\nHave a plan in case your school, child care, or employer closes temporarily.\nTalk with your children, family, and friends about what to do if an outbreak occurs and what each person would need.\n\nPlanning now helps you act more effectively to protect you and your family if COVID-19 does occur locally.\nHow Schools Can Prepare for Novel Coronavirus \nChild care settings and schools can take steps to help stop or slow the spread of COVID-19:\n\nReview, update and implement emergency operations plans in collaboration with the local health department and other relevant partners.\nMake sure the plan includes strategies to reduce the spread of a wide variety of infectious diseases.\nMonitor student and staff absences and alert local health officials of a spike of absences due to respiratory illnesses.\nEnsure they know what to do, such as staying home when sick and appropriately covering coughs and sneezes.\nFrequently clean surfaces such as doorknobs and desktops.\n\nHow Businesses Can Protect Their Employees from COVID-19\nThe CDC has issued the following interim guidance that may help prevent workplace exposures to COVID-19 should there be widespread exposures and community outbreaks:\n\nEncourage sick employees to stay home if they have symptoms of acute respiratory illness.\nMake sure your sick leave policies are flexible and consistent with public health guidance and that employees are aware of them.\nHave a plan in place should a large number of employees get sick or need to work from home.\nSick leave policies should be flexible and permit employees to stay home if they need to care for a sick family member.\nIf an employee shows up to work sick or becomes sick during work hours, separate them and send them home.\nEncourage sneezing and coughing etiquette and hand hygiene by all employees.\nPerform routine cleaning of all frequently touched surfaces in the workplace, such as workstations, countertops and doorknobs.\n\nHealth officials emphasized that all county residents have a role to play in preventing the spread of COVID-19 in the region. If you have questions about COVID-19, call 2-1-1 to speak with a specially trained operator or visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200305.14.23.04"}