{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Extends Emergency Temporary Lodging Program for Flood Victims", "description": "The San Diego County Board of Supervisors voted Tuesday to extend the Emergency Temporary Lodging Program. ", "datePublished": "2024-03-14T17:07:31-07:00", "url": "https://www.countynewscenter.com/county-extends-emergency-temporary-lodging-program-for-flood-victims/", "keywords": ["government", "disaster recovery", "emergency temporary lodging program", "fema", "jan. 22 severe storm"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-03-15T09:26:06-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe San Diego County Board of Supervisors voted Tuesday to extend the Emergency Temporary Lodging Program. \nThe program, which was launched on Feb. 10, has provided safe and secure lodging for more than 840 families who were displaced by flooding from the Jan. 22 storm.  \nFollowing Tuesday’s vote, eligible residents in the County program will have their individual situation evaluated by a team of case workers. Following that process, residents in the Emergency Temporary Lodging Program may have their lodging extended up to May 11. The County and partner agencies will work closely with individuals and families to help bridge their transition into longer term benefits. \nSome residents will be eligible for longer-term Federal Emergency Management Agency (FEMA) Rental Assistance. The FEMA Rental Assistance Program may provide residents with direct financial assistance to pay for rent for up to 18 months, depending on eligibility. Residents that receive funds through the Rental Assistance Program should only spend those funds on rent, deposits for rent and/or to pay for utilities for newly rented properties under the program. Any other use of Rental Assistance funds may make the resident ineligible for future FEMA rental assistance. \nFEMA and the U.S. Small Business Administration (SBA) were dispatched to San Diego County on Feb. 19 to provide financial assistance to families impacted by the flood. This has included helping with rent, costs to repair homes and businesses, and other needs.  \nFEMA has opened two Disaster Recovery Centers to help residents impacted by the storm apply for federal assistance in person. The centers also offer information from the SBA, state agencies and the County of San Diego.  \nThe SBA has also opened a Business Recovery Center in National City to help people apply for low-interest loans and access other services. \nVisit AlertSanDiego.org/recovery for more information on available resources to residents and businesses impacted by the Jan. 22 storm and flooding.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240314.17.07.31"}