{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More San Diego County Businesses Can Reopen", "description": "With the easing of more restrictions in the statewide stay-at-home order, retail and related manufacturing businesses in San Diego County can begin opening tomorrow, but only for delivery or curbside pickup.", "datePublished": "2020-05-07T17:33:04-07:00", "url": "https://www.countynewscenter.com/more-san-diego-county-businesses-can-reopen/", "keywords": ["health", "businesses opening", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-07T17:37:55-07:00", "articleType": "article", "articleContent": "\nWith the easing of more restrictions in the statewide stay-at-home order, retail and related manufacturing businesses in San Diego County can begin opening tomorrow, but only for delivery or curbside pickup.\nRetail and manufacturing businesses are being allowed to reopen because they represent a lower risk of spreading COVID-19. They include shops that sell books, shoes, clothing, music, jewelry and sporting goods among others.\nWhen businesses open their doors, they must do it safely. They are not allowed to have customers inside and must prepare and post a Safe Reopening Plan to ensure the safety of employees and the public.\nThe plan also ensures proper sanitation, physical distancing and general business practices. Businesses should also review and refer to the state checklist for their specific industry, such as the Retailer guidance and checklist, when completing the County plan.\n“Businesses should make sure that the social distancing and face covering guidelines are being followed,” said Wilma Wooten, M.D., M.P.H., County public health officer. “These guidelines remain in place to protect San Diegans from getting and spreading the virus.”\nBusiness owners needing clarification of the reopening guidelines can email questions to: COVID19BusinessQuestions@sdcounty.ca.gov.\nThe state announced new guidelines that would allow some counties to reopen at a faster rate. However, no large jurisdictions in California is expected to meet the new metrics, which include no COVID-19 deaths over a 14-day period. As a result, San Diego County’s reopening is expected to stay consistent with state guidance.\nCOVID-19 Testing in San Diego\nThe County’s Live Well Mobile Office will be offering COVID-19 testing in Southeastern San Diego on Saturday from 9 a.m. to 3 p.m. at the Euclid Health Center, 292 Euclid Ave. An appointment through 2-1-1 is necessary, and slots will be filled on a first-come, first-served basis.\nCOVID-19 testing remains available at local hospitals, medical groups, some community clinics and private labs.\nThe state also has three testing sites – in Escondido, El Cajon and Chula Vista – that are offering free testing by appointment Monday through Friday. You can schedule an appointment online or by calling (888) 634-1123.\nPlanning also is underway to deploy the County Library’s bookmobiles and other County vehicles for testing throughout the region.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,325 tests were reported to the County May 6 and 110 or 3% were positive.\n5.9% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n110 new cases were reported for a San Diego County total of 4,429.\n904 or 20.4% of cases have required hospitalization.\n287 or 6.5% of all cases had to be placed in intensive care.\n\nDeaths:\n\nSeven more COVID-19 deaths have been reported, bringing the region’s total to 165.\nThe new deaths were five men and two women between the ages of 52 and 89. Six of the seven had underlying medical conditions.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n61 active outbreaks; 39 at congregate living facilities and 22 in community settings (Three new outbreaks)\n1,035 cases, including 85 deaths in congregate living facilities\n186 cases, including five deaths in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200507.17.33.04"}