{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Takes to the Sky, Again, to Fight Mosquitoes", "description": "San Diego County’s Vector Control Program is scheduled to conduct a routine mosquito-fighting, aerial larvicide drop on June 26 and 27 on around 50 rivers, streams, ponds, and other waterways in the county to kill mosquito larvae.", "datePublished": "2024-06-17T10:32:53-07:00", "url": "https://www.countynewscenter.com/county-takes-to-the-sky-again-to-fight-mosquitoes/", "keywords": ["environment", "environment", "health", "lueg", "mosquitoes", "sustainability", "vector control"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-06-17T11:35:51-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County’s Vector Control Program is scheduled to conduct a routine mosquito-fighting, aerial larvicide drop on June 26 and 27 on around 50 rivers, streams, ponds, and other waterways in the county to kill mosquito larvae.\nThis includes applying a mosquito-reducing larvicide by helicopter in the Tijuana River Valley. This is the second larvicide drop by helicopter in this area this month as a precaution because some standing water was found that can support mosquito breeding.\nDue to the unusual standing water here following the winter storms, Vector Control crews have also been hard at work doing mosquito surveillance and larvicide treatments by ground in the area.\nApplying the larvicide by helicopter treats hard-to-reach areas, in addition to truck or hand applications, to reduce these pests and their risk for spreading diseases, such as West Nile virus.\nThe larvicide is safe and eco-friendly. It does not hurt people or pets but kills mosquito larvae before they can grow into adult biting mosquitoes.\nLarvicide drops, during the mosquito season (usually April-October), are just one part of Vector Control’s Integrated Vector Management Strategy. County Vector Control monitors over 1,600 potential mosquito-breeding areas each year and applies larvicide through aerial drops, boats, trucks, and hand-crews.\nIt also gives out free mosquito-eating fish to the public, tracks down and treats neglected swimming pools, tests dead birds for West Nile virus, and monitors mosquito populations countywide for potential mosquito-borne illnesses.\nFortunately, there have been no locally contracted West Nile virus cases in humans reported this year. Last year and early this year, some local mosquitoes and birds tested positive for the virus, but Vector Control efforts helped prevent it from transferring to people.\nWest Nile virus symptoms are typically mild, including headache, fever, nausea, fatigue, skin rash or swollen glands. But in rare cases, West Nile virus can make people extremely ill and even kill them.\n“We’re at the peak of mosquito season right now, so we all need to be proactive and take measures to prevent exposure to mosquitoes,” said John-Ross Glueck, interim director of the County’s Environmental Health Division. “In addition to the County’s diligent vector control efforts, people can make a difference at home or work.”\nFor more information about mosquito-borne illnesses go to San Diego County’s “Fight the Bite” website.\nWant to protect yourself from mosquitoes? Follow our “Prevent, Protect, Report” guidelines.\nPrevent Mosquito Breeding\nDump out or remove any items inside and outside of homes that can hold water, such as plant saucers, rain gutters, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquito fish, available for free at locations throughout the county, may be used to control mosquito breeding in backyard standing water sources, such as unmaintained swimming pools, ponds, fountains, and horse troughs.\nProtect Yourself from Mosquito Bites\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nReport Increased Mosquito Activity and Dead Birds\nReport increased mosquito activity, or stagnant, unmaintained swimming pools, and other mosquito-breeding sources, as well as dead birds — dead crows, ravens, jays, hawks and owls — to the County Department of Environmental Health and Quality’s Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov. \nIf you have checked around your home for standing water and are still experiencing mosquito issues, you can request an educational mosquito inspection by contacting the Vector Control Program at (858) 694-2888 or emailing vector@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240617.10.32.53"}