{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "National Volunteer Month: County CERT Members Remain Active during Pandemic", "description": "The month of April is designated as National Volunteer Month, and while COVID-19 has limited many volunteer programs in the county, the San Diego County Fire Protection District’s Community Emergency Response Team (CERT) program has remained active throughout the pandemic.", "datePublished": "2021-04-12T13:32:14-07:00", "url": "https://www.countynewscenter.com/national-volunteer-month-county-cert-members-remain-active-during-pandemic/", "keywords": ["public safety", "cert", "disaster recovery", "disaster response", "fire district", "volunteer"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-04-12T13:32:14-07:00", "articleType": "article", "articleContent": "\nThe month of April is designated as National Volunteer Month, and while COVID-19 has limited many volunteer programs in the county, the San Diego County Fire Protection District’s Community Emergency Response Team (CERT) program has remained active throughout the pandemic.\nThe CERT program is one of the county’s key community risk reduction initiatives. Volunteers train on a regular basis to be able to assist fellow residents in basic disaster response and recovery efforts.\nMembers of several CERTs from across the county combined forces through a mutual aid plan to support residents over the past year helping to distribute food, provide administrative assistance at COVID-19 testing and vaccination sites, and supporting fire evacuation efforts.\nAccording to Teresa Greenhalgh, the county’s CERT coordinator, while the local CERT mutual aid plan has been in place since 2012, it had not been utilized until the COVID-19 pandemic.\n“Following county guidelines in regard to underlying health conditions and those ages 65 and above, a large portion of each CERT programs’ members could not work these events,” said Greenhalgh. “Without implementing CERT mutual aid, many of the programs would not have been able to deploy their teams due to the few available members who could volunteer.”\nGreenhalgh said COVID response was not the only mission of CERT volunteers last year, who also assisted in a more traditional role supporting the Red Cross at temporary evacuation points for the Valley Fire last September.\n“CERT members are initially shelter trained to support the American Red Cross in San Diego but did have to complete a virtual training on supporting temporary evacuation points,” said Greenhalgh. “This training was completed by local CERT members just days before the Valley Fire started.”\nMembers of the CERT program said that while COVID presented some challenges in 2020, the cooperative spirit of the participants made it a worthwhile volunteer effort.\n“Working the COVID-19 Operation Collaboration vaccination site has been a great experience,” said Kathy Rupert, a County Fire CERT member. “It is really rewarding as the people come thru and they are so excited to be getting vaccinated. It feels good to be helping the community.”\nCounty residents interested in joining a CERT should contact their local CERT Manager, who can be found on the county’s CERT information website. Additional information and program information is also available by contacting Greenhalgh via telephone at (619) 857-8050, or via email at Teresa.greenhalgh@sdcounty.ca.gov\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210412.13.32.14"}