{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego’s Most Remarkable Teens for 2023 Honored", "description": "The San Diego County Public Defender’s Office announced its list of 25 Most Remarkable Teens from around San Diego County and recognized them at a special ceremony Thursday.", "datePublished": "2023-11-09T17:14:29-08:00", "url": "https://www.countynewscenter.com/san-diegos-most-remarkable-teens-for-2023-honored/", "keywords": ["families", "most remarkable teens", "public defender s office"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-11-09T22:18:13-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Public Defender’s Office announced its list of 25 Most Remarkable Teens from around San Diego County and recognized them at a special ceremony Thursday.\n“In a world that’s constantly evolving, a group of remarkable teenagers is illuminating the path toward an inspiring future,” said Interim Public Defender Katherine Braner. “These young individuals are not just the leaders of tomorrow; they are the leaders of today. With grit, resilience, courage, creativity, compassion and determination, these young people have something to teach us all. It is our honor to recognize 25 incredible youth and share their inspiring stories.”\nThe 25 teens were selected from among 77 nominated by the community for their inspiring contributions and efforts in categories such as civic involvement, activism, commitment to personal excellence and courage to overcome personal adversity, science and arts and culture.\nAll nominees were interviewed and presented their supporting materials before Public Defender’s Office staff and the San Diego County Public Defender Youth Council.\nThe program recognizes youth ages 13 to 19 for their accomplishments. Every nominee was interviewed by the San Diego County Public Defender Youth Council panel. All nominees received a certificate of recognition.\nCivic leaders and elected officials from San Diego County and the City of San Diego presented the awards at the San Diego Central Library. This is the sixth year teens have been selected for the program.\nThe 25 Most Remarkable Teens for 2023 are:\n\n Vidhi Kulkarni, 17, a student at Del Norte High School received the award in the Entrepreneur category. She founded a nonprofit organization, “The Special Entrepreneurs.” Her mission is to equip individuals with disabilities with the tools and skills to become financially independent through workshops, financial literacy and STEM skills. Vidhi nurtures the potential in participants and provides an online platform for them to sell their products. Vidhi also serves as the president of the Girls in Computer Science club and founded the Genes in Diseases and Symptoms club, and is part of the miRcore organization, dedicated to computational biology research.\nZinia Khatter, a junior at Del Norte High School, is recognized in the STEM Innovation category. Zinia leads Scientella, a nonprofit organization that promotes the next generation of women in STEM. Her organization has global outreach and she has collaborated with professionals from renowned companies to provide research projects, internships and mentorships or young aspiring innovators. She has helped raised nearly $100,000 in scholarships that are distributed to deserving students around the world. Beyond this, she has an intense interest in biomedical sciences and has personal research achievements.\nAiden Gruby, a student at Kearny School of Engineering, Innovation and Design, received the award in the Food Justice Advocate category. Aiden began volunteering with Feeding San Diego at just 6 years old. His leadership and passion for the cause means he is now a Volunteer Team Leader and coordinates with over 100 volunteers on Saturdays. He is an Eagle Scout and his project was designing, building and installing a cash donation machine in the Feeding San Diego lobby. Aiden motivates volunteers by showing the impact that one individual can have on the fight against hunger and fosters teamwork by showing the power of community and the potential to inspire change in the world.\nJoanay Benton, a senior at Mountain Empire High School, received the award in the Overcoming Barriers category. Joanay from the LaPosta Band of Mission Indians is the top student with the highest grade point average in her senior class. She is concurrently enrolled in Cuyamaca College since her sophomore year in high school. She is also the Associated Student Body president, the president of the Future Farmers of America, and is vice president for the Mountain Empire senior class. She excels as a cheerleader, basketball player and volleyball player. Joanay accomplishes this with the support of her family and by a personal commitment to never miss a day of work or an opportunity for growth.\nAva Grosely, who graduated from Carlsbad High School with academic distinction, is recognized in the category of Courage to Overcome Adversity. Ava overcame significant challenges she faced from a young age, by refusing to be defined by her circumstances. She achieved stability by striving for academic excellence, seeking leadership roles and giving service to her community. Through her involvement, she advocates for equity and social justice. Ava served as Senior Class President and Congress Captain on her school’s nationally ranked Speech and Debate team. She received a full scholarship as a QuestBridge Match Scholar to the University of Southern California. She aspires to work in the field of law.\nArnav Dagar, a sophomore at Canyon Crest Academy, received the award in the category of Inventor. Arnav’s technological skills include programming Artificial Intelligence agents to play two-player games, designing an omnidirectional lidar system, and developing sophisticated localization techniques. Currently, he is developing a program for AI to detect risk factors for amblyopia, a vision disorder that affects children. His research has garnered regional, state and national recognition. He serves as a vice president of outreach at the San Diego Science Fair providing guidance and support for students. He also coaches a MATHCOUNTS team at Earl Warren Middle School.\nSarah Gao, a junior at Canyon Crest Academy, was selected for the award in the Environmental Activism category. She is doing groundbreaking environmental research including using seeds to purify water sustainably and affordably which has earned her top awards in science fairs. She has a nonprofit organization, Coast2Canyon, to conserve biodiversity. Sarah is committed to inspiring others including young girls to pursue careers in STEM. She also is active in her school government as vice president of the School Site Council. She plans to study computer science, environmental science and public policy.\nDaphne Mayer, a student at La Jolla High School, received the award in the category of Cultural Representation. Her experience as the daughter of an immigrant from Paraguay was that she had little to no help or guidance after coming to the United States. She has made a difference in improving educational opportunities for underserved students. Recently, she worked to bring a program to her school that can help underserved students gain high-level English proficiency, seek effective academic counseling and learn how to pursue leadership opportunities. While it was not implemented due to funding constraints, she remains dedicated to discovering available resources to build a more compassionate and fair society.\nJabze Solomon, a recent graduate of University High School, received the award in the category of Youth Activism. His path to higher education is guided by a passion for helping others and a commitment to community service. He volunteers with organizations such as UCSD Health and school committees like the Site Governance Team and Reality Changers. His goal is to become a medical malpractice attorney to represent individuals who have been wronged by the medical industry. He is now a student at George Washington University studying criminal justice and police science on a pre-law track.\nArden Pala, 14, at Francis Parker was presented the award in the category of Community Service. Arden is the founder of a 501C3 nonprofit organization, Sports4Kids, which includes a team to mentor and coach elementary-aged athletes. Its primary focus is on low-income and homeless youth who lack access to sports opportunities. His organization has raised funds to help feed the homeless, provide back-to-school backpacks and provide care packages for those who are temporarily without a home. His program has helped 7,500 individuals. He directed a documentary about individuals who experienced homelessness when he was 12 called “A Second Chance.” The film has won several awards including American Youth Film Festival best middle school documentary.\nAviya Afra, a student at the Grauer School, received the award in the Humanitarian category. As Co-President of the Girl Rising Club, they have cultivated an alliance with Daraja Academy, an all-girls boarding school in Kenya. The goal is to help girls worldwide realize their full potential. They help to empower young women who face obstacles like arranged marriages and poverty. This year, she started a campaign that resulted in raising $15,000, enough to fund a full year’s tuition and housing for six Daraja students. They also collected 480 pounds of academic supplies to send. As the world’s youngest KonMari Consultant Trainee, she donates her skills to transform the bedrooms of terminally ill children.\nChris Moya, a senior at Chula Vista High School received the award in the category of LGBTQ+ Activism. Their personal journey of self-acceptance as a member of the LGBTQ+ community in a traditional Mexican household is empowering. Chris is a member of the Main Attraction show choir, a First Gen Scholars program, and is an advocate on campus for a more inclusive environment. They founded the Genders and Sexualities Club and the Chula Closet Club at school to create safe spaces for their peers. Chris is also a volunteer at the San Diego Humane Society and plans to have a career in veterinary medicine or zoology.\nJessie Way, a recent graduate of San Marcos High School, is recognized in the category of Mental Health Advocacy. She is now in her first year at college and is studying to become an occupational therapy doctor. Jessie’s perspective is that she is autistic, which she views as a divine gift, not a deficit. Jessie has a vision for the future in which she can help change the world by dismantling the barriers that autistic individuals frequently encounter. She strives to educate both changemakers and the public about autism using the neurodivergent-affirming paradigm. She is an advocate for inclusivity that extends beyond physically accessible spaces.\nSamantha Morden, 16, at Guajome Park Academy received the award in the Perseverance category. She is recognized for excelling in school as a way to escape chaos around her and find stability. She has faced familial hardships that put her in and out of the foster care system since 7th grade following the loss of one parent and the mental decline of the other. Despite this, Samantha persevered, and she dedicated herself to her education and future. She applied herself to five International Baccalaureate classes and maintained a GPA over 4.0. She also plays violin in orchestra and serves as the publicist for the Academic Team.\nStephanie Morden, 16, Samantha’s twin sister, who also attends Guajome Park Academy received the award in the category of Perseverance. As a result of her mother and father’s mental struggles, she was displaced from home twice. She faced severe mental and physical adversity but gained control of her environment by focusing on her studies and academic achievements. Like her sister, she also maintains a GPA over 4.0 while taking five International Baccalaureate courses. In school, she is involved in extracurricular activities and is president of the school’s Academic Team and plays violin in the school orchestra.\nHillari Hampton, 19, a student at San Diego State University is presented the award in the category of Non-Traditional Sports. She is a competitive bowler and became a certified coach at the age of 14 working with children from 4 to 17. She dislocated her knee during a tournament and underwent 11 months of rigorous rehabilitation and strength training. She returned to the same tournament a year later. In school, she is pursuing a double major in Children’s Theatre and Musical Performance. Her goal is to perform on Broadway. Hillari is a versatile musician and plays nine instruments.  She is also undergoing vocal training under the guidance of a member of rock band Duran Duran.\nHashima Delawarzai, a student at City Heights Preparatory School received the award in the Public Speaking category. Hashima is originally from Afghanistan and is determined to create positive change in her life and the world. She is the eldest of nine siblings and shoulders significant responsibilities to ensure her younger siblings are well cared for and are pursuing their own education. In Afghanistan, women have historically been denied their voices and freedoms and that ignited her desire to be a public speaker. Her goal is to become a doctor and provide the highest quality of care to her community and alleviate suffering.\nAneli Garcia, a student at Health Sciences High and Middle College, is recognized in the Public Health category. Aneli represented California in the Health Occupations Students of America International Competition for her healthcare expertise. She also served as the fire chief in her school’s HSHMC Fire Program learning public safety, emergency response and leadership. Aneli created a Suicide Prevention Campaign at her school that raises awareness about the importance of mental health and also offers training in CPR, firefighting and fire prevention. Aneli is also the captain of the HSHMC Girls Varsity Soccer Team.\nTheresa Aguilar, 17, a student at the Academy of Our Lady of Peace received the award in the category of Community Empowerment. Theresa earned her Girl Scout Gold Award by completing her project to address literacy rates among children in underserved communities. She created a Reach Out and Read Club at her school and a summer reading program at Neighborhood Healthcare Community Clinics. In all, she read 800 books to 275 children in pediatric clinic waiting rooms to foster a love of reading for children at an early age. Theresa also created a trilingual video in English, Spanish and Arabic on the importance of reading to children and sharing her project with a wide audience. Theresa volunteers at various organizations including the Ronald McDonald House Charities San Diego, St. Michael’s Church Altar Serving Ministry, and Interfaith Community Services.\nShania Mancol, 17, a student at e3 Civic High School is awarded in the Innovation category. She is dedicated to creating a safer environment for young people and has served in her school’s Associated Student Body for all four years of high school. Shania is a member of an all-female team pioneering a novel product that can test for “date rape” drugs in beverages. This would create a safer setting for youth in social settings. Her team has conducted intensive research, surveys, and interviews with experts and end users. Their groundbreaking work has earned the prestigious Lemelson-MITInvenTeams grant and will present their project at EurekaFest next June. Shania also played a pivotal role in proposing all-gender restrooms on campus to foster inclusivity and equality.\nJacqueline De Anda, a student at East Village Middle College High School received the award in the Civic Engagement category. She is the Director of Diversity and Equity for the Student Advisory Board at her school and created an equitable board that prioritizes the representation of all district students. She also had a pivotal role in the Superintendent Selection Committee to ensure her community’s voice was heard through the process. She is the president of the Circulo De Mujeres at the Barrio Logan College Institute, where she mentors young women. She also organized an event to destigmatize mental health in the Latinx community. On her school campus she is president of a community service club.\nAdelina Ramirez, a student at San Diego High School is recognized in the Social Justice category. She initiated a year-long community service project to raise awareness about Chicano Park as an important cultural landmark. She raised funding to buy Latinx-themed books to enrich to the school’s curriculum and library. She is committed to social justice and women’s empowerment advocacy. She is in the leadership cohort for Girls Inc. and expanded outreach. Adelina was accepted into the Aaron Price Fellows Program, rigorous three-year fellowship focused on youth, civics and leadership. Adelina is a UCSD intern with the Center for Research on Educational Equity, Assessment & Teaching Excellence and a member of the San Diego Unified Racial Justice and Equity Committee.\nEddie Garcia, a student at Morse High School, is recognized in the category of Resilience. Eddie was born in California but grew up in Mexico. In 2022, he came back to the United States and had to adapt to a new culture and language. He works as a cook and dishwasher when not in school and has contributed to his family’s well-being since the age of 12. At school, as he is learning English proficiency, he dedicates his time to supporting his peers. He is determined to break the chain of his family’s economic hardships. He aspires to become a professional boxer. His alternative plan is a career as an FBI agent because he would like to serve his community and country.\nBlessyn Williams, a senior at Lincoln High School received the award in the category of Leadership. She is a youth leader in the Young and Prosperous Foundation, an organization that provides resources for youth and promotes social justice, equality, personal growth and educational development. She is also the president of Black Girls United, a student-led club under the foundation’s umbrella. She has more than 5oo service hours through the foundation. Blessyn is a valued member of Lincoln High School varsity cheer, lacrosse, and tennis teams. She is in the Aaron Price Fellows Program, a rigorous three-year program, focused on youth, civics and leadership.\nDevin Bacon, a student at the O’Farrell Charter School won the award for Most Promising Teen. After watching his older brother’s prowess in track and field, Devin became involved in running at the age of four, transitioning into local competitions as he got older. He qualified for national meets at the age of eight. He is attending his dream school in Eugene, Oregon and is part of the God’s Speed Track and Field Club. He is also an honor roll student and is involved in various student activities. Devin credits his determination and resilience to his strong support system that includes his family, particularly his mother and brother, friends, coaches, teachers and peers.\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231109.17.14.29"}