{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Library Laptops Help Bridge the Digital Divide", "description": "San Diego County’s 33 branch libraries have added something new to the books, movies, and music they lend to the public – 7,000 sets of Chromebook computers and hotspots to support people in need of digital access.", "datePublished": "2022-09-13T08:48:31-07:00", "url": "https://www.countynewscenter.com/?p=209462", "keywords": ["consumer", "digital divide", "library", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2022-09-13T08:48:42-07:00", "articleType": "article", "articleContent": "\nSan Diego County’s 33 branch libraries have added something new to the books, movies, and music they lend to the public – 7,000 sets of Chromebook computers and hotspots to support people in need of digital access.\nThis TechConnect program, funded by a $4.3 million federal grant from the Emergency Connectivity Fund (EFC), will help people access the internet.\n“This is great example of how the library creatively responds to serve our community, said County Library Director Migell Acosta. “These resources provide important online access that can support education, healthcare services, employment options and connect them to a myriad of County services.”\nWhile supplies last, San Diego County Library (SDCL) customers can check out an ASUS Chromebook C204, ATT Moxee Hotspot device, and charging cables free of charge for up to one year. They are available at any SDCL branch to people with a SDCL library card. Customers are also required to sign a form saying they do not have sufficient equipment or services to access the internet. Minors need to have a parent or caregiver compete the form to check out a set.\nThe program started in June, and more than 3,000 have been distributed by branches and through local community organizations helping SDCL identify people with the greatest need. The community feedback has been positive. A young mother from the Lakeside Branch told library staff that the program was life-changing, and an unsheltered customer said she hopes it will enable her to find a job. You can visit your local SDCL branch to check out a TechConnect set today or learn more at sdcl.org/techconnect.\nThe program is just one of many ways the County is closing the digital divide in the region. Additional efforts include a comprehensive broadband plan to help prioritize and guide connectivity solutions in the unincorporated areas, a partnership with Caltrans and SANDAG to underground fiber optic cable along 22 miles of SR 67, and a  sponsorship of SANDAG’s GetConnected campaign.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220913.08.48.31"}