{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County and Court Officials Preview Start of New CARE Act Program", "description": "County and Court officials outlined Wednesday plans for the launch next week of the Community Assistance, Recovery & Empowerment Act (CARE Act) program to help severely impaired people living with untreated schizophrenia or other psychotic disorders.", "datePublished": "2023-09-27T16:24:55-07:00", "url": "https://www.countynewscenter.com/county-and-court-officials-preview-start-of-new-care-act-program/", "keywords": [], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-09-27T16:24:55-07:00", "articleType": "video.other", "articleContent": "\nCounty and Court officials outlined plans Wednesday for the launch next week of the Community Assistance, Recovery & Empowerment Act (CARE Act) program to help severely impaired people living with untreated schizophrenia or other psychotic disorders. \nStarting Sunday, Oct. 1, the County of San Diego will be one of seven pilot Counties in the state to get an early start on implementing the CARE Act program. It will do so in collaboration with the Superior Court, the Public Defender, legal advocacy, contracted service providers, and community partners.  \n“I’m excited for our County to be a leader in launching this new program,” said Board of Supervisors Chairwoman Nora Vargas. “We want to make sure that the public is aware how this latest tool may help them. If our community doesn’t know how to access this latest resource, they can’t leverage it.” \nReferrals to the program can be initiated by family members, behavioral health providers, first responders, or other approved petitioners. Details are online at sandiegocounty.gov/CAREAct.  \nThe CARE Act program is designed as a voluntary treatment program for adults, 18 years and older. While some people experiencing homelessness may meet the state law’s impairment definitions, it is not a homeless housing program. The new program is one of many County programs that support those with behavioral health needs. For additional information about the new program, people can call the County’s Access and Crisis Line (ACL) at 1-888-724-7240 – or the national crisis line at 9-8-8. \nThe County expects to spend between $15 million – $20 million the first year on CARE Act and for about 1,000 people to be considered. About a quarter of the people engaged are estimated to qualify and transition to confirmed cases, with others guided toward previously existing behavioral health programs. \n“County Behavioral Health Services (BHS) has assembled a team to support the launch of the CARE Act program with our partners,” said Dr. Luke Bergmann, director of County Behavioral Health Services. “Collectively, we will improve the lives of eligible people in our community, while also offering important existing resources and help to others.” \nSigned into law by Gov. Gavin Newsom on Sep 14, 2022, the CARE Act creates a process for those filing a petition with the civil court to connect adults to voluntary treatment if they meet criteria and would benefit from the program. The Superior Court makes an initial determination about whether the petition appears to meet program criteria. If it does, the Court will order BHS to conduct an investigation and report back within 14 days.  \nShould the Superior Court support establishing a case, a CARE Plan will be developed with County BHS, in partnership with the petitioned individual and their lawyer.  \nOnce a CARE Plan is accepted by the Superior Court, BHS and community-based providers will actively engage the connect the individual to services. Services available include behavioral health treatment, stabilization medication, housing and other supports as needed. \n“The San Diego Superior Court is well prepared to begin reviewing petitions and working with the County, individuals and their counsel on both eligibility and the best plan going forward for those who take part in CARE Act proceedings,” said Superior Court Judge Kimberlee Lagotta.\nProgram participation is 12 months but may be extended depending upon individual circumstances. People who successfully complete the program and are graduated by the Court will remain eligible for ongoing treatment and supportive services to support long term recovery. \nCalifornia’s other participating CARE Act pilot Counties are Glenn, Orange, Riverside, Stanislaus, Tuolumne, and the City and County of San Francisco. Los Angeles County starts Dec. 1 with the rest of the state required to begin next year. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230927.16.24.55"}