{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Should Get Boosters, Test Only As Needed, Work from Home", "description": "Due to markedly increasing COVID-19 cases and the resulting strain on the local health care system, County health officials are urging San Diegans to get all the recommended vaccines and to get tested only as necessary.", "datePublished": "2022-01-07T17:12:26-08:00", "url": "https://www.countynewscenter.com/san-diegans-should-get-boosters-test-only-as-needed-work-from-home/", "keywords": ["health", "coronavirus", "covid-19", "not testing", "vaccinations", "work from home"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-01-07T17:12:13-08:00", "articleType": "article", "articleContent": "\nDue to markedly increasing COVID-19 cases and the resulting strain on the local health care system, County health officials are urging San Diegans to get all the recommended vaccines and to get tested only as necessary.\nIn the past month, confirmed COVID-19 cases jumped from about 4,700 per week to more than 45,000 cases reported in the seven days between Dec. 29, 2021 through Jan. 4, 2022. That is nearly a tenfold increase in just 30 days.\nCOVID-19 hospitalizations have also more than doubled in the past 30 days, from 320 to 774, putting a strain on local hospitals that are contending with hundreds of employees unable to work after contracting the virus.\n“We’re now seeing the highest local case counts of the pandemic. COVID-19 is everywhere,” said Wilma J. Wooten, M.D., County public health officer. “The best way to slow the spread of COVID-19 is to have as much immunity as possible and to take other precautions that we know work.”\nWhile we are in this highly active COVID-19 period, Wooten is urging San Diegans to:\n\nGet vaccinated\nGet a booster when eligible. Boosters are now available and recommended for everyone 12 years and older\nWear a tight-fitting mask indoors when in public places. The state currently requires masks in indoor public places\nGet tested only if you have symptoms.\nStay home if you’re sick.\nIf you test positive at home, isolate for at least five days. A PCR test is not needed to confirm a positive rapid antigen test.\nSeek treatment from your doctor if you have moderate to severe symptoms.\nEmployers should be flexible and if the job allows, let employees work remotely for their safety and the wellbeing of those around them.\n\n“While our COVID-19 testing capacity is high, demand has skyrocketed, leading to long lines and waits. Testing should be reserved for those at higher risk of serious illness and people who need it the most,” Wooten said.\nCounty health officials recommend that only people with symptoms needing emergency care should go to a hospital emergency department.  People should not go to an emergency department for testing with no or mild COVID symptoms.\nThe region’s health care providers offer testing to members who meet each systems’ criteria. Many neighborhood pharmacies offer same-day testing as do other locations. The County, which has about 10% of the region’s testing capacity, has a network of no-cost testing public sites that are both walk-up and can take appointments.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220107.17.12.26"}