{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Rapid and Early Start to Flu Season Prompts Calls for Increased Caution", "description": "Flu season has arrived and County health officials are encouraging San Diegans to familiarize themselves with the signs and symptoms of influenza, as well as other respiratory illnesses, and to get a flu shot to protect themselves and their family members.", "datePublished": "2022-10-20T12:45:15-07:00", "url": "https://www.countynewscenter.com/rapid-and-early-start-to-flu-season-prompts-calls-for-increased-caution/", "keywords": ["health", "flu", "flu season", "flu shot", "influenza"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-10-20T12:45:15-07:00", "articleType": "article", "articleContent": "\nFlu season has arrived and County health officials are encouraging San Diegans to familiarize themselves with the signs and symptoms of influenza, as well as other respiratory illnesses, and to get a flu shot to protect themselves and their family members.\nTo date, more than 1,600 San Diegans have been diagnosed with a lab-confirmed case of influenza. The 1,664 cases reported to the County since July 1 of this year, are more than seven times higher than the 217 cases reported at the same time last year during the 2021-22 flu season. While the County monitors flu activity year-round, flu season is typically October to March or later each year.\nRespiratory illnesses historically increase during fall and winter as many people move gatherings indoors, but flu activity typically does not peak until December or January.\nThis year, the County has already seen several large suspected respiratory outbreaks in October, including a cluster of illnesses at local schools. The high number of flu cases and other respiratory illnesses this early in the season is prompting health officials to urge San Diegans to take precautions.\n“We have reason to believe that respiratory illnesses could be extremely disruptive in the region this year for businesses, hospitals, and people’s lives. San Diegans must do their part to prevent the spread of these illnesses,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “I want to remind San Diegans to use precautions we know are effective in protecting against illness, including the flu.”\nWooten added that people should recommit themselves to the following precautions this fall and winter:\n\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nGet Vaccinated\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop after vaccination. The CDC also says you can get a flu and COVID-19 vaccination at the same time, including the new bivalent booster dose. The COVID-19 vaccine does not work against influenza and vice versa.\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest public health center location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nFlu Symptoms\nCOVID-19 and influenza are both spread from person-to-person, especially indoors and in crowded places. Symptoms for both viruses include fever, headache, and muscle and joint pain, as well as a sore throat and coughing.\nSince symptoms for both the flu and COVID are similar, but treatment varies, testing is the best tool to help sick individuals determine a plan of action.\n“Get tested for COVID-19 and the flu when you develop respiratory symptoms and stay away from others if you are sick,” Wooten said. “Protect yourself and your loved ones. Seek medical treatment if your symptoms worsen or if you have an underlying condition that puts you at an increased risk of severe outcomes from the flu or COVID.”\nHigh-risk individuals include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control;\nPregnant women;\nPeople aged 65 years and older; and\nPeople who live with or care for others who are at higher risk.\n\nDuring the 2021-2022 flu season, 4,192 flu cases were reported and eight San Diegans died from influenza. During the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221020.12.45.15"}