{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Issues Emergency Proclamation After Storm Causes Flooding Damage", "description": "The County of San Diego is proclaiming a local emergency on behalf of the Board of Supervisors in anticipation that resources and assistance from the state and federal government may be needed because of damage caused by flooding from the storm January 22, 2024.", "datePublished": "2024-01-22T22:57:26-08:00", "url": "https://www.countynewscenter.com/county-issues-emergency-proclamation-after-storm-causes-flooding-damage/", "keywords": ["government", "alertsandiego.org", "chairwoman nora vargas", "emergency operations center", "emergency proclamation", "emergency services", "flooding", "national weather service"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-01-22T22:57:26-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County of San Diego is proclaiming a local emergency on behalf of the Board of Supervisors in anticipation that resources and assistance from the state and federal government may be needed because of damage caused by flooding from the storm January 22, 2024. A local proclamation communicates to the state that the County is anticipating significant impacts to both public and private property.\nThe San Diego National Weather Service office reported that Monday was the 5th wettest day in San Diego since 1850.\n“County residents are recovering from serious impacts from this storm. Some areas of the County received several inches of rain in a short period of time, flooding streets, damaging homes, and businesses,” said Board of Supervisors Chairwoman Nora Vargas.  “We urge everyone to register for AlertSanDiego.org and download the SD Emergency mobile app to receive emergency notifications, updates, and preparedness information, like a personal disaster plan and go-kit in case of evacuation.”\nThe County’s Emergency Operations Center continues to monitor conditions and coordinate among County departments, with cities, non-governmental organizations and first responders. County workers will begin damage assessments Tuesday morning at 8 a.m. Residents and businessowners can submit their damages to https://crisistrack.juvare.com/public/sandiegoCA/request.html\nGet the latest updates on storm conditions, response, and preparedness at AlertSanDiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240122.22.57.26"}