{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County of San Diego Awarded Grant from the Office of Traffic Safety for Bicycle and Pedestrian Safety Program", "description": "A $125,000 grant from the California Office of Traffic Safety (OTS) will fund activities emphasizing the safety of bicyclists and pedestrians.", "datePublished": "2022-11-04T12:39:05-07:00", "url": "https://www.countynewscenter.com/county-of-san-diego-awarded-grant-from-the-office-of-traffic-safety-for-bicycle-and-pedestrian-safety-program/", "keywords": ["health", "bike safety", "grant", "pedestrian safety"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-11-04T12:39:05-07:00", "articleType": "article", "articleContent": "\nA $125,000 grant from the California Office of Traffic Safety (OTS) will fund activities emphasizing the safety of bicyclists and pedestrians.\n“Bicycle ridership is growing and a big part of San Diego County’s sustainable future,” said San Diego County Health and Human Services Agency Community Operations Officer Barbara Jiménez. “It has never been more important to promote both the benefits of cycling and ensuring everyone is using our roads safely.”\n“Every bicyclist and pedestrian should feel safe on the road,” said OTS Director Barbara Rooney. “Education is one of many important tools that collectively work to make sure everyone, regardless of how they travel, reaches their destination safely.”\nGrant funds will support a variety of activities focused on bicycle and pedestrian safety:\n\nEducation and outreach social media campaign to engage an expanded audience on safety and active transportation topics.\nParticipation in State and National campaigns, such as National Walk to School Day and California’s Pedestrian Safety Month.\nCommunity, senior center, and school education presentations on safest bike/walking practices, with a focus on the benefits active transportation provides on health, community, and climate change.\nParticipation in “Open Streets” events encouraging biking and walking.\nBicycle and scooter skills training courses that educate on safe riding behaviors.\nWalking field trips with older adults and disabled residents to identify walking hazards and educate on safe active transportation techniques.\nPresentations at stakeholder meetings focused on active transportation to share best practices and increase collaboration.\n\nThe services, which will run through Sept. 30, 2023, will be provided by Circulate San Diego.\nThis safety campaign aligns with the County’s vision for a just, sustainable, and resilient future for all.\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\nFor more information, contact Dara Braitman from Circulate San Diego at planning@circulatesd.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221104.12.39.05"}