{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Season’s First Flu Death Reported, Also Had COVID-19", "description": "A 65-year-old man from East County is the first influenza death reported in San Diego County this season, the County Health and Human Services Agency announced today.", "datePublished": "2021-02-03T11:45:59-08:00", "url": "https://www.countynewscenter.com/seasons-first-flu-death-reported-also-had-covid-19/", "keywords": ["health", "first flu death", "flu death", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-04T16:46:53-08:00", "articleType": "article", "articleContent": "\nA 65-year-old man from East County is the first influenza death reported in San Diego County this season, the County Health and Human Services Agency announced today.\nThe man, who was also diagnosed with the novel coronavirus, died Jan. 13, had underlying medical conditions and had been vaccinated against influenza.\n“Influenza deaths are very unfortunate, but they do occur every flu season,” said Wilma Wooten, M.D., M.P.H., County public health officer. “While influenza activity has been very low this season, San Diegans should get vaccinated against the flu to prevent getting influenza and COVID-19 at the same time.”\nThrough Jan. 30, 2021, there have been 39 people diagnosed with influenza and COVID-19 at the same time.\nTo date, 677 influenza cases have been reported in the region, compared to 11,863 cases that had been registered at the same time last year. A total of 108 people died from influenza last season.\nYour Best Shot Against the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nFlu vaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople 65 years and older\nPeople who live with or care for others who are at higher risk\n\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nStay away from sick people\nWash hands thoroughly and often\nUse hand sanitizers\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nThe flu vaccine is available at doctors’ offices and retail pharmacies. If you don’t have medical insurance, you can go to a County public health center to get vaccinated. For a list of locations, visit the County’s influenza Website or call 211 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210203.11.45.59"}