{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Releases Equity-Centered Recommended Budget That Expands Programs and Services", "description": "San Diego County released an $8.11 billion recommended budget today that continues increased spending to fight homelessness; take on mental health and substance use disorder challenges; improve the justice system; help working families and invest in core services like roads, fire protection and parks.", "datePublished": "2023-05-04T08:28:01-07:00", "url": "https://www.countynewscenter.com/county-releases-equity-centered-recommended-budget-that-expands-programs-and-services/", "keywords": ["government", "2023-24 budget", "2023-24 budget release", "budget plan", "engage san diego county"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-05-05T06:44:11-07:00", "articleType": "article", "articleContent": "\nSan Diego County released an $8.11 billion recommended budget today that continues increased spending to fight homelessness; take on mental health and substance use disorder challenges; improve the justice system; help working families and invest in core services like roads, fire protection and parks.\nThe “Invested in Community” budget is $745.8 million larger than last year’s budget, a 10.1% increase. It also adds roughly 490 new positions, a 2.5% increase over last year.\nThe increase in budget and staff will support new and expanded social service programs and increasing caseloads to assist vulnerable populations. It also reflects investments in critical infrastructure, like a new Public Health Lab and affordable housing projects.\nMuch of the revenue to administer many of these programs comes from the state and federal government. It also comes from an increase in local property taxes. While this revenue supports the programs in the coming fiscal year, current economic uncertainty may impact future years.\nThe budget was built with community input and around the values in the County’s General Management System—integrity, equity, access, belonging, excellence and sustainability.\nThe spending plan maintains the County’s essential services – such as public safety, land use and health and social services – while addressing new commitments.\nIt is also centered around equity. The County’s Office of Equity and Racial Justice implemented a Budget Equity Assessment tool last year. This tool helps County departments by using a series of questions when developing the budget to better understand how allocations affect historically vulnerable communities, people with low incomes or who currently suffer or have suffered from inequality.\nThe public can learn more about the recommended budget by viewing an executive summary or the full recommended budget plan.\nThe County invites members of the public to give their feedback in person and online. Two community budget meetings are scheduled, one at 2 pm. on May 16 at the County Operations Center which can be attended in person or online. The second evening meeting will be virtual at 5:30 p.m. on May 18. Visit our open budget page for more information.\nAdditionally, you can provide eComments on the recommended budget now through June 21 on our community engagement budget page at Engage San Diego County.\nYou can also watch, listen and participate in budget presentations, hearings, deliberations and adoption at upcoming Board of Supervisors meetings.\nBudget presentations take place before the Board on May 11. Public hearings are 9 a.m. on June 12 and 5:30 p.m. on June 15. Budget deliberations and adoption are scheduled for June 27.\nInvestment priorities in the recommended budget include:\nMental Health and Substance Use Disorder \n\n$66.7 million increase for a total investment of $737.9 million for contracted services including:\n\n$37.5 million mental health services for adults.\n$10.9 million for crisis diversion services including expanding Mobile Crisis Response Teams, the Crisis Line, public messaging awareness and crisis community-based services.\n$9.5 million substance use disorder outpatient, withdrawal management, residential and recovery services.\n$8.8 million for 41 long-term beds.\n\n\n$18.3 million for implementation of the CARE Act, a new state program for people with serious behavioral health issues that may provide services, shelter and treatment through a civil court proceeding.\n $7.1 million to address opioid addiction.\n\n Homelessness and Housing\n\n $25 million increase for the Innovative Housing Trust Fund to help build affordable housing.\n$6.6 million increase to support Permanent Local Housing Allocation and HUD entitlement programs.\n$5.8 million increase to prevent homelessness and provide housing stability for families experiencing homelessness.\n$2.3 million for homeless services/housing for the LGBTQIA+ community.\n\n Sustainability and Fighting Climate Change\n\n$3.8 million to continue work on an ambitious Regional Decarbonization Framework that will help communities move the region toward zero-carbon emissions.\nPlan to plant more than 5,000 trees as part of a regional effort to add 10,000 trees throughout the county to naturally remove carbon dioxide from the air and lower temperatures.\n$2.5 million for the design phase of the new Zero Carbon Portfolio Plan for County operations with the goal to reach a 90% reduction in greenhouse gas emissions in facilities by 2030.\n$2.7 million to restore land and improve water quality in the Tijuana River Valley.\n\nJustice Reform\n\n$10.6 million to protect the public and help justice-involved people who have substance use disorders and/or behavioral health issues as they reenter their communities by connecting them with treatment, housing and jobs.\n$12.8 million for court programs to support those with mental health, substance use and other needs, such as Collaborative Courts, Drug Courts, Mandatory Supervision Courts, Reentry Courts, Veterans Courts and Behavioral Health Courts.\n$5 million to provide free legal representation to people who are detained or in alternative detention settings and are seeking asylum or facing deportation.\n$2 million to keep young people out of the criminal justice system and address underlying causes of their harmful behavior.\n\nInvesting in Working Families \n\n354 additional staff years across all Health and Human Services Agency departments to support safety net programs like CalWORKs, CalFresh, and Medi-Cal, and services for behavioral health, public health, seniors, children, and families.\n$141.1 million increase for safety net program benefit payments, higher wages for In-Home Supportive Services caregivers, additional employment services and training for CalWORKS and CalFresh recipients and expanding Info Line 211 Access.\n$18 million increase to support foster youth, increase mental health services for transition-age youth and to set up a Prevention Hub to help families avoid the child welfare system and Juvenile Probation.\n$5.2 million of ongoing support for the Office of Immigrant and Refugee Affairs.\n\nHealthy and Safe Communities\n\n$18 million to build “One Safe Place South: The South County Family Justice Center,” matching the one opened in North County, to help survivors with restraining orders, safety planning and trauma therapy, and help them get healthcare, food assistance, shelter and housing.\n$3.9 million to bolster Public Health Infrastructure.\n$17 million to build a new Jacumba Fire Station to better protect the entire community and region.\n$35.6 million to build a new Santee Animal Shelter opening in fall 2024.\n\nThe County wants to know how to keep you informed as it moves along the budget process. Do you prefer email, text or some other form of communication? Visit the budget page at Engage San Diego County, our community engagement page, and give us your ideas.\nTo find out more about the recommended budget and upcoming meetings and hearings, visit the County’s open budget site. You can also visit the Clerk of the Board’s website or call 619-531-5434 to get details about hearings and request translation services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230504.08.28.01"}