{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is Last Day to Vote in 80th Assembly District Election", "description": "Tuesday, April 5 is the final day to cast your ballot in the State Assembly District 80 Special Election. Eligible voters can do so at any of nine vote centers in the district or at the Registrar’s office until 8 p.m.", "datePublished": "2022-04-05T07:00:35-07:00", "url": "https://www.countynewscenter.com/?p=208130", "keywords": ["elections", "april 5 special primary election", "fgg", "last day to vote", "mail ballot drop offs", "registrar of voters", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-04-05T08:17:48-07:00", "articleType": "article", "articleContent": "\nTuesday, April 5 is the final day to cast your ballot in the State Assembly District 80 Special Election. Eligible voters can do so at any of nine vote centers in the district or at the Registrar’s office until 8 p.m.\nAll in-person voters can mark their ballot on a ballot marking device. After the voter marks their selection using the device’s touch screen, they will print their official ballot, review it, place it in a secrecy sleeve and return it to a poll worker to place it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nIf you’re still holding onto your mail ballot, the Registrar’s office reminds you to return it promptly to a ballot drop box location or vote center in the district. Ballot drop box locations will also be open until 8 p.m. on Election Day. You can return it by mail, no postage needed, as long as it is postmarked on or before April 5 and received by the Registrar’s office by April 12.\nAny voter who is in line at a vote center or ballot drop box location at 8 p.m. will be allowed to vote. However, no one can join the line after the 8 p.m. deadline.\nRemember that campaigning or electioneering within 100 feet of a vote center or ballot drop box location is not allowed. This includes information you can see or hear that advocates for or against any candidate on the ballot.\nOnly those who live in the state’s 80th Assembly District under the 2011 district boundaries can vote in the election. The district covers portions of southern San Diego County and includes parts of the cities of Chula Vista, National City and San Diego. If you’re not sure whether you were in the 2011 district boundary, you can look it up at sdvote.com.\nLearn more about voting in the 80th Assembly District Special Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220405.07.00.35"}