{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Do the Drill for Earthquake Safety and Survival", "description": "San Diego County residents and businesses still have time to register to join the Great California ShakeOut earthquake drill which is being held Thursday, 10/20/22.", "datePublished": "2022-10-19T10:41:35-07:00", "url": "https://www.countynewscenter.com/do-the-drill-for-earthquake-safety-and-survival/", "keywords": ["public safety", "earthquake early warning", "emergency", "sdemergency app", "shakeout", "shakereadysd"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-10-19T10:41:35-07:00", "articleType": "article", "articleContent": "\nSan Diego County residents and businesses still have time to register to join the Great California ShakeOut earthquake drill which is being held Thursday, 10/20/22.\nMinimizing or preventing injuries during a significant earthquake is the top goal and the best way to do that is to have some safety measures in place before one occurs, to know how to protect yourself during the shaking in different situations, and to be aware of potential hazards after one has passed.\nSan Diego is in the “before” phase now with more than 800,000 individuals, businesses and organizations in San Diego County currently registered to drop, cover and hold on at 10:20 a.m. on Thursday 10/20. Statewide, 9.4 million are participating and on an international scale, even more will drill.\nThe San Diego County Office of Emergency Services and San Diego County Fire and CAL FIRE San Diego encourage all San Diego County residents and area visitors to register for ShakeOut.\n“Review and update your emergency plan if needed, and download the county’s SD Emergency App which includes ShakeReadySD, technology which can notify people of intense shaking several seconds before it begins. This can give people time to seek cover,” said Jeff Toney, Director of the San Diego County Office of Emergency Services.  “The key to surviving an earthquake is having a plan and practicing it in different environments. Where you might seek cover at home is not the same as what you might do in your workplace or in your vehicle.”\n\nGet the SDEmergency App now with ShakeReadySD early earthquake warning. \nTony Mecham, County Fire and CAL FIRE San Diego Unit Chief, notes those with a plan and emergency supplies have a better chance of survival. This is because during a large-scale disaster, first responders may be unable to get to households for basic first aid calls.\nDrop, cover and hold on is the protective action recommended by federal, state and local emergency preparedness organizations as the best way to avoid or reduce injury during an earthquake. If indoors, seek cover under a desk or table, or if one is not in the area, sit against an interior wall away from glass and heavy furniture and protect your head. Do not run outside if shaking begins. But if you’re already outdoors, try to find a clear area and sit down and protect your head. Move away from building exteriors, trees, power lines if possible. For more specific situations and video demonstrations, visit the Earthquake Country Alliance.\nThe ShakeOut drill can be conducted in as little as 90 seconds. After your drill, look around your surroundings at work or at home to see what items might fall or topple over during intense shaking and cause injury, then secure furniture and wall hangings to prevent the hazard.\nDrill tips and information resources are available on the ShakeOut website. Free family disaster plan templates are also available on www.ReadySanDiego.org in multiple languages. The templates include a list of important items to assemble in your disaster emergency kit.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221019.10.41.35"}