{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Cases Rise, County Urges People to Get Vaccinated, Boosted", "description": "COVID-19 cases are slightly rising in San Diego County, prompting County health officials to continue calls for people to complete their vaccination series and get bivalent boosters if they haven’t already.", "datePublished": "2023-02-16T16:40:26-08:00", "url": "https://www.countynewscenter.com/covid-19-cases-rise-county-urges-people-to-get-vaccinated-boosted/", "keywords": ["health", "bivalent boosters", "coronavirus", "covid vaccinations", "covid-19"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-02-16T16:40:26-08:00", "articleType": "article", "articleContent": "\nCOVID-19 cases are slightly rising in San Diego County, prompting County health officials to continue calls for people to complete their vaccination series and get bivalent boosters if they haven’t already.\n“The best way for people to protect themselves, their loved ones and friends from possibly getting seriously ill or dying from COVID-19 continues to be getting up to date with your vaccinations and get a bivalent booster,” said County Deputy Public Health Officer, Dr. Cameron Kaiser, M.D., M.P.H. “Even though COVID-19 cases are far below historic highs, the virus is still widespread. And it remains a potentially deadly threat for many people.”\nStudies continue to report the bivalent COVID-19 boosters add protection against new COVID-19 variants that make up most new cases in the San Diego County, and they protect against COVID-19 causing hospitalizations and deaths.\nThe Centers for Disease Control and Prevention (CDC) and California Department of Public Health (CDPH) recommend a bivalent booster for everyone six months of age and older. Previous CDC studies have reported that people who have not been vaccinated run much higher risks of dying from COVID-19 than those who have been vaccinated.\nBoth COVID-19 vaccinations and treatment remain widely available throughout San Diego County. COVID-19 primary series vaccines and bivalent boosters, as well as flu vaccines, are available at local pharmacies, medical providers’ offices, and County vaccination sites. People can check online for the days and hours sites are open.\nPreventive Measures   \nIn addition to getting vaccinations and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19 and other seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often.\nStaying away from sick people.\nWearing a facial covering, especially in crowded indoor settings.\nRegularly cleaning commonly touched surfaces.\nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County’s COVID-19 testing webpage.\n\nCOVID-19 Vaccination Progress \n\nMore than 2.69 million or 80.6% of San Diegans have received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 572,085 or 22.8% of 2,514,110 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators.\nCOVID-19 Data \nFor the week ending Feb. 11, 2023, the report shows:\n\n1,916 COVID-19 cases were reported to the County in the past seven days. The region’s total is now 981,076.\nThe 1,916 cases reported in the past week were higher compared to the 1,755 infections identified the previous week.\nFourteen additional deaths were reported in the week ending Feb. 11, 2023. The region’s total is 5,759.\nTen of the people who died were 65 or older.\nNine of the people had been vaccinated and five were unvaccinated or had not completed the primary vaccine series.\nAll 14 had underlying medical conditions.\n\nInfluenza Data \nFor the week ending Feb. 11, 2023, the report shows the following:\n\nNo additional flu deaths were reported; the season’s total is 40.\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 3% the previous week).\nLab-confirmed influenza cases for the week: 59 (compared to 77 the previous week).\nTotal lab-confirmed cases to date: 20,869 (compared to 1,549 at the same time last season and a 7,852 prior 5-year average during the same week).\n\nMore Information\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230216.16.40.26"}