{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Southeastern Live Well Center Wins National Award", "description": "The County’s Southeastern Live Well Center (SELWC) has been named the Best of the Best by a national engineering and construction journal.  After a nearly yearlong review of 800 contenders nationwide, the Southeastern Live Well Center was named the best construction project in 2024 and highlighted by the editors of Engineering News-Record (ENR). ", "datePublished": "2025-04-08T10:49:11-07:00", "url": "https://www.countynewscenter.com/southeastern-live-well-center-wins-national-award/", "keywords": ["health", "best of the best", "community", "engagement", "excellence", "innovation", "project of the year", "selwc", "trauma informed"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-04-08T13:47:00-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Southeastern Live Well Center (SELWC) has been named the Best of the Best by a national engineering and construction journal. \nAfter a nearly yearlong review of 800 contenders nationwide, the Southeastern Live Well Center was named the best construction project in 2024 and highlighted by the editors of Engineering News-Record (ENR). \nThe publication says the SELWC secured National Project of the Year honors for excellence in U.S. design and construction as well as fostering innovation, safety culture and community impact. A panel of 100 construction industry members judged the entries and after several elimination rounds, the SELWC was awarded first-place win.  \nThe Live Well Center had previously been honored by ENR prior to being announced as best of the best in their Western Region, and then in the nation-wide Government Category. The Award of Excellence gala and award presentation was held in New York City on March 27.  \n“Our experience with the Southeastern Live Well Center has reshaped the way we approach new building development here at the County,” said Marko Medved, Director of County General Services. “The community helped shape this facility from start to finish and we are so proud of the final product.”  \nThe Best of the Best win put the SELWC on the cover of ENR’s March 2025 national publication along with a feature write up inside the magazine and online.   \n       \nThe $63.5 million project was praised for acknowledging the socioeconomically diverse and historically marginalized community the facility serves and the meaningful involvement of community members in every step of development. \n“There was a lot of initial distrust of the county in the community,” said Medved. “We had to make personal connections and stand behind our commitments, truly integrating them into the process.” \nThe SELWC also received top marks for its energy saving efficiency, trauma informed design, expansive open spaces and lots of bright light from large windows and skylights. The project’s warm colors and numerous public art pieces inside and outside the building were also celebrated for creating a sense of comfort, healing and belonging.  \nAdditionally, the County’s dedication to community engagement helped secure the SELWC’s first place win. For the first time in a County development, the design-build team committed to hiring contractors from surrounding zip codes, spending $8 million via local community firms. Ultimately, 14 percent of the SELWC workforce lived in the community, nearly tripling the initial 5 percent goal. \nInformation is available online about the SELWC and the services available to the public. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250408.10.49.11"}