{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Poll Workers Needed for June 7 Gubernatorial Primary", "description": "The Registrar of Voters is seeking poll workers for the June 7 Gubernatorial Primary Election. Poll workers play an essential role in elections and can serve their community while earning $15 per hour.", "datePublished": "2022-04-21T12:00:19-07:00", "url": "https://www.countynewscenter.com/?p=208237", "keywords": ["elections", "fgg", "june 7 gubernatorial primary election", "poll workers needed", "registrar of voters", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-04-21T12:12:30-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters is seeking poll workers for the June 7 Gubernatorial Primary Election. Poll workers play an essential role in elections and can serve their community while earning $15 per hour.\nWith the introduction of the Voter’s Choice Act, voter centers replace traditional polling places. Vote centers are open throughout the county for an extended period before Election Day. Rather than a single day of service, poll workers are now needed to staff vote centers up to 11 days in the two weeks before Election Day.\nEnglish speakers who are bilingual in Spanish, Filipino, Vietnamese or Chinese are also needed.\nResponsibilities include:\n\nSubmitting hiring/payroll paperwork\nAttending a two-day, paid poll worker training\nOpening/closing a vote center\nProcessing voters\nAnswering voter questions\n\nTo become a poll worker, applicants must be 18 years old, a U.S citizen and registered to vote in California, or lawfully admitted for permanent residence in the United States. Applicants must also provide their own transportation to their assigned vote center.\nThe Registrar is seeking people who are team players, exhibit strong leadership and customer service skills, and display flexibility, patience and the highest level of integrity at all times. Poll workers must represent the Registrar of Voters in a professional, nonpartisan manner.\nThe Registrar’s office is working with Public Health Services to ensure the health and safety of election workers and voters. Recommended personal protective equipment and sanitation supplies will be provided to workers so they can conduct the election process safely.\nApplications are available online. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220421.12.00.19"}