{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Urges Unvaccinated to Ask Questions of Their Doctor", "description": "The County of San Diego Health and Human Services Agency is urging unvaccinated San Diegans who are hesitant or have questions about the vaccine to talk with their doctor and get vaccinated as soon as possible.", "datePublished": "2021-07-09T16:57:44-07:00", "url": "https://www.countynewscenter.com/county-urges-unvaccinated-to-ask-questions-of-their-doctor/", "keywords": ["health", "coronavirus", "covid-19", "delta variant"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-07-09T16:57:44-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is urging San Diegans unvaccinated for COVID-19 and who are hesitant or have questions about the vaccine to talk with their doctor and get vaccinated as soon as possible.\nThe more contagious delta variant of the virus is on the rise in San Diego County and is expected to become the dominant strain by next month. To date, 54 cases of the delta variant have been identified in the county and 49 of them were in unvaccinated or not yet fully vaccinated San Diegans.\nAlong with the unvaccinated, people who have not completed two doses of the Pfizer or Moderna vaccine are not adequately protected against more contagious variants. Approximately 140,000 San Diegans are overdue for their second shot.\n“One shot of the vaccine is not enough to protect people against this very contagious strain of the virus,” said Eric McDonald, M.D., M.P.H., County Chief Medical Officer. “Shot number two makes the difference when it comes to the delta variant, and I urge San Diegans who are overdue for their second dose to complete the series as soon as possible.”\nSince COVID-19 vaccines became widely available in the county, the vast majority of cases, hospitalizations and deaths have been in unvaccinated San Diegans. From March 1 through July 6, 95 percent of COVID-19 cases, 98 percent of hospitalizations and 96 percent of deaths were in San Diegans who had not been fully vaccinated.\nCounty health officials re-emphasized Friday that vaccines are safe, effective and free.\nDr. Hans Crumpler is a medical doctor with SharpCare in eastern San Diego County, where vaccine uptake is lower compared to the other parts of the region. Crumpler, who was infected with the virus himself and has seen the negative impact of the virus on his patients, regularly counsels those who are vaccine hesitant.\n“The devastation this virus causes is preventable and everyone who is able to get the vaccine should get it as promptly as they can,” Crumpler said. “I beg you, please get your vaccine, come to your provider, ask questions if you have doubts, fear or hesitations. We’re here to help educate you.”\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210709.16.57.44"}