{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Boosters Highly Encouraged for All Eligible San Diegans", "description": "With masks coming off indoors in many public places for fully vaccinated people, County health officials are urging all eligible San Diegans to get all the recommended COVID-19 doses, including the additional and booster shots.", "datePublished": "2022-02-16T16:42:40-08:00", "url": "https://www.countynewscenter.com/covid-19-boosters-highly-encouraged-for-all-eligible-san-diegans/", "keywords": ["health", "additional doses", "boosters", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-02-16T17:24:34-08:00", "articleType": "article", "articleContent": "\nWith masks coming off indoors in many public places for fully vaccinated people, County health officials are urging all eligible San Diegans to get all the recommended COVID-19 doses, including the additional dose and booster shot.\nResearch from the Centers for Disease Control and Prevention shows that COVID-19 vaccine boosters remain effective at preventing hospitalizations and very effective and preventing severe illness.\nAccording to the County Health and Human Services Agency, 1,616 hospitalizations were reported during the 30-day period between Jan. 4, 2022 and Feb. 2, 2022. Of those, 201 (12.4%) San Diegans who were boosted ended up in the hospital.\n“COVID-19 vaccine additional doses and boosters offer protection against the Omicron variant, prevent serious illness in most people and keep people out of the hospital,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “San Diegans should get all the recommended vaccine doses as soon as they are eligible.”\nAn additional shot is recommended for people ages 5 and up who are moderately and severely immunocompromised. COVID-19 vaccine boosters are available for fully vaccinated people ages 12 and up.\nThe Centers for Disease Control and Prevention (CDC) now recommends an additional dose for moderately and severely immunocompromised individuals three months after the primary dose.  For boosters, the CDC recommends people receive a Pfizer or Moderna booster shot five months after their primary series. A Johnson & Johnson booster is recommended two months after the first dose.\nPfizer boosters have been approved for everyone age 12 and older. Moderna and Johnson & Johnson boosters are available only for adults 18 years and older.\nAn additional dose for immunocompromised people is recommended to be given 28 days after the second dose—Pfizer is available for everyone ages 5 and up and Moderna for just adults 18 and older. Individuals in this category are also eligible for a booster dose 2 or 3 months after their last primary dose depending on the type of vaccine they received initially.\nLocally, a total of 1,131,912 or 53.7% of the 2,107,394 San Diegans who are fully vaccinated have received a booster. That means 975,482 are due for a booster.\nWhere COVID-19 Vaccines Are Available\nThe region has plenty of COVID-19 vaccines and booster doses. The county has more than 400 vaccination sites including pharmacies, medical providers, clinics, and County locations. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nDoses administered: More than 6.78 million.\nReceived at least one shot: Over 2.90 million or 92.3% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.55 million or 81.1%.\nBoosters administered: 1,131,912 or 53.7% of 2,107,934 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n93 new deaths were reported since the last report on Feb. 9, 2022. The region’s total is 4,947.\n54 men and 39 women died between Dec. 30, 2021 and Feb. 14, 2022.\n37 were age 80 or older, 26 were in their 70s, 15 were in their 60s, nine were in their 50s, four were in their 40s, one was in their 30s and one was in their 20s.\n27 of the people who died were fully vaccinated and 66 were not fully vaccinated.\n86 had underlying medical conditions, one did not and six had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n970 COVID-19 cases were reported to the County on Feb. 15, 2022. The region’s total is now 728,287.\n9,073 cases were reported in the past week (Feb. 9 through Feb. 15) compared to 16,257 infections identified the previous week (Feb. 2 through Feb. 8).\nDuring the 30-day period between Jan. 4, 2021 and Feb. 2, 2022, there were 1,616 COVID-19 hospitalizations; 904 people were not fully vaccinated, 511 were fully vaccinated and 201 were fully vaccinated and boosted.\nSan Diego County’s case rate per 100,000 residents is 73.4 for people fully vaccinated and boosted, 106.1 for fully vaccinated people and 189.5 for not fully vaccinated San Diegans.\n9,386 tests were reported to the County on Feb. 13, 2022, and the percentage of new positive cases was 8.4%.\nThe 14-day rolling percentage of positive cases among tests reported through Feb. 13, 2022 is 9.5%.\n\nCommunity Setting Outbreaks:\n\n57 new community outbreaks were confirmed in the past seven days (Feb. 9, 2022 through Feb. 15, 2022): 24 in a TK-12th grade school setting, 14 in daycare/preschool/childcare settings, six emergency services settings, two in health care settings, two in faith-based settings, two in government settings, two in retail settings, one in a college/university setting, one in distribution warehouse setting, one in community-based organization, one in a business setting and one in an adult day care setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220216.16.42.40"}