{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mail Ballots Go Out to Registered Voters for Gubernatorial Recall Election", "description": "More than 1.9 million ballots are on their way to San Diego County registered voters for the Sept. 14 California Gubernatorial Recall Election. You may find yours in your mailbox as early as Monday, Aug. 16. You will also find your “I Voted” sticker inside your official mail ballot packet.", "datePublished": "2021-08-16T13:46:48-07:00", "url": "https://www.countynewscenter.com/mail-ballots-go-out-to-registered-voters-for-gubernatorial-recall-election/", "keywords": ["elections", "2021 recall election", "gubernatorial recall election", "rov"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-08-16T14:35:47-07:00", "articleType": "article", "articleContent": "\nMore than 1.9 million ballots are on their way to San Diego County registered voters for the Sept. 14 California Gubernatorial Recall Election. You may find yours in your mailbox as early as Monday, Aug. 16. You will also find your “I Voted” sticker inside your official mail ballot packet.\nEarly voting is also underway at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar urges voters to take advantage of the convenience of voting by mail.\n“We encourage voters to act early and vote from the comfort of their home,” said Interim Registrar of Voters Cynthia Paes. “Sign, seal, and return your mail ballot to a trusted source. The sooner we receive your ballot, the sooner we can start processing it so it will be counted right when the polls close at 8 p.m. on election night.”\nYou can return your marked ballot in the pre-paid postage envelope to any U.S. Postal Service office or collection box. Voters who return their mail ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nStarting Tuesday, Aug. 17, you’ll also have the option of dropping off your ballot at one of 131 mail ballot drop-off locations around the county.\nIn-person voting locations\nIn addition to mail ballots, 221 in-person voting locations will be open across the county for four days, Saturday, Sept. 11 – Tuesday, Sept. 14. Take advantage of early voting:\n\nNow, at the Registrar’s office 8 a.m. to 5 p.m., Monday through Friday\nAt a voting location near you or the Registrar’s office Saturday, Sept. 11 through Monday, Sept. 13, 8 a.m. to 5 p.m.\n\nAll again will be open on Election Day, Sept. 14, when hours change to 7 a.m. to 8 p.m.\nThis election, all in-person voters will mark their ballot on a ballot marking device. This device does not store, tabulate or count any votes. After the voter confirms their selection on the device, the voter will print their ballot, review it, and place it in the ballot box to be counted at the Registrar’s office election night.\nWhy are we having a recall election?  The recall process allows voters to decide whether to remove elected public officials from office before their term is over. California is one of 19 states that allows any elected official to be recalled from office.\nThe ballot will ask voters two questions:\n1) Do you want to recall the governor?\n2) If recalled, who do you want to replace him?\nYou can vote on either one or both parts of the recall ballot. If more than 50% of voters vote to recall the governor, then the replacement candidate with the most votes would be elected.\nTo learn more about voting in the gubernatorial recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210816.13.46.48"}