{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Leadership in Health and Human Services Inspires Next Generation", "description": "San Diego State University students and alumni had the opportunity to learn about careers in health and human services directly from experts with the County’s Health and Human Services Agency at a 3-day career fair.", "datePublished": "2025-03-28T16:05:18-07:00", "url": "https://www.countynewscenter.com/county-leadership-in-health-and-human-services-inspires-next-generation/", "keywords": ["health", "behavioral health", "careers week", "health and human services", "live well center for innovation and leadership", "lwcil", "public health", "sdsu"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-03-28T16:05:18-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesSan Diego State University students and alumni had the opportunity to learn about careers in health and human services directly from experts with the County’s Health and Human Services Agency at a 3-day career fair. The event was held this week to inspire students and alumni to pursue careers in public service.   \nThe career fair offered on-campus workshops, networking opportunities, and one-on-one access to leadership in the County’s Health and Human Services Agency. Several County executives, all SDSU grads, shared their personal career journey and described how their experiences at the County shaped them professionally. \n“It is always exciting and inspiring to see the next generation of students who are passionate about public service,” said County Health and Human Services Director, Kimberly Giardina. “SDSU provides ideal candidates who live in San Diego and have personal connections to the communities and residents we serve.”\n                \nThe County of San Diego and the Live Well Center for Innovation and Leadership, worked in partnership with SDSU’s College of Health and Human Services to host the inaugural event.  \nThis collaboration between the County and the university started in 2022, sharing resources and expertise to develop students for impactful careers. It serves as a pipeline to connect students to jobs and strengthen the link between academia and practice. The partnership also helps San Diego retain local talent and build a diverse, competent and engaged health and human services workforce. \nNicole Magnuson is the Director of the Live Well Center for Innovation and Leadership. She is happy to see so many SDSU students go on to meaningful careers with the County, as well as other benefits of the program. \n“Besides providing fulfilling careers, we collaborate on research and service that contributes to a healthy, equitable, safe and thriving region.” said Magnuson. \nLearn more about the Live Well Center for Innovation and Leadership.\n           \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250328.16.05.18"}