{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Website Helps Residents Locate, Schedule COVID-19 Testing", "description": "The County has launched a new website that will make it easier for San Diegans to get a COVID-19 test.", "datePublished": "2020-06-12T17:51:10-07:00", "url": "https://www.countynewscenter.com/new-county-website-helps-residents-locate-schedule-covid-19-testing/", "keywords": ["health", "business reopening", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-06-23T10:11:02-07:00", "articleType": "article", "articleContent": "\nThe County has launched a new website that will make it easier for San Diegans to get a COVID-19 test. You can choose a site by location or day and make an appointment online.\nThe test sites listed on the page prioritize San Diegans who do not have health insurance or cannot access a test site offered by their health care provider. Insurance carriers must cover COVID-19 tests at no cost to their members, even if the person seeking the test is not showing symptoms.\nNew East County Test Site\nStarting Monday, the County and Sycuan will open a new public testing location at the Sycuan Recreational Center, 5577 Dehesa Road, El Cajon, 92019.\nThe free drive-up tests are being provided by specially trained first responders from the Sycuan Fire Department. Testing will take place Monday through Thursday between 8 a.m. and 4 p.m. Anyone who wants to get tested is asked to schedule an appointment through the County’s new online system or by calling 2-1-1.\nThe partnership expands public COVID-19 testing options in the East County.\n“I greatly appreciate the collaboration between the leadership at Sycuan and the County public health team,” said Supervisor Dianne Jacob. “This is a great example of two governments coming together to put public safety first.”\nCAL FIRE and the San Diego County Fire Authority teamed up to train the Sycuan Emergency Medical Services team, which will administer the tests. The testing supplies will be provided by the County Public Health Lab.\n“Sycuan is proud to partner with San Diego County Health and Human Services Agency in proactively addressing the public health needs of our tribal members and team members,” said chairman Cody Martinez, Sycuan Band of the Kumeyaay Nation. “We are well positioned to assist in outreach to Native Americans as well as frontline essential employees, public safety and fire personnel through the East County, as well as our team members.”\nNo Appointment Testing\nFor those seeking same-day testing without an appointment, the County is offering an additional COVID-19 test site at South Bay Urgent Care at 1628 Palm Avenue.\nLocated in the city of San Diego, near its border with Imperial Beach, the clinic is offering drive-up testing Monday through Friday from 9 a.m. to 8 p.m., and Saturday and Sunday from 10 a.m. to 6 p.m. While tests are typically covered by insurance, the County is supplying up to 20 tests per day to cover County residents who do not have insurance.\nNail Salons, Tattoo Parlors Next to Reopen\nThe state provided guidance for several additional businesses that can reopen, with restrictions, as early as Friday, June 19:\n\nPersonal care\nNail salons\nMassage parlors\nAestheticians\nTattoo and piercing shops\n\nThe business owners need to follow state guidance and complete the County’s Safe Reopening Plan.\n“As more businesses reopen and activities increase, the County must continue to be vigilant and utilize all the strategies available to us to decrease the spread of COVID-19,” said Wilma J. Wooten, M.D., M.P.H, County public health officer. “Every one of us has a role and can take action to make a difference in curbing COVID-19.”\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n6,384 tests were reported to the County since yesterday and 132 or 2% were positive.\nThe 14-day, rolling average percentage of positive tests is 3.0%.\n\nCases:\n\n132 new cases were reported for a San Diego County total of 9,130.\n1,489 or 16.3% of the total cases have required hospitalization.\n421 or 4.6% of all cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSix new COVID-19 deaths were reported today, bringing the region’s total deaths to 313. One death that was previously reported was of non-County resident and has been removed from the total.\nTwo women and four men died\nTheir ages ranged from 69 to 101.\nAll had underlying medical conditions.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200612.17.51.10"}