{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Lived Experience as a Job Qualification", "description": "The County recently teamed up with the San Diego Workforce Partnership to hold a job fair for people who have a history of incarceration. ", "datePublished": "2024-09-20T15:29:50-07:00", "url": "https://www.countynewscenter.com/lived-experience-as-a-job-qualification/", "keywords": ["public safety", "alternatives to incarceration", "behavioral health", "hhsa", "probation", "psg", "public defender s office", "san diego sheriff s department"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-09-20T15:29:50-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County recently teamed up with the San Diego Workforce Partnership to hold a job fair for people who have a history of incarceration.\nServing time in jail, drug or alcohol use or mental health challenges may not sound like something that a job applicant would highlight. But in the peer support field, that background is called lived experience and is considered an asset, when paired with specialized training to help people who struggle with similar challenges.\nA panel of local peer support specialists spoke about their personal stories, training, and the important work they do before an audience of jobseekers at the Southeastern Live Well Center in San Diego. The panel was part of an all-day event under the County’s Alternatives to Incarceration initiative, which focuses on strengthening the community-based programs that help prevent people from entering or returning to jail.\nPeer specialists work alongside medical professionals and clinicians and others, because often the ability to talk to someone who has a similar background resounds with a patient more than a doctor or professional counselor.\nPanelist Kenneth Anderson, said the training he received not only helped him with his work in peer support, but it also changed his life. He said the training helped him to be a better person and a better father because it taught him how to talk to his son about mental health in a language that he understood.\nAccording to a 2022 San Diego Behavioral Health Workforce Report done by the San Diego Workforce Partnership, San Diego County faces a significant shortage of behavioral health workers. They estimate more than 5,700 community health workers, social service assistants and peer support specialists will be needed by 2027.\nPeer support certification is available in California and includes specialized training such as peer services for the unhoused, justice-involved, crisis care, and for family members. The San Diego Workforce Partnership offers a no-cost pathway to a position as a certified peer support specialist in the San Diego behavioral health and social service community for people who meet certain qualifications.\nThe County Public Defender’s Office, Sheriff’s Department and Health and Human Services Agency also spoke about how they use peer support in their organizations to inspire and assist people in jail or reentering the community. An employer panel with representatives from local organizations who hire peer support specialists shared the characteristics they look for in peer support applicants. Participants also had the opportunity to bring their resumes for review, practice job interviews, and talk to several local programs that are currently hiring peers.\nThe field of peer support is growing. Peer support is used in clinical settings such as hospitals or behavioral health treatment programs, social services helping people access resources and navigating systems such as housing, employment and community services; community and outreach providing support and resources in non-clinical settings; mobile crisis response for urgent mental health situations helping with support and stabilization;  online/remote work through digital platforms like support groups or individual sessions, and increasingly criminal justice agencies such as Public Defender or Probation Departments.\nAgner Medrano, who has worked in peer support for 20 years, said it’s about caring. He is a former gang member and a pastor with the Victory Outreach church.\n“Do it from your heart because if you don’t, the clients see right through it. They say real recognizes real,” Medrano said. “Being invited to a graduation, seeing a family healed and continuing with their lives – to me, that is our paycheck, not what we get every two weeks. It’s seeing an individual change their life.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240920.15.29.50"}