{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccines Recommended for Students Going Back to School", "description": "Local students are back or will soon be heading back to school, and County health officials are encouraging parents to make sure they get the recommended COVID-19 vaccines to prevent the spread of the virus.", "datePublished": "2022-08-25T17:40:41-07:00", "url": "https://www.countynewscenter.com/?p=209307", "keywords": ["health", "coronavirus", "covid vaccinations", "covid-19", "vaccinations children and vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-08-25T17:43:49-07:00", "articleType": "article", "articleContent": "\nLocal students are back or will soon be heading back to school, and County health officials are encouraging parents to make sure they get the recommended COVID-19 vaccines to prevent the spread of the virus.\nThe most recent data from the County Health and Human Services Agency shows the percentage of local children who have received one dose of a COVID-19 vaccine:\n\n9.1% of children between 6 months and 4 years of age\n47.3% of children between 5 and 11 years old\n85.5% of children between 12 and 17 years of age\n\nIn comparison, 89.5% of San Diegans between 18 and 64 years old have received at least one COVID-19 dose. The percentage is even higher for people over 65 years of age: 99.9%.\n“Children should be vaccinated to protect themselves and those around them from COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “While it’s true that the virus has not been as severe in children, they can still develop serious complications from COVID-19.”\nThe COVID-19 vaccine is recommended for everyone 6 months and older. Vaccine supplies remain plentiful, both for those seeking initial doses and those eligible for boosters. People can get vaccinated or a booster through their medical provider, a retail pharmacy or a site operated by the County. Additional booster eligibility details are at coronavirus-sd.com.\nVaccination Progress:\n\nReceived at least one shot: More than 3.01 million or 90.1% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: More than 2.66 million or 79.7%.\nBoosters administered: 1,442,309 or 58.9% of 2,447,274 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nEight additional deaths were reported since the last report on Aug. 18, 2022. The region’s total is 5,456.\nOf the eight additional deaths, one was a woman and seven were men. They died between Jan. 5, 2022 and Aug. 16, 2022; seven deaths occurred in the past two weeks.\nFive of the people who died were 80 years or older, one was in their 70s, one was in their 60s and one was in their 40s.\nSix were fully vaccinated and two were not.\nSeven had underlying medical conditions and one did not.\n\nCases, Case Rates and Testing:\n\n1,961 COVID-19 cases were reported to the County in the past three days (Aug. 22 to Aug. 24, 2022). The region’s total is now 908,654.\n4,744 cases were reported in the past week (Aug. 18 through Aug. 24) compared to 5,285 infections identified the previous week (Aug. 11 through Aug. 17).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 32.10 for people fully vaccinated and boosted, 22.32 for fully vaccinated people and 67.19 for not fully vaccinated San Diegans.\n7,920 tests were reported to the County on Aug. 20, and the percentage of new positive cases was 8.2% (Data through Aug. 20).\nThe 14-day rolling percentage of positive cases, among tests reported through Aug. 20, is 9.1%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220825.17.40.41"}