{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Health Officials Report Increase in Whooping Cough", "description": "Increasing cases of pertussis, also known as whooping cough, have County health officials recommending that people get vaccinated, particularly those most at risk of becoming seriously ill. ", "datePublished": "2023-11-29T11:03:08-08:00", "url": "https://www.countynewscenter.com/county-health-officials-report-increase-in-whooping-cough/", "keywords": ["health", "pertussis", "whooping cough"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-11-29T11:03:08-08:00", "articleType": "article", "articleContent": "\nIncreasing cases of pertussis, also known as whooping cough, have County health officials recommending that people get vaccinated, particularly those most at risk of becoming seriously ill. \nThe number of pertussis illnesses jumped from 12 in September to 57 in October. Spikes in pertussis happen every three to five years.  The last peak was in 2017.  The current rise in illness reports is the first since the COVID-19 pandemic when COVID-19 prevention steps also kept pertussis down.   \n“We’re seeing pertussis spreading in rates similar to before the pandemic,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “This is concerning because we know that post-pandemic, many people are experiencing vaccine fatigue. Yet what we have learned over the last several years is that vaccines, hand washing, masking and other precautions help curb the spread of illness.” \nPregnant women and people who come into close contact with young infants are strongly urged to be vaccinated. Newborns are especially susceptible to pertussis since they are too young to be fully vaccinated. The last pertussis death in the County was a 5-week-old San Diego infant who died in July 2016. \nA typical case of pertussis starts with a cough and runny nose for one to two weeks, followed by weeks to months of rapid coughing fits that sometimes end with a whooping sound. Fever, if present, is usually mild. Antibiotics can lessen the severity of symptoms and prevent the spread of disease to others. \nThe Centers for Disease Control and Prevention recommends the following schedule for the Tdap vaccination that helps protect people from pertussis: \n\nA Tdap booster is recommended for pregnant women early in their third trimester and during each pregnancy to protect their newborns.  \nYoung children need five doses of DTaP by kindergarten: at 2 months, 4 months, 6 months, 15 to 18 months and 4 to 6 years. \nAfter that, the first Tdap booster is due at age 11 years. All students entering 7th grade are required to have proof of a whooping cough booster immunization (Tdap).\nOne dose of Tdap is recommended for adults 19 years of age and older who did not get Tdap as a teenager. \nAfter that, getting Tdap instead of the standard tetanus shot (Td) every 10 years will also reduce infections.  \n\nParents can obtain the DTaP vaccine series and the Tdap booster shot for their children and themselves through their primary care physicians. Local retail pharmacies offer vaccinations for a fee, and anyone who is not covered by a medical insurance plan can get the shot from a County Public Health Center at minimal or no cost. \nFor more information about whooping cough and ongoing vaccination clinics, call the County’s Immunization Branch at (866) 358-2966, or visit: Immunization Program (sandiegocounty.gov).\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231129.11.03.08"}