{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Senior Affordable Housing Opens in South Bay", "description": "A new community of 73 apartment homes for seniors experiencing homelessness, or at risk of becoming homeless, celebrated a grand opening in South Bay today.", "datePublished": "2024-04-04T16:52:30-07:00", "url": "https://www.countynewscenter.com/new-senior-affordable-housing-opens-in-south-bay/", "keywords": ["health", "affordable housing", "low income", "no place like home", "senior housing", "south bay"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-04-04T16:52:30-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA new community of 73 apartment homes for seniors experiencing homelessness, or at risk of becoming homeless, celebrated a grand opening in South Bay today.\nNestor Senior Village features studio apartments for older adults, 55 years and up, who are making 30-percent or less of the area median income. About half of the apartments are reserved for people in need of mental health services through the County’s No Place Like Home program.\nA National CORE development, Nestor Senior Village was built on surplus land owned by the Nestor United Methodist Church, one of the oldest churches in San Diego with a long history of providing support for unhoused San Diegans. Residents share onsite amenities with the church including outdoor recreation space and a food pantry. Nestor Senior Village also has a courtyard with outdoor seating, a community room, a laundry room, private offices for case management and 34 parking spots.\nMore information about the project is available here.\n“San Diego’s high cost of housing has resulted in a growing number of seniors experiencing homelessness,” said David Estrella, director of the County’s Housing and Community Development Services department. “Investments and partnerships like this are a critical part of the County’s commitment to provide the housing, and stability it can bring, to our most vulnerable older adults.”\nNestor Senior Village is within walking distance to grocery stores and pharmacies, a park, and the Nestor Community Health Center. It is also directly adjacent to two bus stops and the trolley.\nSince 2017, the County has invested more than $305 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund, and over 2,100 units have opened. There are an additional 3,286 units on the way.\nWhen all the developments in the pipeline are complete, the total number of affordable units supported by the County will reach over 9,500. This is expected to provide homes to nearly 21,000 people.\nThe development plans align with the County’s Housing Blueprint, the County’s guide and ongoing response to the regional housing crisis.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240404.16.52.30"}