{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "No COVID-19 Deaths Reported Today; Cases Jump to 1,404", "description": "For the first time in over a week, no COVID-19 deaths were reported in San Diego yesterday, but cases jumped to over 1,400, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-06T16:00:03-07:00", "url": "https://www.countynewscenter.com/no-covid-19-deaths-reported-cases-jump-to-1404/", "keywords": ["health", "coronavirus", "covid-19", "ethnic background"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-11T08:50:51-07:00", "articleType": "article", "articleContent": "\nFor the first time in over a week, no COVID-19 deaths were reported in San Diego yesterday, but cases jumped to over 1,400, the County Health and Human Services Agency announced today.\nThe number of local COVID-19 deaths remains at 19 and the age range is between 25 and 98 years of age. Fifteen people who have died were men and four were women.\n“While we’re happy to see no deaths reported in the past day, it does not mean we won’t see additional COVID-19 fatalities. Deaths are often a lagging indicator,” said Eric McDonald, M.D., M.P.H., medical director of the County Epidemiology and Immunization Services branch. “The most effective way to keep people from getting the virus and to prevent potential deaths is by staying home and wearing a face covering while in public conducting essential activities.”\nHomemade masks, bandanas, scarves and neck gaiters are acceptable, since these items can be washed and reused. Facial coverings don’t need to be used when people are at home. First 5 San Diego compiled a list of guides for making your own covering.\nCOVID-19 Cases Increase to 1,404\nThrough April 6, a total of 1,404 COVID-19 cases have been reported in San Diego County, including 78 new cases in the last day.\nOf San Diego County’s cases, 739 (52.6%) were men and 657 (46.8%) were women. The gender of eight people is unknown. Of the known cases, 269 (19.2%) have required hospitalization and 102 (7.3%) of the total number of cases had to be placed in intensive care.\nStarting today, the County began reporting the ethnic breakdown of COVID-19 cases. Of the 1,404 cases reported today, 405 (29%) did not indicate an ethnic background. Of the 999 remaining cases, the ethnic breakdown is as follows:\n\n49% White\n31% Hispanic\n10% Asian\n6% African American\n4% Other\n\n\nCounty officials also talked about other measures and resources to deal with COVID-19. To date:\n\nMore than 18,000 tests have been administered to San Diegans, including 827 tests reported April 5.\nThe County has distributed over 1.7 million personal protective equipment items to local health care providers, including over 694,000 N-95 respirators, nearly 337,000 surgical face masks and more than 673,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,585 rooms for County Public Health Services use, 159 are occupied by 165 guests.\nOf the 441 rooms assigned to the Regional Task Force on the Homeless, 188 are being occupied by 312 people who are at higher risk of developing complications from COVID-19.\n\nStay Connected to Seniors\nDuring the COVID-19 pandemic, we are required to stay physically distant, but this does not mean we can’t be socially connected.\nDuring physical distancing, seniors could feel more isolated than ever. Here’s how you can help:\n\nCheck on your elderly neighbors, family and friends.\nYou can reach out to a handful of neighbors to see if they need anything.\nVolunteer to go buy their groceries and supplies.\nShow seniors how to use video chat to talk to others using smartphones, laptops or tablets.\nDo a phone or text chain which may work better for older adults unfamiliar with video chatting apps.\nWrite simple messages and leave them at their door or mailbox.\n\nIt is important for older adults to remain connected and active. The County’s Live Well at Home webpage we have a link specifically for Seniors and Older Adults which offers our popular “Feeling Fit” videos, which is an exercise program for older adults that you can do at home, even if you have limited mobility. That page will also link you to San Diego Oasis, which offers a “Morning Meditations with Merry” class on Tuesday and Thursday mornings to practice mindfulness and connection.\nIf you or someone you know is feeling depressed and isolated, please call the County’s Access and Crisis Line at 1-888-724-7240 to speak with an experienced counselor, who can also provide you with a referral to meet your needs and help determine eligibility.\nHome-Delivered Meals for Seniors\nLow-income adults 60 and older who are homebound due to illness or disability may request to have meals delivered to them if they are registered with a County of San Diego nutrition provider that offers this service.\nAll eligible seniors who were previously attending a congregate dining site now can pick up a “to-go” meal or request a home-delivered meal to ensure continued access to food. To be connected to this service you can call 1-800-339-4661.\nThrough additional delivery routes and new volunteer staff, senior nutrition providers have nearly doubled the amount of daily home delivered meals served throughout San Diego.\nThirteen Community Emergency Response Team volunteers from around the County have assisted Feeding San Diego and the San Diego Food Bank with 4 large scale food distribution events. This partnership resulted in over 3,700 families in need receiving food during these events.\nFor more information about home-delivered meals or nutrition services supported by the County of San Diego, contact the program via email or call 800-339-4661. You can always call 2-1-1 to get connected to resources in your area.\nThe County’s COVID-19 webpage now contains a graph showing new positive cases and total cases reported by date. The data will also be broken down by ethnic group. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200406.16.00.03"}