{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pinwheels for Child Abuse Prevention", "description": "A garden of pinwheels was created today on the lawn of the County Waterfront Park as a tribute to children impacted by abuse and neglect.  ", "datePublished": "2025-04-29T16:48:31-07:00", "url": "https://www.countynewscenter.com/pinwheels-for-child-abuse-prevention/", "keywords": ["health", "child abuse prevention month", "child and family well-being", "child neglect", "pinwheels", "promises2kids"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-04-29T16:48:31-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteA garden of pinwheels was created today on the lawn of the County Waterfront Park as a tribute to children impacted by abuse and neglect.  \nThe pinwheels are planted each April in recognition of National Child Abuse Prevention Month, a time each year to raise awareness about protecting children and supporting families before a crisis situation arises.  \nCounty Supervisor Joel Anderson, Promises2Kids and the County’s Child and Family Well Being Department teamed up for a presentation that encouraged everyone to get involved and be part of the solution to help protect children. Families thrive when they are surrounded by a connected community. \nThis past fiscal year, San Diego’s Child Abuse Hotline received over 38,000 calls that led to nearly 19,000 investigations involving more than 36,000 children. Child abuse and neglect can cause long-term psychological, emotional, and physical effects that have lasting consequences for victims.   \nThe County’s Child and Family Well-Being Department is focused on lowering those numbers through early intervention and family-centered programs and services. By providing support, education and easy access to critical resources, families can stay together, and children can avoid entering the child welfare service system altogether.  \nProgress is being made.  \nChild abuse and neglect cases have decreased overall by 50 percent over the last decade while entries into foster care are down 67 percent. Both declines are a reflection of the positive impact of prevention efforts, early support and partnerships grounded in care and compassion. \nChild abuse and neglect are preventable. If you believe a child you know is experiencing abuse or neglect, help is a phone call away. Contact the County’s Child Abuse Hotline at 858-560-2191 or 800-344-6000. People also can call 2-1-1 San Diego.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250429.16.48.31"}