{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County and Prebys Foundation Join Forces to Help Local Artists, Support Art and Culture Sustainability", "description": "A new partnership will dramatically boost funding opportunities for local artists.", "datePublished": "2024-11-08T10:11:20-08:00", "url": "https://www.countynewscenter.com/county-and-prebys-foundation-join-forces-to-help-local-artists-support-art-and-culture-sustainability/", "keywords": ["government", "artists", "arts", "community enhancement grant", "county arts and culture commission", "culture sustainability", "economic development and government affairs", "fgg", "grant funding", "prebys"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-11-08T10:44:24-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA new partnership will dramatically boost funding opportunities for local artists.\nThe San Diego County Arts and Culture Commission and Office of Economic Development & Government Affairs in partnership with the Prebys Foundation are announcing a new matching grant program to boost funding for local arts and cultural projects.\nStarting Dec.1 and until Jan. 31, 2025, organizations applying for County Community Enhancement grants can receive dollar-for-dollar matching funds from the Prebys Foundation when hiring artists or cultural practitioners for their projects.\nThe foundation will provide $250,000 in matching funds for the $250,0000 available through the County’s Community Enhancement grants for a total of $500,000.\nGrant amounts to organizations will range from $2,500 to $5,000 and could be put toward murals, public art pieces for buildings, dance performances and more. When matched, the partnership will fund projects of $5,000 to $10,000.\n“This program effectively doubles the impact of arts funding in our community,” said County Director of Economic Development & Government Affairs Matthew Parr. “This partnership with the Prebys Foundation will really make a difference to artists and people who enjoy different forms of art and cultural events.”\n“Envisioning our county as a dynamic hub of arts and culture, we are excited to announce matching grants that will enhance the funding for artists across our region,” said Prebys Foundation CEO Grant Oliphant. “This initiative aims to help the County Arts and Culture Commission establish a vision that invests in artists in a sustained and meaningful way. We look forward to the thriving arts scene and strengthened partnerships that will result from this collaboration.”\nTo apply for funding, organizations can:\n\nVisit the County’s Community Enhancement Grant portal.\nCheck the designated box on your grant application to indicate interest.\nApply through Dec. 15.\n\nCurrent grant applicants will be automatically reviewed for eligibility.\nFor questions about the matching program, contact arts@sdcounty.ca.gov.\nThe San Diego County Arts and Culture Commission supports and sustains the growth and vitality of San Diego County’s diverse arts and culture communities.\nPrebys Foundation is the largest independent private foundation in San Diego County, a unique tri-national area encompassing communities from San Diego, Tijuana, and the Kumeyaay Nation. The foundation works to create an inclusive, equitable, and dynamic future for all San Diegans. For more information about the Prebys Foundation, visit prebysfdn.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241108.10.11.20"}