{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Votes to Buy, Conserve Historic Star Ranch Land in Campo", "description": "County supervisors have voted to buy the 2,151-acre, historic Star Ranch area in Campo, its largest acquisition of sensitive habitat, wetlands, potential passive park land and hiking trails in a decade.", "datePublished": "2021-03-17T16:32:23-07:00", "url": "https://www.countynewscenter.com/board-votes-to-buy-conserve-historic-star-ranch-land-in-campo/", "keywords": ["government", "habitat", "lueg", "multiple species conservation program", "parks", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-03-17T16:32:23-07:00", "articleType": "article", "articleContent": "\nSan Diego County supervisors voted Wednesday to buy the 2,151-acre, historic Star Ranch area in Campo, its largest acquisition of sensitive habitat, wetlands, potential passive park land and hiking trails in a decade.\nCounty officials said the land will provide a permanent home for sensitive species and conserve important habitat including 200 acres of wetlands, and it could eventually provide a large park and connections for hikers to nearby trails such as the Pacific Crest Trail.\nThe Board voted unanimously to buy the land for roughly $8.7 million, a figure that will be offset by a $1.28 million contribution from the U.S. Navy, which operates a training base nearby and needs to maintain a buffer around it to keep it isolated.\nThe ranch is located a mile north of the U.S.-Mexico border in Campo near State Route 94 and Buckman Springs Road, just north of the County Park’s Campo Stone Store Museum. The store itself is a historic landmark rebuilt in stone in 1875.\nCounty parks department officials said the land fits into the County’s future East County Multiple Species Conservation Plan area. They said the purchase will permanently protect its chaparral, wetland and riparian habitats that are home to animals including the coastal horned lizard, two-striped garter snake, Cooper’s hawk, white-tailed hawk and the federally protected least Bell’s vireo and arroyo toad. Because the land also connects to hundreds of acres of federal land managed by the Bureau of Land Management, its acquisition will also create important wildlife corridors for animals to travel.\nCounty officials said keeping the land from being developed will also contribute to the County’s drive to reduce greenhouse gas emissions by eliminating nearly 3,000 metric tons of emissions.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210317.16.32.23"}