{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Urges Public to Have a COVID-Safe Super Bowl Sunday", "description": "With Sunday’s big game on the horizon, the County is asking for the public’s help to prevent Super Bowl parties from becoming super spreader events.", "datePublished": "2021-02-04T18:53:27-08:00", "url": "https://www.countynewscenter.com/county-urges-public-to-have-a-covid-safe-super-bowl-sunday/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-02-05T09:44:13-08:00", "articleType": "article", "articleContent": "\nWith Sunday’s big game on the horizon, the County is asking for the public’s help to prevent Super Bowl parties from becoming super spreader events.\n“The safest way to gather and celebrate the Super Bowl is virtually, or with people you live with,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Local case numbers have been on a downward trend and we want to keep the region moving in the right direction toward the goal line.”\nSuggestions from the Centers for Disease Control and Prevention include decorating your home with your favorite team’s logo or colors, making appetizers and sharing recipes virtually with friends, and starting a text group to comment on the game or the halftime show.\nVaccination Eligibility\nWhile the state includes medicinal cannabis industry employees in Phase 1A, the County has made a decision to include this group in Phase 1B, Tier 1 Food and Agriculture for growing, production, storage, transport and distribution. References to cannabis workers being eligible for vaccination have been removed from the County’s vaccination website.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 42.5 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 10.5%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 14% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 9.\n\nCommunity Setting Outbreaks:\n\n11 community outbreaks were confirmed Feb. 3: six in business settings, two in faith-based settings, two in government settings and one in a healthcare setting.\nIn the past seven days (Jan. 28 through Feb. 3), 63 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n21,594 tests were reported to the County on Feb. 3, and the percentage of new positive cases was 7%.\nThe 14-day rolling average percentage of positive cases is 7.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 19,116.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n1,598 cases were reported to the County on Feb. 3. The region’s total is now 242,616.\n10,459 or 4.3% of all cases have required hospitalization.\n1,477 or 0.6% of all cases and 14.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n55 new COVID-19 deaths were reported on Feb. 3. The region’s total is 2,738.\n21 women and 34 men died between Nov. 26 and Feb. 3.\nOf the 55 new deaths reported that day, 22 people who died were 80 years or older, 14 people were in their 70s, 11 people were in their 60s, seven were in their 50s and one person was in their 40s.\n54 had underlying medical conditions and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210204.18.53.27"}