{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Boosters Expected to Soon Be Available for Children 5 to 11", "description": "Pending approval from the Western States committee, booster doses of COVID-19 vaccine may soon be available for San Diego children ages 5 through 11, the County Health and Human Services Agency announced today.", "datePublished": "2022-05-19T16:05:10-07:00", "url": "https://www.countynewscenter.com/?p=208561", "keywords": ["health", "boosters", "boosters for children", "coronavirus", "covid-19", "mis-c"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-05-19T16:05:10-07:00", "articleType": "article", "articleContent": "\nPending approval from the Western States committee, booster doses of COVID-19 vaccine may soon be available for San Diego children ages 5 through 11, the County Health and Human Services Agency announced today.\nThe COVID-19 Pfizer boosters should be given five months after receiving the final dose of the primary vaccine series.\n“Some parents have been anxiously waiting to give their children extra protection against COVID-19 and the shots may be finally approved,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “COVID-19 boosters for everyone who is eligible are easy to get because we have plenty of vaccine available in the region.”\nMIS-C Cases in San Diego County\nWhile COVID-19 symptoms tend to be less severe in children, the Omicron variants have been making more San Diego children sick, with some requiring hospitalization and others developing multisystem inflammatory syndrome or MIS-C. From November 27, 2021 to May 7, 2022, 90% of the pediatric hospitalizations for the syndrome occurred in not fully vaccinated children.\nSince the pandemic began, there have been 98 MIS-C cases in San Diego County.  Fifty-three percent of MIS-C cases have been reported in children ages 5 to 11 and the majority (60%) have been Hispanic.\nAccording to the Centers for Disease Control and Prevention, “MIS-C is a rare, but serious, postinfectious hyperinflammatory condition occurring about 2 to 6 weeks after infection with the SARS-CoV-2 virus.”\nSymptoms of MIS-C include fever, abdominal pain, diarrhea, skin rash, inflammation and multiorgan dysfunction. In severe cases, children can experience hypotension (low blood pressure) and shock. Approximately 60-80% of the early cases of MIS-C patients required intensive care admission.\n“MIS-C can often be so severe that children require life-saving interventions. Parents should contact their doctor immediately if their child develops any of these symptoms,” Wooten said. “The best thing parents can do is get all the recommended doses of the COVID-19 vaccine for themselves and their children.”\nVaccine supplies remain plentiful, both for those seeking initial doses and those eligible for boosters. People can get vaccinated or a booster through their medical provider, a retail pharmacy or a site operated by the County. Additional booster eligibility details are at coronavirus-sd.com.\nVaccination Progress:\n\nReceived at least one shot: Nearly 2.96 million or 94.0% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.62 million or 83.3%.\nBoosters administered: 1,323,824 or 58.5% of 2,264,730 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n11 additional deaths were reported since the last report on May 12. The region’s total is 5,282.\nOf those 11 additional deaths, six were men and five were women. They died between Jan. 17, 2022 and May 15, 2022; two of the deaths occurred in the past two weeks.\nSix of the people who died were 80 years or older, three were in their 70s, one was in their 60s and one was in their 20s.\nFive of the people who died were fully vaccinated and six were not fully vaccinated.\nAll had underlying medical conditions.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n3,409 COVID-19 cases were reported to the County in the past three days (May 16-18, 2022). The region’s total is now 775,369.\n7,007 cases were reported in the past week (May 12-May 18) compared to 4,995 infections identified the previous week (May 5-May 11).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 15.67 for people fully vaccinated and boosted, 8.86 for fully vaccinated people and 34.84 for not fully vaccinated San Diegans.\n9,611 tests were reported to the County on May 14, and the percentage of new positive cases was 7.3% (Data through May 14).\nThe 14-day rolling percentage of positive cases, among tests reported through May 14, is 5.8%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220519.16.05.10"}