{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Medical Examiner Adds New Tech to 1981 Cold Case Effort", "description": "The San Diego County Medical Examiner’s Office is putting current technology into a renewed effort to identify a man whose body was found nearly 40 years ago.", "datePublished": "2021-02-19T15:06:13-08:00", "url": "https://www.countynewscenter.com/medical-examiner-adds-new-tech-to-1981-cold-case-effort/", "keywords": ["public safety", "cold case", "medical examiner"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-02-19T15:06:13-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Medical Examiner’s Office is putting current technology into a renewed effort to identify a man whose body was found nearly 40 years ago.\nHis remains were discovered in a burning Dumpster outside a Big Bear Market in the 9900 block of Mira Mesa Boulevard on Sept. 28, 1981. Despite efforts at the time, homicide investigators did not find any information to identify him.\nThe San Diego Police Cold Case Unit is now taking another look at this case. Police investigators worked with odontologists from the County Medical Examiner’s Office, who re-examined the man’s dental records taken during the initial autopsy. At the time, his age had been determined to be in his late teens, but with newer technology, dental experts now agree he was more likely in his mid 30s, give or take five years.\nIn a video produced by the San Diego Police Department, Detective Lori Adams of the Cold Case Unit said this new information expands the possibilities on identifying him and notifying his family. Determining his identity is also key to determining what happened to him and solving his case.\nPolice are reissuing a sketch of what the man may have looked like prior to his death. He is of undetermined race with a medium skin tone, with wavy auburn color hair and brown eyes. He was about 33 years old, give or take 5 years, stood approximately 5 foot 7 inches to 5 foot 10 inches in height, and weighed between 125 and 135 pounds. He had dental work which is consistent with being done in the United States.\nIn the video, Adams said that the passage of time can sometimes help in cold cases because it can give people time to build courage to provide information that they were too afraid to offer when the crime occurred, or it provides another opportunity for people who were too apprehensive about getting involved in a police investigation then.\nPolice ask anyone who may recognize the man or have any information about the crime, to please call Crime Stoppers at (888) 580-8477 or SDPD Homicide at (619) 531-2293.\n﻿﻿Video courtesy of San Diego Police Department. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210219.15.06.13"}