{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Annual Point in Time Count Draws Hundreds of Volunteers", "description": "Nearly 1,500 volunteers walked the streets of San Diego County early this morning looking to engage with people experiencing homelessness as part of the region’s Point in Time Count.", "datePublished": "2023-01-26T15:48:58-08:00", "url": "https://www.countynewscenter.com/annual-point-in-time-count-draws-hundreds-of-volunteers/", "keywords": ["housing", "homelessness", "point in time count", "san diego county"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-01-26T16:13:28-08:00", "articleType": "article", "articleContent": "\nNearly 1,500 volunteers walked the streets of San Diego County early this morning looking to engage with people experiencing homelessness as part of the region’s Point in Time Count.\nThe annual count led by the Regional Task Force on Homelessness provides a one-day snapshot of unsheltered San Diegans and those in emergency shelters.\n“The annual Point in Time Count helps us get an idea of the unsheltered population in our region in order to connect them with resources.” said Barbara Jiménez, County Community Operations Officer, Department of Homeless Solutions and Equitable Communities. “It’s also an opportunity for more County employees to interact with our neighbors experiencing homelessness.”\n\nVolunteers began the day at 4 a.m. in one of 36 different sites throughout the County where they split into teams to walk or drive around their designated areas looking for people living outside.\n254 County employees volunteered to take part in the Point in Time Count this year including Beatrice Maleno and Dahiana Jimenez who work in the Department of Homeless Solutions and Equitable Communities and Maria Lischin, a social worker III with Aging and Independence Services.\n“Participating in the Point in Time Count for over five years has afforded me the opportunity to advocate for resources,” said Beatrice, Program Specialist II in the Department of Homeless Solutions and Equitable Communities. “It’s important so that we as a community can build and create permanent housing solutions that allow our most vulnerable to thrive and live their best lives.”\n\nBeatrice and her volunteer group, who surveyed areas in Vista, first came across a group of three people. They were laying on cardboard outside a payday advance business. Two men agreed to speak with them and answer a short questionnaire.\nOne of the men told them that a medical condition had impacted his ability to work. The other man said he was experiencing homelessness for the first time. Dahiana gave him a McDonald’s gift card before he rushed off saying he was heading to work.\nThe third man was sleeping, so his location was noted so that outreach workers would know where to find him when they make contact with him at later time.\n\nNext, the team found three more people. Two men and a woman were set up to sleep outside a tire shop. They had sought shelter behind a large tire. One of the men who agreed to take the survey said he had been experiencing homelessness for the past seven years.\nAround 7 a.m., Beatrice, Dahiana and Maria met two more people who were picking up their blankets after waking up at a small business center.\n\nWhile the woman answered the survey, her dog vied for attention from volunteers. When Dahiana gave the woman the McDonald’s gift card, she turned to her dog and promised her a special treat.\n“Being a social worker for the unsheltered community means that I am walking alongside my clients and assisting them to the next stage in their life journey,” Dahiana explained.\nThe information from the completed surveys is used to apply for federal and state funding to help people experiencing homelessness and find solutions on how to best serve them.\nThe County has multiple programs in place that could connect homeless people to the services they need and help them find a stable place to live. You can find more information here or by calling 2-1-1.\n    \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230126.15.48.58"}