{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Southeastern Live Well Center to Feature Array of Work from Local Artists", "description": "The County of San Diego’s new Southeastern Live Well Center will open next year, and even before visitors walk inside, they will be greeted by special public art that represents and reflects the dynamism of the Southeastern community.", "datePublished": "2022-11-09T11:42:25-08:00", "url": "https://www.countynewscenter.com/new-county-of-san-diego-southeastern-live-well-center-to-feature-array-of-work-from-local-artists/", "keywords": ["health", "public art", "southeastern live well center"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-11-09T11:42:25-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s new Southeastern Live Well Center will open next year, and even before visitors walk inside, they will be greeted by special public art that represents and reflects the dynamism of the Southeastern community.\nEvery one of the painters, sculptors, woodworkers and multi-media artists working on the Live Well Center’s art have deep roots in the community. Coming from an array of diverse backgrounds and using various mediums, their work will be featured throughout the 65,000-square-foot space.\nThe one-stop hub on the corner of Market Street and Euclid Avenue is set to open in the summer of 2023. It will house self-sufficiency and family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services as well as space for community-based organizations and community meetings.\nCommunity feedback has been essential to every step of the project and has been applied to the design and art. The 14 artists chosen to display their work are incorporating the public’s feedback as they work to create final pieces based on their submitted concepts. The artists are working alongside the project’s architects to ensure their pieces are optimized in scale and scope.\nArt concept “Gateway” by Manuelita Brown\nFor example, leading up to the building’s main entrance, will be a large sculpture entitled “Gateway,” by artist Manuelita Brown. According to Brown, it will depict “a human passing through an opening.” Brown said that her art concept illustrates “a narrative of leaving one space for another.” It will include a collection of medallions representing the cultural identities of community residents.\nArt concept “Family” by Victor Ochoa\nWhen visitors first step inside, they will be greeted by muralist Victor Ochoa’s “Family”, a piece that features a girl lifted by her father with arms stretched in flight while a mother carries her daughter on her back. “This piece is about family structures and single parent situations,” Ochoa explained.\nArt concept by Kaori Fukuyama\nAs you enter the main lobby and look up, you will see a skylight installation by Kaori Fukuyama. Her concept features custom-cut acrylic panels of various colors that will “build on the sun and create shadow play on the stairwell below,” Fukuyama said. “The serpentine form will run across the length of the skylight to represent Chollas Creek, which nourishes and nurtures the community.”\nArt concept by Francisco Eme\nBelow the skylight, the grand stairwell will be adorned by an installation by Francisco Eme called “Native Motives”.  Combining ancient and contemporary materials and techniques, Eme’s concept uses textiles to represent cultures of the past, present and future in what he called “a living acknowledgment to the community.”\nArt concept by Daniel (Maxx Moses) Hopkins\nIn the 4,000 square-foot Tubman Chavez Conference Center, there will be two original canvas paintings by graffiti artist Daniel (Maxx Moses) Hopkins. According to Hopkins, these pieces capture “the nature of wellness, vulnerability, patience and love within our community.”\n \n \n“We are grateful that these artists will help us create a truly welcoming environment and tell a beautiful story about our community through their work,” said Leah Goodwin of Leah Goodwin Creations, the project’s art consultant. “These artists will bring the art statement values to represent and celebrate the history, diversity and cross-cultural experiences of the community to life.”\nArt concept “Singing Patterns” by Doris Bittar\nOne exterior wall is set to feature a two-part mural screen by Doris Bittar honoring the culture of San Diego’s dynamic and historic neighborhoods. Bittar’s concept, titled “Singing Patterns,” metaphorically bridges regions, history and time together using patterns from all over the world.\nArt concept by Jean Cornwell Wheat\nAnother exterior area will be the meditation garden, which will feature tall totem poles by Jean Cornwell Wheat. The concept depicts faces, hands and cultural design paintings representing the seven continents, as well as a design honoring the indigenous people of the region and California.\nArt concept by Michelle Guerrero\nThe concept of family will also be depicted in the family waiting area. A mural by Michelle Guerrero will depict children, flowers and birds, combining the cultural world with a playful, colorful touch.\nArt concept by XoQue Art in Motion\nNearby, wall art by XoQue Art in Motion artists will showcase a children’s storybook theme. The piece invites the viewer to recognize the fact that “we all have the ability to turn the page and change our story,” explained the artists, Berenice Badillo, Selina Calvo, Sandra Carmona, Jennifer Clay and Ana Maria Herrera.\nArt will be visible throughout the building, including corridors.\nArt concept by Chloe Becky\nA large painting in mixed media depicting a landscape including trees, flowers and homes as well as portraits, is the premise of the concept from artist Chloe Becky. “This piece will convey the vibrant beauty of the community and how the people who reside in it create and cultivate their unique environment and rich culture,” said Becky.\nArt concept by Wendy Maruyama\nWoodworking artist Wendy Maruyama conceptualized a large wall installation featuring a black-lacquered mirrored surface. “It centers on self-reflection, contemplation, memory and meditation,” Maruyama explained. “The blackness of the lacquer has depth, looks as if you are looking into another space and is much like looking at water.”\nArt concept by JHelen Ramirez\nUsing a vibrant color-pallet, Artist JHelen Ramirez’s artwork depicts various monumental moments in history. It is “a testament to the power of the people who have directed the energies toward justice, a portrayal of the living global community and the good people are capable of,” detailed Ramirez.\nArt concept by Andrea Rushing\n \nAnother art piece by Andrea Rushing will show people balancing on pillars in the ocean. Rushing said that while separated, they are “all connected by ribbons and the thread of life.”\nArt concept by Jose “Bean” Venegas\nJose “Bean” Venegas’ concept is a painting called “Love” and is displayed on a mirrored surface. “My work is an examination of the different languages not only around the world but in this diverse community,” Venegas said. People will be able to see their reflection in the art piece. “The goal is for the art piece to never be the same…with different people looking in the mirror.”\nThe Public Art Advisory Committee, made up of nine community representatives, selected the 14 art concepts from 100 artist submissions.\nThe committee includes including two youth representatives, the Manzanita Band of the Kumeyaay Nation, Asian Pacific Islander Initiative, Multicultural Health Foundation, Pacific Islander Collaborative of San Diego, Project New Village and the Jackie Robinson Family YMCA. The project manager and architect also sit on the committee.\nThe 14 art concepts received public feedback during a month-long art tour in July where community members were able to speak with the artists and representatives and share their thoughts in the online survey.\nArtwork will be unveiled at a grand opening community event of the new Southeast Live Well Center in the summer of 2023.\nConcept art pieces can be viewed on the county’s Southeast Live Well Center website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221109.11.42.25"}