{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Now Primarily Vaccinated at Pharmacies, Community Clinics", "description": "San Diegans have largely turned to traditional vaccination clinics to get immunized against COVID-19.", "datePublished": "2021-07-30T15:59:17-07:00", "url": "https://www.countynewscenter.com/san-diegans-now-primarily-vaccinated-at-pharmacies-community-clinics/", "keywords": ["health", "community clinics", "coronavirus", "covid-19", "pharmacies", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-07-30T15:59:52-07:00", "articleType": "article", "articleContent": "\nSan Diegans have largely turned to traditional vaccination clinics to get immunized against COVID-19.\nRetail pharmacies are now the primary provider of vaccines, administering over 100,000 doses from July 1 through July 28. They were followed, in order, by community clinics (nearly 20,000 doses), private medical providers (almost 17,000 doses), County sites (about 13,000 doses) and hospitals (just under 9,000 doses) during the same time frame.\n“I want to thank every San Diegan who has been vaccinated and the many partners working daily with the County to ensure vaccines are readily available in every part of our region,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Masking and other public health guidance are additional measures to help us safely navigate the COVID-19 pandemic. Vaccinations are our key for getting out of it.”\nThe County has been working with its vaccination partners to get the word out to San Diegans who are hesitant about getting immunized.\nTo date, about 2.28 million or 81.4% of the 2.8 million San Diegans eligible for the COVID-19 vaccine have received a first dose and about 1.97 million or 70.3% are fully vaccinated.\n“I want to thank all of our community and health care partners who have been doing a great job getting the word out about how important it is to get vaccinated,” Wooten said.\nCOVID-19 Cases, Hospitalizations Up\nIn the past month, the local COVID-19 case rate has jumped from 2.1 to 19.3 cases per 100,000 residents. Hospitalizations have also increased more than 300% and intensive care unit admissions rose by over 120% during that same period.\nOn July 29, a total of 1,273 cases were reported, the highest daily total since Feb. 5, 2021.\nThe spike in cases drove the County to recommend mask-wearing indoors for all San Diegans regardless of vaccination status.\n“Unvaccinated people are overwhelmingly the ones getting infected and being hospitalized,” Wooten said. “If you have not gotten your COVID-19 vaccine, do it now.”\nThe County is helping medical providers contact all San Diegans who are partially vaccinated to get their second shot, especially now that COVID-19 cases have been going up, a spike driven primarily by the Delta variant. The County is also using the San Diego Immunization Registry to develop follow-up reminders for those who are behind schedule.\nIn addition to the hundreds of COVID-19 vaccine locations available throughout the region, the County is also operating eight geographically distributed no-cost vaccination sites that allow people to choose any one of the three vaccines available in the United States: Moderna, Pfizer and Johnson & Johnson. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210730.15.59.17"}