{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Dashboard Tracks South County Water and Odor Pollution", "description": "An interactive online dashboard and map has gone live displaying current environmental conditions in South County including beach water quality and sewage odor data. ", "datePublished": "2025-04-28T15:35:24-07:00", "url": "https://www.countynewscenter.com/new-dashboard-tracks-south-county-water-and-odor-pollution/", "keywords": ["health", "air quality", "odors", "sewage", "south bay", "south county", "tijuan river", "water quality"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-04-28T18:10:58-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAn interactive online dashboard and map has gone live displaying current environmental conditions in South County including beach water quality and sewage odor data. \nThe dashboard draws data from multiple websites to provide a one-stop digital summary of current conditions for people to view and plan their South Bay visits and activity accordingly.   \nThe page includes beach water closure information from the County with the previous week’s information for comparison. Odor complaints and hydrogen sulfide levels for communities near the river valley are provided by the regional San Diego Air Pollution Control District (SDAPCD).  Sewage spill information from the U.S. Section of the International Boundary and Water Commission can also be found here. Links to original sources are also provided so users can find out more about specific topics.\nOther dashboard highlights include information about “What We Know,” “What We’re Doing” and “What You Can Do.” It also features a link to surveillance data from South County emergency departments that tracks patient health complaints related to pollution related breathing problems and potentially infectious stomach issues. \nThe dashboard was developed by the County in partnership with UC San Diego’s Resilient Shield, a multidisciplinary team collaborating to integrate advanced computing techniques like forecast modeling to facilitate informed decision making.   \n“This new dashboard reaffirms our commitment to the South Bay communities most impacted by the sewage pollution by providing pertinent information all in one place that they can take action on or be informed about,” said Dr. Ankita Kadakia, the County’s interim public health officer. “I want to thank our partners with UCSD and APCD for their help in making this happen.” \nBeach and bay water closures from sewage contamination of the river valley have plagued South County for decades. Since 2018, the County has funded daily beach water quality monitoring in the South County, including Imperial Beach, Silver Strand and Coronado.  \nMore recently, the County also has been monitoring reports of an elevation in primarily overnight hydrogen sulfide (H2S) readings in the Tijuana River Valley, creating odor issues for nearby communities. \nThe hydrogen sulfide readings are provided by the SDAPCD which operates a specialized H2S analyzer network. In addition, the U.S. Section of the International Boundary and Water Comhttps://www.sdapcd.org/mission (USIBWC) operates a sewage treatment plant and works directly with wastewater officials in Mexico to provide data on flows into the river valley.  The County also works with state and federal agency partners.  \nIn a multi-agency partnership last year, County public health experts advised SDAPCD on hydrogen sulfide guidance.  The guidance recommends that people who live in affected areas and smell the odors limit outdoor activities when they are bothersome, keep doors closed, increase air circulation with indoor fans and use air purifiers indoors.  \nAPCD also offers free purifiers for those in the three principally effected ZIP codes. These high quality purifiers are effective for odors and gases like hydrogen sulfide particularly when equipped with permanganate filters.  \nPeople with asthma, chronic obstructive pulmonary disease (COPD), or other chronic lung conditions should have emergency medications such as rescue inhalers readily available. If symptoms from a strong odor persist, are worrisome or worsen, seek medical care.  \nThe County of San Diego urges federal officials to continue working with their counterparts in Mexico on stopping the flow of raw sewage and bringing an ultimate resolution to this longtime source of water and air pollution. \nA link to the new dashboard will be located on the County website dedicated to the South Region’s health concerns related to the border sewage crisis. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250428.15.35.24"}