{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Dairy Products Recalled for Possible Listeria Contamination", "description": "Rizo-López Foods, Inc., of Modesto, California, has voluntarily recalled dairy products sold locally and statewide due to a possible health risk for Listeria monocytogenes contamination. ", "datePublished": "2024-02-20T14:19:21-08:00", "url": "https://www.countynewscenter.com/dairy-products-recalled-for-possible-listeria-contamination/", "keywords": ["health", "cheese", "dairy products", "food recall", "listeria"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-02-21T09:07:37-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteRizo-López Foods, Inc., of Modesto, California, has voluntarily recalled dairy products sold locally and statewide due to a possible health risk for Listeria monocytogenes contamination.\nThe products include a variety of cheeses, including cotija, crema Latina, crema Mexicana, Oaxaca, panela, queso fresco, and more.\nThe recalled products have been largely distributed to retailers such as Northgate, Wal-Mart, and Costco. For more information, visit the FDA site.\nThe County’s Department of Environmental Health & Quality has reached out to local retailers listed in the recall to determine if they’ve removed the product from shelves.\nCustomers who have purchased these Rizo-López Foods items should not eat them. The products should be thrown away or returned to the store.\nListeria monocytogenes is an organism that can cause serious and sometimes fatal infections in young children, frail or elderly people and others with weakened immune systems.\nAlthough healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.\nThe FDA recommends that anyone who purchased or received any recalled products to use extra vigilance in cleaning and sanitizing any surfaces and containers that may have come in contact with these products to reduce the risk of cross-contamination.\nListeria monocytogenes can survive in refrigerated temperatures and can easily spread to other foods and surfaces.\nIf you have eaten these items and are ill, consult a medical professional.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240220.14.19.21"}