{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pregnant San Diego Woman Dies from COVID-19", "description": "An unvaccinated woman is the first pregnant San Diego woman to die from COVID-19, the County Health and Human Services Agency announced today.", "datePublished": "2021-10-08T14:32:48-07:00", "url": "https://www.countynewscenter.com/pregnant-san-diego-woman-dies-from-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "pregnant woman", "pregnant woman death"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-08T14:32:48-07:00", "articleType": "article", "articleContent": "\nAn unvaccinated woman is the first pregnant San Diego woman to die from COVID-19, the County Health and Human Services Agency announced today.\nThe woman died earlier this week after being hospitalized, as did her unborn child. Her age and other details about her death and pregnancy are not being reported to protect her and her family’s privacy.\n“This is a very unfortunate death, and our sincere condolences go out to the family and friends of the deceased,” said Seema Shah, M.D., medical director of HHSA’s Epidemiology and Immunization Services branch. “Contracting COVID-19 during pregnancy puts you at greater risk of having serious complications and death. We urge anyone who is pregnant and unvaccinated to get immunized to protect themselves and their babies.”\nOn Oct. 6, the County Health and Human Services Agency issued a health alert to the local medical community alerting them of an increase in cases and hospitalizations of unvaccinated pregnant women, and encouraging them to urge their patients to get vaccinated.\nFrom June 1, 2021 through Sept. 30, there have been 253 laboratory-confirmed cases among pregnant people, including 203 among those not fully vaccinated compared to 50 who were fully vaccinated. Of the 253, a total of 31 required hospitalization; 30 of those hospitalized were not fully vaccinated.\nNot fully vaccinated is defined as being unvaccinated or having received a single dose of Moderna or Pfizer COVID-19 vaccines. Fully vaccinated is defined as being 14-days after the 2nd dose of Pfizer or Moderna COVID-19 vaccines or a single dose of Johnson & Johnson vaccine.\nIn late September, the Centers for Disease Control and Prevention issued a health advisory strongly recommending that people get vaccinated against COVID-19 either before, during or after pregnancy —including those who are breast-feeding — because the benefits of vaccination outweigh known and potential risks.\nAccording to the CDC, pregnant people who contract and develop symptoms from COVID-19 “have a two-fold risk of admission into intensive care and a 70% increased risk of death.”\n“This is heartbreaking and tragic news that a pregnant mother and her unborn baby have died from this terrible disease,” said Dr. Joanna Adamczak, a maternal-fetal specialist and chief medical officer of Sharp Mary Birch Hospital for Women & Newborns. “We, as health care providers, urgently encourage anyone who is pregnant, or plans to get pregnant, to get the vaccine. It provides important protection for both mom and baby.”\nThere are over 400 locations where San Diegans can get vaccinated against COVID-19. They include doctors’ offices, retail pharmacies (Rite Aid, Walgreens, CVS, etc.), community clinics and County public health centers.\nNearly 80% of eligible San Diegans are now fully vaccinated. There is plenty of COVID-19 vaccine available in the region for San Diegans who are eligible and due for a booster shot and for San Diegans who have not yet been vaccinated. You can also find a complete list of locations at coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211008.14.32.48"}