{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Urges People to Get the Best Gift Available-Vaccinations!", "description": "The County Health and Human Services Agency is urging people to give themselves, their family and friends the best gift available this holiday season―vaccinations to protect against COVID-19 and the flu.", "datePublished": "2022-12-22T18:23:13-08:00", "url": "https://www.countynewscenter.com/county-urges-people-to-get-the-best-gift-available%e2%80%95vaccinations/", "keywords": ["health", "covid-19", "flu", "influenza", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-12-22T18:44:02-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is urging people to give themselves, their family and friends the best gift available this holiday season― vaccinations to protect against COVID-19 and the flu.\nThe updated bivalent COVID-19 boosters that provide the greatest protection against COVID-19 were recently made available to everyone six months of age and older.\nCOVID-19 and the flu are circulating at high levels this winter and vaccinations for both are widely available at local pharmacies and medical providers. The County will also be offering vaccinations throughout the holidays at its vaccination sites. Check online here for the days and hours sites will be open.\n“Many San Diegans have taken advantage of the ability to get vaccinated,” said County Public Health Officer Dr. Wilma Wooten, M.D., M.P.H. “But we can still vaccinate and protect more people. COVID-19 remains highly prevalent in San Diego County, and we’re entering January, the month historically when we’ve had our highest peak number of cases. So please take advantage and complete your vaccinations to protect yourself, your family, and others.”\nCounty officials report that through this week, 80.5% of eligible San Diegans have received their two-shot primary vaccinations, 60.8% have received the primary vaccinations and a booster. They also report that one in five, 20%, of all eligible San Diego residents 5 years and older have received the new bivalent booster.  In addition, 40% of people 65 years of age and older have received the new bivalent booster.\nPeople across the country and here in San Diego County continue to deal with multiple respiratory diseases this winter season, including COVID-19, flu and respiratory syncytial virus (RSV). Public Health officials still strongly urge people to get vaccinated for both COVID-19 and the flu.\nThe bivalent COVID-19 booster and flu vaccinations are separate shots, but they can be given at the same visit. They decrease the chances of getting infected, but more importantly, they effectively reduce the risk of severe illness and complications like hospitalization and death. Boosters are available through local participating pharmacies and healthcare providers. People can visit the state’s My Turn website to schedule an appointment. Booster dose availability is listed on the County’s COVID-19 vaccinations schedule webpage.\nHoliday Prevention Measures\nCounty officials also recommend wearing a mask if you are able, particularly during indoor public gatherings, to protect yourself and those around you.\nIn addition to vaccination and masking, San Diegans can take other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often\nStaying away from sick people\nStaying home and avoiding contact with others when sick\nRegularly cleaning commonly touched surfaces\nHome testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County of San Diego COVID-19 testing webpage.\n\nCOVID-19 Vaccination Progress:\n\nMore than 2.69 million or 80.5% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 497,928 or 20% of 2,494,948 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nCOVID-19 Deaths:\n\n18 additional deaths were reported since the last report on Dec. 15, 2022. The region’s total is 5,626.\nOf the 18 additional deaths, nine were women and nine were men. They died between March 8, 2022, and Dec. 14, 2022. Thirteen of the newly reported deaths occurred in the past two weeks.\nThirteen of the people who died 80 or older, three were in their 70s and two were in their 60s.\n14 of these people had been vaccinated and four had not received any COVID-19 vaccines.\n18 had underlying medical conditions.\n\nCOVID-19 Cases, Case Rates and Testing:\n\n4,764 COVID-19 cases were reported to the County in the past seven days (Dec. 13, 2022, to Dec. 19, 2022). The region’s total is now 957,586.\nThe 4,764 cases reported in the past week were lower compared to the 4,821 infections identified the previous week (Dec. 6, 2022 through Dec. 12, 2022).\n4,730 tests were reported to the County on Dec. 17, and the percentage of new positive cases was 11.4% (Data through Dec. 17).\nThe 14-day rolling percentage of positive cases, among tests reported through Dec. 17, is 9.8%.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report  weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Dec. 17, 2022, the report shows the following:\n\nSeven additional flu deaths; the season’s total is now 27.\nFour of the additional flu deaths were women and three were men. They died between Nov. 30, 2022, and Dec. 13, 2022.\nOne of them had received a flu shot this season and six had not.\nSix of the seven had underlying medical conditions; one had no underlying medical conditions. None of the newly reported deaths were coinfected with COVID-19.\nEmergency department visits for influenza-like illness: 6% of all visits (compared with 7% the previous week).\nLab-confirmed influenza cases for the week: 1,141 (compared to 1,609 the previous week).\nTotal lab-confirmed cases to date: 18,439 (compared to 888 at the same time last season and a 1,201 prior 5-year average during the same week).\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221222.18.23.13"}