{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Case Reported at Sycuan Casino", "description": "A person at Sycuan Casino was recently diagnosed with tuberculosis (TB) and may have exposed patrons and employees, the San Diego County Health and Human Services Agency announced today.", "datePublished": "2022-01-03T17:35:45-08:00", "url": "https://www.countynewscenter.com/tuberculosis-case-reported-at-sycuan-casino/", "keywords": ["health", "sycuan casino tb case", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-01-03T17:35:45-08:00", "articleType": "article", "articleContent": "\nA person at Sycuan Casino was recently diagnosed with tuberculosis (TB) and may have exposed patrons and employees, the San Diego County Health and Human Services Agency announced today.\nThe dates of exposure were from April 1, 2021 to December 9, 2021. HHSA is working with Sycuan Casino officials to notify those who were potentially exposed.\nTuberculosis is transmitted from person to person through indoor air during prolonged contact with an infectious person. The exposure risk for patrons was low due to COVID-19 safety measures like masks, social distancing and divider walls in place at the casino.\n“While many people exposed to tuberculosis do not become infected, some will be, and an early infection may not show any symptoms,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Although we don’t think this is a high-risk exposure, testing is recommended for employees who may have been exposed to the infected individual for a significant period of time.”\nSymptoms of infectious tuberculosis include persistent cough, fever, night sweats and unexplained weight loss. People with symptoms of TB, or who are immune-compromised and may not show obvious symptoms, should consult their medical provider to be evaluated for the bacteria. Tuberculosis can be cured with an extended course of specific antibiotics.\nPeople who would like more information on this potential exposure should contact the San Diego County TB Control Program at (619) 692-8621.\nTuberculosis is not uncommon in the San Diego region and, although decreasing since the early 1990s, case counts have stabilized in recent years. In 2020, 192 cases were reported in San Diego County. Last year’s TB case numbers have not been finalized yet, but so far, 164 cases have been reported in 2021.\nLearn more about TB and how to treat it by watching the below testimonial from a tuberculosis survivor.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220103.17.35.45"}