{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Awarded More State Funds to Help People Living in Encampments", "description": "More state funds are heading to San Diego County to help people experiencing homelessness along the region’s riverbeds.   ", "datePublished": "2023-09-26T11:26:32-07:00", "url": "https://www.countynewscenter.com/county-awarded-more-state-funds-to-help-people-living-in-encampments/", "keywords": ["health", "grant", "homelessness"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-09-26T11:26:32-07:00", "articleType": "article", "articleContent": "\nMore state funds are heading to San Diego County to help people experiencing homelessness along the region’s riverbeds.   \nThe newest is a $5.1 million grant for the Sweetwater Riverbed, including an area paralleling Interstate 805 in the South County and known as “The Jungle.”  \nUnder leadership of San Diego County Board of Supervisors Chairwoman Nora Vargas, the County’s Department of Homeless Solutions and Equitable Communities led the grant application in collaboration with the City of Chula Vista, National City and California Department of Transportation to the State’s $240 million Encampment Resolution Fund.  \n“These new funds will greatly expand our ongoing work with the regional partners to bring services into the riverbed,” said Chairwoman Vargas who represents that community. “I look forward to working with our County teams, the City of Chula Vista, National City and Caltrans on putting this important funding to use.” \nThe Encampment Resolution Fund aims to help local jurisdictions resolve encampments and provide permanent housing and service connections.    \nThis is the second such grant awarded to a County-led partnership.  \nIn June, the County, the City of San Diego, City of Santee and California Department of Transportation, got nearly $17 Million to address homeless encampments in the San Diego riverbed. Outreach teams there have already started helping people get into housing and cleaning up the riverbed.\nThis newest award, also to the County’s Department of Homeless Solutions & Equitable Communities, will help an estimated 75 people experiencing homelessness along the Sweetwater riverbed.  \n“We are looking forward to working with our partners in the Sweetwater riverbed to better understand people’s unique circumstances and needs,” said Barbara Jiménez, County Community Operations Officer. “I’m confident that working together, and with these new resources, we will move more people into housing.” \nOver the next several months, the County will finalize planning and work with the partner entities to bring together the staff and resources necessary to start work on the Sweetwater riverbed program. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230926.11.26.32"}