{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Probation, Sheriff’s Deputies Spread Holiday Cheer to Children", "description": "The first Saturday in December really is the most wonderful time of the year for kids and local law enforcement officers at this year’s Shop with a Cop event.", "datePublished": "2022-12-03T17:04:03-08:00", "url": "https://www.countynewscenter.com/county-probation-sheriffs-deputies-spread-holiday-cheer-to-children/", "keywords": ["public safety"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-12-06T14:15:39-08:00", "articleType": "article", "articleContent": "\nThe first Saturday in December really is the most wonderful time of the year for kids and local law enforcement officers at this year’s Shop with a Cop event.\nFranklin, 8, is all-smiles and practically vibrating with excitement as he’s handed his shopping bag by Probation Officer Pedro Bernal, his partner for the event. The morning has been an amazing surprise to Franklin.\n“My dad took me to my school and then I saw cops and then they said my name. And I told them, ‘I’m not going to jail,’ and they said no they were going to take me to go to SeaWorld and to go get whatever I want for $200,” he recounted breathlessly.\nFranklin happily shows off his blue Switch Lite and game to play on it. The game was an early present from Bernal because the cost of the device used up the gift card.\nCounty Probation, the Sheriff’s Department and the District Attorney’s Bureau of Investigation  joined other local law enforcement agencies, SeaWorld, Target and STAR/PAL to sponsor the 28th annual event, providing 300 local children with a happier holiday season and encouraging positive relationships with officers.\nThe fun morning started at SeaWorld where the children were paired with an officer or deputy. The children and law enforcement were treated to private sea animal shows and breakfast at the theme park. Later, the children and their partner rode in patrol vehicles with lights flashing and sirens blaring for a $200 shopping spree.\nHundreds of the patrol vehicles caravanned to the Sports Arena Target. Children’s voices booming out on speakers wishing people a Merry Christmas.\nFor Uriah,  it will be a 9th birthday to remember. As he walked into Target with his partner Deputy Ryan Martinez, he was serenaded by a volunteer when told it was the boy’s birthday. And by two rows of greeters dressed as Star Wars characters and Target staff volunteers clapping them into the store. Actually, the greeters are for every child who went in to make them all feel special.\nInside, Uriah bought gifts for all of his family. And something fun for himself.\n“I’m looking for LOL dolls, that one,” said Savannah, 8, who was paired with Probation Officer Janet Moore. From there she went on to discuss all the cute accessories that come with the doll.\nThe Escondido Police were the host agency this year and over 300 uniformed officers from more than 30 different local, state, and federal agencies volunteered to partner with a deserving child, selected from local schools.\n“It’s probably one of the highlights of our year — for me it is,” said Sheriff’s Deputy Ruben Gonzales, who is participating for the fifth time. “This is such a great event, to give back to the community and kids. They love it. We get as much joy out of this, probably more, than they do. He didn’t even know that he was coming today. Mom surprised him. She told him last night, you have to get up early and didn’t tell him why.”\nLaw enforcement agencies raise money for the event by holding sporting events, breakfasts and other fundraising events throughout the year.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221203.17.04.03"}