{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Confirms Third Measles Case of 2024", "description": "County public health officials have confirmed the third case of measles in the region this year in a 13-month-old resident who had recently traveled overseas. ", "datePublished": "2024-05-14T16:32:24-07:00", "url": "https://www.countynewscenter.com/county-confirms-third-measles-case-of-2024/", "keywords": ["health", "confirmed measles case", "measles", "measles vaccines"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-05-16T13:59:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty public health officials have confirmed the third case of measles in the region this year in a 13-month-old resident who had recently traveled overseas. \nThe County previously confirmed two other cases in the region this year. None of the three cases are linked, but all are associated with international travel. Before 2024, the last confirmed measles case in the County was in 2019. \nThe unimmunized infant may have exposed others at the following times and locations: \n\nChildren’s Primary Care Medical Group El Cajon located at 844 Jackman St., on May 12, from 9:10 a.m. to 12 p.m. \n\n\nRady Children’s Emergency Department located at 3020 Children’s Way, 1st Floor in San Diego, on May 13, from 10:30 a.m. to 12:45 p.m. \n\nCounty epidemiologists are working with Children’s Primary Care Medical Group El Cajon and Rady Children’s Hospital to identify and follow up with patients and staff to determine if those possibly exposed at these locations have been vaccinated. They will also evaluate their potential for developing measles. \n“Measles is a very contagious disease that can be spread easily by coughing, sneezing or being in the same room with an infected person,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Anyone who was at any of the specific locations and at the dates and times listed above should watch for symptoms and call their health care provider if they show any signs of the disease.” \nPeople with symptoms are asked to call their doctor’s office in advance, rather than visit an office directly, so that infection control measures may be taken to prevent exposure to others. \nMeasles develops seven to 21 days after exposure. Early symptoms include fever, cough, runny nose and red eyes. A distinctive red rash usually appears one to four days after early symptoms start.  \nA person is considered contagious four days before and four days after the rash appears. The rash typically begins on the face and head, then proceeds downward and outward to the hands and feet. It fades in the same order it began, from head to feet. \n“The best way to prevent measles is by getting the measles vaccine,” said Dr. Wooten. “With measles outbreaks occurring in several countries, it is very important that all international travelers get vaccinated. Infants between 6 and 12 months of age who travel should get one dose, and travelers over 12 months of age should get two doses at least four weeks apart.” \nComplications from measles are more common in children younger than 5 years old and adults 20 years and older. Complications can include diarrhea, ear infections and pneumonia. Death can occur from severe complications and the risk is higher among younger children and adults. There is no treatment for measles. Bed rest, fluids, and fever control are recommended. People with complications may need treatment for their specific problems. \nFor more information about measles, other vaccine-preventable diseases and the shots that protect against them, visit HHSA Immunization Branch online or by phone at (866) 358-2966. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240514.16.32.24"}