{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two County Supervisors Sworn into Office", "description": "Two newly elected County supervisors took the oath of office Monday at the County Administration Center Board Chamber.", "datePublished": "2025-01-06T15:55:43-08:00", "url": "https://www.countynewscenter.com/two-county-supervisors-sworn-into-office/", "keywords": ["government", "district 2", "district 3", "fgg", "joel anderson", "second terms", "swearing in", "terra lawson remer"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-01-06T16:06:16-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesTwo re-elected County supervisors took the oath of office Monday at the County Administration Center Board Chamber.\nVice Chair Terra Lawson-Remer from District 3 and Supervisor Joel Anderson from District 2 were sworn into office after winning a second term in the November election.\nThe vice chair outlined the Board’s many accomplishments in helping San Diegans. She said none of it had been easy, but the Board is going to continue to make progress.\n“I’ve been a researcher, a rabble-rouser, an educator, an attorney, an organizer, an author – and after gathering a lot of empirical data during my first term, I can say with confidence, that being a County supervisor is one of the most rewarding, challenging, sometimes very surprising, and always fulfilling jobs that I’ve ever had,” said Supervisor Lawson-Remer. “And it’s so worth it. Because together, we’ve been creating the change you sent me here to accomplish.”\nBefore his election as a County Supervisor, Joel Anderson had served East County in various roles including the State Assembly and the State Senate.\n“It’s an honor and a privilege to represent my district and I love my job…,” said Supervisor Joel Anderson. “They’ve trusted me for 22 years to represent them and it’s an incredible privilege, and I’m so delighted to do it for another four years.”\nChairwoman Nora Vargas also won a second term, but recently announced she is ending her tenure as supervisor for District 1. Her first term concluded Monday at noon.\nThe County will determine the process to fill the position in accordance with San Diego County Charter, Section 401.4 and Board Policy A-39, which states the Board of Supervisors must meet within seven business days of the vacancy to determine the method to fill the vacancy from one of three options: fill the vacancy by appointment, fill the vacancy by appointment until a special election, or call a special election. The Board of Supervisors will hold a special meeting Tuesday, Jan. 14 at 12 p.m.\nThe County is committed to serving the residents of District 1 and all of those in the region during this transition to ensure they have the support and services they need.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250106.15.55.43"}