{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Residents Learn About County Budget, Give Feedback", "description": "Residents had a chance to talk with experts on the County’s $8.48 billion recommended budget during an open house Thursday.", "datePublished": "2024-05-24T11:18:31-07:00", "url": "https://www.countynewscenter.com/residents-learn-about-county-budget-give-feedback/", "keywords": ["government", "2024-25 budget", "2024-25 recommended budget", "2024-25 recommended operational plan", "community budget meeting", "community budget open house", "community budget session"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-05-24T11:18:31-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesResidents had a chance to talk with experts on the County’s $8.48 billion recommended budget during an open house Thursday.\nThe event took place at the County Operations Center. Attendees could stop by any one of seven topic stations and ask questions.\nOne offered information on how the budget is compiled, where funding comes from and how a good portion must be spent on federal and state mandated programs.\nOther tables focused on budget priorities like behavioral health, housing, homelessness, justice reform, public safety and roads. Open house visitors could learn details and give their feedback on the budget.\nRegionally, the County provides food and restaurant inspections, beach and bay water testing, elections, social services, health programs, foster care, adult protective services and more.\nIn addition, the County provides city-type services for those who live outside of the region’s 18 cities, the unincorporated area. There, the County supplies police and fire protection, and maintains parks, libraries and roads.\nA second budget session will take place virtually from 6 p.m. to 7:30 p.m. on Wednesday, May 29. It will include a presentation and moderated comment period.\nIf you would like to attend, visit Engage San Diego County for virtual meeting information. You can also register to let us know you are coming or request language and accessibility services.\nIf you happen to miss the session, a recording will be made available in English and Spanish at Engage San Diego County after the virtual meeting has taken place.\nYou can also submit your comments at Engage San Diego County or by emailing engage@sdcounty.ca.gov now through 5 p.m. on June 13.\nFor more information on the budget, you can review an executive summary or the full recommended budget plan.\nBudget hearings will take place before the Board of Supervisors at 9 a.m. on Tuesday, June 4 and at 5:30 p.m. on Thursday, June 6.\nThe Board will hold deliberations and adopt the budget on June 25. The adopted budget takes effect July 1.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240524.11.18.31"}