{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Higher-capacity COVID-19 Vaccination Clinic to Open in Oceanside", "description": "A COVID-19 vaccination clinic in Oceanside will start administering shots Tuesday from a new location that can reach more people each day.", "datePublished": "2021-03-15T17:38:09-07:00", "url": "https://www.countynewscenter.com/higher-capacity-covid-19-vaccination-clinic-to-open-in-oceanside/", "keywords": ["health", "coronavirus", "covid-19", "oceanside", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-15T17:38:09-07:00", "articleType": "article", "articleContent": "\nA COVID-19 vaccination clinic in Oceanside will start administering shots Tuesday from a new location that can reach more people each day.\nThe new walk-in clinic will be offering vaccines from 9:30 a.m. to 3:30 p.m. Sun. through Thurs. at the North Coastal Health and Human Services Agency building, 1701 Mission Ave. in Oceanside\nThe clinic will have the capacity to offer up to 700 shots daily, 200 more doses than the other clinic which was located at 3708 Ocean Ranch Blvd. Appointments will be required at the new clinic and some doses will be set aside for residents living in the 92058 ZIP code.\nSecond-dose appointments scheduled for the old clinic will be moved to the new location.\nYou can make an appointment at www.vaccinationsuperstationsd.com or by calling 2-1-1.\nVaccination Progress:\n\nNearly 1.34 million COVID-19 vaccine doses have been delivered to the region, and over 1.25 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, over 439,000 County residents, or 16.3% of San Diegans 16 and older, are fully immunized.\nOverall, over 715,000 County residents have received at least one shot of the two-dose vaccine. That’s 26.6% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 8.8 cases per 100,000 residents. The County is currently in the Purple Tier but likely to move to the Red Tier March 17.\nCurrently, the testing positivity percentage is 3.3%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 4.5% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the most restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March 16.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed March 14.\nThree new community outbreaks were confirmed March 13 in business settings.\nFour new community outbreaks were confirmed March 12: two in business settings, one in a TK-12th grade school setting and one in a restaurant/bar setting.\nIn the past seven days (March 8 through March 14), 15 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n8,659 tests were reported to the County on March 14, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 2.9%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,101.\n\nCases, Hospitalizations and ICU Admissions:\n\n178 COVID-19 cases were reported to the County on March 14. The region’s total is now 265,649.\nMarch 14 was the third time the daily case count has been under 200 cases in the past 10 days. Prior to that, it was Oct. 14, 2020, when 143 cases were reported.\n13,343 or 5% of all cases have required hospitalization.\n1,627 or 0.6% of all cases and 12.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported March 14. The region’s total is 3,452.\nEight new COVID-19 deaths were reported March 13. Five men and three women died between Jan. 25 and March 11. Three people who died were 80 years or older, two were in their 70s, two were in their 60s and one was in their 50s. Seven had underlying medical conditions and one had medical history pending.\n10 new COVID-19 deaths were reported March 12. Six men and four women died between Dec. 9 and March 11. Five people who died were 80 years or older, one was in their 70s, two were in their 60s, one was in their 50s and one was in their 40s. All had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210315.17.38.09"}