{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Golf Cart Sized Machine Will Test for Treatable Diseases in Record Time", "description": "A one-of-a-kind machine that works twice as fast as current practices when testing for diseases is heading for the County of San Diego’s new Public Health Lab, allowing epidemiologists to more effectively fight the spread of diseases. ", "datePublished": "2024-12-10T15:32:16-08:00", "url": "https://www.countynewscenter.com/new-golfcart-sized-machine-will-test-for-treatable-diseases-in-record-time/", "keywords": ["health", "diasorin", "health", "kadakia", "tb"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-12-10T16:13:59-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteA one-of-a-kind machine that works twice as fast as current practices when testing for diseases is heading for the County of San Diego’s new Public Health Lab, allowing epidemiologists to more effectively fight the spread of diseases. \nTuesday the County Board of Supervisors approved the spending of $240,000 to acquire a Diasorin Liaison XL and supporting supplies and equipment. \nThe golf cart sized piece of equipment can test for tuberculosis, chickenpox, shingles, measles, mumps and rubella.  \nThe faster testing is particularly important for tuberculosis (TB) where local cases are trending up. \nThe machine’s automation features reduce staff hands-on time by 75 percent. The Diasorin Liaison XL will be ready for use when the new county Public Health Lab opens in late spring 2025. \nUnlike traditional skin testing for TB, the Diasorin can test a person’s blood to aid the diagnosis of latent TB infection.\n“The biggest challenge in preventing TB is that many people are unaware they have it,” said Dr. Ankita Kadakia, MD, County interim public health officer. “Latent or dormant TB can be easily treated, yet an estimated 85% of active TB cases come from untreated latent TB.  Latent TB sleeps in someone’s body until they develop conditions such as immune suppression which causes the TB to wake up and cause disease. We estimate 175,000 people in San Diego County have latent TB infections,”  \nThe machine’s speed is expected to increase the number of tests for TB. It will find greater numbers of unknown infections which will allow more people to get treatment. \n More information is available on the County’s Public Health Lab webpage and the County’s Tuberculosis webpage. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241210.15.32.16"}