{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Announces New Child Care Blueprint to Help Families", "description": "San Diego County’s new Child and Family Well-Being department publicly unveiled Tuesday its Child Care Blueprint, a two-year strategy to improve access, equity, and the quality of childcare throughout the region.", "datePublished": "2023-08-29T12:24:53-07:00", "url": "https://www.countynewscenter.com/county-announces-new-child-care-blueprint-to-help-families/", "keywords": ["families", "child and family well-being", "childcare"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-08-29T12:24:53-07:00", "articleType": "article", "articleContent": "\nSan Diego County’s new Child and Family Well-Being department publicly unveiled Tuesday its Child Care Blueprint, a two-year strategy to improve access, equity, and the quality of childcare throughout the region.\nIt’s no secret many parents in San Diego County and elsewhere are struggling to find and pay for childcare. Families are often putting their names on coveted providers’ waiting lists before a child is even born.\n“The Blueprint is part of our strategy to reimagine how we serve families and support providers” said County Board of Supervisors Chairwoman Nora Vargas. “Childcare is a public good, and we all have a role to play to ensure it is accessible to all families. Now more than ever, childcare is essential to support our workforce and help build back our economy.”\nThe challenges surrounding childcare became more apparent during the COVID-19 pandemic. In response, the County Board of Supervisors conducted a Child Care Conference in 2022 to hear from local and national experts.\nFrom that conference the Blueprint was crafted to outline goals, priorities, and calls to action to expand access to quality childcare.\n“This plan establishes a strong vision for childcare in the region. It builds on existing County and community programs and positions us to make San Diego County a place where every family has access to childcare that meets their needs,” said Dr. Eric McDonald, interim director of the Health and Human Services Agency.\nThe primary goals of the Childcare Blueprint are:\n\nA childcare workforce that is well-trained, supported, valued as a profession, and paid competitive wages.\nSafe and quality facilities are developed and renovated to expand childcare programs, particularly in geographic areas where childcare is scarce, or family demand outpaces supply.\nAll families have access to childcare that meets their needs and preferences and supports their children’s learning, physical and mental health and social emotional development.\n\n“Together with our amazing partners we are committed to addressing this crisis,” said Alethea Arguilez, assistant director of the Office of Child and Family Strengthening. “We will work with them on shaping childcare throughout San Diego County. We encourage all in the community to be a part of this strategic work in support of workforce development, dedicated space and expanded access and affordability for working families.”\nTo volunteer for a work group, email the County here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230829.12.24.53"}