{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Residents’ Input Needed on Design for County’s Southeastern Live Well Center ", "description": "The County’s Southeastern Live Well Center project is moving forward and residents in the area will once again have an opportunity to give their input on the look and feel of the facility which will serve as a hub for health and social services in the region.", "datePublished": "2021-08-02T15:30:37-07:00", "url": "https://www.countynewscenter.com/residents-input-needed-on-design-for-countys-southeastern-live-well-center/", "keywords": ["health", "live well san diego", "southeastern live well center"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-08-02T15:30:37-07:00", "articleType": "article", "articleContent": "\nThe County’s Southeastern Live Well Center project is moving forward and residents in the area will once again have an opportunity to give their input on the look and feel of the facility which will serve as a hub for health and social services in the region.\nResidents of Southeastern San Diego will also have a say in the final color scheme and other options, including the public art and photo murals that will surround the 65,000-square-foot facility.\n“Virtually every aspect of the project has been reviewed by the community because they are the best-equipped to design a facility to better serve their needs,” said Chair Nathan Fletcher, County Board of Supervisors. “We’ve listened to the community and have implemented their ideas to make sure they get the services they want and also make the facility a welcoming environment.”\nAfter hearing residents’ feedback, the facility will now include features such as a meditation garden and fruit trees. Residents also helped determine the final color options now available for review.\nSoutheastern San Diego residents are invited to submit their choices for the final color and art here.\nThe County, along with the PCL Construction + Steinberg Hart design-build team, are also seeking community residents who can join the newly created Photo Mural Committee and the Art Advisory Committee. You can submit your application here.\nAdditionally, on Oct. 14 there be will another virtual contract fair designed to bring in local businesses as subcontractors. For additional information and to be included in the upcoming bidder list please contact SELWCOutreach@pcl.com.\n“We encourage the community to continue offering input so that residents can feel proud about the final product,” said Vice Chair Nora Vargas. “We also are committed to ensuring Southeastern Live Well Center subcontracting and jobs are available to members of the community.”\nA minimum of 5% of the workforce will be comprised of local workers residing in Southeastern San Diego.\nThe Southeastern Live Well Center will provide a full array of community services including medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities and military and veterans services.\nThe facility also will provide space for community meetings in its 4,000-square-foot conference center which includes a large main conference room and separate smaller conference room.\nThe Southeastern Live Well Center is expected to break ground in fall of 2021 and open in the summer of 2023.\nLive Well Centers are operating in National City, Chula Vista, Escondido, Lemon Grove and Oceanside, with Lemon Grove recently completing an extensive remodel and Oceanside having been completed last year.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210802.15.30.37"}