{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Keep Your Pets Safe and Secure During Fireworks Shows", "description": "Starting tonight through the Fourth of July, fireworks shows will spark panic in dogs and cats, who can escape from yards, homes or their owner’s grip and end up lost.", "datePublished": "2023-06-30T15:27:22-07:00", "url": "https://www.countynewscenter.com/keep-your-pets-safe-and-secure-during-fireworks-shows/", "keywords": ["animals", "das", "fireworks", "lost dogs", "lost pets"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-06-30T17:42:09-07:00", "articleType": "article", "articleContent": "\nStarting tonight through the Fourth of July, fireworks shows will spark panic in dogs and cats, who can escape from yards, homes or their owner’s grip and end up lost.\nIn 2022, the County Department of Animal Services took in approximately 100 stray dogs and cats. Take precautions to make sure your furry friend is safely secured during the commotion.\nOnce a pet is in panic mode, they may bolt and are then at risk for running into traffic, getting lost, or even being attacked by other animals.\nIf you know your dog or cat is afraid of loud noises or don’t know how they will react, consider these tips to protect your pet this Independence Day:\n\nMicrochip your pet and ensure contact information is updated. This way, if they somehow get away, an officer can reunite you more quickly.\nMake sure they are wearing their collars with identifying information on them in case they manage to escape.\nBring them inside your home before the fireworks start. Even if your pet is in a fenced yard and has never escaped before, their fear could lead to them to dig under, break through or jump over the fence.\nProvide a quiet, calm space. White noise machines or sleep machines can be helpful. Or perhaps if the fireworks are still audible, turn on music or a television instead.\nIf possible, stay home with your pets to reassure them, or have someone they like and trust stay with them.\nIf your pet is seriously distressed by loud noises like thunder, consult your veterinarian to see if anxiety-relieving medication is appropriate.\n\nAnimal Services recommends that people not take their pets to fireworks shows, take them for a walk during the show or leave them in your car.\nIf you find a lost pet in the unincorporated area of the County after the fireworks, try to secure the animal and check for a tag to notify the owner. Check social media sites and lost and found websites to see if someone is looking for their pet.\nIf you are unable to reach the owner, call County Animal Services’ 24-hour emergency dispatch number at (619) 236-2341 so the animal can be cared for at the shelter.\nIf you lost your cat or dog, please check County Animal Services’ lost and found page online. And if you see your dog or cat is at County Animal Services, the shelters will be open from 1 to 4 p.m. on Monday, July 3 for the reclaim of animals only. If your pet is lost after Monday or on Tuesday, you can pick up your pet starting at 1 p.m. on Wednesday, July 5.\nAnimal Services is waiving the normal reclaim fees through July 10.\nYou can also check with neighbors, local veterinarians and pet hospitals, social media and lost and found websites such as Pawboost.com.\nPets that are microchipped and licensed are reunited with their owners more quickly than those that are not. If your dog is not microchipped, residents in the unincorporated areas can get their dogs microchipped for a $20 fee at the County’s two shelters in Carlsbad and Bonita.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230630.15.27.22"}