{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccination Clinics Coming to La Mesa, San Ysidro", "description": "San Diegans who qualify and want to get vaccinated against the novel coronavirus will have one more place to do it after the County opens a vaccination super station Feb. 2 in La Mesa.", "datePublished": "2021-02-01T17:05:34-08:00", "url": "https://www.countynewscenter.com/covid-19-vaccination-super-station-coming-to-la-mesa/", "keywords": ["health", "coronavirus", "covid-19", "oceanside", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-01T17:22:04-08:00", "articleType": "article", "articleContent": "\nSan Diegans who qualify and want to get vaccinated against the novel coronavirus will have one more place to do it after the County opens a vaccination super station Feb. 2 in La Mesa and a smaller clinic in San Ysidro.\nThe La Mesa site, operated by Sharp HealthCare, will open at the Grossmont Center shopping mall, 5500 Grossmont Center Dr., Suite 212. Appointments are required.\nThe new walk-up clinic will be vaccinating people from 10 a.m. to 6 p.m. Monday through Friday. Up to 1,000 doses will be administered daily, but the site’s capacity can be expanded to provide up to 5,000 vaccinations every day. This location will replace and expand the site Sharp HealthCare had been operating on Wakarusa St. Appointments made for that site transfer to the super station at the mall.\nThis is the fourth vaccination super station to open in the region. Three others are located Petco Park downtown San Diego, at the old Sears in Chula Vista and California State University San Marcos. Many other smaller County clinics are also currently vaccinating people throughout the region.\nA smaller, County-run vaccination clinic at the Southwestern College Higher Education Center at San Ysidro, 460 W. San Ysidro Blvd. The site will be open from 9:30 a.m. to 3:30 p.m. Tuesday through Saturday and will be able to provide up to 500 doses daily. Appointments are also required at this site.\n“We’re prepared to get shots in the arms of as many San Diegans as possible when more doses come to the region,” said Wilma J. Wooten, M.D,. M.P.H., County public health officer. “Getting vaccinated is the best defense we have against COVID-19.”\nCounty Only Vaccinating People 65 and Older\nWhile the state has expanded COVID-19 vaccination eligibility to all people in Phase 1B, County clinics for now are vaccinating only people in Phase 1A and people 65 years and older in Phase 1B given the limited number of doses available in the region.\nDoctors, pharmacies, community clinics and other healthcare providers are working to provide vaccinations to San Diegans in the priority groups.\n“We understand some people want to get vaccinated right away, but, unfortunately, we don’t have enough vaccine to give a dose to all San Diegans who want one,” Wooten said.\nAll County vaccination super stations and other clinics require appointments and can be made at vaccinationsuperstationsd.com.\nCounty clinics are only vaccinating people in Phase 1A and those 65 and older in Phase 1B.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 49.6 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 12.6%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 16.7% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 2.\n\nCommunity Setting Outbreaks:\n\n11 community outbreaks were confirmed Jan. 31: six in business settings, three in daycare/preschool/childcare settings, one in a government setting and one in a faith-based setting.\n10 new community outbreaks were confirmed on Jan. 30: four in business settings, two in healthcare settings, one in a TK-12th grade school setting, one in a distribution warehouse setting, one in a daycare/preschool/childcare setting and one in a construction setting.\nFive new community outbreaks were confirmed on Jan. 29: two in business settings, two in food/beverage processing settings and one in a retail setting.\nIn the past seven days (Jan. 25 through Jan. 31), 57 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n11,027 tests were reported to the County on Jan. 31, and the percentage of new positive cases was 10%.\nThe 14-day rolling average percentage of positive cases is 8.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 19,502.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases:\n\n1,082 cases were reported to the County on Jan. 31. The region’s total is now 239,124.\n10,217 or 4.3% of all cases have required hospitalization.\n1,460 or 0.6% of all cases and 14.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported on Jan. 31. The region’s total is 2,619.\n16 COVID-19 deaths were reported Jan. 30. Twelve men and four women died between Jan. 18 and Jan. 28.\nOf the 16 deaths reported that day, seven people who passed away were 80 years or older, two people were in their 70s, four people were in their 60s, two people were in their 50s and one person was in their 40s.\n11 had underlying medical conditions, one did not and four had a medical history pending.\n32 COVID-19 deaths were reported Jan. 29. Seventeen women and 15 men died between Jan. 5 and Jan. 29.\nOf the 32 new deaths reported that day, 15 people who passed away were 80 years or older, eight people were in their 70s, five people were in their 60s and four people were in their 40s.\n31 had underlying medical conditions and one did not.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210201.17.05.34"}