{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands Assistance for Struggling Tenants, Landlords", "description": "The County’s Housing and Community Development Services is rolling out two new initiatives aimed at assisting landlords and tenants who have struggled financially amid the COVID-19 pandemic.", "datePublished": "2021-08-26T11:34:11-07:00", "url": "https://www.countynewscenter.com/county-expands-assistance-for-struggling-tenants-landlords/", "keywords": ["health", "coronavirus", "covid-19", "deposit assistance", "erap", "housing assistance programs", "landlord assistance"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-08-26T11:34:11-07:00", "articleType": "article", "articleContent": "\nThe County’s Housing and Community Development Services is rolling out two new initiatives aimed at assisting landlords and tenants who have struggled financially amid the COVID-19 pandemic. Both efforts are part of the County’s existing Emergency Rent and Utilities Assistance Program, which supports low-income renters impacted by the pandemic.\nRental Assistance for Small Landlords\nThe first program will provide payments to landlords with rental properties whose tenants are late on their rent. The Rental Assistance for Small Landlord Program will compensate landlords or property owners for overdue rent payments accumulated since April 2020.\nRecipients must meet several criteria, including the following:\n\nThe property must be located in San Diego County and the owner must be a county resident\nThe landlord must own no more than five rental units\nTenants in eligible units must be at least three months past due on their rent\n\nThe County will pay benefits directly to the landlord and applications will be accepted until funding runs out. The application period opens Sept. 1.\nSecurity Deposit Assistance Program\nThe second initiative is aimed at making it easier for San Diego renters to come up with security deposits when moving to a new rental unit. Through the Security Deposit Assistance Program, eligible applicants can receive security deposit assistance, limited to two months’ rent, up to $7,000.\nTo qualify, the applicant must meet certain income limits and must sign a six-months or longer lease for the unit they plan to rent. Landlord participation is a requirement and payments will be made directly to the property owner.\nThe application period for security deposit assistance opens Sept. 3.\nThe programs lessen housing cost burdens and maintain housing stability for low-income renters and landlords who have faced financial hardships due to the COVID-19 pandemic.\nAbout Emergency Rent and Utilities Assistance \nThe ERAP initiative provides assistance with rent, utilities and other costs such as internet service and application fees. The program is funded by federal and state grants and the County has successfully awarded $107 million to more than 12,000 households. The County recently received additional funding from both the federal and state government, allowing previous recipients to request additional assistance and expanding the pool of eligible applicants.\nFor more information, visit www.SDHCD.org,  or call (858) 694-4801.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210826.11.34.11"}