{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, City Open Shelter for People with Substance Use Disorders", "description": "The County and the City of San Diego today opened a new, 44-bed shelter for people experiencing homelessness and who are struggling with substance use disorders or mental health issues or both.", "datePublished": "2021-12-15T11:53:13-08:00", "url": "https://www.countynewscenter.com/county-city-open-shelter-for-people-with-substance-use-disorders/", "keywords": ["housing", "homeless shelter", "homelessness", "midway community"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-15T11:54:30-08:00", "articleType": "article", "articleContent": "\nThe County and the City of San Diego today opened a new, 44-bed shelter for people experiencing homelessness and who are struggling with substance use disorders or mental health issues or both.\nThe Community Harm Reduction Team shelter is in former retail store in the Midway community.\nThe County has committed initial funding for five years but would continue providing outreach to eligible clients and connect them with shelter, behavioral health services, case management, permanent housing and medical care for as long as it’s necessary. The goal is to get San Diegans who are homeless on a path to wellness, stability and finding a permanent place to live.\nOutreach and case management, which includes Naloxone distribution to reverse narcotic overdoses, fentanyl testing and sterile syringe access, will be handled by Family Health Centers of San Diego through a contract with the County.\nFamily Health Centers of San Diego will provide substance use counselors, peer support, mental health clinicians and nurse practitioners for medical consultation.\nUpon initial engagement by outreach workers, clients are welcomed to the new shelter with day-to-day operations provided by Alpha Project which is offering 24-hour staffing to support 44 beds.\nThe new shelter is part of the County’s regional effort to improve access to behavioral health services with its sites and in partnership with others. The County recently expanded mobile crisis response teams, crisis stabilization units and is working to maximize mental and substance use services throughout the region.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211215.11.53.13"}