{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "This Holiday Season, Don’t Pack a Pest", "description": "The holidays mean shipping gifts to faraway friends and family, or maybe even traveling to give, receive and bring gifts back home. Whatever your plans, don't pack a pest!", "datePublished": "2022-11-21T08:23:16-08:00", "url": "https://www.countynewscenter.com/this-holiday-season-dont-pack-a-pest/", "keywords": ["agriculture", "ag weights and measures", "agriculture", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-11-21T08:42:51-08:00", "articleType": "article", "articleContent": "\nThe holiday season means it’s time to ship gifts to faraway friends and family, or maybe even travel to deliver them in person and bring gifts back home in return.\nWhatever you do, be sure you don’t ship or bring back a present nobody wants—a harmful pest!\nIt can happen if you’re not careful. The gifts you send or receive could be carrying hitchhiking pests or plant diseases that could potentially damage the County’s $1.75 billion agricultural industry and our environment.\nThat homemade wreath you brought home from grandma’s could be carrying spongy moth eggs; that citrus you picked from your backyard to send to a friend could be carrying huanglongbing—a destructive citrus disease. Or that beautiful fruit basket you made from scratch to send to a friend could be hiding mealy bugs.\nSo remember. Don’t pack a pest!\nEvery year San Diego County’s Department of Agriculture, Weights and Measures inspectors — human and detector dogs — work hard to stop the spread of invasive pests like the emerald ash borer, glassy-winged sharpshooter, and South American palm weevil.\nHow can you help?\nHere are some simple guidelines:\nDon’t Pack a Pest\n\nIf you’re traveling — whether it’s out of state or out of the country — leave whatever you find on your trip right where you found it. Don’t bring home a keepsake clipping from Aunt Penny’s holiday wreath, or those bulbs you found in Florida, any citrus branches, leaves or stems from anywhere, or avocado leaves from Mexico.\nDon’t transport any fresh, raw, uncooked, untreated foodstuffs. Same for seeds, beans, nuts, rice, dried fruit, decorative greenery, untreated wood items, animal products or soil from almost any foreign country.\nIf you are traveling and think you may have accidentally packed some plant or animal item away, declare those products when you’re asked by an agricultural inspector if you have anything in your luggage.\n\nFor more information about harmful insects, plant diseases, and Agriculture, Weights and Measures — and everyone’s — role in protecting our local environment and agriculture, visit the department’s Insect and Plant Disease Information webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221121.08.23.16"}