{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is Last Day to Vote in March Presidential Primary Election", "description": "Tuesday, March 5 is the final day to cast your ballot in the Presidential Primary Election. But voters can still vote early today at any one of more than 200 vote centers or drop off their ballot at one of 146 official ballot drop boxes around the county.", "datePublished": "2024-03-04T09:30:37-08:00", "url": "https://www.countynewscenter.com/tuesday-is-last-day-to-vote-in-march-presidential-primary-election/", "keywords": ["elections", "elections", "fgg", "march 5 presidential primary", "official ballot drop boxes", "tuesday last day to vote", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-03-01T16:32:09-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesTuesday, March 5 is the final day to cast your ballot in the Presidential Primary Election. But voters can still vote early today at any one of more than 200 vote centers or drop off their ballot at one of 146 official ballot drop boxes around the county.\nAll will be open on the final day of voting, March 5, from 7 a.m. to 8 p.m. Any voter who is in line at a vote center or an official ballot drop box at 8 p.m. will be allowed to vote. However, no one can join the line after the 8 p.m. deadline.\nPlease note that Santee-Lakeside Elks Lodge is no longer serving as a vote center. Voters will be directed to the two nearest vote centers: Lakeside Community Center located at 9841 Vine St. and Willowbrook Golf Course located at 11905 Riverside Drive.\nIf you’re not registered to vote and want to participate in the election, you may visit any vote center to conditionally register and vote provisionally through March 5.\nOnce the voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the state, the voter registration becomes active, and the provisional ballot is counted.\nYou can visit any vote center around the county. Find a location near you at sdvote.com.\nVote centers replace polling places and provide more services. You can:\n\nVote in-person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters will use a touch screen to:\n\nMake their selections on a ballot marking device\nPrint out the official ballot\nReview it\nPlace it in the secrecy sleeve\nGive it to a poll worker to insert in the ballot box\n\nThe ballot will be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or measure on the ballot. People may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet or you can look it up online at sdvote.com.\nIf you plan to vote for president, the Registrar urges voters to review each political party’s rules.\nLearn more about voting in the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240304.09.30.37"}