{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Input Solicited for Public Art for Southeastern San Diego Live Well Center", "description": "The Southeastern San Diego Live Well Center’s Public Art Advisory Committee is seeking community input on artwork for the new building. Starting this week, people will have the chance to weigh in on which public art submissions should be chosen to grace the interior and exterior of the building.", "datePublished": "2022-07-14T11:38:27-07:00", "url": "https://www.countynewscenter.com/?p=208967", "keywords": ["government"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-07-15T08:20:21-07:00", "articleType": "article", "articleContent": "\nThe Southeastern San Diego Live Well Center’s Public Art Advisory Committee is seeking community input on artwork for the new facility.\nStarting this week, people will have the chance to weigh in on which public art submissions should be chosen to grace the interior and exterior of the building.\nThe public can see and comment on the proposed concepts on display at the nearby Malcolm X Library and Jackie Robinson YMCA during regular business hours. The concepts will also be on display at several community events and meetings taking place over the next few weeks:\n\nJuly 18 – Chollas Valley Planning Group (virtual community meeting) at 6:30 p.m.\nJuly 25 – Central Region Leadership Meeting (virtual community meeting) from 1:30 -3:30 p.m.\nJuly 26 – In-person feedback opportunity at Malcolm X Library from 5 to 7 p.m.\nJuly 28 – Virtual session with invited artist, link to be posted here\nJuly 30 – Project New Village Health & Healing Summerfest from 11 a.m. to 2 p.m.\nJuly 30 – Leon Williams Recognition Event from 2 to 6 p.m. at the County Administration Center, 1600 Pacific Highway, San Diego\nJuly 13 – 31- Review the concepts and take the survey online\n\nThe public art tour marks the next stage in opening the one-stop social services and community center at Market Street and Euclid Avenue. Construction for the 65,000-square-foot center started last October.\nFrom its conception, the local community played an integral role in the Southeastern Live Well Center’s creation, design and workforce. The center will offer self-sufficiency and family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services. The building site will also include a shared space for community meetings, a meditation garden open to all and more.\nThe County has a policy of including public art at new County buildings. For the new Live Well Center, more than 100 artists submitted applications to the Public Art Advisory Committee last April in hopes of winning a commission. Fourteen finalists were selected to present their concepts.\n“We looked for experienced artists with roots in the community and commissioned them to create unique designs that will support the art statement to create a welcoming environment and celebrate the history, diversity and cross-cultural experiences of the community while educating, creating beauty, inspiration and healing.” said art consultant to the Public Art Advisory Committee Leah Goodwin of Leah Goodwin Creations.\nOnce selected, the art will include a welcoming sculpture in the outdoor main entry plaza, a sculpture in the meditation garden, artwork showcasing the grand staircase and second-floor skylight, along with other pieces for the waiting and conference rooms, family play area and building corridors.\nThe project’s Public Art Advisory Committee will consider the community feedback before making its final decisions. The committee includes the architect, the project manager and nine community residents and stakeholders, including two youth representatives, the Manzanita Band of the Kumeyaay Nation, Asian Pacific Islander Initiative, Multicultural Health Foundation, Pacific Islander Collaborative of San Diego, Project New Village and the Jackie Robinson Family YMCA.\n“I am very impressed by the volume of response and the level of talent that we have seen in the artist submissions,” said Project New Village Executive Director, Diane Moss, Public Art Advisory Committee member and founder of the Mt. Hope Community Garden. “I know quite a few of the artists, but it was wonderful to hear more about what they do, their story and their connections to the neighborhood.”\nThe art designs will be selected in August and installed before the Southeastern San Diego Live Well Center celebrates its grand opening next summer.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220714.11.38.27"}