{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Senior Visits New Home at Levant Senior Cottages", "description": "Tomorrow, May 30, the County will celebrate the grand opening of Levant Senior Cottages, a new affordable housing development in Linda Vista for low-income seniors. For future resident Earl Deshazer, this new home means getting back the independence he lost after a major health challenge.", "datePublished": "2024-05-29T17:30:13-07:00", "url": "https://www.countynewscenter.com/local-senior-visits-new-home-at-levant-senior-cottages/", "keywords": ["health", "affordable housing", "aging", "linda vista", "low income", "senior supportive housing"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-05-30T08:20:48-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteTomorrow, May 30, the County will celebrate the grand opening of Levant Senior Cottages, a new 127-unit affordable housing development in Linda Vista. The homes are tailored to meet the needs of low-income seniors 55 and older, earning between 25 percent and 50 percent of the Area Median Income. Every unit here is already spoken for, but this project is the first of 11 affordable housing communities planned for county excess land.\nBuilt by Wakeland Housing and Development, Levant Senior Cottages feature 18 one-bedroom homes and 108 studio apartments including 32 supportive housing units for frail residents. Amenities include a large community building for classes, community events and social activities. Outdoors areas are pedestrian and wheelchair friendly.\nFor future resident Earl Deshazer, Levant Senior Cottages means getting back the independence he lost after a major health challenge.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240529.17.30.13"}