{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Programs Win 51 Achievement Awards", "description": "The County of San Diego won recognition from the National Association of Counties for 51 programs that improve how government serves the public.  The National Association of Counties Achievement Awards are given each year to recognize outstanding, innovative county government programs all across the United States.", "datePublished": "2021-06-30T14:25:51-07:00", "url": "https://www.countynewscenter.com/county-programs-win-51-achievement-awards/", "keywords": ["government", "achievement award", "naco"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-06-30T14:25:51-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego won recognition from the National Association of Counties for 51 programs that improve how government serves the public.  The National Association of Counties Achievement Awards are given each year to recognize outstanding, innovative county government programs all across the United States.\n“As county government, we prioritize public service and we are happy to get recognition. These national awards highlight the exemplary work of our entire County team, especially the many employees who worked directly in the programs honored,” said Chair Nathan Fletcher, County Board of Supervisors. “2020 served as a trying year for just about everyone and our County employees responded to various needs that arose out of that quickly and effectively. Several of those programs were among those awarded.”\nThe awards were selected in various public service categories including: “Children and Youth,” “Arts and Historic Preservation,” “Community/Economic Development,” “Criminal Justice and Safety,” “Emergency Management and Response,” “Environmental Protection and Energy,” “Health,” “Human Services,” “Information Technology” and “Planning.”\nAmong this year’s winners were programs that did the following: provided training to family caregivers of people with dementia, worked with schools to make sure students who have experienced traumatic events are “handled with care,” rezoned a 1940s U.S. military encampment and a historic place of interest with the community’s help so that it can be improved and enjoyed, and created a penalty waiver system for people who were late to pay property taxes due to financial hardship associated with COVID-19.\nThe complete list of winning programs and the County departments that developed them:\n\nFIRST: Dementia Capability Through IDEA Behavioral Symptom Management Training – Aging and Independence Services\nFIRST: Boosting Dementia Capability Through Cognitive Screening – Aging and Independence Services\nAging Roadmap: Creating Thriving Communities for People of all Ages – Aging and Independence Services\nSchooLink – Behavioral Health Services\nManaging Remote Employees Virtual Course – Human Resources\nHealth and Human Services Agency (HHSA) Ergonomic Tips: Working from Home – Human Resources\nRoaming Outpatient Access Mobile (ROAM) – Behavioral Health Services\nMicrolearning Series – Behavioral Health Services\nHHSA Central and South Region Homeless Service – Central Region\nHHSA Central and South Region CWS Intern Program with ARTS (A Reason to Survive) – Central Region\nWorkforce Training and Development Units – Child Welfare Services\nReturned Mail Scanning Automation – Eligibility Operations Administration\nLive Well Mobile Office Pandemic Response – Central Region\nRegional Hotel Assistance Program – Housing and Community Development\nCOVID-19 Early Alert System: Safer at School Early Alert System – Public Health Services\nCounty Elimination Initiatives – Public Health Services\nSan Diego County Perinatal Equity Initiative – Public Health Services\nPublic Health Cross Jurisdictional Strategist – Public Health Services\nVitalCheck – Public Health Services\nWhole Genome Sequencing – Public Health Services\nEmergency Access Program Gives Vulnerable Residents Peace of Mind – San Diego County Fire/Fire Protection District\nCHOICE Program – San Diego County Probation\nHandle with Care Program – San Diego County District Attorney\nCOVID-19 Inbox Project – Office of Emergency Services\nEmergency Child Care Plan in Response to COVID-19 – Office of Emergency Services\nSan Diego County District Attorney Insurance Fraud & Workplace Justice Division – San Diego County District Attorney\nLight Pollution Ordinance – Planning & Development Services\nCamp Lockett Master Plan – Planning & Development Services\nPermit Streamlining and Innovations for Energy Resiliency – Planning & Development Services\nPermit Streamlining, and Self-Certification Program – Planning & Development Services\nSafe Reopening Compliance Team – Planning & Development Services\nUnderground Storage Tank Plan Check– Environmental Health\nDrone Monitoring – Information Technology\nHousing Production and Capacity Portal – Planning & Development Services\nBuilding Inspector Mobile App – Planning & Development Services\nVideo Inspection Program – Agriculture, Weights and Measures\nAll Hazards Tool – Information Technology\nVirtual Appeal Hearings – Planning & Development Services\nExpansion of Digital and Online Services – Planning & Development Services\nMobile Workforce: Code Compliance Officers in the Field – Planning & Development Services\nDigital Library Project – Library\nSweetwater Bike Park – Parks and Recreation\nEstrella Park – Parks and Recreation\nVirtual Recreation Center – Parks and Recreation\nCOVID-19 Property Tax Penalty Cancellation – Treasurer Tax Collector\nMarriage Hut – Assessor Recorder County Clerk\nStreamlined Defaulted Penalty Cancellation and Split Process – Treasurer Tax Collector\nJELS Agency Drop Box for Local Law Enforcement – County Technology Office\n5 Day Challenge – Human Resources\nTrek Across County Trails – Human Resources\nVirtual Employee Wellness Program – Human Resources\n\nThe complete list of winning programs can be seen in a searchable database.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210630.14.25.51"}