{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pilot Program for Older Adults Offers Rental Subsidy", "description": "The County of San Diego Department of Homeless Solutions and Equitable Communities is launching a pilot program to provide 222 seniors at risk of experiencing homelessness a rental subsidy. ", "datePublished": "2023-02-01T15:59:08-08:00", "url": "https://www.countynewscenter.com/pilot-shallow-rental-subsidy-program-for-older-adults-now-accepting-applicants/", "keywords": ["housing", "affordable housing", "housing", "older adults", "rental subsidy"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-02-01T19:31:20-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Department of Homeless Solutions and Equitable Communities is launching a pilot program to provide 222 seniors at risk of experiencing homelessness a rental subsidy. \nThis program was approved by the San Diego County Board of Supervisors last September. Eligible adults over 55 years old would be provided $500 a month for 18 months to help them stabilize. Assistance payments are anticipated to begin this spring. \nSan Diego’s 55 years or older population is expected to balloon to more than 1.1 million people by 2030. \n“Older adults, in particular people on fixed incomes, are struggling with rising rents and represent a growing part of our homeless population,” said Barbara Jiménez, Community Operations Officer who oversees the Department of Homeless Solutions & Equitable Communities. “This pilot program will help people remain in their homes while also offering light case management services to connect participants to supportive services.” \nAccording to the 2022 We All Count Point-in-Time Count, 25 percent of people who were unsheltered were 55 years and older. \nEligible applicants must: \n\nHave a household income at or below 50 percent of the Area Median Income.  \nBe using more than half of their income toward housing. \nHave their name on the lease or rental agreement. \nHave a landlord willing to participate in the program. \nNot be receiving any other rental subsidies.  \nSign consent forms to participate in the program.  \n\nPilot program participants who meet the eligibility criteria will be selected at random. \nTo apply for this rental subsidy, email your full name and contact information to HSEC-OHS.HHSA@sdcounty.ca.gov or call 619-980-4168. Application assistance and translation services will be provided. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230201.15.59.08"}