{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Gobble Gobble; Take the Annual Thanksgiving Safe-Cooking Quiz!", "description": "Thanksgiving. It's the biggest day of the year for home cooking. The Super Bowl; Barbie 2023; Beyonce; the Eras Tour! And you don’t want to ruin it. So, take our annual Thanksgiving Safe-Cooking Quiz!", "datePublished": "2023-11-15T09:26:19-08:00", "url": "https://www.countynewscenter.com/gobble-gobble-take-the-annual-thanksgiving-safe-cooking-quiz/", "keywords": ["consumer", "dehq", "food safety", "lueg", "thanksgiving"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-11-15T10:51:28-08:00", "articleType": "article", "articleContent": "\nThanksgiving―it’s the biggest day of the year for home cooking. The Super Bowl; Barbie 2023; Beyonce; the Eras Tour!\nAnd you don’t want to ruin it. Which can happen if you serve your friends and family heaping helpings of salmonella, listeria or other dangerous bacteria in your turkey, stuffing, vegetables, salads and desserts by not prepping, cleaning and cooking right.\nFortunately, there are some very simple rules to keep you, your family and friends safe.\nBone―(appétit)―up by taking our annual Thanksgiving safe-cooking quiz!\nThanksgiving feasts start with the thaw! Do you know the best way to thaw frozen meat?\n\nOK. So, when you buy your frozen turkey and bring it home, just set it out on the counter. Yes, you’ll have less counter space. But after a couple days, when the outside is soft, it should be all thawed and ready to cook.\nWoa—days?! Just run it under hot water! Until the outside is soft.\nWhy thaw? Have a turk-cicle… Just think of the Tik-tok challenges!\nPlease, plan ahead and let meat defrost in the fridge. Meats, poultry and fish should be defrosted in the refrigerator. If you’re cooking a big turkey, you should allow at least 24 hours for every five pounds in weight.\n\nAnswer: D. Thawing meat in the refrigerator is absolutely the best and safest method. That’s because a refrigerator allows meat to thaw slowly and evenly, rather than leaving parts of defrosted meat to stand at room temperature where bacteria can multiply exponentially.\nNote: The United States Department of Agriculture (USDA) says that you can also thaw meats in cold water. But—and this is important—the water must be cold, under 40 degrees, and should be changed every 30 minutes to keep it cold. Thawing in the fridge is easier!\nHow often should you wash your hands and cutting boards when preparing food?\n\nBefore you start cooking.\nAfter you pet the dog—or the cat. Or pick up the kids.\nAfter you sneeze, blow your nose or have to run to the bathroom.\nYou don’t have to wash your cutting boards. And if you’re wearing clean clothes, just wipe your hands on your shirt or pants. All good!\nThe answer is A, B and C; but mainly, “OFTEN!”\n\nAnswer: Definitely E. You should wash your hands and cutting boards before and after everything in A, B and C, and pretty much as often as you can in the kitchen. Handwashing is always a key part of safe cooking. So break out that soap and do it. Harmful bacteria, from E. coli to salmonella and staphylococcus aureus, as well as viruses, can be removed from people’s hands through proper handwashing.\nHere are just a few other things you should wash your hands after doing: coughing, handling money, eating, drinking, playing video games and handling or preparing raw food.\nShould you rinse off fruits and vegetables?\n\nNah., They wash them at the supermarket. Don’t they?\nAgain, if you’re wearing clean clothes, wiping them off on your shirts or pants will do.\nYou should definitely rinse fruits and vegetables with cold water. It will remove lingering dirt that can carry bacteria.\nIt’s better if you don’t wash them. Dirt is chock-full of vitamins and minerals.\n\nAnswer: Sí. I mean C, of course! Rinsing with cold water cleans off dirt and other contaminants (more germs than minerals…). But don’t wash them with detergents or soap, even dishwashing soap. You could end up eating residues from those cleaners if they’re absorbed by fruits and vegetables.\nWhy should you keep raw meats and meat products separated from fruits and vegetables when cutting them up or preparing them?\n\nI heard this story once. Guy left his vegetables and meat together on his cutting board. Kitchen was hit by lightning. It turned into a Veggie-saurus. And it destroyed the whole house. So, there’s that…\nNot only should you keep them together, you should also let them soak for a while. Juice from meats is called “marinade.”\nBecause raw meats, meat products and blood can carry bacteria like E. coli and salmonella that can contaminate fruits and vegetables—and make people sick.\nVegetables? Who eats vegetables?\n\nAnswer: The correct answer is C. Cross-contamination is one of the most common causes of food-borne illness according to the USDA. That is, the transfer of harmful bacteria from one food, particularly raw meats, poultry and shellfish, to other foods. When preparing food, you need to keep raw meats and their juices away from fruits and vegetables and all ready-to-eat foods.\nNote: If you can, use separate cutting boards for meats and produce. If you can’t use separate cutting boards, wash yours with hot, soapy water after using them on raw meats and before using them to cut fruits and vegetables. Or use your cutting board to chop vegetables first, then use it to prepare your uncooked meat, then wash it with hot, soapy water.)\nIs the “five-second rule” real? Can you eat something you’ve dropped on the floor if you pick it up in less than five seconds?\n\nDepends. What part of the floor did you drop it on??\nMan. My dogs eat stuff off the floor all the time and they never get sick. Nothing can contaminate your food in less than five seconds. Pick it up quick and blow on it.\nNo. It is NOT real. You really shouldn’t eat anything you’ve dropped on floor.\n\nAnswer: C. Eating food off the floor is OK for the dogs, but NOT people. Truth is, almost any contact is long enough for food to be contaminated by bacteria that can be found on the ground or in your house. According to Rutgers University, bacteria can transfer from a surface to food in less than one second!\nAnd finally (drum roll please), for the umpteenth year in a row, our favorite cook-safely quiz question…\n What is the Danger Zone? And what does it have to do with Thanksgiving dinner?\n\nHey man, there’s only ONE “Danger Zone.” I mean, just Google it. It’s that great song from “Top Gun.” Tom Cruise, Giorgio Moroder and Kenny Loggins!  “Highway to the DANGER ZONE! Riiiide in—to the DANGER ZONE!”\nEasy. The Danger Zone is anywhere in Ken’s Mojo Dojo Casa House…\nIt’s that distance you have to walk—through kids, over toys, past the pets and without tripping on the bunched carpet—to get your Thanksgiving feast from the kitchen to the table. Without. Dropping. A thing.\nIt’s the range of temperatures between 41 degrees Fahrenheit and 135 degrees Fahrenheit—the temperatures where bacteria can grow like crazy in foods, doubling in number in as little as 20 minutes.\n\nAnswer: D; it’s definitely D. With all due respect to Top Gun, the real “Danger Zone” is the range of temperature between 41 degrees and 135 degrees Fahrenheit that allows bacteria to breed exponentially—not a good thing. If hot foods cool or cold foods heat up enough to enter that zone, your food can become a bacteria-fest. And you, your family and friends can end up getting sick. So keep hot foods safely heated with chafing dishes, preheated steam tables, warming trays, slow cookers and ovens. Place cold foods in containers on ice, or in the fridge. And refrigerate leftovers as soon as you can, but definitely within two hours.\nThere you have it. Now you’re an expert. But if you’re still interested, you can get more information about food safety tips at FoodSafety.gov’s “Food Safety by Types of Food” webpage, or by calling the USDA’s Meat and Poultry hotline at 1-888-674-6854.\nSo, be safe. Cook safe. And keep the safe-giving in your Thanksgiving!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231115.09.26.19"}