{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Give Your Input at Community Budget Meetings", "description": "People in the community will get a chance to give their feedback on the County’s new recommended budget at two community budget meetings next week.", "datePublished": "2023-05-12T10:53:52-07:00", "url": "https://www.countynewscenter.com/give-your-input-at-community-budget-meetings/", "keywords": ["government", "2023-24 budget", "community budget meeting", "community feedback", "community input", "engage san diego county"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-05-12T11:21:32-07:00", "articleType": "article", "articleContent": "\nPeople in the community will get a chance to give their feedback on the County’s new recommended budget at two community budget meetings next week.\nThe meetings give people a chance to learn more about the budget, ask questions and give their input.\nThe first one will be a hybrid in-person and virtual meeting. It will take place from 2 to 4 p.m. on Tuesday, May 16 at the County Operations Center in Kearny Mesa.\nThe second meeting will be held in the evening and be virtual only. The meeting will run from 5:30 to 7 p.m. on Thursday, May 18.\nBoth meetings will begin with welcoming remarks on why the budget matters and how the community played a role in it. From there, a brief video will explain how the budget process works.\nThe County’s departments are broken down into four groups: Public Safety, the Health and Human Services Agency, Land Use and Environment, and Finance and General Government.\nThe general managers of each one will give a budget overview about their group and show how the budget plan could support and improve their services. County finance experts will also be on hand.\nAfterward, members of the community can ask questions and make comments.\nIf you would like to attend, you can register at Engage San Diego County. There, you will find address and virtual meeting information. You can also request language and accessibility services.\nIf you happen to miss both meetings, recordings will be made available in English and Spanish at Engage San Diego County after both meetings have taken place.\nPublic hearings on the budget start at 9 a.m. on June 12, and 5:30 p.m. on June 15. Both will be held at the County Administration Center.\nYou can watch, listen and participate during the hearings. You can also submit eComments at any time between now and 5 p.m. on June 21. Budget deliberations and adoption are scheduled for June 27.\nTo find out more about the recommended budget, read the executive summary or the full recommended budget plan.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230512.10.53.52"}