{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County and Partners Break Ground on Housing Complex for Homeless Seniors", "description": "The County and its partners broke ground Monday on a new housing complex for seniors who experience homelessness. The 74-unit project in the Nestor area will serve San Diegans age 55 and older who are currently unsheltered or at risk of becoming homeless.", "datePublished": "2022-07-25T16:38:19-07:00", "url": "https://www.countynewscenter.com/?p=209040", "keywords": ["housing", "framework for ending homelessness", "homeless", "housing for seniors"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-07-25T16:38:19-07:00", "articleType": "article", "articleContent": "\nThe County and its partners broke ground Monday on a new housing complex for seniors who experience homelessness. The 74-unit project in the Nestor area will serve San Diegans age 55 and older who are currently unsheltered or at risk of becoming homeless.\nWhile all units at Nestor Senior Village will serve homeless seniors, about half of the units will be set aside specifically to serve homeless seniors with a serious mental illness.\n“Nestor Senior Village will bring much needed supportive housing to this community,” said David Estrella, director of HHSA’s Housing and Community Development Services. “Affordable housing coupled with comprehensive supportive services will ensure that seniors experiencing mental health challenges truly benefit from this development.”\n\nNestor Senior Village is a collaboration between the County, City of San Diego, San Diego Housing Commission and Nestor United Methodist Church. The church is leasing some of its surplus land to the development through a ground lease and the housing complex is being constructed adjacent to the church.\nThe County provided $7.5 million in funding through its No Place Like Home initiative and the San Diego Housing Commission provided about $3 million in capital funding in addition to 73 project-based housing vouchers.\nServing A Growing Population\nMany older adults find themselves struggling to stay sheltered due to the high cost of living in the area, major illness or even the loss of a spouse. One in every four people who experiences homelessness in San Diego is 55 years or older and that number is expected to rise as the Baby Boomer generation ages.\nNestor Senior Village is one of more than a dozen projects the County of San Diego is supporting that are currently under construction across the region. Combined, the developments will add more than 950 affordable housing units to our local communities.\nThe new senior housing complex aligns with the County’s Framework for Ending Homelessness, which was approved by the Board last year.\nAs part of the framework, the County has committed to investing more than $53 million to create supportive housing for persons with a serious mental illness who are experiencing or at risk of homelessness.\nNestor Senior Village is expected to open in January 2024.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220725.16.38.19"}