{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two County Parks Close in High Heat", "description": "Due to triple-digit temperatures, two County parks will be closed for the month of August. They are El Capitan County Preserve in Lakeside and Mt. Gower County Preserve in Ramona.", "datePublished": "2024-08-06T09:54:36-07:00", "url": "https://www.countynewscenter.com/two-county-parks-close-in-high-heat/", "keywords": ["parks and rec", "county parks", "excessive heat", "health", "heat safety tips", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-08-06T10:14:35-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDue to triple-digit temperatures, two County parks will be closed for the month of August. They are El Capitan County Preserve in Lakeside and Mt. Gower County Preserve in Ramona.\nThese locations have difficult trails that end in isolated areas. They also offer very limited shade which can lead to dangerous conditions during major heat events. They join two desert parks that are already closed for the summer due to extreme heat: Vallecito and Agua Caliente County Parks.\nClosing parks is always a last resort, but it is done to reduce heat-related incidents like heat exhaustion and heat stroke.\n“When we close park gates, it’s to reduce health risks and related injuries caused by severe weather events – for guests as well as for our own team members who are called to assist in emergency situations,” said Brian Albright, director of the County of San Diego Department of Parks and Recreation.\nThe closures also provide County Parks and Recreation staff an opportunity to conduct needed maintenance including trail restoration. This work is done in the early morning or evening while it is cooler.\nThe County will continue to work safely to improve your park experience and look forward to welcoming you back to El Capitan and Mt. Gower County Preserves in September.\nThere are more than 100 other County parks and preserves to explore during the month of August – like Waterfront Park and its new active recreation area. It’s open daily from 6 a.m. to 10 p.m.\nIf it is really hot, consider staying home or plan your next hike by taking one of these virtual tours of some of the County’s most popular trails.\nIf you do go out for a hike, be smart about it! Here are some safety tips to consider:\n\nLet someone know where you will be and when you plan to return.\nHike with others, never alone.\nLeave your dog at home for difficult hikes. Even “easy” hikes may be too much for your dog when the air or ground are too hot.\nTake plenty of water to stay hydrated. Rangers recommend one liter (about a quart) for every 2 to 3 miles.\nWear sunscreen, a hat and sunglasses.\nTake breaks in shade, if possible.\nTake a fully charged mobile phone, map and/or GPS.\nWear lightweight, light-colored, ventilated clothing.\nBring along a warm jacket if you plan to stay out after dusk.\nWear sturdy shoes with traction for slippery rocks.\nFollow all posted safety rules.\nBring ample food, sunscreen to reapply, a flashlight, first aid kit, multi-purpose tool and a whistle.\nKnow your limitations; choose trails that match your level of physical fitness and areas where you are not going to get lost.\n\nFor additional information on visiting County Parks, visit sdparks.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240806.09.54.36"}