{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What’s Allowed, Not Allowed in Restaurants, Stores", "description": "Restaurants and stores can now open to serve customers in person. However, they must follow specific guidelines to prevent the spread of COVID-19.", "datePublished": "2020-05-21T17:35:15-07:00", "url": "https://www.countynewscenter.com/whats-allowed-not-allowed-in-restaurants-stores/", "keywords": ["health", "coronavirus", "covid-19", "restaurants"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-21T17:49:27-07:00", "articleType": "article", "articleContent": "\nRestaurants and stores can now open to serve customers in person. However, they must follow specific guidelines to prevent the spread of COVID-19.\nGuidelines for dine-in restaurants are:\n\nTemperature/symptom screening for employees daily\nEmployees with symptoms are not allowed to work\nAll tables need to be six feet apart or have barriers separating them\nSigns need to be posted reminding customers to social distance\nEmployees must wear facial coverings\nCustomers must wear facial coverings except when seated\nNo self-service such as buffets, salad bars, soda machines, etc.\nEncourage reservations\nExpand outdoor seating\n\nBefore reopening, food businesses must fill and post the County Restaurant Operating Protocol. Additional guidance, posters and information for a safe reopening can be found on the coronavirus-sd.com page for restaurant operators website.\nThe County Department of Environmental Health continues conducting food safety status verifications to ensure compliance with the California Retail Food Code and provide guidance and education on the Health Officer Orders.\nRetail shopping \nCustomers are allowed in stores, including malls, with the following requirements:\n\nPost signs saying no employees or customers with COVID-19 symptoms should enter\nTemperature/symptom screening for employees daily\nEmployees and customers must wear facial coverings\nLimit number of customers to maintain six feet of distance\n\nBusinesses that have not done so already need to complete a Safe Reopening Plan, post it at their entrance and discuss with their employees. Retail businesses that have been providing curbside or front-door pick-up and will now be allowing customers indoors must update their plan.\nThe public or employees should not enter any business if they have symptoms of COVID-19, which include cough, shortness of breath or difficulty breathing, fever, chills, muscle pain, sore throat, or a new loss of taste or smell.\nThe plan was adopted because the County meets all the current readiness criteria and can safely move into an accelerated reopening.\nAs more places open to the public, it’s important for people to continue taking precautions to avoid getting and spreading COVID-19.\n“Dining out and shopping must be done safely as crowded places increase the risk of exposure to COVID-19,” Wooten said. “People should continue wearing a face covering in public, maintain their distance from others, avoid touching their face and wash their hands frequently.”\nWhile some San Diegans would like for more businesses to reopen and other activities to occur, the State has yet to allow the following to open:\n\nHotels, Airbnb\nGyms, fitness centers\nHair, nail salons\nBeach parking lots\nSitting or lying down on the beach\nReligious services, except funerals performed with social distancing\n\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n4,722 tests were reported to the County May 20, and 175 or 4% were positive.\n3.7% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n175 new cases were reported for a San Diego County total of 6,315.\n1,183 or 18.7% of the total cases have required hospitalization.\n354 or 5.6% of all cases had to be placed in intensive care.\n\nDeaths:\n\n11 more COVID-19 deaths were reported today, bringing the region’s total to 241.\nSeven women and four men died, and their ages ranged from 51 to 100 years.\nAll but one had underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n73 active outbreaks, 50 at congregate living facilities and 23 in community settings.\n1,391 cases, including 119 deaths in congregate living facilities.\n299 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200521.17.35.15"}