{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Help the County Update Emergency Plans", "description": "The San Diego County Office of Emergency Services is asking County residents to provide feedback for two emergency plans. The survey feedback will be incorporated into the Operational Area Emergency Operations Plan and the Multi-Jurisdictional Hazard Mitigation Plan.", "datePublished": "2022-04-01T09:02:46-07:00", "url": "https://www.countynewscenter.com/?p=208093", "keywords": ["public safety", "feedback", "forum", "hazard mitigation plan", "oes", "office of emergency services", "survey"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-04-04T10:18:57-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Office of Emergency Services is asking County residents to provide feedback for two emergency plans. The survey feedback will be incorporated into the Operational Area Emergency Operations Plan and the Multi-Jurisdictional Hazard Mitigation Plan.\nThese plans cover hazards like earthquakes, flooding, fires, tsunamis and even terrorist attacks. One of the plans also identifies risks and goals to minimize impacts from natural and human-caused disasters. Both plans were last revised in 2018 and are currently being reviewed to reflect changes in current operations and capabilities.\nThe survey is available in six languages, English, Spanish, Tagalog, Chinese (Simplified and Traditional), Arabic, and Vietnamese.\nThe feedback will be added to the Office of Emergency Services’ two plans to coordinate response to major emergencies and disasters.  The goal is to further protect residents, their property, and the environment.\nSurvey feedback should be provided by May 1.  Residents who choose to include their email address in the survey will be invited to attend a virtual forum on Monday, May 23. In the forum, the Office of Emergency Services will review the survey results and offer residents a chance to provide additional feedback on the plans.\nTo help, visit the Office of Emergency Services website.:\nwww.sandiegocounty.gov/oes.\nEmail addresses provided in the survey will be used to send a virtual form invitation and will not be shared with anyone outside of the County survey and forum planning team.\nAdditional disaster preparedness information is available at:\nwww.ReadySanDiego.org.\nThe Office of Emergency Services also encourages everyone to sign up for AlertSanDiego, which will notify people if they are in danger of being impacted by an emergency or disaster.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220401.09.02.46"}