{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Earthquake Preparedness Month Reminds Residents: “Don’t Get Caught Off Guard”", "description": "April is Earthquake Preparedness Month in California, and the County of San Diego’s Office of Emergency Services (OES) and California Governor’s Office of Emergency Services (Cal OES) are reminding residents to “not get caught off guard” and have a plan for how to protect themselves in the event of an earthquake.", "datePublished": "2021-04-28T12:31:57-07:00", "url": "https://www.countynewscenter.com/earthquake-preparedness-month-reminds-residents-dont-get-caught-off-guard/", "keywords": ["public safety", "earthquake", "earthquake early warning", "emergency", "emergency preparedness", "office of emergency services", "preparedness"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-04-28T13:52:04-07:00", "articleType": "article", "articleContent": "\nApril is Earthquake Preparedness Month in California, and the County of San Diego’s Office of Emergency Services (OES) and California Governor’s Office of Emergency Services (Cal OES) are reminding residents to “not get caught off guard” and have a plan for how to protect themselves in the event of an earthquake.\nSan Diego County is home to three major active faults: the Rose Canyon Fault (which runs along the coast, through downtown, Old Town and La Jolla), and the San Jacinto and Elsinore faults, which run through the northern and eastern areas of the county. Earthquakes along these faults could produce damaging earthquakes that may disrupt roadways, transportation, and services like water, gas, and phone communication for weeks or months. Coastal areas are also at risk for tsunamis.\nAs part of the state’s 2021 “Don’t Get Caught Off Guard” campaign, OES and Cal OES officials are encouraging residents to take the time to know their risks, update their emergency plan, register for local emergency alerts, and download an earthquake early warning app.\nThe County’s Office of Emergency Services will launch earthquake early warning technology, ShakeReadySD, powered by ShakeAlert®, in the SD Emergency app this July. When enabled, ShakeReadySD is designed to alert iPhone and Android users seconds before a magnitude 4.5 or higher earthquake with moderate to strong shaking is expected in your area so you can take the right actions quickly to protect yourself.\nIn the meantime, Californians can download the state’s no-cost MyShake App to their iPhone and Android. Managed by Cal OES, the MyShake app is part of the Earthquake Warning California system that similarly uses a network of ground motion sensors located across the state to alert users through the app, Android Alerts, and the Wireless Emergency Alert system to “Drop, Cover and Hold On” seconds before significant earthquake with the criteria mentioned above arrives.\nIf you live in or travel to areas that could be impacted by an earthquake, preparation is vital, as these events can strike suddenly, at any time, with little warning. To discover your level of risk for earthquakes and the specific steps you should take to prepare, visit the Know Your Hazards map tool. For more information about hazards throughout California, visit Cal OES’ My Hazards map.\nTo register for AlertSanDiego, the county’s regional emergency mass notification system, and to learn about the steps you can take to prepare for earthquakes and other disasters, visit ReadySanDiego.org. More information on earthquake early warning, visit ShakeAlert.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210428.12.31.57"}