{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Awarded Grant to Supervise High-Risk, Repeat DUI Offenders", "description": "The San Diego County Probation Department received a $335,000 grant from the California Office of Traffic Safety to provide more intensive monitoring for people convicted of driving under the influence.", "datePublished": "2021-11-01T12:35:31-07:00", "url": "https://www.countynewscenter.com/probation-awarded-grant-to-supervise-high-risk-repeat-dui-offenders/", "keywords": ["public safety", "dui grant", "ots grant", "probation"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-11-01T12:35:31-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Probation Department received a $335,000 grant from the California Office of Traffic Safety to provide more intensive monitoring for people convicted of driving under the influence.\n“Our monitoring program helps probationers stay on track with treatment and other court-ordered measures,” San Diego County Interim Probation Chief Cesar Escuro said. “The goal is that with additional guidance and help, it will reduce the number of probationers who are arrested or cited again for DUI.”\nThe grant will help fund regular and frequent check-ins with high-risk, felony and repeat DUI offenders. Probation officers monitor the person’s compliance with their treatment plan, DUI program participation, court orders, and their substance abuse by conducting frequent alcohol and drug testing, and home visits during non-traditional and evening hours, weekends, and holidays.\n“Prevention and treatment are valuable tools in reducing DUI recidivism rates,” OTS Director Barbara Rooney said. “Monitoring programs are intended to steer probationers in the right direction.”\nThe probation grant will also pay for operations targeting probation violations, alcohol testing, officer training in Standard Field Sobriety Testing and collaborating with courts and prosecutors to establish probation orders.\nThe grant program runs through September 2022. Funding for the OTS grant program is provided through the National Highway Traffic Safety Administration.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211101.12.35.31"}