{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Asks for Patience as COVID-19 Vaccine Eligibility Expands ", "description": "As many as half a million additional people in San Diego County will become eligible on Saturday for the COVID-19 vaccine, but supplies remain limited, and it’s expected to take weeks before all those included in the next eligibility tier could get vaccinated. ", "datePublished": "2021-02-25T19:05:00-08:00", "url": "https://www.countynewscenter.com/county-asks-for-patience-as-covid-19-vaccine-eligibility-expands/", "keywords": ["health", "coronavirus", "covid-19", "essential worker vaccinations", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-02-25T19:28:10-08:00", "articleType": "article", "articleContent": "\nAs many as half a million additional people in San Diego County will become eligible on Saturday for the COVID-19 vaccine, but supplies remain limited, and it’s expected to take weeks before all those included in the next eligibility tier could get vaccinated.\nThose working in emergency services, education and childcare, as well as food and agriculture can begin receiving vaccinations starting Feb. 27. Each of those sectors includes a wide variety of occupations, and there are vaccination plans in place for certain subsets of those groups.\nThose not covered by specific vaccination plans for their occupation should contact their primary care doctor or schedule an appointment at vaccinationsuperstationsd.com.\nNewly-eligible essential workers\nEmergency services includes law enforcement officers, whose vaccination appointments will be coordinated by Scripps Health. Others in that sector include those working in 911 call centers, building security, disaster monitoring and hazardous materials response.\nEducation and childcare includes all teachers and staff at those facilities. Those working in transitional kindergarten through 12th grade will have appointments coordinated by the County Office of Education through the California Schools VEBA. They must use vebavaccinates.com and should not show up at vaccination sites prior to an appointment confirmed through VEBA\nEducation staff working at childcare facilities or in higher education not covered by California Schools VEBA should go through their primary care doctor or visit vaccinationsuperstationsd.com.\nFood and agriculture includes workers for any grocery or convenience store; those supporting restaurant carry-out and quick serve food operations, including food preparation; food manufacturing; a variety of support functions for food and animal feed industries.\nThe food and agriculture sector also includes farm workers. They will be the focus of a campaign by Operation Collaboration, a coalition of firefighters and medical personnel providing COVID-19 vaccines throughout the region. Operation Collaboration will visit fields and agricultural areas to deliver vaccines to workers in remote areas of the county.\nThe newly eligible groups are in addition to health care workers and anyone 65 and older. People 16 years of age and older with underlying conditions, regardless of occupation, can begin signing up for vaccinations on March 15.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 15 cases per 100,000 residents (as of Feb. 23) and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 5%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.4% and is in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March. 2.\n\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed Feb. 24: four in business settings, one in a daycare/preschool/childcare setting, one in a faith-based agency setting and one in a retail setting.\nIn the past seven days (Feb. 18 through Feb. 24), 30 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n18,830 tests were reported to the County on Feb. 24, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 4.4%.  Target is less than 8.0%.\nThe 7-day, daily average of tests is 14,464.\n\nCases, Hospitalizations and ICU Admissions:\n\n519 cases were reported to the County on Feb. 24. The region’s total is now 258,982.\n13,095 or 5.1% of all cases have required hospitalization.\n1,580 or 0.6% of all cases and 12.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n30 new COVID-19 deaths were reported Feb. 24. The region’s total is 3,260.\nTwelve women and 18 men died between Jan. 14 and Feb. 24.\nOf the 30 deaths reported Feb. 24, 10 people who died were 80 years or older, nine were in their 70s, eight were in their 60s, one was in their 50s and two were in their 40s.\nTwenty-seven had underlying medical conditions, two did not and one has medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210225.19.05.00"}