{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Top Stories from the San Diego County News Center in 2023", "description": "There was a lot of news in 2023. The most widely read and viewed County News Center stories and topics showed the wide range of things that happened in San Diego County. From the County creating more affordable housing and tackling homelessness, to an actual and extremely rare cyclone warning, to one of the largest boil water orders in recent memory, there was a lot to talk about.", "datePublished": "2024-01-03T10:41:26-08:00", "url": "https://www.countynewscenter.com/top-stories-from-the-san-diego-county-news-center-in-2023/", "keywords": ["government", "affordable housing", "boil water", "covid-19", "rocky mountain spotted fever", "ticks", "top baby names", "top stories", "tropical cyclone hilary", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-01-03T10:43:44-08:00", "articleType": "article", "articleContent": "\nIt was a busy news year in San Diego County in 2023. The most widely read and viewed County News Center stories and topics showed the wide range of things that happened in San Diego County. From the County creating more affordable housing and tackling homelessness, to an actual and extremely rare cyclone warning and one of the largest boil water orders in recent memory, there was a lot to talk about.\nHere is a look at just a few of the most read and viewed news topics and stories reported on the County News Center in 2023.\nAffordable Housing\nAs it has been in recent years, affordable housing and ending homelessness were huge stories for the County of San Diego in 2023. The County works every year to create or preserve affordable housing through numerous programs to help low-income families, seniors, foster kids, people experiencing homelessness, veterans and people with disabilities. Some of those include “No Place Like Home,” the “HOME Investment Partnership,” using County-owned excess property to create housing, and project-based vouchers.\nThe County News Center ran widely read stories about the grand openings of new affordable homes in San Ysidro, apartments in Alpine, housing units in San Marcos in both July and April, and apartments in Linda Vista. The County also broke ground on several projects. Those included apartments in Clairemont, a 70-unit development in Carlsbad and a housing project in Oceanside—and started building a new complex in San Ysidro.\nSeriously…a Cyclone?\nYup. In late August, San Diegans were told to batten down the hatches and prepare for the possibility of an actual tropical cyclone—Hurricane Hilary. The storm was eventually downgraded to a tropical storm by the time it drenched San Diego County Aug. 20. But with fears of catastrophic and deadly flooding, Hilary prompted the National Hurricane Center to issue its first-ever tropical storm warning for Southern California. And it became the only tropical storm to directly hit San Diego County in more than 80 years.\nHilary shattered single-day rainfall records that had stood since 1977 across the county, with more than seven inches falling on Aug. 20 alone on Ranchita and Mt. Laguna.\nDays in advance the County of San Diego provided free sandbags, offered driving tips and opened its regional Emergency Operations Center. SeaWorld and the San Diego Zoo closed in anticipation; schools closed in its aftermath. A tornado warning was issued in East County. In all, Hilary caused power outages, road detours, mudslides, fallen trees and canceled and delayed flights. Still, in the end, damage was contained and County and City of San Diego officials thanked the public for listening to and heeding emergency warnings, staying home and off the roads—all of which reduced Hilary’s damage.\nBoil Water Order\nOne of the most-read series of County News Center stories regarded the Cal-American Boil Water order that immediately followed Tropical Storm Hilary in August. The County helped coordinate the response to notify impacted cities, provide health and safety guidance and distribute bottled water during the period the boil water order as in effect. And, after the lifting of the order, the County provided businesses with free surveys to report damage from the order.\nBoil water orders are issued when drinking water supplies test positive for possible contaminations, often from bacteria or other contaminants that can make people sick. They typically involve small water systems—like wells—and affect small numbers of people.\nBut the Cal-American Boil Water Order, issued by the company, was notable for its size. The Company estimated that more than 17,000 customers were affected from Aug. 24-26. The communities included Imperial Beach, the City of Coronado south of Fiddler’s Cove, parts of the City of San Diego including Nestor and Otay Mesa West, and portions of southwest Chula Vista.\nPublic Service\nSome of the most popular stories from the County News Center in 2023 weren’t about big events or ongoing initiatives. Instead they included news, tips and information that ran the gamut of the services the County provides every day of every year—from public health to just plain fun.\nCOVID-19 Still Here, Get Vaccinated\nEven as we approach 2024, COVID-19 remains prevalent across the U.S., the world and in San Diego County. This week the Los Angeles Times reported that “everyone seems to be sick” and that nationally, COVID-19 remains the primary cause of new respiratory hospitalizations and deaths. In September, County officials urged San Diegans to stay up-to-date with new COVID-19 vaccinations, which were designed to respond to current strains of the virus.\nRocky Mountain Spotted Fever\nIn November, the County’s Health and Human Services Agency and Department of Environmental Health and Quality reported that a local man had died from Rocky Mountain spotted fever after traveling to Baja California. It marked the first death in a local hospital from the bacterial disease since 2014. The disease is passed to humans when they’re bitten by infected ticks. San Diego County typically sees one-to-three cases a year. November’s widely read County News Center story talked about the disease and offered people tips to protect themselves and pets from ticks.\nTop 10 Baby Names\nWho doesn’t love a Top 10 list? Or babies? Put the two together and readers perk up! In case you’re curious, the top two names—Mateo and Olivia—mean “gift of God” and “peace.” Read about the full list!\nStay on top of what 2024 will bring by signing up for updates from the County News Center.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240103.10.41.26"}