{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local COVID-19 Cases Hit Another Record Ahead of Thanksgiving", "description": "The County Health and Human Services Agency confirmed 1,546 new COVID-19 cases today, surpassing the previous record of 1,478 cases set just last Friday.", "datePublished": "2020-11-24T17:34:02-08:00", "url": "https://www.countynewscenter.com/local-covid-19-cases-hit-another-record-ahead-of-thanksgiving/", "keywords": ["health", "coronavirus", "covid-19", "record cases", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-11-24T17:34:02-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency confirmed 1,546 new COVID-19 cases today, surpassing the previous record of 1,478 cases set just last Friday. The continuing surge of cases and hospitalizations is pushing the County further into the state’s most restrictive Purple Tier.\nNew data released by the state Tuesday shows the County’s adjusted case rate has increased to 13.1 cases per 100,000 residents. This is a 2.4-point increase over last week.\n“The continuing spike in cases ahead of this week’s holiday is alarming and it is vital that all San Diegans commit themselves to the public health guidance,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The sooner we lower our case rates, the sooner we will be able to lift restrictions and reopen our businesses.”\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure of case rate or testing positivity to assign tiers regarding what activities are permitted. Indoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed.\nThe County’s state-calculated, adjusted case rate is currently 13.1 cases per 100,000 residents and the region is in Purple Tier or Tier 1 for that metric.\nThe testing positivity percentage is 3.1%, placing it in Tier 3 or the Orange Tier for that metric.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 9.3% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance.\nThe California Department of Public Health announced that tier assignments, typically given each Tuesday, may now occur any day of the week and may occur more than once a week.\n\nCommunity Setting Outbreaks:\n\nFifteen new community outbreaks were confirmed on Nov. 23: three in retail settings, three in business settings, three in restaurant/bar settings, two in restaurant settings, one in a government setting, one in a grocery setting, one in a faith-based agency setting and one in a TK-12 school setting.\nIn the past seven days (Nov. 17 through Nov. 23), 73 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n17,329 tests were reported to the County on Nov. 23, and the percentage of new laboratory-confirmed cases was 9%.\nThe 14-day rolling average percentage of positive cases is 5.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 20,397.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n1,546 new cases were confirmed among San Diego County residents on Nov. 23, the highest one-day total since the beginning of the pandemic. The region’s total is now 74,361.\n4,435 or 6% of all cases have required hospitalization.\n1,002 or 1.3% of all cases and 22.6% of hospitalized cases had to be admitted to an intensive care unit.\nA new COVID-19 case rate map shows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nSixteen new deaths were reported in the County on Nov. 23. The region’s total is now 984.\nFive women and 11 men died between Nov. 7 and Nov. 23. Their ages ranged from early 60s to late 90s.\nFourteen had underlying medical conditions, two did not have any underlying conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201124.17.34.02"}