{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccination Clinics to Open at SDSU, Mexican Consulate", "description": "Two new COVID-19 vaccination clinics are opening in the region and will take measures to focus on people in communities hit hardest by the pandemic.", "datePublished": "2021-03-22T18:12:28-07:00", "url": "https://www.countynewscenter.com/covid-19-vaccination-clinics-to-open-at-sdsu-mexican-consulate/", "keywords": ["health", "coronavirus", "covid-19", "mexican consulate", "sdsu", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-22T18:12:42-07:00", "articleType": "article", "articleContent": "\nTwo new COVID-19 vaccination clinics are opening in the region and will take measures to focus on people in communities hit hardest by the pandemic.\nA walk-up clinic will be administering vaccines from 9:30 a.m. to 3:30 p.m. Tuesdays through Saturdays at Viejas Arena at San Diego State University, located at 5500 Canyon Crest Dr. in San Diego. Initially, the clinic will be able to administer 750 doses daily but can ramp up to 1,500 per day when more doses are available in the region.\nCOVID-19 vaccines will also be available from 9:30 a.m. to 3:30 p.m. Tuesdays, Wednesdays and Thursdays at the patio in the Mexican Consulate, 1540 India St. in Little Italy. The walk-up clinic will have the capacity to administer up to 100 appointments a day, dependent on supply.\nAs part of Project SAVE (Scheduling Assistance for Vaccine Equity), these clinics take steps to ensure an equitable distribution of the novel coronavirus vaccine, including offering reserved appointments.\nThe reserved appointments will be filled through outreach by community health workers or promotoras who are reaching out to people through various ways, including at grocery stores, faith centers, food distribution sites and housing complexes in different impacted parts of the region.\nThe Viejas Arena clinic will set aside 10 percent of doses for residents who live in communities adjacent to SDSU, as will the existing Copley-Price YMCA clinic. The Mexican Consulate site will serve members of the Latino community, which has been more severely impacted by COVID-19, as well as the general community.\nAppointments are required for both sites and can be made by visiting www.vaccinationsuperstationsd.com or, for those 65 years of age or older, by calling 2-1-1.\nVaccination Progress:\n\nOver 1.52 million COVID-19 vaccine doses have been delivered to the region, and more than 1.42 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, almost 502,000 County residents, or 18.7% of San Diegans 16 and older, are fully immunized.\nOverall, over 811,000 County residents have received at least one shot of the two-dose vaccine. That’s 30.2% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.8 cases per 100,000 residents. The County is in the Red Tier.\nCurrently, the testing positivity percentage is 2.8%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 4.2% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March 23.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed March 21.\nFour new community outbreaks were confirmed March 20: one in a restaurant/bar setting, one in a restaurant setting, one in a fitness/gym setting and one in a faith-based setting.\nFour new community outbreaks were confirmed March 19: two in TK-12th grade school settings, one in a private residence and one in a business setting.\nIn the past seven days (March 15 through March 21), 18 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n4,928 tests were reported to the County on March 21, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 2.9%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,101.\n\nCases, Hospitalizations and ICU Admissions:\n\n189 COVID-19 cases were reported to the County on March 21. The region’s total is now 267,917.\n13,943 or 5.2% of all cases have required hospitalization.\n1,628 or 0.6% of all cases and 11.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported March 21. The region’s total is 3,494.\nTwo new COVID-19 deaths were reported March 20.\nOne man his 70s died Feb. 6 and a woman in her 80s died Jan. 11.\nBoth had underlying medical conditions.\nOne new COVID-19 death was reported March 19.\nA man in his 60s died March 14 and had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210322.18.12.28"}