{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "How to Fight the Two: COVID-19 and Influenza", "description": "The novel coronavirus and influenza may be different viruses, but they can be fought in many of the same ways.", "datePublished": "2020-10-01T10:50:38-07:00", "url": "https://www.countynewscenter.com/how-to-fight-the-two-covid-19-and-influenza/", "keywords": ["health", "coronavirus", "covid-19", "flu", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-10-01T13:09:27-07:00", "articleType": "article", "articleContent": "\nThe novel coronavirus and influenza may be different viruses, but they can be fought in many of the same ways.\nThe primary difference is there is a vaccine available now to protect you against the flu, while we wait for one to arrive for COVID-19.\nToday, with influenza season on its way, County health officials are encouraging San Diegans to get vaccinated to prevent getting the flu.\n“Influenza and COVID-19 are both respiratory illnesses. You must do all you can to prevent getting both at the same time,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Get a flu shot now and continue taking the recommended precautions that work at preventing both viruses.”\nWhere to Get a Flu Shot\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nThe influenza vaccine is now available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit www.sdiz.org or call 211 San Diego.\n“The influenza vaccine is safe and effective,” Wooten said. “Get vaccinated now so that you can get protected when influenza begins to spread.”\nA County employee gets a flu shot.\nTips to Prevent the Flu and COVID-19\nThe novel coronavirus and influenza are both spread from person to person, especially indoors and in crowded places.\nHere are some tips to help you prevent COVID-19 and the flu:\n\nWash your hands properly and regularly or use a hand sanitizer.\nCover your cough or sneeze with a tissue, throw it away and wash your hands.\nIf you’re sick, stay home and isolate yourself from others.\nUse a face covering when in public and close to others. They prevent spreading germs and viruses.\nMaintain physical distance from others.\nAvoid crowded places to decrease your risk of exposure.\n\nLast season, a total of 20,711 lab-confirmed flu cases were reported in the region and 108 San Diegans died from complications from influenza.\nThrough Sept. 30, a total of 47,180 COVId-19 cases have been reported in San Diego County, including 783 deaths.\nFor more information about influenza and COVID-19 is available at www.sdiz.org and www.coronavirus-sd.com, respectively.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201001.10.50.38"}