{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Offer Mpox Vaccines and other Services at Pride Festival", "description": "Pride festival goers can get Mpox vaccines, chill out in the senior cool zone and wave hello to County Library workers as they are honored as grand marshals during the annual Pride Parade this weekend.  ", "datePublished": "2024-07-19T08:25:35-07:00", "url": "https://www.countynewscenter.com/county-to-offer-mpox-vaccines-and-other-services-at-pride-festival/", "keywords": ["health", "mpox", "pride", "pride festival activities"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-07-19T08:25:35-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesPride festival goers can get Mpox vaccines, chill out in the senior cool zone and wave hello to County Library workers as they are honored as grand marshals during the annual Pride Parade this weekend.  \nThe County also is back offering a variety of community services and activities during Pride Festival. \nCounty Public Health Services through its partnership with Champions for Health will be giving Mpox vaccines as well as COVID-19 and Meningococcal vaccinations on Saturday, July 20 between 2 and 7 p.m. and Sunday, July 21 between 11 a.m. and 5 p.m. Those who have a health insurance card should bring it, but health insurance is not required. No appointment is necessary.  \nThe JYNNEOS vaccine helps protect against Mpox which has been on the rise again in recent weeks in San Diego. County public health doctors are reminding people who previously received only a single dose of JYNNEOS that they should get a second dose to maximize protection and lessen symptoms if they do get sick.   \nThe Mpox vaccine can also be given after exposure to Mpox to help prevent getting the infection or reduce symptoms if infection does occur.  \nAlong with getting vaccinated, other ways to protect yourself from Mpox include avoiding close, skin-to-skin contact, including intimate contact, with someone who has Mpox.  \nThe County also is offering rapid HIV testing at Pride Festival on Saturday from noon to 7 p.m., and Sunday from 11 a.m. to 6 p.m. Those who stop by can pick up information on PrEP, Doxy-PEP, Mpox and no-cost Take Me Home Testing which is at-home HIV and STD testing.   \nCounty Public health doctors recommend HIV testing and knowing your HIV status. Effective treatments can lead to a healthy life for people who test positive for HIV and pre-exposure prophylaxis, or PrEP medicines are available for people who test negative but are vulnerable to HIV so they can remain HIV-negative. Resources and services are available via the County’s Getting to Zero app.  \nThe County’s Aging & Independence Services will be at Pride, providing information on resources and services available for older adults at the Senior Cool Zone on Saturday between 11 a.m. and 6 p.m. The Senior Cool Zone is a free area for older adults to cool off with fans and refreshments.  \nHelping kick off the Pride festivities, County library workers will be among those serving as grand marshal for the parade. During the festival, County Libraries will join the Lit Café at the festival to help people sign up for library cards and provide activities like story time and crafts.  \nOther County departments also will walk as part of the County’s Pride Parade contingent and participate in other activities. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240719.08.25.35"}