{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Congratulations to San Diego’s 25 Most Remarkable Teens", "description": "Despite the pandemic’s interruption to schools this spring, the San Diego County Public Defender’s Office sought to recognize 25 students who excelled in a broad field of endeavors, including community, public safety and active citizenship.", "datePublished": "2020-08-28T16:29:20-07:00", "url": "https://www.countynewscenter.com/congratulations-to-san-diegos-25-most-remarkable-teens/", "keywords": ["public safety", "public defender s office", "remarkable teen", "youth council"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-08-28T16:29:20-07:00", "articleType": "article", "articleContent": "\nDespite the pandemic’s interruption to schools this spring, the San Diego County Public Defender’s Office sought to recognize 25 students who excelled in a broad field of endeavors, including community, public safety and active citizenship.\n“It was difficult choosing only 25 from all the amazing kids we interviewed, but it was also inspiring to hear their stories,” Public Defender Randy Mize said. “Gen Z teens are involved, informed and globally connected.  These kids are ready to fight fiercely for change in a world that is desperate for change. I can’t wait to see what they do.”\nThe Most Remarkable Teen program recognizes San Diego youth ages 13-19 for their contributions and efforts in 25 non-traditional categories including arts and culture, technology, civic involvement, leadership, courage to overcome adversity and other outstanding accomplishments, successes, and efforts.\nThe San Diego County Public Defender Youth Council, made up of high school students, and Mize interviewed nominees using videoconferencing and selected the 25 teens from 150 students nominated. The public defender said last year’s inaugural program was a success and they were thrilled to receive so many nominations since schools closed shortly after the nomination period opened.\nDue to COVID-19, the Public Defender Attorney Advisors delivered Remarkable Teen award packets, including a crystal glass trophy, personalized yard sign and special commendations, to each recipient’s home this week.\nThe teens received a Certificate of Recognition from the Public Defender for the honor of being nominated. The teens also received personal commendations from San Diego County Board Chairman Greg Cox and Supervisor Nathan Fletcher and San Diego City Council President Pro Tem Barbara Bry, Councilmembers Monica Montgomery, Chris Ward and, who had previously committed to presenting the 2020 awards at the live event.\nThe 25 Teens honored by category are:\nYouth Activism:\nSaw Paw Kay\nSaw Paw Kay at e3civic High School was the student body president at his school. He is a “tireless” volunteer and advocate, and one of 40 teen leaders fighting hunger in San Diego with the Jewish Family Service Teen Leadership Program. Saw serves as a spokesperson for the Karen community in San Diego and is a member of the First-Generation Youth Group Panel at SDSU sharing successes and challenges after refugee camp resettlement. Saw was born in Myanmar in a refugee camp\nand fled with his family to live in the United States. He is an outstanding student at e3civic and has earned several awards.\nCommunity Service:\nNatasha Threat\nNatasha Threat at Pacific Ridge School founded a nonprofit organization, Beegether, that beautifies the community through planting. She raises funds on a project-by-project basis. Natasha is also the head of WE, an international development charity and youth empowerment movement at her school, which collected food for a local food bank and raised money to sponsor four people with clean water for life in areas where clean water is hard to come by. She is also a member of A Million Knots, a service-learning group that hosts a school in India to provide education to 12 girls under the age of 13.\n \nSocial Conscience:\nElena Medina\nElena Medina at High Tech High Chula Vista is involved in many social justice activities on campus and in her community. She co-teaches a student-led ethnic studies class at her school and is co-president of the Movimiento Estudiantil Chicano de Aztlan or M.E.Ch.A. club. Elena is also a finalist to be a student board member for the California Board of Education. Most recently, she was one of 15 students selected in the nation to accept the Yale Bassett Award for Community Engagement for the class of 2021. The Yale Bassett award recognizes a record of creative leadership and public service, academic distinction, interdisciplinary problem solving, and experience addressing societal issues.\n \nFilmmaking:\nAlex Paz\nAlex Paz at San Marcos High School is a prolific film maker on campus. He has directed over 30 videos for the San Marcos Unified School District. Alex makes football hype films that are hosted on his popular YouTube channel and led to him earning a guest host role on KUSI News’ Prep Pigskin report for his videography work on the football field. He uses social media to promote his skills and this has led to paying jobs. Alex plans to continue studying media broadcast and film storytelling programs. His dream will be to become a full-time content creator for the Kansas City Chiefs after he graduates from college.\n \nCitizenship:\nRiya Argawal\nRiya Agarwal at Torrey Pines High School is the queen for the House of India within the House of Pacific Relations Queens Organization at Balboa Park where her mission is to foster the spirit of understanding, tolerance and goodwill between all ethnicities and cultures. She spreads cultural awareness to her local community and Balboa Park visitors by helping showcase India’s culture through dance performances, ethnic food and fashion. Riya wrote a children’s book on Indian customs to spark children’s interest and creativity. She is also involved in various community service events and served as a commissioner at her school’s Associated Student Body.\n \nCourage to Overcome Adversity:\nJose Lopez\nJose Lopez at Sweetwater High School first entered the foster care system at 9 years old because of neglectful parents. At first, his family background profoundly affected his self-esteem but he decided to become a positive role model for some younger relatives who are facing similar challenges. Jose is involved with Guardian Scholars, a program, that helps foster youth prepare for college, and another program, Reality Changers, that provides at-risk youth with academic support. He excels at school, started a school Business Club and is on the school’s hockey, swim and golf teams. Jose is also a junior recruit with the Civil Air Patrol.\n \nSocial Justice:\nMakhfira Abdullahi\nMakhfira Abdullahi at Morse High School is an activist and served as the secretary of the One World Club in high school for three years. The organization is an international, nonprofit educational program for youth of all ages which fosters civic commitment to school, local, national and global communities. She helped organize events, donations and fundraisers for various charitable organizations. Makhfira also serves as a Young Legislator for California’s 79th State Assembly district which focuses on policies in state and local government. She is involved in several local advocacy groups that strive for educational and social justice in the community. Makhfira plans to study political science at UCSD, with an emphasis on international relations.\n \nPerforming Arts:\nKaavya Raamkumar\nKaavya Raamkumar at Del Norte High School is a soloist violinist, Indian classical dancer and a vocalist. She holds a Certificate of Merit Level Eight with state honors and is a member of multiple orchestras. Among the orchestras, Kaavya is a first violinist in the San Diego Youth Symphony and has represented San Diego in performances at Carnegie Hall and the Sydney Opera House. She has won many competitions and is a community performer at many events and venue throughout San Diego. Kaavya also serves as a mentor to other students of music. When she’s not playing her violin, she’s performing Indian classical dance and singing at music and dance festivals. Beyond arts, Kaavya also has a passion for science, technology, engineering and mathematics and volunteers at the Fleet Science Center as a gallery facilitator and also tutors elementary and middle school students in this field.\n \nMost Enterprising:\nDiego Real\nDiego Real at Mount Miguel High School was president of his school’s first Robotics Club, helped oversee the development of the robotics team and the Mount Miguel Matador Engineering Program. Diego helped write a multimillion-dollar grant for a brand-new engineering class, computer lab and collaborative workspace to improve the facilities and curriculum at his high school. Diego has been able to work and collaborate with people from Northrop Grumman, NASA’s Deep Space Network, and SpaceX. More importantly for him, he has visited several elementary and middle schools to show off the robotics program with a goal of inspiring other students to enter STEM fields. He will attend UCSD and study aerospace engineering. His goal is to work at NASA’s jet propulsion laboratory.\n \nCampus Leadership:\nZaw Yabe\nZaw Ler Yabe at Hoover High School is involved in numerous campus leadership roles at her high school and in the community. She is involved with Mid-City CAN, a community collaborative that works to create a safe, productive, and healthy community through advocacy and organizing. Zaw has been involved with a variety of International Rescue Committee afterschool and summer programs for the past three years. Zaw attends Girls Academy and Peacemakers every week where the focus is on advocacy, learning about America and San Diego, as well as public speaking. She is also the Health and Wellness Leader at Hoover and a member of the Student Council and the College Avenue Compact and Peer Mediation Service. Zaw moved to the United States at the age of six and had to learn English and overcome other cultural challenges.\n \nInnovation:\nChristopher Caligiuri\nChristopher Caliguiri at Canyon Crest Academy leads fellow students in STEM instruction at this school and offers science and engineering outreach classes in the community. He is the Robotics president at this school and has achieved the rank of Eagle Scout through the Boy Scouts of America. He works alongside a graduate student in computational neuroscience and cognitive science and his mentor, the Director of the Stem Cell Research program at UCSD, to develop a novel robotics platform controlled by brain organoids, artificially grown mass of cells or tissue that resembles an organ. The robot platform Christopher developed has been featured in a variety of publications, including the New York Times, and won a variety of science fair awards. Christopher has also worked alongside NASA researchers, developing capillary action technology for potential use on the International Space Station.\n \nJournalism:\nVanessa Galindo\nVanessa Galindo at San Diego High School has been the leader of her school’s campus news program. She loves to make videos and pictures of everyday life because she believes sharing one’s perspective on life is important. Vanessa believes it informs people to a different cultural perspective and can provoke certain feelings within an audience that might change their view on different countries and nationalities. At San Diego High School, Vanessa filmed and directed several news packages dealing with climate change and campus cleanup. These news segments addressed shortcomings in the school and impelled change. Vanessa is also in the school music program and thinks that exploring the arts and finding ways to be more creative in one’s life is important to generate new ideas that entertain, inform and inspire others.\n \nCommitment to Personal Excellence:\nAnika Menon\nAnika Menon at Mount Carmel High School is committed to helping others in her community. As a youth, she participated in medical camps, which provide free medical care to those without insurance. For the past three years, she worked in internships and as a volunteer at Palomar Hospital and Scripps Mercy. She is trained in multiple nursing responsibilities and gained valuable experience providing direct, hands-on patient care alongside clinical professionals. She was the president of her school’s No Place for Hate committee and an ambassador to teach younger children about kindness and the importance of character. She was a tutor for students who are recent refugees. Anika is also a classical Indian dancer and completed 13 years of training in the art form. She will attend UCLA in the fall as a nursing major and hopes to become a pediatric nurse anesthetist.\n \nEntrepreneur:\nAndrew Diep-Tran\nAndrew Diep-Tran at Mission Hills High School is an entrepreneur and an economics enthusiast who inspires other students. He created an organization which has a goal to provide educational opportunities through book drives, competitions, and corporate partnerships. Andrew incorporated this nonprofit and is collaborating with an economics teacher so other students can replicate and create their own chapters around the world. He founded a Finance, Investments, Business and Economics Fellowship with local business guest speakers, including the chief operating officer of Sony Electronics at meetings. He organized stock market simulators, two “Shark Tank” entrepreneurship competitions and business-related videos and lectures designed to foster interest in careers in business. Andrew is currently establishing FIBE chapters in elementary, middle, and high schools in the San Marcos Unified School District. He was appointed to the San Marcos Youth Commission in 2019. Andrew is also organizing TEDxMissionHillsHS, the first youth-oriented TEDx event in San Marcos.\n \nDance:\nBeret Dernbach\nBeret Dernbach at the San Diego School of Creative and Performing Arts is a Highland Dance world champion. She started Highland dancing when she was five years old. She is a two-time Highland dance World Champion, a three-time U.S. Champion, and she has won five Western Region Championship titles. She is the sixth American in the 124-year history of the World Highland Dance Championships, which is held in Scotland, to win in the juvenile division. Beret works at the House of Scotland as a performer and member. Beret is also part of the San Diego Global Neighborhood Project. This nonprofit develops cultural, education and trade partnerships with 15 countries. She started a community service project to honor Veterans who have sacrificed their lives for our country. Each Memorial Day Beret distributes between 200 and 1000 handmade felt poppies, the national symbol of Remembrance Day, at ceremonies across California and in Scotland. Beret will be a freshman at the University of California San Diego, majoring in Political Science and International Relations on a pre-law track.\n \nPerseverance:\nMasitas Ahmed\nMasitis Ahmed at Crawford High School overcame health issues and challenges and is now a student leader. She gained confidence after becoming a mentor leader for a summer program for incoming freshmen. She then joined the Girl’s Take Flight program which is a program run by the Elementary Institute of Science. She took their 32-week internship, and became FAA Certified as a commercial drone pilot. She started a drone club at Crawford so that she could share her drone flight knowledge with others. Masitis plays the guitar, piano, and drums, and has written a play which is being performed at San Diego City College. She is the head of public relations for the Umi Learning Center, a nonprofit organization that teaches English to recent arrivals to the United States. Masitis graduated from Crawford with honors and will attend San Diego State University in the fall. Her dream is to become a commercial pilot.\n \nTechnology: Robotics:\nDavid Scuba\nDavid Scuba at Torrey Pines High School is active with the For Inspiration and Recognition of Science and Technology (FIRST) team in robotics competitions. FIRST is an international youth organization that develops ways to inspire students in engineering and technology fields. David started building and coding Lego robots in elementary school and has expanded his abilities. He is now honing his skills in designing, building, machining and CAD. David and his teams have won multiple league robotics championships. For the past month, David’s robotics team has worked in collaboration with Forecast 3D to start a GoFundMe and raise money to 3D print custom-designed reusable face shields for healthcare professionals working with COVID-19 patients. The team has already raised $4,000 and has begun shipping the shields to hospitals around the country. David plans to major in mechanical engineering in college.\n \nCivic Engagement:\nCatherine\nCatherine Tamayo\nTamayo at the Academy of our Lady of Peace is passionate about public speaking, politics and criminal justice. In 2018, Catherine was the youngest student attorney to work with her team for a second-place spot in the San Diego county Mock Trial tournament. Catherine started a Women in Politics club at her school. With a mission statement of “Uniting girls, women, and others in politics to create space for civil discourse, seeking to promote dynamic, solution-oriented discussion necessary to bridge the political divide,” the club’s goal is to heal political division on a local level. Club activities include voter registration and informed discussions of upcoming elections and the operational workings of the political process. Catherine plans to attend San Diego State University and then hopes to go to law school to improve the criminal justice system by becoming a criminal defense attorney.\n \nPhotography:\nChris Htoo\nChris Htoo at e3civic High School is an award-winning photographer with a passion for the environment. The honor student was born in a refugee camp on the Thai/Myanmar border and fled with his family to the United States as a child. Chris has won numerous photography prizes in the Scholastic Art and Writing Competition and the San Diego Fair. He also won an award for a film he produced which was screened publicly at Digital Gym Theater. Chris is also passionate about the environment. He attended the UCSD Global Environmental Leadership and Sustainability Program and is a member of RiverWatch, an organization that measures water health along the San Diego River. He attended an intensive environmental science and conservation camp to learn public land stewardship. Chris also attended John Hopkins’s Engineering Innovation Summer program at USD where he was recognized as the best engineering student in the group. Chris was also chosen to be part of the Asian Pacific Youth Leadership Project in Sacramento. He hopes to become a professional photographer, an engineer or a shoe designer for Nike.\n \nLeadership:\nAmelie Simpson\nAmelie Simpson at Valhalla High School serves as president of the Rotary’s Interact club, a club seeking to perform community service locally and globally. She started the Interact chapter at her school and organized the school’s Australian exchange program. She is involved in the Fleet Science Center’s BE WiSE program, which promotes STEM learning experiences for young women. In 2019 Amelie attended a two-week technology camp at InnovaLab in Silicon Valley. Amelie is participating in The Digital Experiment, a virtual leadership and cross-cultural exchange program sponsored by the U.S. Department of State. She is also a contributor to Rambler, a local teen magazine, and recently launched Pen Pal Party, a program to help teens feel connected during times of social isolation. Amelie volunteers at local nonprofits. An accomplished two-sport athlete, Amelie is a starting midfielder on both Valhalla’s varsity field hockey and lacrosse teams. She is also a singer, songwriter and guitarist and a member of Valhalla Vocal Music’s Chamber Ensemble.\n \nMusic:\nLiam Gardner\nLiam Gardner at San Diego High School plays bass, viola, violin, cello, piano and guitar. He started his music career in elementary school and became passionate about honing his skills, not only his own playing, but also in helping to improve the playing of those around him. In high school, he was accepted into the San Diego Youth Symphony as he continued to play for San Diego Unified School District Honor Orchestra. Liam tutored children in music after school which ignited his desire to be a music teacher. As a first-generation college student, he plans to obtain a master’s in music education so that he can inspire young people to experience the joy he receives from music.\n \nCourage to Overcome: Family Situation\nLluvia Ugarte\nLluvia Ugarte at Otay Ranch High School has excelled in all that she has pursued and demonstrated an incredible resiliency in the face of so much adversity in her family life as well as health challenges. Lluvia is kind and compassionate in her treatment of others. She feels their pain and empathizes with everyone, especially children. She is driven in her pursuit to earn a medical degree by exceling in her academic life. She graduated from Otay Ranch with the Seal of Biliteracy, a California Scholarship Federation Seal Bearer (CSF), Varsity Cheerleader Captain, and an Associated Study Body participant in Spirit and Arts. Lluvia will attend San Diego State University this fall studying biology, with the ultimate goal of pursuing a career in medicine.\n \nPersonal Determination:\nMatthew Tillyer\nMatthew Tillyer, a recent graduate of Classical Academy High School, did not let his physical challenges determine his ability to serve and connect, and that positively impacted his high school and community. He became physically disabled six years ago following a severe respiratory infection that attacked his nervous system. After experimental medication and months of physical therapy, Matthew was able to attend high school in a wheelchair. Matthew always loved football, and filmed varsity practices and games. Matthew became a member of the Fellowship of Christian Athletes on campus, serving as president in his senior year. He also served as an editor of the school video news program as well as commissioner of Link Crew – a student mentorship program. Matthew will be attending UCSD in the fall and plans to major in international studies-history.\n \nMost Promising Teen:\nLilian Franqui\nLilian Franqui at Pacific Beach Middle School is dedicated to her music, schoolwork, sports and community. Lilian has received the International Baccalaureate Student of the Year award twice at Pacific Beach Middle School. She has won the Concerto Competition at the San Diego Youth Symphony in 2019 and is the co-principal for the upcoming 2020-2021 concert season for the SDYS’s Sinfonia orchestra. Lilian has also received a scholarship and been selected as first chair at the prestigious Interlochen Arts Camp in Michigan. Lilian also makes a difference in the world by participating in various service organizations. She is currently the President of the Class of 2025 for the National Charity League Seaside Chapter. During the school year Lilian was the Treasurer of the Kiwanis’ Middle School Program, Builders Club. Lilian also mentors young players at SDYS and plays the violin for young children at their Childhood Introduction to Music Education with Smiles program. Lilian is very active in sports and is currently on the elite team for the Coastal Clash Field Hockey U14 team. She is also an avid surfer.\n \nPublic Defender’s Award of Excellence:\nOlivia Yang\nOlivia Yang at Canyon Crest Academy is a professional figure skater. She skated for Team Del Sol synchronized skating team and is a gold medalist in the U.S. Figure Skating Moves-In-the-Field. She is the founding president of an inspirational club called Sports for Exceptional Athletes which serves students with developmental disabilities in a variety of capacities. Olivia helped thousands of exceptional athletes and their family members by providing and organizing coaching, tournaments, sports camps, and fundraising. Olivia also devotes herself to scientific research and was selected to study Parkinson’s disease at California State Summer School for Math and Science at the University of Irving and presented the clinical trial to professors and medical doctors. She is a member of a specialized team working with San Diego State University’s Ecological Modeling and Integration Lab to do research on ecosystems that impact human health. Olivia will present her research at the 2020 Ecological Society of America conference in Salt Lake City. This summer, Olivia participated in the Bank of America Student Leader internship program to work with local nonprofit organizations, and was also selected by the Salk Institute to further her research experience.\nThe San Diego County Public Defender Youth Council was formed in 2017. Youth Council members include students from eight San Diego high schools. Public Defender Attorney Advisors work with Youth Council members to help them achieve their goals as they focus on projects that promote civic engagement and social justice.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200828.16.29.20"}