{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Law Expanding Involuntary Behavioral Health Treatment Takes Effect Jan. 1", "description": "The County of San Diego’s Behavioral Health Services has spent the last year organizing extensive planning and training to prepare for the biggest update to California’s civil detention and conservatorship laws in more than 50 years.  ", "datePublished": "2025-01-02T10:40:17-08:00", "url": "https://www.countynewscenter.com/state-law-expanding-involuntary-behavioral-health-treatment-takes-effect-jan-1/", "keywords": ["health", "behavioral health law", "mental health", "sb43", "state senate bill 43"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-01-02T12:06:13-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County of San Diego’s Behavioral Health Services has spent the last year organizing extensive planning and training to prepare for the biggest update to California’s civil detention and conservatorship laws in more than 50 years.  \nThe updates are required by State Senate Bill 43 (SB-43) which took effect Jan. 1, 2025.  Now, more people in San Diego needing help with behavioral health conditions may be involuntarily transported for evaluation, treatment and potential conservatorship. \nThe law significantly modifies the legal definition of “grave disability” which can be used to evaluate the condition of a person with a behavioral health illness. It was signed by California Gov. Gavin Newsom on Oct. 10, 2023. \nPrevious state law allowed civil detainment, in cases of suspected mental health condition, when people are determined to be:  \n\na danger to self, \na danger to others, or \ngravely disabled because they cannot secure food, shelter or clothing. \n\nUnder the new law, grave disability is redefined to not only include those unable to secure food, shelter and clothing, but also those who cannot keep themselves safe or secure necessary medical care.  Additionally, grave disability may be determined to be a result of mental illness or substance use disorder as a standalone condition.   \nSan Francisco and San Luis Obispo were the first in January 2024 to agree to follow SB-43. The County of San Diego chose to defer for one year to allow for a major training effort with regional partners. Most counties in California decided to start applying SB-43 in January 2026. \nCounty Behavioral Health Services over the past year organized an extensive planning and training effort to prepare locally, involving community members, hospital emergency department staff, regional law enforcement leadership, members of the harm reduction community, legal advocates and others.  \nOfficers from law enforcement agencies representing all 18 cities and the County Sheriff’s Office have gone through SB-43 trainings. The trainings have been led by the Jewish Family Service Patient Advocacy program.  \n“I can’t say enough about how all the stakeholders have come together to ensure we are properly, and compassionately applying this new law to help some of our most vulnerable residents,” said Luke Bergmann, director of County Behavioral Health Services. “From the County’s side, we stand ready with our Crisis Stabilization Units and substance use treatment providers to help. It is going to require a community-wide effort and it will be a learning process. I’m confident that the many stakeholders are ready to help those affected and work our way through the challenges that come with being one of the first to comply with the law, just as we have managed this last year with the CARE Act.” \nThis new definition of “gravely disabled” applies to the three primary processes established in previous law: \n\nAssessment, evaluation and crisis intervention or placement for those on a 5150 hold, an involuntary psychiatric hold that can last up to 72 hours \n\n\nIf necessary and appropriately authorized, the intensive treatment period for grave disability may be extended for up to two periods of 30 days each \n\n\nConservatorship of up to one year, and renewable, for ongoing behavioral health treatment and support, subject to a court’s determination.  \n\nCounty Behavioral Health Services estimates an increase of about 1,500 72-hour detentions for involuntary treatment over years past with the changes of SB-43. The actual number will depend on actions taken by law enforcement, medical and behavioral health clinicians. \nIndividuals detained under a 5150 hold for involuntary treatment are transported by peace officers or mobile crisis response teams to emergency departments or crisis stabilization units. Upon arrival, they undergo assessment and receive care tailored to their situation. A person may be released at any time if they no longer meet the criteria for involuntary treatment or agree to voluntary care, which ends the hold.  \nDetailed information about SB-43 and its roll out in San Diego County is available to the public online at a website updated regularly by San Diego County Behavioral Health Services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250102.10.40.17"}