{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Annual Count Shows Decline in County’s Unsheltered Population", "description": "On Jan. 30 of this year, more than 300 County employees fanned out across the region with hundreds of other volunteers to take part in the annual We All Count, Point in Time Count of the region’s unsheltered population. ", "datePublished": "2025-05-21T11:32:38-07:00", "url": "https://www.countynewscenter.com/annual-count-shows-decline-in-countys-unsheltered-population/", "keywords": ["housing", "homeless count", "homelessness", "housing", "point in time", "san diego county"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-21T14:42:51-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteOn Jan. 30 of this year, more than 300 County employees fanned out across the region with hundreds of other volunteers to take part in the annual We All Count, Point in Time Count of the region’s unsheltered population. \nResults released yesterday showed 178 people unsheltered in the County’s unincorporated areas. The number was 11 percent lower than the 201 counted in 2024 and is the lowest in the last 12 years. \nThe total unincorporated count showed 254 unsheltered (178) and sheltered (76) individuals. \nRegionwide, the count showed 5,714 people unsheltered, down 6.5 percent from the previous year, and 4,191 sheltered, a decline of 7 percent from 2024. \nOther notable reductions included a 26 percent decline in Veteran homelessness, 20 percent reduction in youth homelessness, 72 percent decrease in unsheltered families and a 5 percent drop in chronic homelessness. The full report can be accessed through the San Diego Regional Task Force on Homelessness. \nAdditional emergency housing resources for the unincorporated area on the horizon include the reopening of the refurbished Magnolia Safe Parking site in summer and the Troy Street Sleeping cabins next year. \nIn addition to leading efforts in the unincorporated communities, the County administers programs that serve regionwide and assist people experiencing homelessness across different domains of County’s Framework for Ending Homelessness.  \nThe County’s Office of Homeless Solutions partners with cities regionwide in multi-disciplinary outreach efforts to connect people to County’s resources, including city of San Diego CARE outreach events seven days each month.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250521.11.32.38"}