{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Award-winning County Buildings – Functional and Beautiful By Design", "description": "October is a big month for architects. World Architecture Day was Oct. 2, and some cities celebrate good design all month with Archtober. But good architecture is top of mind at the County every day.", "datePublished": "2023-10-25T15:08:23-07:00", "url": "https://www.countynewscenter.com/award-winning-county-buildings-functional-and-beautiful-by-design/", "keywords": ["government", "architecture", "archtober", "awards", "fgg", "general services", "orchids"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-10-25T16:33:17-07:00", "articleType": "article", "articleContent": "\nOctober is a big month for architects. World Architecture Day was Oct. 2, and some cities celebrate good design all month with Archtober.\nThe San Diego Architectural Foundation honors buildings, parks or plazas in the region with Orchids this time of year. It also gives those that are not so beautiful Onion awards.\nBut good architecture is top of mind at the County every day. New facilities open every year and General Services makes sure the structures are not only technologically up-to-date, customer-friendly, energy-efficient and beautiful, but reflect and respect the communities where they are built.\n“We want our facilities to be inviting, to make visitors feel respected as they approach the facility and when they come through the door. We want staff to be proud to work in our facilities,” said County General Services Deputy Director Steve Schmidt. “And we want the community in general, and all passersby, to feel respected by what we have built in their community.”\nThese efforts show, both in People’s Choice and other architectural awards.\nThe County won a second place People’s Choice Orchid Award Oct. 5 for its Ohio Street Probation Community Support Office. Earlier this year, the office won a Gold Nugget for Best Special Use Project at the Pacific Coast Builders Conference.\nHere is a sample of other award-winners in the past.\n2020 Orchid for Architecture: the Assessor/Recorder/County Clerk office in Santee\nImage Credit: Chipper Hatter\n\n2019 Orchid for Architecture: the Borrego Springs Library, Park and Sheriff’s office\n\n\n2017 People’s Choice Orchid Award: the Imperial Beach Library\nImage Credit: Stephen Whalen Photograph\n\n2014 Urban Planning Orchid Award: the Waterfront Park\n\n\n2013 Academy of Architecture for Justice Facilities Award of Excellence: La Colinas Detention and Reentry Facility\nImage Credit: kmd architects\n\n2012 People’s Choice Orchid Award: County Operations Center\nImage Credit: Bruce Heimbach\n\n2011 People’s Choice Orchid Award: the Fallbrook Library\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231025.15.08.23"}