{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting Saturday, 39 Vote Centers Open for  November Presidential General Election", "description": "You don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at 39 vote centers starting Saturday, Oct. 26.", "datePublished": "2024-10-25T10:00:33-07:00", "url": "https://www.countynewscenter.com/starting-saturday-39-vote-centers-open-for-november-presidential-general-election/", "keywords": ["elections", "2024 presidential general election", "fgg", "nov. 5 presidential general election", "registrar of voters", "vote centers open"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-10-24T18:11:19-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesYou don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at 39 vote centers starting Saturday, Oct. 26. The centers are located around the county and will be open daily from 8 a.m. to 5 p.m.\nOn Saturday, Nov. 2, over 200 vote centers will be open daily from 8 a.m. to 5 p.m. through Nov. 4. On the final day of voting, Nov. 5, all vote centers will be open from 7 a.m. to 8 p.m.\nIf you plan to vote in person, be prepared. Read your voter information pamphlet and mark your selections on the sample ballot in advance. When you go inside the voting booth at the vote center, you can refer to your choices on the sample ballot to conveniently mark your selections on your official ballot.\nYou can visit any vote center in the county. Find a location near you at sdvote.com.\nVote centers have replaced polling places and provide more services. You can:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selections on ballot marking devices. When finished, the voter will print out the official ballot, review it, place it in a secrecy sleeve, and hand it to a poll worker to insert it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate, measure, or proposition on the ballot. Additionally, an individual may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nDon’t delay! With a significant number of contests on the ballot, the voting process may take longer than usual. The Registrar’s office recommends using early voting options to avoid long lines.\nThe options are:\n\nVote in person at any vote center around the county.\nOr cast your ballot by mail.\nOr drop off your ballot sealed inside its return envelope at an official drop box.\n\nTo vote from home, sign and date your return envelope, seal your completed ballot inside and return it by mail promptly to make sure it arrives at the Registrar’s office before Nov. 5.\nTo drop off your ballot, seal it inside its return envelope and return it to one of the Registrar’s 150 official ballot drop boxes. The secure stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.”\nFind one close to you through the Registrar’s locator map, your voter information pamphlet or online at sdvote.com. Most of these drop boxes are available 24/7. The rest depend on the hours of operation of the location. Check each location’s hours of operation before heading out to return your ballot. All will close at 8 p.m., Nov. 5.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nLearn more about voting in the November Presidential General Election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241025.10.00.33"}