{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Give Yourself the Gift of Furr Ever Love", "description": "Looking for love that lasts a lifetime? This Valentine’s season, open your heart and home to a shelter pet in need.", "datePublished": "2025-02-07T16:04:23-08:00", "url": "https://www.countynewscenter.com/give-yourself-the-gift-of-furr-ever-love/", "keywords": ["animals", "adopt pets", "das", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-02-07T16:15:26-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesLooking for love that lasts a lifetime? This Valentine’s season, open your heart and home to a shelter pet in need.\nThis is Cindy A1935918 at the Bonita shelter.\nCounty Animal Services is offering up some “Sweet Deals” on all its super loveable pets. From now until Feb. 16, all adoptions, excluding puppies under a year old, are just $14 at the County’s shelters in Bonita and Carlsbad.\nCome meet some of the available pets on the Animal Services website like Shia an Akita or Mowgli a Kelpie mix, both at the Carlsbad shelter.  Or Desie, a Siberian Husky and Cindy, a Doberman Pinscher, both at the Bonita shelter. You can even take\nThis is Shia A1933797 at the Carlsbad Shelter.\ndogs out for a fun outing to get to know their personality better. You can learn more about Dogs Day Out here, just scroll down.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at the South Shelter, 5821 Sweetwater Road in Bonita and the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nAll adoption fees include spaying or neutering, a microchip, updated vaccinations and a one-year dog license for those in the service area.\nThis is Mowgli A1931898 at the Carlsbad shelter.\nTo adopt, you just need a photo identification card. Adoptions are on a first-come, first-served basis.\nAdoption fees are always waived for:\n\nPets who have been at the shelter for 30+ days\nPets aged 8 years and older\nAdopters 60 years and older\n\nThis is Desie A1748867 at the Bonita shelter.\nIf you’re unsure, considering fostering a pet to see if it is a good fit, or just to give him or her a break from the shelter environment. Pets benefit tremendously from being in a home environment and learning how to be part of a family. All basic care supplies such as food, leash, and bedding, are included as part of the program.\nFor more information on fostering animals, making pet food donations, or volunteering for the shelter, call (619) 767-2675 or visit the Animal Services main website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250207.16.04.23"}