{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands Funding to Engage Fathers and Caregivers", "description": "A Behavioral Health Services (BHS) program focused on culturally appropriate programming to strengthen relationships between fathers and their children and bolster fathers’ parenting skills was approved Tuesday by the San Diego County Board of Supervisors. This Board approval signals an eight-fold expansion of these services. ", "datePublished": "2023-03-03T11:58:52-08:00", "url": "https://www.countynewscenter.com/county-expands-funding-to-engage-fathers-and-caregivers/", "keywords": ["families", "bhs", "fathers"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-03-03T14:29:07-08:00", "articleType": "article", "articleContent": "\nA Behavioral Health Services (BHS) program focused on culturally appropriate programming to strengthen relationships between fathers and their children and bolster fathers’ parenting skills was approved Tuesday by the San Diego County Board of Supervisors. This Board approval signals an eight-fold expansion of these services.\n“Evidence shows earlier interventions in the lives of young people is the best way to support resilience and wellbeing,” said Dr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency. “Parent or caregiver engagement is vital for the mental health development in children.”  \nAdverse Childhood Experiences, also known as ACEs, and toxic stress are associated with nine out of the 10 leading causes of death in the country. These poor health outcomes are passed from generation to generation. \nBHS’ Positive Parenting and Father 2 Child programs provide support to families and help break the cycle of trauma. The Positive Parenting Program provides a variety of programming options from in-person to virtual meetings, as well as group or individual skill-building classes for parents, father figures, and caregivers to build positive relationships, improve better management, and reduce stress. \nThe Father 2 Child program has provided services to underserved families in the central region since 2012. It produces culturally specific programming for fathers of all ethnicities and seven priority populations, including underserved Asian, Pacific Islander, Latino, and military families. Activities include curriculum-based group education, counseling, outreach and flexible funds to support employment and recreation opportunities. The program teaches fathering techniques and skills, in addition to increasing awareness around the importance of active and engaged father figures.  \nCounty BHS will build upon these existing programs and expand parenting program services to focus on fathers countywide while providing greater access for underserved communities. A key focus of enhanced programming is to remove barriers to participation like transportation services and childcare. \nBHS focuses on healthcare, family, and school as domains in the Children’s Continuum Strategy to prevent adverse outcomes and health disparities. This expansion falls under the family domain and addresses the importance of fathers, male caregivers, and father figures in the lives of young people. \nProjected annual costs for parenting program services will increase from $250,000 to $2 million. It is part of BHS’ mission to implement prevention and early intervention strategies to strengthen families. \nThe County of San Diego’s Behavioral Health Services (BHS) department provides mental health and substance use disorder services to over 111,000 San Diego County residents of all ages. Services are provided through 9 county-operated programs, over 300 contracts, and 800 individual fee-for-service providers. BHS offers services across the lifespan through coordinated systems of care and embraces Live Well San Diego, the County’s over-arching vision for a region that is building better health, living safely, and thriving.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230303.11.58.52"}