{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Be Prepared for Wildfires! ", "description": "The County of San Diego joined CAL FIRE and partner agencies at the Ramona CAL FIRE Air Attack Base today to explain what you can do to prepare for wildfires. Almost half of the state’s largest and most damaging wildfires occurred in 2020 and 2021, burning almost 7 million acres.", "datePublished": "2022-05-02T18:43:11-07:00", "url": "https://www.countynewscenter.com/be-prepared-for-wildfires/", "keywords": ["public safety", "board chair nathan fletcher", "cal fire", "cal fire chief tony mecham", "defensible space", "home hardening", "wildfire preparedness week"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-05-02T19:21:40-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego joined CAL FIRE and partner agencies at the Ramona CAL FIRE Air Attack Base today to explain what you can do to prepare for wildfires. Almost half of the state’s largest and most damaging wildfires occurred in 2020 and 2021, burning almost 7 million acres. But there are proactive steps you can take to prepare your home and communities to be more resilient to the impacts of wildfire. \n\nCreate defensible space around your property by maintaining your lawn and removing combustible debris from around your home. \nHarden your home by using fire resistant materials for construction, renovation and landscaping to help protect your property. \nMake and share a family wildfire emergency plan. Talk to your neighbors about wildfire safety and plan how the neighborhood can work together before and after a wildfire. \n\n“San Diego County is prepared, and we are ready to respond to wildfires,” stated Board of Supervisors Chair Nathan Fletcher. “Since the devastating 2003 Cedar Fire, your County has invested more than $600 million. Those investments have improved fire protection and EMS, added staffing, fire stations, made communication enhancements, increased training and brush management. We’ve also added more ground and air equipment.” \nSupervisor Joel Anderson said, “Some of the things we can do is really focus on the grants to help people harden their homes which we’ve done. We’ve all voted to spend $1 million towards that goal. We also worked so that when you need to evacuate a place like Ramona, Alpine or Fallbrook the roads aren’t restricted. We’ve cut back all the trees along the evacuation routes, so people have a chance to get out.” \nThe event was the first of a statewide campaign to help Californians prepare for wildfires. The CAL FIRE Director was there to speak and show off some of the agency’s newest equipment. He was joined by representatives from the California Natural Resources Agency, United States Forest Service, California Office of Emergency Services, the California Military Department, the Highway Patrol and the CAL FIRE San Diego Fire Chief, Tony Mecham. \nChief Mecham praised all local fire crews, “San Diego County is unique, and I believe we are one of the most prepared regions in the United States. And the reason that we are so prepared is we have a mindset of collaboration and cooperation.” \nTo learn more about wildfire safety and preparedness, visit readysandiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220502.18.43.11"}