{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, Residents Celebrate Groundbreaking for New Park", "description": "Fallbrook residents will soon see the park they wished for come to life. County officials and community members broke ground Thursday on a new 6.7-acre park.", "datePublished": "2023-09-28T15:41:57-07:00", "url": "https://www.countynewscenter.com/county-residents-celebrate-groundbreaking-for-new-park/", "keywords": ["parks and rec", "fallbrook", "groundbreaking", "lueg", "permeable parking lot", "skate park", "village view county park"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-09-28T15:41:57-07:00", "articleType": "article", "articleContent": "\nFallbrook residents will soon see the park they wished for come to life. County officials and community members broke ground Thursday on a new 6.7-acre park.\nThe new site will feature an all-wheel park or skatepark, shaded picnic and play areas, a multipurpose field, a walking trail, nature trails and separate off-leash zones for small dogs and large dogs.\nOther amenities include a native plant garden, a 60-space permeable parking lot, bike parking, an ADA-accessible restroom and a combined drinking fountain and water bottle filling station. (See map below.)\nResidents had a chance to get involved in designing the park from the beginning. County Parks held public meetings, issued surveys, worked with focus groups and spoke with community planning groups to hear what residents wanted.\n“I want to thank the incredible residents of Fallbrook and our County parks team for making this vision a reality. Your unwavering support and enthusiasm have paved the way for a brighter, greener future. It is vital the community has a safe place where our children can play, our parents can enjoy a picnic in the shade, and where we can all take a stroll on a nature trail to enjoy some peace and quiet in a chaotic world,” said County Supervisor Jim Desmond. “This land is now public park land. It’s yours, it’s mine – it’s ours in perpetuity.”\n“Personally, I would just like to say thank you to everyone who has been a part of the process up until now,” said County Parks and Recreation Director Brian Albright. “It’s great to see so many people so passionate about building a new park.”\nA skate park was particularly high on the wish list. And this one will accommodate beginners and seasoned skaters. They’ll find a bowl, quarter pipes, rails, kickers, wedge ramps, stairs and more.\nThe County park will go up approximately one block away from the Fallbrook Community Center allowing the two locations to coordinate community events. The site was also chosen because it’s close to local schools and the downtown area.\nVillage View County Park will be open from sunrise to sunset seven days a week and access will be free.\nA grand opening is expected in spring 2025.\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230928.15.41.57"}