{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego Man Tests Positive for UK Variant of COVID-19", "description": "A San Diego man with no travel outside the county has tested positive for the COVID-19 variant first identified in the United Kingdom, the County Health and Human Services Agency announced today.", "datePublished": "2020-12-30T16:54:30-08:00", "url": "https://www.countynewscenter.com/san-diego-man-tests-positive-for-uk-variant-of-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "uk variant"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-04T10:56:21-08:00", "articleType": "article", "articleContent": "\nA San Diego man with no travel outside the county has tested positive for the COVID-19 variant first identified in the United Kingdom, the County Health and Human Services Agency announced today.\nThe man was tested on Dec. 29 after two days of symptoms, and results showed a characteristic pattern that indicated it could be the new UK strain. The specimen was immediately sent to Scripps Research and whole genome sequencing determined Dec. 30 that it is the UK variant, also known as B.1.1.7.\nThe patient is not hospitalized and is currently isolated. The County’s case investigation has identified household contacts who are being quarantined and tested for the novel coronavirus. The man had little interaction with people outside his household while potentially contagious.\n“The B.1.1.7 strain is here, and San Diegans can protect themselves against it by doing the same things they have been asked to do since the pandemic began,” said Eric McDonald, M.D., M.P.H., medical director of the County Epidemiology and Immunizations Services branch. “Everyone should stay home and avoid any gatherings over the New Year’s holiday. The best way to celebrate is to be sure that everyone stays healthy in 2021.”\nAccording to the Centers for Disease Control and Prevention, the UK strain is one of multiple COVID-19 variants that have been identified around the world.\nThere is some evidence that the new strains are more easily spread, but these variants are not believed to cause more severe illness or increase the risk of death.\nAt this time, it is also believed that the vaccines currently available will offer protection against newly emerging variants. Scientists continue to study the new strains of the novel coronavirus to determine their potential impact.\nSince the new strain has a higher rate of transmission, it could lead to an increase in cases in the region. With New Year’s Eve tomorrow, County health officials say San Diegans to do the following now more than ever:\n\nWash your hands\nWear a mask\nKeep your distance from others and leave your household only for essential activities\nIf you’re sick, get tested, and then stay home and isolate yourself\n\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is now 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\n11 new community outbreaks were confirmed on Dec. 29: Four in business settings, four in daycare/preschool/childcare settings, one in a TK-12 school setting, one in a food/beverage processing setting and one in hotel/resort/spa setting.\nIn the past seven days (Dec. 23 through Dec. 29), 55 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n23,957 tests were reported to the County on Dec. 29, and the percentage of new laboratory-confirmed cases was 10%.\nThe 14-day rolling average percentage of positive cases is 10.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 21,645.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n2,448 new cases were reported to the County on Dec. 29. The region’s total is now 152,512.\n5,826 or 3.8% of all cases have required hospitalization.\n1,213 or 0.8% of all cases and 20.8% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n37 new COVID-19 deaths were reported to the County on Dec. 29. The region’s total is now 1,472.\n21 men and 16 women died between Dec. 17 and Dec. 28, and their ages ranged from mid-50s to early 100s.\n30 had underlying medical conditions and seven have medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201230.16.54.30"}