{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Register for Great ShakeOut Earthquake Drill", "description": "The pandemic has many of us working or studying from home, so an earthquake preparedness drill could look very different this year.", "datePublished": "2020-10-08T13:55:09-07:00", "url": "https://www.countynewscenter.com/register-for-great-shakeout-earthquake-drill/", "keywords": ["public safety", "earthquake", "emegency", "emergency preparedness", "shakeout"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-10-08T14:03:31-07:00", "articleType": "article", "articleContent": "\nThe pandemic has many of us working or studying from home, so an earthquake preparedness drill could look very different this year.\nIf you have a plan, disaster supplies and you practice an earthquake drill with your family, your chances of surviving will greatly improve. Register to participate in the Great ShakeOut earthquake drill on October 15 at 10:15 a.m. It takes as little as 90 seconds and can be customized to fit your schedule. You can practice the drill before 10/15 or in the days after at any time, just so long as you take the time to learn and practice what to do during major shaking.\nMore than 5.2 million people in California and more than 17.5 million people worldwide will drop, cover and hold on under a desk or table to practice their earthquake response. So far, nearly 330,000 San Diego County residents have registered for this year’s drill.\nShakeOut earthquake drills are not just for those working from home or distance learning. Businesses and organizations are encouraged to practice with their employees and willing customers while following COVID-19 safety precautions. For example, some businesses may choose to videoconference a drill or stagger the number of people participating to maintain social distancing.\nEarthquake preparedness is important because in a significant earthquake, people are more likely to be injured from falling debris than the shaking itself.\nPrepare for where you are: If indoors, the safest thing to do is to Drop to the ground in a safe area and seek protection under a sturdy table or desk, if one is available. Once under the table, tuck your legs into your chest. Cover your head with one arm, and use your other arm to Hold on to the furniture leg in case the shaking causes the furniture to move.\nIf you are in a room without a table or desk, find an interior wall away from windows or mirrors and that is not under light fixtures or near heavy furniture that could topple over. Slide down with your back to the wall, tuck your legs into your chest and cover your head with both arms.\nDuring strong shaking, stay in place. Moving can lead to falls or injuries from falling debris. Large items can topple over onto you such as tall bookcases, heavy items on shelves, or glass. After strong earthquakes, expect aftershocks. You’re safest if you stay put for several minutes to make sure the strongest shaking has passed.\nIf outdoors, try to move to an open area where nothing can fall on you. Then sit, pull your legs into your chest and protect your head using your hands. Outdoor hazards include tree branches, stone masonry on buildings and overhead electrical lines.\nFor more specific information for other scenarios, visit the ShakeOut website.\nLearn what to do before an earthquake and try to prevent hazards. Secure furniture, large electronics and wall hangings around your home or workplace. You can also learn what to do afterward, including checking for a ruptured gas line, knowing how to turn it off if it has and knowing how to reunite with family if you are separated.\nDrill tips and information resources are available on the ShakeOut website. Free personal disaster plan templates are also available on ReadySanDiego.org in multiple languages. The templates include a list of important items to assemble in your disaster emergency kit.\nMore local preparedness tips include: Downloading a free SDEmergency app for information and registering your cell phone or VoIP number or email with AlertSanDiego, the county’s emergency mass notification system.\nOn ShakeOut Day, 10/15, the County’s Office of Emergency Services is also asking residents to post a photo or video of themselves or others on Twitter or Facebook doing Drop, Cover and Hold On drills or showing other emergency preparation. For more details, visit the ReadySanDiego ShakeOut social media challenge page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201008.13.55.09"}