{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mar Vista High COVID-19 Testing Site Reopening Sept. 24", "description": "The County’s COVID-19 testing site at Mar Vista High School in Imperial Beach will be reopening Sept. 24, after being temporarily closed to provide additional resources at San Diego State University.", "datePublished": "2020-09-23T17:22:56-07:00", "url": "https://www.countynewscenter.com/mar-vista-high-covid-19-testing-site-reopening-sept-24/", "keywords": ["health", "coronavirus", "covid testing", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-09-24T09:06:57-07:00", "articleType": "article", "articleContent": "\nThe County’s COVID-19 testing site at Mar Vista High School in Imperial Beach will be reopening Sept. 24, after being temporarily closed to provide additional resources at San Diego State University.\nThe drive-up site will be providing up to 500 free tests from 8:30 a.m. to 3:30 p.m. Monday through Friday. No appointments are necessary, testing takes about 5-10 minutes, and results come back in about two days.\nMar Vista High is one of six County locations that do not require an appointment to get a test. People must be 12 years of age or older to be tested at a County-coordinated site.\nThe other five sites are located at:\n\nCalifornia State University San Marcos – Viasat Engineering Pavilion\nUniversity of San Diego – Electronics Recycling Center\nSan Diego State University Alumni Center\nTubman-Chavez Community Center\nSan Ysidro Port of Entry PedEast\n\nAppointments are necessary at other County testing sites. To make an appointment, visit www.211sandiego.org or call 2-1-1. You can view the testing sites by day online.\nFree COVID-19 testing is also available from your healthcare provider. Health plans are required to cover COVID-19 tests at no cost to the enrollee. It is recommended that you first contact your healthcare provider for a COVID-19 test.\nMost youth and their caregivers can receive testing through the COVID-19 Collaborative for Children in partnership with Rady Children’s Hospital. You should contact your Rady pediatrician or email covidcollaborative@rchsd.org for more information.\nYouth and caregivers covered by Kaiser Permanente should consult with their pediatrician or physician provider directly, or through www.kp.org.\nThe County announced today it was working on making tests available at County sites for children under age 12.\nTo date, more than 1 million tests have been reported in the region and the County has conducted over 51,000 case investigations.\n\nNew State Metrics:\n\nUnder the new state monitoring metrics, San Diego County is currently in Tier 2, also referred to as the Red Tier.\nSan Diego’s state-calculated, adjusted case rate is 6.9. The testing positivity percentage is 3.8%.\nThe California Department of Public Health will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 29.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed on Sept. 22.\nIn the past seven days (Sept. 16 through Sept. 22), 13 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n5,091 tests were reported to the County on Sept. 22 and the percentage of new laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 3.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,241.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n278 new cases were confirmed among San Diego County residents on Sept. 22. The region’s total is now 45,425.\n19 of the 278 new cases are connected to San Diego State University. The total number of cases connected to SDSU students is reported online.\n3,450 or 7.6% of cases have required hospitalization through Sept. 22.\n813 or 1.8% of all cases and 23.6% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nTwo new COVID-19 deaths were reported in San Diego County on Sept. 22. The region’s total remains at 767.\nTwo men died Sept. 20, and their ages were in the early 60s and early 70s.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200923.17.22.56"}