{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Three Wild Mice Test Positive for Hantavirus", "description": "Three wild mice collected in routine monitoring in Carlsbad have tested positive for hantavirus, prompting County officials to remind people they should never sweep or vacuum up after rodents if they find them in living spaces.", "datePublished": "2020-02-21T09:09:48-08:00", "url": "https://www.countynewscenter.com/three-wild-mice-test-positive-for-hantavirus/", "keywords": ["health", "hantavirus", "vector control"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-02-21T09:09:48-08:00", "articleType": "article", "articleContent": "\nThree wild mice collected in routine monitoring in Carlsbad have tested positive for hantavirus, prompting County officials to remind people they should never sweep or vacuum up after rodents if they find them in living spaces.\nCounty officials said it was important for people to remember to use “wet-cleaning” methods instead of sweeping or vacuuming if they find evidence of rodents in homes, sheds, garages, cabins or other living spaces.\nHantavirus is potentially deadly, and people are exposed to it when the virus, shed by wild rodents in urine, feces and saliva, dries and stirred into the air and inhaled.\nWhile hantavirus is common in San Diego County, people are unlikely to be exposed to the virus because the carriers, wild rodents, wild mice in particular, generally want to live and nest away from people.\nStill, County officials said people should be careful to use wet cleaning methods, with bleach, disinfectants, rubber gloves and bags if they find rodent droppings or other signs that wild rodents have gotten into living spaces and they must clean.\nThe mice collected from an open space in Carlsbad included two harvest mice and one deer mouse.\nThere is no cure or vaccine for hantavirus. In 2019, 42 rodents collected in routine monitoring by County Vector Control tested positive for hantavirus.\nLast month, two cactus mice collected in Santee and Valley Center tested positive for hantavirus. Twelve rodents have tested positive so far in 2020.\nHere are tips for people to prevent being exposed to wild rodents and hantavirus, and how to use wet-cleaning methods.\nAvoid Exposure to Hantavirus\n\nSeal up all external holes in homes, garages and sheds larger than a dime to keep rodents from getting in.\nEliminate rodent infestations immediately.\nAvoid rodent-infested areas and do not stir up dust or materials that may be contaminated with rodent droppings and urine.\nClean up rodent droppings and urine using the wet cleaning method described below.\n\nUse “Wet-cleaning” Methods to Prevent Inhaling the Virus\n\nDo not sweep or vacuum infested areas.\nVentilate affected area by opening doors and windows for at least 30 minutes.\nUse rubber gloves. Spray a 10 percent bleach solution or other disinfectants onto dead rodents, rodent droppings, nests, contaminated traps, and surrounding areas and let the disinfectant stand for at least 15 minutes before cleaning.\nClean with a sponge or a mop that has been soaked in disinfectant.\nPlace disinfected rodents and debris into two plastic bags, seal them and discard in the trash.\nWash gloves in a bleach solution, then soap and water, and dispose of them using the same double-bag method.\nThoroughly wash your hands with soap and water.\n\nFor more information, contact the County Department of Environmental Health (DEH) at (858) 694-2888 or visit the DEH hantavirus web page.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200221.09.09.48"}