{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Vista Celebrates New Affordable Housing for Seniors", "description": "A new affordable housing community in North County celebrated its grand opening today. Santa Fe Senior Village is a 54-apartment building located on North Santa Fe Drive in Downtown Vista.", "datePublished": "2025-04-18T14:14:11-07:00", "url": "https://www.countynewscenter.com/vista-celebrates-new-affordable-housing-for-seniors/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-04-18T14:14:11-07:00", "articleType": "video.other", "articleContent": "\nReading Time:  2 minutesA new affordable housing community in North County celebrated its grand opening today.\nSanta Fe Senior Village is a 54-unit apartment building located on North Santa Fe Drive in Downtown Vista. It is the city’s first permanent supportive housing.\nThe new development provides homes for extremely low to low-income seniors and veterans 62 years old and up. It features 51 studio apartments and two 1-bedroom apartments, with 27 units fully furnished for individuals and families who were homeless or at risk of becoming homeless.\nThe pedestrian friendly senior community is located next to the Vista Transit Center Station providing residents with close and convenient access to public transportation. Santa Fe Senior Village is also within walking distance of a grocery store, public park, restaurants, a public library and a medical clinic.\n“This project meets a critical need for affordable housing and allows our seniors and working families to stay in the community they love, said County Supervisor Jim Desmond. “I’m proud to support this effort, which serves as a model for how we can make North County more livable and accessible for everyone.”\nDeveloped by National Core and the San Diego Community Housing Corporation, Santa Fe Senior Village is the result of a public/private partnership including the County and the City of Vista. The County provided $9.3 million in funding and 53 Project-Based Housing Choice Vouchers for long term housing stability. The County’s Behavioral Health Services also offers support services including case management and care coordination.\n“Santa Fe Senior Village is proof that as a community we can come together to provide the appropriate housing and services for our most vulnerable neighbors,” said Kimberly Giardina, Deputy Chief Administrative Officer for the County Health and Human Services Agency. “Safe, affordable housing is critical and combining it with much needed supportive services will have lasting positive impacts on this community for years to come.”\nSanta Fe Senior Village amenities include a community room, computer lab, barbeque area, community garden, outdoor terrace and laundry facilities.\nVisit National Core and Santa Fe Senior Village for wait list information.\nSince 2017, the County has invested more than $325 million into affordable housing, using excess land, its Innovative Housing Trust Fund, and other state, federal, and local funding sources administered by the County. Those funds have helped open doors to over 2,588 homes, 1,593 new units just for seniors, with 3,292 more on the way.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250418.14.14.11"}