{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County Funds Newest Affordable Housing in Linda Vista", "description": "There are 96 new affordable housing options for families and individuals in San Diego County. A grand opening celebration was held today for the Amanecer Apartments on Ulric Street in Linda Vista. The Community HousingWorks development features apartments large enough for families with some units reserved for foster youth and unhoused veterans. The County invested $7 million dollars of Innovative Housing Trust Funds in the project and helped welcome these new residents home.", "datePublished": "2023-04-07T08:08:47-07:00", "url": "https://www.countynewscenter.com/county-funds-newest-affordable-housing-in-linda-vista/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-04-07T08:08:47-07:00", "articleType": "video.other", "articleContent": "\nThere are 96 new affordable housing options for families and individuals in San Diego County. A grand opening celebration was held today for the Amanecer Apartments on Ulric Street in Linda Vista. The Community HousingWorks development features apartments large enough for families with some units reserved for foster youth and unhoused veterans. The County invested $7 million dollars of Innovative Housing Trust Funds in the project and helped welcome these new residents home.\nSan Diego County Housing and Community Development Services helps more than 53,800 people through various housing programs and affordable housing efforts. Since 2017, the County has invested more than $240 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund. Efforts since then have resulted in the opening of 1,125 new units with an additional 3,144 units on the way. When upcoming developments under construction or in planning are complete, the total number of affordable units supported by the County will reach nearly 7,600, providing homes to more than 16,700 people.\nThese and other endeavors are part of the County’s ongoing response to the region’s housing affordability crisis. Efforts also are underway to create a roadmap, or Housing Blueprint, to guide our ongoing response. Community input remains vital to the County’s efforts to address the crisis to date. People are encouraged to review the Housing Blueprint to help inform final recommendations for its goals and objectives before it is presented later this year to the Board of Supervisors.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230407.08.08.47"}