{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches Website Focused on South Bay Gastrointestinal Illnesses", "description": "San Diego County Public Health Services has created and is regularly updating a webpage focused on the ongoing surveillance and investigation of gastrointestinal (GI) illness concerns in the South Bay. ", "datePublished": "2024-03-27T13:35:48-07:00", "url": "https://www.countynewscenter.com/county-launches-website-focused-on-south-bay-gastrointestinal-illnesses/", "keywords": ["health", "beach water", "south bay"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-03-27T13:56:18-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County Public Health Services has created and is regularly updating a webpage focused on the ongoing surveillance and investigation of gastrointestinal illness based on concerns from the South Bay community. \nThe webpage provides updates, an explanation of illnesses, surveillance data and resources. The County began monitoring the illness reports in August and is now issuing a Surveillance Bulletin on South Region Gastrointestinal Illness that is updated weekly on Thursdays. \nGastrointestinal is also commonly referred to as GI and is related to illnesses including the stomach and intestine.   \nThe data reviewed to date reveals no significant increases in reportable GI illnesses and no increases in related emergency department visits in the South Bay Region. Public Health Services also is reviewing data collected by County medical professionals who were embedded for nearly two weeks with a South Bay clinic. Results are expected in the next 30 days. \nCounty health officials have also updated Imperial Beach officials, the California Coastal Commission, San Diego County Air Pollution Control District, California Department of Public Health and Environmental Protection Agency on the ongoing surveillance work. \n“As the Centers for Disease Control and Prevention have advised, when people come into direct contact with sewage contaminated water, it can lead to a number of illnesses, including those that result in emergency room visits and at times hospitalizations,” said Dr. Ankita Kadakia, the County’s deputy public health officer. “South County residents deserve access to clean beaches and waterways. While we continue to closely monitor reports of illnesses and await steps to lessen and clean sewage flows, it remains very important for people to avoid going into water that is contaminated.” \nTimely reports and maps of local water quality are available online and updated regularly. \nThe County of San Diego continues to advocate to the federal government for additional funding and a binational solution to the regular release of untreated sewage that flow across the border, into the Tijuana River Valley and ultimately into the waters off South County beaches. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240327.13.35.48"}