{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Library Cards Become Golden Ticket to Help Reentry", "description": "It’s like a ticket to a better life—and it comes in the form of a simple card. A new program designed to help people who have spent time in County detention facilities successfully return to their communities and build brighter futures has issued more than 120 library cards in its first year.", "datePublished": "2022-11-15T09:59:45-08:00", "url": "https://www.countynewscenter.com/library-cards-become-golden-ticket-for-reentry/", "keywords": ["library"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-11-15T15:17:43-08:00", "articleType": "article", "articleContent": "\nIt’s like a ticket to a better life—and it comes in the form of a simple card.\nA new program designed to help people who have spent time in County detention facilities successfully return to their communities and build brighter futures has issued more than 120 library cards in its first year.\nThe library card program started in October 2021 as a pilot program for women at the Las Colinas Detention and Reentry Facility. It proved so successful that it has already been expanded to all county detention and reentry facilities.\nThe San Diego County Sheriff’s Department and County Library teamed up to add library cards to reentry services. The library card program hopes to help people coming home improve their lives by giving them access—not just to books, but to all County Library programs, and to create “lifelong learners.”\nFor example, they can start the path to earning a free high school diploma through the Library High School. And they can check out “Tech Connect” Chromebook laptops, Wi-Fi hotspots and get a free year of internet service to help with job searches, education and training.\nBecause they don’t need any other identification to get the library card and the access it brings, the program offers immediate hope, a sense of belonging and community.\nCounty Library officials said the program has been welcomed.\nLiz Vagani, manager of Library’s Santee branch, said she talked with a man who received a reentry library card when he came to the library to pick up his “Tech Connect” Chrome laptop.\n“He was very thankful,” Vagani said. “We chatted a bit about what the library had to offer. That’s when he told me he knew this would change his life.”\nPosters promoting the library card program are placed in County detention facilities. People can complete the application process through their counselors. Library staff issue the card—an ID packaged with a list of services and library branch locations. The packet is stored with the applicant’s belongings and given to them upon release—meaning every one of them can rejoin their communities with a card in hand.\nFor more information about the Sheriff’s Department Reentry Services, visit the division’s webpage.\nTo learn more about the San Diego County Library system, go to its website at sdcl.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221115.09.59.45"}