{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "FEMA to Conduct Emergency Alert Systems Testing", "description": "Televisions, radios and some cellphones will receive a test message as part of a nationwide emergency alert systems test on Wednesday, Aug. 11.", "datePublished": "2021-08-09T09:49:39-07:00", "url": "https://www.countynewscenter.com/fema-to-conduct-emergency-alert-systems-testing/", "keywords": ["public safety", "emergency alert system", "fema", "wireless alert"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-08-09T09:49:39-07:00", "articleType": "article", "articleContent": "\nTelevisions, radios and some cellphones will receive a test message as part of a nationwide emergency alert systems test on Wednesday, Aug. 11.\nAs in previous emergency alert systems tests, there is no need for concern for cellphone users or anyone viewing the alerts on television or hearing the tone on the radio, and there is no action that needs to be taken.\nThe Federal Emergency Management Agency in coordination with the Federal Communications Commission will test its Emergency Alert System with television and radio channels between 11:20 and 11:50 a.m. Some consumer cellphones whose subscribers opted into the Wireless Emergency Alerts tests will also receive the special tone and test message.\nIn a real situation, the emergency alert systems would be used to warn the public about dangerous weather, missing children, or another critical situation that may require you to evacuate or remain in place.\nWireless Emergency Alerts can be sent by the National Weather Service, local first responder agencies, the National Center for Missing and Exploited Children, and the president through a system devised by FEMA and the Federal Communications Commission.\nTo learn more about the federal Wireless Emergency Alert system, visit ReadySanDiego.org. You’re also encouraged to sign up for AlertSanDiego, the County’s emergency alert system that will send notices including wildfire evacuations.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210809.09.49.39"}