{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Surpass 500, Cases Over 25K", "description": "A record number of COVID-19 deaths were reported in San Diego, bringing the region’s total to 505, the County Health and Human Services Agency announced today.", "datePublished": "2020-07-22T18:22:30-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-surpass-500-cases-over-25k/", "keywords": ["health", "500 deaths", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-23T08:58:48-07:00", "articleType": "article", "articleContent": "\nA record number of COVID-19 deaths were reported in San Diego, bringing the region’s total to 505, the County Health and Human Services Agency announced today.\nEighteen San Diegans died between June 22 and July 21, and their ages ranged from 51 to 96 years. All had existing medical conditions.\nAlso, 587 COVID-19 cases were reported July 21, the third highest one-day total. To date, 25,107 cases have been reported in San Diego County.\nThroughout the pandemic, San Diegans over 50 years of age have been hit hardest by COVID-19. While people in this demographic represent only 31% of the more than 25,000 cases, they account for nearly 96% of the deaths.\nCOVID-19 has been most deadly for San Diegans 60 years and older. People in this age group represent only 17% of the cases but 87% of the deaths.\n“Getting through this pandemic requires that we all do our part to protect ourselves and others,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We are depending on everyone. Every individual, every business, every school and all other sectors to play a role and protect our most vulnerable.”\nThe disproportionate number of deaths among older people is the fact that nearly all of them had underlying medical conditions such as heart and lung disease, cancer, diabetes or obesity.\nMore COVID-19 Deaths Being Reported Outside Congregate Settings\nAt the beginning of the COVID-19 pandemic, more than half of the deaths were being reported in skilled-nursing facilities and other congregate settings.\nToday, more deaths are being reported in the general population. Of the 505 COVID-19 deaths, 291 or 58% are among the general population compared to 214 or 42% that have been reported in skilled-nursing facilities and other congregate settings.\n“The increasing number of deaths outside of congregate facilities is a sign that the virus continues to be widespread and taking a toll on San Diegans, especially older people and those with underlying chronic conditions,” Wooten said.\nCounty to Deploy Compliance Team\nA team made up of County staff will be working with representatives from local jurisdictions to address complaints about businesses that are flagrantly not complying with the local health order.\nWhile most businesses have reopened safely and scaled back their operations when asked by the state and the county, some businesses have refused to modify operations or close.\nThe Safe Reopening Compliance Team will go out to businesses and establishments across the region to ensure compliance with the local Public Health Order and to slow the spread of COVID-19. If they refuse, more strict measures could be taken.\nResidents can report businesses defying the public health guidance by calling their local police department’s non-emergency line. \nCommunity Setting Outbreaks:\n\nTwo new outbreaks were identified on July 21, one in a business and one in a healthcare setting.\nIn the past seven days, 12 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n8,280 tests were reported to the County on July 21 and 7% were positive new cases.\nThe 14-day rolling average percentage of positive cases is 6.0%. The target is less than 8.0%.\nThe 7-day, daily average of tests is 9,155.\n\nCases: \n\n587 new cases were reported in San Diego County for a total of 25,107.\n2,279 or 9.1% of cases have required hospitalization.\n592 or 2.4% of all cases and 26% of hospitalized cases had to be admitted to an intensive care unit.\n\nMore COVID-19 Info:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200722.18.22.30"}