{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Prepare for Natural Disasters to Protect Your Legacy", "description": "Families and individuals work hard to establish their homes and businesses and fill them with cherished people and memories. Don’t let a natural disaster destroy your legacy.", "datePublished": "2022-09-20T11:44:40-07:00", "url": "https://www.countynewscenter.com/?p=209538", "keywords": ["government", "emergency preparedness", "national preparedness month"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-09-20T14:31:27-07:00", "articleType": "article", "articleContent": "\nFamilies and individuals work hard to establish their homes and businesses and fill them with cherished people and memories. Don’t let a natural disaster destroy your legacy.\n“To remind everyone what is at stake, the theme for 2022’s National Preparedness Month is ‘A Lasting Legacy,’” said Jeff Toney, director of the San Diego County Office of Emergency Services. “The destructive Border 32 fire made the point earlier this month that while wildfires are a year-round threat to the San Diego region, fall is peak fire season. As we continue into the fall months, the wildfire threat will only increase as grasses and brush dry out further. This September, take time to create or review a personal disaster plan for your family.”\nIn addition to wildfires, San Diego faces other natural disaster hazards such as earthquakes and flooding. Communities face various levels of risk for different hazards and it is important to know your hazard risk so you can take appropriate measures to safeguard from damages. Visit the County’s ReadySanDiego’s page to launch an easy tool to determine your risk based on specific addresses.\nKnowing specific hazard risks allows people to customize their personal disaster plan and possibly lower the level of risk. Some examples of this are protecting your home from embers by clearing away leaves and debris, woodpiles or other potential flammable items that could fuel a spark of fire. Or in the case of flooding, protecting your home by having sandbags on hand, if needed. Templates in 12 languages are available online to guide your family, as well as for people who may need assistance.\nA personal disaster plan helps people consider how and where families will reunite if phone lines are affected and they are separated. It also helps gather important phone numbers for quick reference if phone lines are not affected. Families or individuals can plan how they would respond to an earthquake in various locations such as home, work or school, and determine which areas in each room would be safest to drop, cover and hold on in.  In the case of a house fire, families can discuss how and where to escape.\nGathering emergency supplies such as water, nonperishable food, medications, and special dietary needs as well as flashlights, batteries, a radio and first aid materials will also be a critical part of your plan. A printable list of suggested items may help guide people in putting a kit together.\nOnce a personal disaster plan is complete, people are more likely to minimize potential risks around their home or business and be ready to act in a stressful real-life situation, especially if the plan is discussed and practiced by all household members.\nIn the event of a disaster, it will be important to stay informed with official information. San Diego County offers AlertSanDiego, a mass emergency notification tool that sends information to all hard-wired home and business phones. Cell phones need to be registered to receive the alert.\nAdditionally, the County will also put more information out on its SD Emergency page and people can download the SD Emergency App at no cost to receive information directly to their phones. The app includes early earthquake warning capability and has a brief personal disaster plan template.\nTo learn more about ways to prepare for a disaster, visit ReadySanDiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220920.11.44.40"}