{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Community Development Block Grant Applications Open", "description": "The County of San Diego’s Housing and Community Development Services (HCDS) have opened the 2024-2025 Community Development Block Grant Project Applications. Applications are available online, including a printable hard copy option at www.sdhcd.org. HCDS will accept applications through 5 p.m. on Nov. 10, 2023.  ", "datePublished": "2023-09-21T11:18:15-07:00", "url": "https://www.countynewscenter.com/county-community-development-block-grant-applications-open/", "keywords": ["government", "cdbg", "cdbg grants", "community development", "county grants", "hcds", "housing", "housing and community development services", "san diego"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-09-21T12:44:49-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Housing and Community Development Services (HCDS) has opened the 2024-2025 Community Development Block Grant (CDBG) Project Applications. Applications are available online, including a printable hard copy option at www.sdhcd.org. HCDS will accept applications through 5 p.m. on Nov. 10, 2023.  \nThe CDBG program aims to develop urban communities by providing decent housing, a suitable living environment, and by expanding economic opportunities for low and moderate-income residents. CDBG funding can be used on a wide range of activities including community facilities, infrastructure development, affordable housing acquisition or preservation, neighborhood enhancement, and a limited range of public services. HCDS administers CDBG projects for the unincorporated area and the Cities of Coronado, Del Mar, Imperial Beach, Lemon Grove, Poway, and Solana Beach.  \nAll CDBG projects must:  \n\nMeet CDBG program eligibility requirements\nAlign with the County’s 5- Year Consolidated Plan Goals\nAlign with the 2024-2025 Annual Plan Strategy\nSupport the County’s goal of advancing economic and racial equity by prioritizing the needs of vulnerable communities in the region\n\nHCDS will be hosting five CDBG Application Workshops, where interested applicants can drop-in and receive one-on-one technical assistance, guidance, and receive general information about the CDBG program and the application process. Workshops are available to non-profit organizations, County departments, participating CDBG city departments, and/or community members who want to learn more about funding a CDBG project idea.  \nAll CDBG projects must be implemented by a public entity or tax-exempt non-profit organization. Applications submitted by nonprofit organizations must be submitted by an authorized representative, as authorized by the organization’s Board of Directors. Community Organizations, Participating Cities, and County Department applications can be found here. \nPrivate residents may submit a separate Resident Request Application. Please note “Resident Request” applications are not intended to be awarded to private residents for projects or services. Please consult with HCDS before submitting a “Resident Request” at Community.Development@sdcounty.ca.gov or (858) 694-8756. Resident Request Online Forms can be found here. \nHCDS will also be hosting five CDBG Application Workshops, offering one-on-one technical support, application assistance, and general information about the CDBG program and the application process to interested applicants. These workshops are drop-in opportunities available to non-profit organizations, County departments, participating CDBG city departments, and community members who want to learn more about funding a CDBG project idea.  \nCDBG Application Workshop Schedule: \n\nLakeside Library\nWednesday, October 4\n2 – 4 p.m.\n12428 Woodside Ave., 92040 \n\n\nImperial Beach Library\nThursday, October 5 \n2 – 4 p.m.\n810 Imperial Beach Blvd., 91932 \n\n\nDel Mar Library  \nFriday, October 6\n1 – 3 p.m. \n1309 Camino Del Mar, 92014  \n\n\nSpring Valley Library\nTuesday, October 10\n2 – 4 p.m.\n836 Kempton St., 91977  \n\n\nFallbrook Library\nWednesday, October 11\n1 – 3 p.m. \n124 Mission Rd., 92028     \n\nFor more information and engagement opportunities visit Engage San Diego and the San Diego County Engagement Center.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230921.11.18.15"}