{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Hundreds of County Employees Volunteer for Homeless Count", "description": "The annual homeless count is spearheaded by the Regional Task Force on Homelessness and provides a one-day snapshot of people living on the streets or in short-term shelters.", "datePublished": "2022-02-24T13:13:41-08:00", "url": "https://www.countynewscenter.com/hundreds-of-county-employees-volunteer-for-homeless-count/", "keywords": ["housing", "homeless count", "homelessness", "point in time count"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-02-25T08:35:13-08:00", "articleType": "article", "articleContent": "\nIt’s around 4 a.m. and it’s cold outside.\nOn the corner of 30th St. and University Ave. in North Park a man is walking with his bike in tow. He stops to talk to Lisa Lawrence and Christianne Knoop, two County employees with Health and Human Services Agency Department of Homeless Solutions and Equitable Communities who are volunteering in the annual homeless count.\nHe agrees to answer a short questionnaire and gets socks, masks and a $10 gift card to 7-Eleven in return. Starbucks gift cards were also provided.\nHis name is Rahid. He’s 49, Hispanic and has been homeless for 10 years. He says he does not have any mental illness, but admits he uses methamphetamines.\nCounty social worker Christianne Knoop speaks with a homeless woman.\nWhy is a Homeless Count Done?\nKnoop enters his information into the survey application the Regional Task Force on Homelessness uses to gather information on some of the thousands of people in San Diego County who are homeless.\nKnoop and Lawrence don’t have to walk far since Emwar, covered in a comforter, is walking by.\nHe too agrees to talk to them. He is 34 years old, African American and has been homeless on and off for five years. He too is using substances but says he’s working on getting stable housing.\nThe annual homeless count is spearheaded by the Regional Task Force on Homelessness and provides a one-day snapshot of people living on the streets or in short-term shelters. The results are used to apply for federal and state funding to help people experiencing homelessness and find solutions on how to best serve this vulnerable population.  In San Diego County, the homeless count is completed annually, but a count did not take place in 2021 due to the ongoing COVID-19 pandemic and this year’s count had to be pushed back for about a month due to the Omicron surge.\nThis year, about 1,400 people volunteered for the count. Volunteers gathered in different locations throughout the region where they are separated into teams, and they walk or drive the streets, parks, beaches and valleys looking for people who are experiencing homelessness.\nThe teams deployed from San Diego LGBTQ Center headed out to walk the streets and alleys of Hillcrest, Old Town, Mission Hills, North Park and University Heights.\nSome teams drove. Others walked and engaged people they found asking them if they wanted to participate in a survey to better understand their situation.\nCounty Employees Step Up\nCounty employees have participated in the homeless count for the past eight years, earning their regular pay.  This year, more than 300 County employees volunteered for the count.\nKnoop and Lawrence’s team also included a freshman student at San Diego State University who aspires to be a social worker when he graduates.\nThe group was assigned to North Park, particularly the area between University Ave. and El Cajon Blvd. from Arizona St. to Iowa Street.\n“It’s important to volunteer for the count,” said Lawrence who has volunteered for five years. She is a Social Worker at the Department of Homeless Solutions and Equitable Communities, Office of Homeless Solutions within the Health and Human Services Agency.\n“You hear the word homeless, but you really don’t know what it means until you see it,” said Lawrence, adding that she tries to get her friends to volunteer.\nKnoop said she has volunteered to do the homeless count four times because she likes to be engaged in her community.\n“Everyone has a story to tell and it’s important that we listen,” said Knoop who is also a Social Worker within the Office of Homeless Solutions. “These are real people. It’s hard to comprehend what they’re going through.”\nBoth Knoop and Lawrence regularly do homeless outreach as part of their job but emphasized importance of participating in the count to learn more about the needs of those experiencing homelessness.\nNot every homeless person the teams encounter is interviewed. Some people who were sleeping were not disturbed. In those instances, the counters filled out an even shorter questionnaire, which noted where they were sleeping.\nSome, like Mike, Stephanie and Mitchell also agreed to share their experiences.\nMike, who is 58 and White, has been homeless for 10 years. Nearby was Stephanie, a 53-year-old African American woman who has been homeless for the past five years. Both said they have no physical or substance abuse issues.\nOn an alley near Lincoln Ave. and 30th Street, Knoop and Lawrence came across Mitchell, a 61-year-old veteran who said he’s been homeless for 15 years.\nHomeless count volunteers use an app to enter people’s information.\nLawrence looked him up in the Homeless Management Information System and found that Mitchell had received services in the past from PATH, a local organization that provides services to people experiencing homelessness. His contact information was outdated, so Lawrence took his phone number down to ensure he can be again connected to housing resources and supports.\nDuring the 2020 count, the region’s combined total of people experiencing homelessness came to 7,638, a 6% drop compared to 2019.  Of those, 3,971 were unsheltered. These individuals included veterans, family members, victims of domestic violence, those with substance user disorders, HIV/AIDS patients and the chronically homeless.\nHomeless advocates believe that the COVID-19 pandemic has displaced many more people over the past two years. They will have more information when the results of this year’s homeless count are available in the spring.\nThe County has multiple programs in place that could connect homeless people to the services they need and help them find a stable place to live. You can find more information here or by calling 2-1-1.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220224.13.13.41"}