{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Violence Survivor Finds Hope and Support at One Safe Place", "description": "San Diego County is home to some of the nation’s most respected organizations providing services to help people escape family or domestic violence. Since July, One Safe Place in San Marcos has been providing hope and services to help victims of domestic violence, child abuse, elder abuse, human trafficking, and violent loss.", "datePublished": "2022-10-31T11:39:01-07:00", "url": "https://www.countynewscenter.com/violence-survivor-finds-hope-and-support-at-one-safe-place/", "keywords": ["public safety", "care coordinators", "crystal robbins", "deputy amber sprague", "deputy brian abraham", "deputy jason burk", "domestic abuse", "domestic violence", "estafania gomez", "nani", "one safe place", "san diego county sheriff s deputies", "san marcos", "tracy prior"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-10-31T11:39:01-07:00", "articleType": "article", "articleContent": "\nNani’s smile is lovely and her story uniquely positioned to illustrate the importance of organizations like One Safe Place, a safe haven set up by the District Attorney’s Office to provide hope and services to help victims of domestic violence, child abuse, elder abuse, human trafficking and violent loss in San Diego’s North County.\nNani lived on the streets of Escondido for more than 5 years.  She and her boyfriend were well-known to the deputies and police officers working near the Escondido Transit Center because they were often the subject of complaints.\nOne day transit cameras caught Nani’s boyfriend striking and knocking her to the ground. San Diego Sheriff Deputies Jason Burk, Brian Abraham and Amber Sprague saw the video and moved in to arrest him.  After the arrest, Deputy Sprague knew One Safe Place could provide the support Nani needed.\n“One Safe Place is a one stop shop to support victims of abuse and trauma,” Tracy Prior, Chief Deputy District Attorney and Chief Operating Officer of One Safe Place.\n“The District Attorney’s Office created One Safe Place as a one stop shop to address the needs of abuse and trauma victims,” said Tracy Prior, Chief Deputy District Attorney and Chief Operating Officer of One Safe Place.  Care Coordinators from the District Attorney’s Office focus on the needs of victims and their families. They then expand the team to provide an array of services like planning, legal services and mental health support based on the situational needs.\nDeputy Brian Abraham says Nani walked through the front door at One Safe Place and “everyone was welcoming.”\n\nThe team of professionals at One Safe Place included Care Coordinator Crystal Robbins who quickly went to work accessing Nani’s needs.  \nNani’s mother and daughter lived out-of-state, and they were excited to help her return home. Estefania Gomez, an eligibility worker with the County of San Diego stepped in to help facilitate.  Gomez often helps victims get financial support like food stamps or other aid programs, helps facilitate medical attention for chronic or immediate medical issues, and connect people with a social worker.  But Nani’s case was different. In her case, she had an opportunity to immediately change Nani’s life, pluck her off the streets of Escondido and get her home to her family.\nPartner organizations were willing to pay hundreds or even thousands of dollars to get her a plane ticket, but the travel planning had its challenges.\nFor one, Nani had been homeless for years, so she had no identification or documents like a birth certificate to prove who she was, a critical element in being allowed to board a plane. Staff at One Safe Place set to work to track down Nani’s birth certificate from her home state and work with the state of California to issue her a new identification card.\n\nWhile this was going on, other team members worked with Nani to get her ready for the trip.  She only had the clothes and belongings she could carry with her, so the One Safe Place department store-style clothing shop was a must stop.\nKnowing the flight would not be until the next morning, staff found a safe place for Nani to clean up and sleep while she waited.\n“This is a prime example of what can happen when we all work together,” San Diego County Sheriff’s Deputy Amber Sprague.\nThe following morning, Deputies Burk and Abraham started their day by arriving at Nani’s hotel at 6:30 a.m. and driving her to the airport. They even walked with her to the gate where Nani hugged the deputies multiple times before boarding.\nNani had gone from an abusive relationship, homeless on the streets of Escondido to meeting with her family and a new home hundreds of miles away in less than 24 hours.\nThe story doesn’t end there. As Nani works to rebuild her life and mend relationships with her daughter and mother, support for Nani continues today. One Safe Place Care Coordinator Crystal Robbins is still actively working with Nani, her family and service providers in her home state.\nNani has also stayed in touch with the deputies.  Two days after her flight, Nani called Deputy Abraham.  She told him she was thankful for the support she received from him and the other deputies and that from the team at One Safe Place.\n“In my career in law enforcement, the support Nani got from One Safe Place was one of the most beautiful things I’ve seen, “said Deputy Sprague.\nOne Safe Place has served more than 1,000 guests since it opened in July.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221031.11.39.01"}