{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Face Coverings to Be Required When Restaurants, Stores Open", "description": "As the County awaits a response from the state on its plan to allow in-person dining and shopping, health officials want people to know that face coverings and physical distancing will be required when entering these businesses.", "datePublished": "2020-05-20T17:28:25-07:00", "url": "https://www.countynewscenter.com/face-coverings-to-be-required-when-restaurants-stores-open/", "keywords": ["health", "coronavirus", "covid-19", "face coverings"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-21T12:00:07-07:00", "articleType": "article", "articleContent": "\nAs the County awaits a response from the state on its plan to allow in-person dining and shopping, health officials want people to know that face coverings and physical distancing will be required when entering these businesses. In restaurants, the coverings will be needed until the customers are seated.\n“As San Diegans prepare to eat out and go shopping, it’s important for people to remember they must wear a face covering when in public and close to other people,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The County is enormously grateful for the public’s effort to date.”\nWhen you wear a face covering, you protect those around you. When others use a face covering, they protect you. When you couple face coverings with physical distancing and good hand hygiene, the risk of getting COVID-19 diminishes.\nCounty Public Health Officer Wilma Wooten wears a face covering to remind the public one is required when out in public.\nFace coverings “disrupt the trajectory of a cough, sneeze or breath” preventing droplets carrying the virus from traveling between people, according to the Centers for Disease Control and Prevention.\nTwo recent studies have estimated that between 12,000 and 15,000 local lives were saved because of the preventive measures.\n“Had we not practiced physical distancing and respected the stay-at-home order, many thousands more individuals, including our elderly, would have died from COVID-19,” Wooten said.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n4,802 tests were reported to the County May 19, and 114 or 2% were positive.\n3.6% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n114 new cases were reported for a San Diego County total of 6,140.\n1,155 or 18.8% of the total cases have required hospitalization.\n352 or 5.7% of all cases had to be placed in intensive care.\n\nDeaths:\n\nEight more COVID-19 deaths were reported today, bringing the region’s total to 230.\nSeven men and one woman died, and their ages ranged from 61 to 99 years.\nAll had underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n72 active outbreaks, 49 at congregate living facilities and 23 in community settings.\n1,351 cases, including 112 deaths in congregate living facilities.\n310 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200520.17.28.25"}