{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More Young San Diegans Getting Sick, Hospitalized Due to COVID-19", "description": "The number of younger San Diegans getting infected with the novel coronavirus has been increasing in recent weeks, and more of them are landing in the hospital, the County Health and Human Services Agency announced today.", "datePublished": "2020-07-15T17:47:32-07:00", "url": "https://www.countynewscenter.com/more-young-san-diegans-getting-sick-hospitalized-due-to-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "hospitalizations", "young people"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-16T08:53:00-07:00", "articleType": "article", "articleContent": "\nThe number of younger San Diegans getting infected with the novel coronavirus has been increasing in recent weeks, and more of them are landing in the hospital, the County Health and Human Services Agency (HHSA) announced today.\nOf the nearly 21,500 COVID-19 cases reported in the region, San Diegans between 20 and 39 years of age represent nearly 44% of all cases.\nA closer look at the HHSA data shows that after restaurants, bars, wineries, breweries, hotels and other businesses reopened, the number of people between 20 and 39 years of age getting sick with COVID-19 began to rise rapidly.\n\nDuring the second week of June, 510 San Diegans in that age bracket got sick with COVID-19. Another 1,144 got sick the following week, and during the last week of June the number jumped to 1,595. The figures began to decrease again when indoor activities at those same were closed again. The total was down to 1,028 by the week ending July 11.\n“Some young people think they’re invincible and won’t get sick, but that’s not the case,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Not only are they getting sick, but they are also ending up at emergency rooms and needing hospitalization.”\nDuring the second week of June 10, a total of 16 San Diegans between 20 and 39 years of age were hospitalized. The figured dropped to 12 the following week and jumped to 27 the last week of June. Again, the number began to decrease when certain sectors of the economy were closed and was down to 18 by July 11.\nAlso, the number of COVID-19 outbreaks in community settings followed a similar pattern of increasing as activities widened. While only eight community outbreaks were reported in May, in June, 33 were identified. This month, 38 community outbreaks have been reported, with restaurants/bars and private residences the most common locations.\n“The evidence is clear. As more people started to go out, especially young people, we started to see an increasing number of COVID-19 cases,” Wooten said.\nCOVID-19 Impact in Younger People\nDr. Scott Eisman, a pulmonary disease and critical care medicine expert at Scripps Memorial Hospital in Encinitas, said that while young people think COVID-19 is not serious, the novel coronavirus could have serious health issues, especially in young people who smoke or vape.\n“Many younger people think that this is something that you’ll get, and you’ll overcome, and everything will be fine, but the complications of this illness are greater than the flu,” Eisman said. “We have younger and younger patients showing up with more and more significant complications.”\nEisman said research has shown that COVID-19 attacks both lungs and their blood vessels which could result in blood clotting in the lungs and other parts of the body.\nCOVID-19, Eisman said, can cause other problems, including stroke, cardiac issues, cerebral dysfunction, liver and kidney failure.\n“It causes blood clotting in general and that could create substantial problems in the ability of the lung to deliver oxygen,” Eisman said.\nCounty Hiring Case Investigators\nDue to the increasing number of COVID-19 cases, the County is hiring additional people to do case investigations, an important activity in public health responses to infectious disease.\nCase investigators call or email people who have tested positive for COVID-19 to ask them to isolate themselves and find out their close contacts. Bilingual applicants are encouraged to apply for the temporary position.\nThe new hires will join the more than 510 case investigators and contact tracers currently working to stop the spread of the virus.\nCommunity Setting Outbreaks and Other Triggers:\n\nFour new community setting outbreaks were identified on July 14 in a hair salon, a barbershop, a restaurant/bar and a laboratory.\nIn the past seven days, 14 community outbreaks were confirmed.\nThe number of community outbreaks is double the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\nThe County also reached the Case Investigation trigger because only 46% of investigations were initiated within 24 hours of notification over a 7-day period. The percentage should be at least 71%.\nThe state’s threshold of no more than 100 cases per every 100,000 residents is also in the red and currently registers at 147.2 in San Diego County.\n\nTesting:\n\n8,436 tests were reported to the County on July 14 and 7% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 6.3%. The target set by the state is less than 8%.\nThe 7-day, daily average of tests is 8,056.\n\nCases:\n\n559 new cases were reported in San Diego County for a total of 21,446.\n2,093 or 9.8% of cases have required hospitalization.\n546 or 2.5% of all cases and 26.1% of hospitalized cases had to be admitted to an intensive care unit.\n\n Deaths:\n\n12 new COVID-19 deaths were reported in San Diego County on July 14, and the region’s total is now 448.\nSeven men and five women died between July 5 and July 14 and their ages ranged from mid-50s to mid-90s.\nAll had underlying medical conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200715.17.47.32"}