{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Adopt a New Love and Help the County Clear its Shelters", "description": "Sweet doggies, kitties, rabbits, roosters, tortoises, pigs and guinea pigs are looking to steal a piece of your heart. As part of the nationwide Clear the Shelters campaign, all adoption fees for the County’s shelters are being waived.", "datePublished": "2024-08-02T09:57:22-07:00", "url": "https://www.countynewscenter.com/adopt-a-new-love-and-help-the-county-clear-its-shelters/", "keywords": ["animals", "adopt pets", "animal services", "clear the shelters", "das", "pet adoption waiver"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-08-02T09:57:22-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSweet doggies, kitties, rabbits, roosters, tortoises, pigs and guinea pigs are looking to steal a piece of your heart. As part of the nationwide Clear the Shelters campaign, all adoption fees for the County’s shelters are being waived.\nAdditionally, San Diego County Animal Services is waiving adoption fees from Aug. 1-10.\nThis year, the Clear the Shelters campaign is celebrating a decade of helping pets find homes. In September 2023, it surpassed 1 million adoptions. This year’s monthlong campaign will begin Aug 10 and extend through Sept. 10.\n“We participate in Clear the Shelters because it’s an important opportunity to find our wonderful animals a wonderful forever home,” said Steve Lujan, interim director.  “Helping pair animals and people is one of our highest priorities.”\nFind your new best friend by browsing the County shelters’ online animal listings on the Adoptions page.  Due to the popularity of this adoption special, Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already adopted.\nIf you cannot adopt, you can still help. Learn about our fostering program.\nAdoption fees are always waived for senior adopters, senior pets and pets that have been waiting for their forever home for 30 days or more.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240802.09.57.22"}