{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "72 COVID-19 Deaths Reported Locally; County Could Loosen Restrictions in May", "description": "Seventy-two San Diegans have now died from complications of COVID-19, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-20T19:21:15-07:00", "url": "https://www.countynewscenter.com/72-covid-19-deaths-reported-locally-county-could-loosen-restrictions-in-may/", "keywords": ["health", "72 covid-19 deaths", "coronavirus", "health officer order"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-20T19:21:45-07:00", "articleType": "article", "articleContent": "\nSeventy-two San Diegans have now died from complications of COVID-19, the County Health and Human Services Agency announced today.\nAn additional COVID-19 death –a woman in her mid 80s – was announced today, bringing the region’s total to 72. She had underlying medical conditions.\n“Our condolences go out to the family of the latest COVID-19 victim and to all of the loved ones of all the people who have died from this virus,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We must stay the course and people should remain at home to keep the number of COVID-19 deaths and cases from spiking up.”\nSixty-two of the 72 people who have died from COVID-19 were 60 years and older. Of those who have died, 39 were men and 33 were women. Age, gender and ethnic/race breakdowns for cases and deaths are posted at coronavirus-sd.com.\nCounty COVID-19 Cases Reach 2,325\nNearly 34,000 COVID-19 tests have been administered in San Diego County. Of those, 2,325 have been positive, including 57 new cases announced today.\nOf the local cases, 1,172 (50.4%) were men and 1,149 (49.4%) were women. The gender of four people is unknown. Of the reported cases, 562 (24.2%) have required hospitalization and 189 (8.1%) of the total number of people who tested positive had to be placed in intensive care. Seventy-two (3.1%) have died.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nCounty Could Loosen COVID-19 Restrictions by May\nCounty officials also announced COVID-19 restrictions could be loosened in May if metrics continue to move in the right direction.\nThe County will be considering five federal criteria before lifting some of the restrictions by the local Health Officer Order. The criteria fall within three categories: the number of San Diegans with influenza-like illness and COVID-19 symptoms; the percentage of positive tests compared to number of tests performed; and the capacity of hospitals to deal with all patients and robust testing.\nThe County also is working with representatives of other local jurisdictions to develop phased public access to parks, beaches and other places.\n“County decisions must be based on objective and data-driven information,” Wooten said.\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data is also broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200420.19.21.15"}