{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "46,000-plus Helped by Love Your Heart in February", "description": "The County released its 2023 Love Your Heart Report Tuesday, showing that the annual February public health campaign gave more than 46,000 people free blood pressure checks and saved 646 people from imminent medical emergencies like strokes or heart attacks.", "datePublished": "2023-06-20T15:22:46-07:00", "url": "https://www.countynewscenter.com/46000-plus-helped-by-love-your-heart-in-february/", "keywords": ["health", "blood pressure", "blood pressure screening", "live well", "love your heart"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-06-20T15:44:43-07:00", "articleType": "article", "articleContent": "\nSan Diego County released its 2023 Love Your Heart Report Tuesday, showing that the annual February public health campaign gave more than 46,000 people free blood pressure checks and saved 646 people from imminent medical emergencies like strokes or heart attacks.\nThe County started the Love Your Heart campaign at 15 sites in 2012. The goal was to help people to “know their numbers” with free blood pressure checks, and to promote education about the dangers of high blood pressure, which is often referred to as “the silent killer.”\nIn February, the County and hundreds of partners gave 46,365 people at 368 sites across San Diego County and Mexico free blood pressure screenings, the report stated.\nThose screenings showed 646 people that their blood pressures had reached “crisis levels,” giving them the opportunity to seek immediate medical help.\nThey also alerted another 11,965 people—roughly 26%—they had higher than normal blood pressure levels that put them in stage 1 or stage 2 levels of hypertension. Those screenings gave those people time and information about how to improve their blood pressure by losing weight, eating healthier, reducing stress and exercising more.\nHigh blood pressure is a major risk for strokes and heart disease. The Centers for Disease Control and Prevention (CDC) report that heart disease is still the leading cause of death for men, women and people of most racial and ethnic groups in the United States. The CDC says high blood pressure became known as “the silent killer” because it usually presents no symptoms and the only way to know if you have it is to get your blood pressure checked.\n“Love Your Heart has a simple mission,” County Health and Human Services Agency Director Nick Macchione told County partners at a Love Your Heart recognition event Tuesday. “Prevent heart disease and stroke by educating residents on their blood pressure numbers and empower them to take control of their health.”\nSome of the other data the Love Your Heart Report included:\n\n4,481 San Diegans received free blood pressure screenings at 157 sites across the county. That included screenings at two community fairs, one in Chula Vista and one in Ramona.\n46% of blood pressure screenings showed people they had above-normal readings.\n82 blood pressure readings were submitted online.\n3,200 blood-pressure monitors were given out to participants across the county.\n\nThe full 2023 Love Your Heart Report can be seen online at the County’s Live Well San Diego Love Your Heart web page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230620.15.22.46"}