{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Case Reported at Learn4Life Workforce Innovation High School", "description": "A person at Learn4Life Workforce Innovation High School in Lemon Grove was recently diagnosed with tuberculosis (TB) and may have exposed students and staff, the San Diego County Health and Human Services Agency (HHSA) announced today.", "datePublished": "2022-10-12T14:49:05-07:00", "url": "https://www.countynewscenter.com/tuberculosis-case-reported-at-learn4life-workforce-innovation-high-school/", "keywords": ["health", "learn4life", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-10-12T14:49:05-07:00", "articleType": "article", "articleContent": "\nA person at Learn4Life Workforce Innovation High School in Lemon Grove was recently diagnosed with tuberculosis (TB) and may have exposed students and staff, the San Diego County Health and Human Services Agency (HHSA) announced today.\nHHSA is working in close collaboration with officials at the school in Lemon Grove to notify people who were potentially exposed. The potential exposure period at San Diego Workforce Innovation High School was from Feb. 15, 2022 to Aug. 15, 2022.\nA limited number of people at the school have been identified as having had an increased risk of exposure. These individuals have already been notified about their increased risk and referred to testing.\nAt this time HHSA and San Diego Workforce Innovation High School do not have reason to believe that anyone who has not already been identified as a close contact of the infected individual was at high risk for infection.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. Some who become infected with tuberculosis will become ill at some point in the future, sometimes even years later. Blood tests and skin tests are effective to determine whether someone has been infected.”\nTB is transmitted from person to person through indoor air during prolonged contact with an infectious person. Most people who are exposed to TB do not become infected.\nPeople who are infected, and people at high risk of becoming ill quickly after an infection, such as those with an immunocompromising condition, should discuss treatments with a medical provider, as antibiotics can prevent people with TB infection from becoming sick.\nIndividuals who would like more information on this potential exposure should call:\n\nLearn4Life San Diego Workforce Innovation High School at (619) 363-4043\nCounty TB Control Program at (619) 692-8621\n\nThe number of annual TB cases in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 201 cases reported in 2021. As of the end of September, a total of 126 cases have been reported for this year so far.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221012.14.49.05"}