{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Men Who Have Sex with Men Encouraged to Protect Themselves from Monkeypox", "description": "County health officials are encouraging gay, bisexual and transgender men who have sex with men to abstain or practice safer sex to avoid getting and spreading the monkeypox virus.", "datePublished": "2022-07-12T17:20:43-07:00", "url": "https://www.countynewscenter.com/men-who-have-sex-with-men-encouraged-to-protect-themselves-from-monkeypox/", "keywords": ["health", "monkeypox", "monkeypox cases", "monkeypox vaccine"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-07-13T17:28:16-07:00", "articleType": "article", "articleContent": "\nCounty health officials are encouraging gay, bisexual, transgender and other men who have sex with men to abstain or practice safer sex to avoid getting and spreading the monkeypox virus.\nThere have been three confirmed and three probable monkeypox cases in San Diego County. Nationally, monkeypox cases have been primarily in men who have sex with men who attended circuit or rave parties.\n“We want our community to be mindful of how monkeypox spreads,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “While it’s not inherently a sexually transmitted disease, close or body contact with somebody with monkeypox can pass the virus on to you. Ask potential partners about any rashes, and if you’re sick yourself, please stay home and consider seeking medical attention.”\nWith the national supply of vaccine being extremely limited, the County is focusing on vaccinating people at higher risk of contracting and having severe illness from the virus. This includes confirmed contacts of those infected and at-risk patients of County STD clinics.\nThe County continues working with representatives of the lesbian, gay, bisexual, transgender and queer communities on messaging and in planning for monkeypox vaccination clinics. Two vaccination clinics will take place this week ahead of San Diego Pride. In addition, the County worked with the community on two recently completed vaccination clinics for invasive meningococcal disease.\nAbout 600 JYNNEOS® monkeypox vaccine doses will be administered this week, by appointment only, to San Diego County residents in the following groups:\n\nPeople at higher risk of exposure to monkeypox, especially gay, bisexual, transgender and other men who have sex with men and who have two or more sexual partners\nPeople who participate in circuit/rave parties\n\n“We appreciate people’s willingness to get vaccinated and we hope to expand soon, but given the low supply of vaccine right now, we need to prioritize distribution of the doses we have,” Kaiser said. “If you suspect you may have been exposed to monkeypox, stay home, avoid contact with others and call your medical provider. We can work with them to help protect you too.”\nThe Centers for Disease Control and Prevention states that it’s not clear how the people were exposed to monkeypox, but early data suggest that gay, bisexual men and other men who have sex with men make up a high number of cases.\nHowever, anyone who has been in close contact with someone who has monkeypox is at risk of contracting the virus.\n“It’s important to remember that the risk of human monkeypox for the general public remains very low,” Kaiser said.\nAbout Monkeypox\nMonkeypox is a viral infection that can spread through contact with body fluids, sores on the body of someone who has monkeypox, or from shared items (e.g., clothing and bedding) that have been contaminated with fluids from sores of a person with monkeypox.\nThe disease can also spread between people through saliva or respiratory droplets, typically between people in a close setting. Although monkeypox is not generally considered a sexually transmitted disease, it can be transmitted during sex through skin-to-skin and other intimate contact, regardless of gender or sexual orientation.\nCases of monkeypox have previously been identified in travelers from, or residents of, countries in western and central Africa where monkeypox is endemic. Since May 2022, monkeypox cases have been reported in several non-endemic countries, including the United States.\nMonkeypox Symptoms\nSymptoms of monkeypox are similar to, but milder than, the signs and symptoms of smallpox, a related but extinct virus. They include:\n\nFever\nHeadache\nMuscle aches\nBackache\nSwollen lymph nodes\nChills\nExhaustion\n\nA rash usually develops within 1 to 3 days after the appearance of fever.  This rash that can look like pimples or blisters that appears on the face, inside the mouth, and on other parts of the body, like the hands, feet, chest, genitals, or anus.\nMost people who develop monkeypox experience symptoms within seven to 14 days (and up to 21 days) after exposure.\nMost people who become infected with monkeypox have a mild illness that improves without treatment over two to four weeks. Monkeypox is contagious and can spread to others until scabs have fallen off and a new layer of skin has formed.\nWhat People Should Do\nAnyone who thinks they may have symptoms of monkeypox, including unusual rashes or lesions, should contact a healthcare provider right away. Cover the area of the rash with clothing, wear a mask and avoid skin-to-skin or close contact with others until the symptoms are medically evaluated.\nFor more information on monkeypox, visit the County’s monkeypox website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220712.17.20.43"}