{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s the Ship-Shipping-est Time of the Year; Don’t Pack a Pest!", "description": "The holiday season is back. It’s the time when many of us are personally mailing and shipping packages and gifts to faraway family and friends. Or maybe even traveling to deliver presents and bring back home gifts in return. Just remember—don’t pack a pest!", "datePublished": "2024-11-26T11:09:57-08:00", "url": "https://www.countynewscenter.com/its-the-ship-shipping-est-time-of-the-year-dont-pack-a-pest/", "keywords": ["environment", "ag weights and measures", "lueg"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-11-26T11:09:57-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIt’s the ship-shipping-est time of the year! And you want to make sure you’re not sending someone you love something nobody wants—a harmful pest.\nThe holiday season is back. It’s the time when many of us are personally mailing and shipping packages and gifts to faraway family and friends. Or maybe even traveling to deliver presents and bring back home gifts in return.\nJust remember—don’t pack a pest!\nIt can happen. The gifts you send or receive could be carrying hitchhiking pests or plant diseases that could potentially damage the County’s $1.66 billion agricultural industry and our local environment.\nHere’s how. That homemade wreath you brought home from your favorite aunt could be carrying spongy moth eggs. Or that citrus you picked from your backyard to send to a friend could be carrying “citrus greening”—huanglongbing—a destructive citrus disease. Or the beautiful fruit basket you and the kids made from scratch to send to a friend could be hiding mealybugs.\nEvery year San Diego County’s Department of Agriculture, Weights and Measures inspectors—human and detector dogs—work hard to stop the spread of invasive pests. From exotic fruit flies to the emerald ash borer, glassy-winged sharpshooter and South American palm weevil.\nAnd you can help. Just follow these simple guidelines:\nDon’t Pack a Pest\nIf you’re traveling—whether it’s out of state or out of the country—leave what you find behind. Don’t bring home a keepsake clipping from your grandmother’s holiday wreath, or those bulbs you found in Florida. And don’t bring home or avocado leaves from Mexico, or any citrus branches, leaves or stems from anywhere.\nDon’t transport any fresh, raw, uncooked and untreated foodstuffs. That goes for seeds, beans, nuts, rice, dried fruit, decorative greenery, untreated wood items, animal products or soil from almost any foreign country.\nIf you are traveling and think you may have accidentally packed some plant or animal item away? Declare them when an agricultural inspector asks you if you have anything in your luggage.\nFor more information about harmful insects, plant diseases, Agriculture, Weights and Measures and everybody’s role in protecting our local environment and agriculture, visit the department’s Insect and Plant Disease Information webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241126.11.09.57"}