{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Testing Still Limited; Not Everyone Needs to Be Tested", "description": "As the number of cases continues to increase and community transmission is becoming more widespread, more San Diegans are wondering why the local medical community is not testing everyone who might have COVID-19.", "datePublished": "2020-03-25T19:25:47-07:00", "url": "https://www.countynewscenter.com/covid-19-testing-still-limited-not-everyone-needs-to-be-tested/", "keywords": ["health", "coronavirus", "covid testing", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-19T08:19:09-07:00", "articleType": "article", "articleContent": "\nAs the number of cases continues to increase and community transmission is becoming more widespread, more San Diegans are wondering why the local medical community is not testing everyone who might have COVID-19.\nThe answer: Testing is still limited and primarily for people at higher risk of complications from COVID-19, and not everyone needs to get tested for the novel coronavirus.\n“Testing for COVID-19 is still limited so we are prioritizing people who need it the most,” said Dr. Wilma Wooten, M.D., M.P.H., County public health officer. “About 80% of people who get COVID-19 have mild to moderate symptoms and don’t need to be tested.\nWho Should Be Tested?\nAt the moment, COVID-19 testing is being considered for people who have a fever and a cough and are part of the following:\n\nHave a lower respiratory illness and no other potential cause, especially if they are hospitalized\nPeople living in a senior living facility, including nursing facilities or assisted living facilities\nPeople who are elderly\nPeople in congregate settings, such as homeless shelters\nHealth care workers, first responders and other emergency workers\n\nClose contacts of confirmed COVID-19 cases who develop symptoms are likely to be positive for the disease as well. Testing is not required if the patient is not severely ill, not in a priority population, or not at high risk for complications.\n“Testing people who have mild or moderate symptoms, but are not at higher risk of severe complications depletes testing resources and scarce personal protective equipment and exposes other patients and health care personnel to COVID-19,” Wooten said, adding that this recommendation might change when testing is more widely available.\nSo, what should you do if you think you have COVID-19 symptoms?\nStay at home.\nIf you’ve had symptoms, the recommendation is for you to stay home under the following conditions:\n\nAt least three days (72 hours) have passed since recovery, defined as resolution of fever without the use of fever-reducing medications and improvement in respiratory symptoms such as cough or shortness of breath; and\nAt least seven days have passed since symptoms first appeared.\n\n“We all should we doing everything we can to flatten the curve since this is a life-saving action,” Wooten said.\nIf you have questions about COVID-19 testing, please talk to your healthcare provider or call 2-1-1 to talk to a public health nurse.\nCases Rise to 297\nThe total number of confirmed COVID-19 cases increased to 297 Wednesday, 55 more than the previous day. No additional deaths were reported.\nOf the 297 cases, 277 were San Diego County residents and 20 were non-residents. Starting Thursday, the non-residents will be dropped from the table to conform with the practices of other health departments across the state. The number of cases connected to the federal quarantine is no longer included in the County’s total.\nThe County’s daily coronavirus in San Diego webpage now also contains a graph showing new positive cases and total cases reported by date.\nFor more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200325.19.25.47"}