{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Ahead of Schedule to Meet State Housing Goals", "description": "The County recently reported its 2024 housing totals through the General Plan & Housing Element Annual Progress Report.", "datePublished": "2025-04-23T15:44:51-07:00", "url": "https://www.countynewscenter.com/county-ahead-of-schedule-to-meet-state-housing-goals/", "keywords": ["housing", "accessory dwelling unit", "general plan & housing element annual progress report.", "housing"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2025-04-23T15:50:02-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County recently reported its 2024 housing totals through the General Plan & Housing Element Annual Progress Report.\nThis information is required annually by the state of California to track housing production across various income levels, which shows how local governments are meeting the state-defined housing needs for their jurisdiction. The County is well on track to meet its goals.\nThe report, shared with the Board of Supervisors on April 23, is a summary of housing and land use actions under the General Plan, from Jan. 1 through Dec. 31, 2024.\nThe numbers come from housing applications that require environmental review or approval (discretionary projects), building permits issued and move-in ready homes in the unincorporated area.\nIt does not reflect the number of housing units currently in the approval process or “pipeline,” which could take more than the 12 reported months depending on the complexity of the development, as well as outside influences such as builder financing, labor and supply shortages, mortgage interest rates, new laws and litigation. As of April 2024, there are more than 4,500 units in this process.\nThe report was presented as an informational item and does not require action by the Board. A more in-depth look at County policies related to housing will be presented at a housing workshop this fall.\nKey 2024 reported findings include: \n\nThe County is 84% of the way to meeting its goal of 6,700 total units over an eight-year period (2021-2029).\nWhile meeting or exceeding other income category goals, the County has more work to do toward meeting its housing goals for its very low-income population.\nBuilding trends and numbers are largely impacted by economic factors and have been declining since the post-2008 recovery.\nThere was an 11% drop in permitted homes and a 24% decrease in completed homes compared to 2023.\nAccessory Dwelling Unit (ADU) projects have increased as an overall portion of permitted housing units (489 units – 45%).\n\nMore information about the data presented in the report can be found in this helpful Q&A.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250423.15.44.51"}