{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Support Provided to Border 32 Fire Survivors", "description": "County Emergency Services opened a Local Assistance Center Monday to support those affected by the Border 32 Fire.  The fire damaged 4,400 homes and destroyed more than a dozen homes and buildings in the area between Dulzura and Potrero.", "datePublished": "2022-09-13T16:55:27-07:00", "url": "https://www.countynewscenter.com/?p=209469", "keywords": ["government", "american red cross", "border 32 fire", "local assistance center", "office of emergency services", "sdg&e", "supervisor joel anderson"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-09-13T17:16:09-07:00", "articleType": "article", "articleContent": "\nCounty Emergency Services opened a Local Assistance Center Monday to support those affected by the Border 32 Fire.  The fire burned 4,400 acres and destroyed more than a dozen homes and buildings in the area between Dulzura and Potrero.\nMore than 50 families took advantage of the services offered by the County, State, American Red Cross, and other non-governmental agencies. Residents who lost everything were able to get help with services such as debris removal and building permits to medical care services and help with pets and animals.\nThe American Red Cross provided survivor case management and assigned each a person to help walk them through the process of rebuilding.\n“An event like this helps start the healing process after a disaster like a wildfire,” said County Emergency Services Director Jeff Toney.  “It is a very stressful time for survivors, and we want to offer support to everyone who needs it. They could live on a property prone to debris and mudflow, so we can offer erosion control assistance.  Others may need mental health resources.”\nDistrict 2 Supervisor Joel Anderson attended the Local Assistance Center to thank the staff and volunteers in person. The Supervisor was also briefed on the fire.\n“I want to thank the County Office of Emergency Services for working with County staff and CAL FIRE to bring so many recovery resources for victims of the Border 32 fire who are going through such a difficult time after losing their homes,” said Supervisor Joel Anderson, who represents Dulzura and Potrero in District 2. “I would also like to thank all the state agencies and non-governmental organizations for volunteering their time to help this community recover from the Border 32 Fire. To anyone impacted by the fire, please do not hesitate to reach out to my office and we will do whatever we can to assist you.”\nThe County Department of Animal Services was also at the assistance center offering help and free food for pets affected by the fire.  Animal Services officers helped evacuate and care for dozens of animals during the wildfire.  The County shelter staff cared for common pets like dogs and cats, but also parrots, tortoises, horses, goats and pigs throughout the disaster.\nTo learn more about the recovery efforts, visit SDCountyRecovery.com.\n    \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220913.16.55.27"}