{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Animal Services Coordinator Recognized for Helping Students with Disabilities", "description": "County Animal Services’ Coordinator of Volunteer and Public Service Rachael Borrelli was recognized for her work with TRACE Alternative School.  Borelli was given the school's Jan Merritt Leadership Award which goes to individuals who use creativity and innovation to support students with disabil...", "datePublished": "2022-06-09T16:41:12-07:00", "url": "https://www.countynewscenter.com/?p=208724", "keywords": ["government", "award", "department of animal services", "rachael borrelli", "students with disabilities", "trace alternative school", "volunteers"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-06-09T16:42:52-07:00", "articleType": "article", "articleContent": "\nA local school honored a San Diego County Department of Animal Services employee for her work with its students.\nTRACE Alternative School presented Rachael Borrelli, a coordinator of volunteer and public service, with its Jan Merritt Leadership Award, which goes to individuals who use creativity and innovation to support students with disabilities.\nBorrelli says working with students is the favorite part of her job at the Department of Animal Services.\nShe patiently taught students to interact with dogs and cats, make and deliver treats, wash the dishes and fold the laundry.\nThe award nomination praised Borrelli for greeting students with smiles and enthusiasm, and helping the students forget their insecurity and anxiousness. She engaged the students directly and helped build their communication and team building skills.\nBorrelli also coordinates with five different special needs organizations and about 15 students.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220609.16.41.12"}