{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Sample Ballot Pamphlets Go Out for Recall Election", "description": "Sample Ballot and Voter Information Pamphlets are on the way to San Diego County’s 1.96 million registered voters for the Sept. 14 California Gubernatorial Recall Election.", "datePublished": "2021-08-11T10:41:18-07:00", "url": "https://www.countynewscenter.com/sample-ballot-pamphlets-go-out-for-recall-election/", "keywords": ["elections", "2021 recall election", "registrar of voters", "sample ballot and voter information pamphlets", "sample ballot mailing"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-08-12T09:39:12-07:00", "articleType": "article", "articleContent": "\nSample Ballot and Voter Information Pamphlets are on the way to San Diego County’s 1.96 million registered voters for the Sept. 14 California Gubernatorial Recall Election. The Registrar of Voters office says all voters should receive their pamphlets by Aug. 21.\nThe voter information pamphlet contains information about the recall election and how to cast your ballot. All voters will receive a mail ballot, but voters choosing to vote in person can find their closest voting location listed on the back of the voter information pamphlet. Voters can also see their pamphlet online.\nIf you signed up to get your voter information pamphlet electronically, you should have already received an email giving you the same information and a link to your pamphlet.\nVoters who want to be among the first to see their pamphlet every election can sign up to receive all future pamphlets electronically. Voters who take this option will no longer receive a paper copy of the pamphlet in the mail but will get an email notification when the pamphlet becomes available online.\nTo learn more about voting in the gubernatorial recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210811.10.41.18"}