{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Medical Therapy Units Have A Field Day", "description": "Physical and occupational therapists at the County’s Medical Therapy Units (MTU) hosted a full day camp tailor-made for MTU clients with activities like basketball, volleyball, rugby, water games, and face-painting. The smiles and laughter underscored the value of their efforts.", "datePublished": "2024-08-08T12:30:20-07:00", "url": "https://www.countynewscenter.com/medical-therapy-units-have-a-field-day/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-08-08T12:30:20-07:00", "articleType": "video.other", "articleContent": "\nReading Time:  < 1 minuteSummer vacation is the highlight of the school year for many students and camp days with water play and outdoor sports are the best days ever. For children with physical disabilities or chronic health challenges, summer camp isn’t always an option.\nSo, the physical and occupational therapists at the County’s Medical Therapy Units (MTU) hosted a full day camp tailor-made for MTU clients with activities like basketball, volleyball, rugby, water games, and face-painting.\nMedical Therapy Units (MTU) are part of the statewide California Children’s Services (CCS) and provide physical and occupational therapy to children under age 21 with medical conditions like Diabetes, Cystic Fibrosis, Spina Bifida, Hemophilia, Sickle Cell Disease or Cerebral Palsy.\nSan Diego County has six Medical Therapy Units (MTU) located in Chula Vista, El Cajon, Escondido, San Diego North in Clairemont, San Diego South in Grant Hill, Vista and a satellite office in Poway.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240808.12.30.20"}