{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Empowers Teens to Become Public Health Advocates", "description": "County Public Health Services is teaming up with the San Diego County Office of Education to host the second annual Public Health Advocate Camp for high school students.", "datePublished": "2024-07-15T08:03:01-07:00", "url": "https://www.countynewscenter.com/county-empowers-teens-to-become-public-health-advocates/", "keywords": ["health", "advocate camp", "dr. kadakia", "public health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-07-15T08:03:01-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty Public Health Services is teaming up with the San Diego County Office of Education to host the second annual Public Health Advocate Camp for high school students.\nThis year, 38 students have registered for the camp, marking a 10-student increase from last year’s attendance.\n“The goal of the camp is to inspire high school students to become advocates for public health in their communities, and learn about careers in Public Health,” said Dr. Ankita Kadakia, County interim public health officer.\nTaking place from July 15 to 19 at the Linda Vista Innovation Center, the week-long camp is designed to educate teens about health topics relevant to their age group.\nDuring the camp, students learn about critical health issues and will actively engage in creating their own public health campaigns to mirror the daily work of public health professionals.\nLast year, a high school senior said about the program, “I’ve been thinking of going into the medical field, but also Public Health is something that I was looking into. It looks very interesting.”\nShe appreciated how a media campaign can keep the community safe.\n“It was very enlightening to know that you can do something, even if it is very little. If you can just spread the information, a lot can happen,” she said.\nTo participate, students go through a now-closed application process. The no-cost program is made possible through donations from County employees and the Office of Education. Applications for next year’s camp will open next April and are shared through local schools.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240715.08.03.01"}