{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Annual Celebration Brings Together Recovery Support and Resources", "description": "The County is bringing together its partner and members of the community to raise awareness about local treatment, support and recovery resources in honor of National Recovery Month.  ", "datePublished": "2023-08-23T14:27:05-07:00", "url": "https://www.countynewscenter.com/annual-celebration-brings-together-recovery-support-and-resources/", "keywords": ["health", "behavioral health", "recovery", "treatment resources"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-08-23T14:58:33-07:00", "articleType": "article", "articleContent": "\nThe County is bringing together its partners and members of the community to raise awareness about local treatment, support and recovery resources in honor of National Recovery Month.  \nThe public is invited to attend the free community event at Waterfront Park (1600 Pacific Highway, San Diego) on Saturday, August 26 from 10 a.m. to 1 p.m.  \nHosted by the County’s Behavioral Health Services, this year’s theme is Celebrate the Tides of Hope. The gathering welcomes people in recovery and those thinking about recovery and their families and friends to come together. \nNational Recovery Month is celebrated every September to bring awareness for mental health and addiction recovery and to support those still struggling and recovering.  \n“The journey to recovery for an individual takes a community and support from family and friends,” said Dr. Luke Bergmann, County Behavioral Health Director. “This celebration is an opportunity for people in all stages of their recovery journey and their loved ones to take a step toward healing together.” \nA resource fair will feature interactive activities for families, giveaways (while supplies last), free naloxone kits and information about how to use it. People can also bring old or expired prescription drugs for safe disposal. Other local resource providers will also be staffing informational booths.  \nMore information about the event is available online.  \nThe County’s Behavioral Health Services provides mental health and substance use disorder services to more than 105,000 San Diego County residents.  \nIf you or someone you care about is in crisis or would like behavioral health resources or support, including accessing Mobile Crisis Response Teams (MCRT), please call the Access and Crisis Line at (888) 724-7240 (24 hours a day, 7 days a week). Calls are answered by experienced counselors, with assistance available in over 200 languages. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230823.14.27.05"}