{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voter Information Pamphlets Go Out to Registered Voters for Presidential General Election", "description": "Voter information pamphlets are on their way to the County’s 1.9 million registered voters for the November Presidential General Election.", "datePublished": "2024-09-27T11:29:57-07:00", "url": "https://www.countynewscenter.com/voter-information-pamphlets-go-out-to-registered-voters-for-presidential-general-election/", "keywords": ["elections", "2024 presidential primary election", "county registrar of voters", "fgg", "nov. 5 presidential general election", "registrar of voters", "voter information packets"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-09-30T09:57:09-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteVoter information pamphlets are on their way to the County’s 1.9 million registered voters for the November Presidential General Election.\nRemember, they look a little different now. The Registrar’s voter information pamphlets changed in March. They provide the same important information but are larger in size, like the Secretary of State’s Voter Information Guide.\nThe Registrar’s pamphlets contain information on voting options, election deadlines, candidate statements, ballot measures and more. It also includes a sample of what your official ballot will look like.\nVoters may also see their pamphlets online with the View A Voter Information Pamphlet (Sample Ballot) tool at sdvote.com.\nIf you signed up to get your voter information pamphlet electronically, you should have received an email giving you the same information and a link to your pamphlet.\nVoters who want to be among the first to see their pamphlet every election can sign up to receive all future pamphlets electronically. Voters who take this option will no longer receive a paper copy in the mail but will get an email when the pamphlet becomes available online.\nIf you plan on voting in person, be prepared. Due to the large number of contests on the ballot, it will take longer to complete the ballot. Read your pamphlet and mark your selections on the sample ballot in advance. When you go inside the voting booth at the vote center, you can refer to your choices on the sample ballot to quickly mark your selections on your official ballot.\nMeantime, the Registrar is still looking for poll workers, especially bilingual poll workers.\nLearn more about voting in the November Presidential General Election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240927.11.29.57"}