{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Chairwoman Delivers State of the County Address", "description": "County Board of Supervisors Chairwoman Nora Vargas gave her first State of the County address during an evening presentation Wednesday, Feb. 1.", "datePublished": "2023-02-02T11:48:03-08:00", "url": "https://www.countynewscenter.com/new-chairwoman-delivers-state-of-the-county-address/", "keywords": ["government", "2023 state of the county address", "chairwoman nora vargas", "state of the county"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-02-02T12:10:07-08:00", "articleType": "article", "articleContent": "\nCounty Board of Supervisors Chairwoman Nora Vargas gave her first State of the County address during an evening presentation Wednesday, Feb. 1.\nThe chairwoman’s niece and goddaughter Fatima acted as emcee and told the audience that her aunt represents several firsts. For the first time in nearly 200 years, the County of San Diego has the first woman of color, first immigrant, first fronteriza and the first Latina serving as Chair of the Board of Supervisors. \nDuring her address, Chairwoman Vargas talked about County’s accomplishments but said there is still a lot of work to do build healthier and stronger communities, create paths to economic prosperity and enhance community infrastructure.\nThroughout her speech, the chairwoman stressed the importance of working together to overcome the region’s challenges.\nShe said we need to start with the basics, food and shelter. And talked about what the County is doing to help those who are homeless or at risk. The chairwoman said she is committed to providing healthy food in food deserts and increasing the number of community gardens at County facilities.\nChairwoman Vargas also outlined a wide variety of proposals to provide childcare for all, stable housing for working families, increased mental health services, and additional funding for local businesses.\nShe mentioned the importance of green spaces and called for doubling the number of planned tree plantings from 5,000 to 10,000. The chair says she will fight for green jobs and environmental justice.\nChairwoman Vargas said she looks forward to working with her colleagues on the Board, elected officials and stakeholders to move her proposals forward.\nThe live address was available in American Sign Language and on social media channels and television. The broadcast also offered live interpretation in Arabic, Chinese, Filipino, Korean, Persian, Somali, Spanish and Vietnamese via Zoom.\nThe invitation-only event took place outside the San Diego County Administration Center on the Waterfront Park’s west side.\nFor details and additional proposals, watch the entire address above.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230202.11.48.03"}