{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Cool Zones Open as Temperatures Heat Up", "description": "The County of San Diego opened its annual Cool Zones program Saturday, just as the region is expecting to face its first potential summer-like temperatures this week.", "datePublished": "2024-06-03T13:46:57-07:00", "url": "https://www.countynewscenter.com/county-cool-zones-open-as-temperatures-heat-up/", "keywords": ["library", "aging and independence services", "cool zones", "equity", "extreme heat", "hhsa", "lueg", "public safety"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-06-03T17:27:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County of San Diego opened its annual Cool Zones program Saturday, just as the region is expecting to face its first potential summer-like temperatures this week.\nThe Cool Zones program was created two decades ago. It was designed to give older adults, people with disabilities and people with health concerns free, safe air-conditioned shelters to visit to escape extreme heat.\nThe program will run from Saturday, June 1 through Oct. 31. Cool Zone sites include the County’s 33 branch libraries, community centers and other locations across the county.\nA complete list and map of Cool Zone sites, their hours and locations are located online. The site includes a map feature where people can type in their address to find locations near them. People can also call 2-1-1 to find a location, or, if they cannot get to a Cool Zone, ask for help with free transportation. People can also call 2-1-1 to find a location, and—if they cannot get to a Cool Zone site—ask for help with free transportation.\nExtreme heat can be especially dangerous for the elderly and children. Everyone is recommended to shelter in cool places when the temperatures get too hot. Working or exercising outside on a hot day or staying inside a hot space for too long can cause heat-related illnesses. Those can range from cramps to exhaustion and heatstroke, a condition when the body can no longer control its temperature.\nSigns of heatstroke or exhaustion include having an extremely high body temperature, 103 degrees or higher, dizziness, nausea, confusion and headache. Anyone suffering these symptoms should call 9-1-1 and be cooled off immediately.\nIn addition to the Cool Zone sites, the County and San Diego Gas & Electric work together to provide free electric fans to eligible older or disabled people living on limited incomes countywide.\nTo be eligible, county residents must be 60 years of age or older, or disabled, living on limited income, must not have access to air-conditioned space at their home or apartment and unable to travel to a Cool Zone site.\nTo learn more about the Cool Zone fan program or to request a fan, call 2-1-1 or visit www.coolzones.org to complete a fan eligibility survey.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240603.13.46.57"}