{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Be a Hero for a Husky", "description": "Overcrowded shelters are a problem across the nation and in our local communities. Hundreds of shelter dogs need to be adopted or to be fostered temporarily. County Animal Services is asking caring individuals in the community: Can you be a Hero for a Husky?", "datePublished": "2024-01-19T14:24:20-08:00", "url": "https://www.countynewscenter.com/be-a-hero-for-a-husky/", "keywords": ["animals", "adopt pets", "das", "huskies", "husky"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-01-19T14:24:20-08:00", "articleType": "article", "articleContent": "\nReading Time:  4 minutesOvercrowded shelters are a problem across the nation and in our local communities. Hundreds of shelter dogs need to be adopted or to be fostered temporarily. County Animal Services is asking caring individuals in the community: Can you be a Hero for a Husky?\nA husky or husky mix dog may be the right fit for you and Jan. 19- 28 is Be a Hero for a Husky week at San Diego County Animal Services shelters in Bonita and Carlsbad. A large inventory of available huskies are available and adoption fees are being waived for all Siberian Huskies and Husky-mixes.\nHuskies make up nearly 20 percent of the dogs at the Bonita and Carlsbad shelters. Currently, there are 40 Huskies seeking homes, some of these good boys and girls have been patiently waiting more than a year to be chosen by their forever family.\nTake a look at these sweet faces:\nRoxy is 5 years old and at the Bonita shelter. She does well with people including children, cats and other dogs. She has a calm demeanor and is described as sweet and mellow.\n \n \n\nSparrow is 2 years old and is also at the Bonita. He is housetrained, walks well on leash, polite, and is super talkative.\n \n \nPenny is 5 years old and is at the Bonita shelter. She enjoys walks, spending time with people and is content relaxing at home.\n \n \nIgloo is 2 years old and is at the Carlsbad shelter. He’s easy to handle and walks well on leash without pulling He is affectionate, relaxed, and good with other dogs.\n \n \nMoonshine is 2 years old and at the Carlsbad shelter. He walks well on leash, is friendly with other dogs and likes to receive affection. He is housebroken and likes swimming pools.\n \n \nMiles is 5 years old and at the Carlsbad shelter. He walks well on a leash and enjoys walks with his person.\n \n \nWhooper is 3 years old and a mix with a German Shepherd at the Carlsbad shelter. This beauty loves to play and cool off in a baby pool.\n \n \nOrca is 3 years old and also at the Carlsbad shelter. She is sweet and silly and a perfect mellow office dog.\n \n \nJuneau is 2 years old and at the Bonita shelter. She is sweet and loyal and would make a great best friend.\n \n \nThese are just nine of the amazing Huskies available. Consider a Husky if you are you ready for more adventure in your life this year and need a fun, active partner.\nYou may even want to consider fostering a Husky to see if it is a good fit, or just to give him or her a break from the shelter environment. Dogs benefit tremendously from being in a home environment and learn how to be part of a family. All basic care supplies such as food, leash, and bedding, are included as part of the program.\nBefore adopting any animal, it’s important to do your research. It’s easy to just fall in love with a Husky’s looks, but it is a good idea to learn about general tendencies of breeds to help make a good decision. Afterall, a pet becomes part of your “pack.”\nGenerally, Huskies have a friendly, intelligent, alert, outgoing and gentle temperament. All animals are different and in some cases Animal Services staff may have more insight on an animal you are interested in and would be happy to discuss.\nIf you’re interested, in being a hero to any of these huskies or other dogs, walk-in hours are from 1 to 4 p.m. Tuesday through Friday and 10 a.m. to 4 p.m. Saturday and Sunday at the South Shelter, 5821 Sweetwater Road in Bonita and the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nCheck out some of the available pets on the Animal Services website. \nAll adoption fees include spaying or neutering, a microchip, updated vaccinations and a one-year dog license for those in the service area. Adoption fees are waived for the Huskies and Husky mixes, and for any pet that has been in shelter care for more than 30 days.\nTo adopt, you just need a photo identification card. Adoptions are on a first-come, first-served basis.\nFor more information on fostering animals, making pet food donations, or volunteering for the shelter, call (619) 767-2675 or visit the Animal Services main website. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240119.14.24.20"}