{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "6 in 10 Adult San Diegans Face Severe Impacts If They Contract COVID-19", "description": "Six out of every 10 adult San Diegans are at extra risk for severe illness should they contract the novel coronavirus.", "datePublished": "2020-07-29T16:55:19-07:00", "url": "https://www.countynewscenter.com/6-in-10-adult-san-diegans-face-severe-impacts-if-they-contract-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "six of ten san diegans"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-30T08:42:24-07:00", "articleType": "article", "articleContent": "\nSix out of every 10 adult San Diegans are at extra risk for severe illness should they contract the novel coronavirus.\nThat’s because about 57% of San Diego County adults have pre-existing medical conditions such as high blood pressure, heart and lung disease, cancer, diabetes and obesity.\nSan Diegans with underlying chronic conditions are at increased risks of serious outcomes if they contract COVID-19, requiring to be hospitalized, placed in intensive care or worse, dying.\nTo date, 95% of San Diegans who died from COVID-19 had an underlying medical conditions.\n“COVID-19 deaths can be prevented,” said Wilma Wooten, M.D., M.P.H., County public health officer. “It’s important to remember that our actions matter. We must all do all we can to prevent from contracting and spreading the virus.”\nIt’s true that younger San Diegans with COVID-19 typically don’t need to be hospitalized, that is not the case for older adults. Of the 2,459 people who were hospitalized due to COVID-19, about 52% were 60 years of age or older.\n“Some San Diegans think they’re not going to get sick and therefore are not following the public health guidance,” said Wooten. “What they don’t realize is that they could get infected and pass the virus to others who are vulnerable.”\nWearing a mask protects you and others from COVID-19.\nCommunity Setting Outbreaks:\n\nSix new outbreaks were identified on July 28: three in restaurant/bar settings, two in businesses and one in a healthcare setting.\nIn the past seven days, 24 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n6,899 tests were reported to the County on July 28 and 4% were laboratory-confirmed positive new cases.\nThe 14-day rolling average percentage of positive cases is 5.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,456.\n\nCases:\n\n282 new cases were reported in San Diego County for a total of 28,287.\n2,459 or 8.7% of cases have required hospitalization.\n632 or 2.2% of all cases and 25.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFive new COVID-19 deaths were reported in San Diego County on July 28 and the region’s total is now 552.\nThree men and two women died between July 23 and July 27 and their ages ranged from 33 to 96 years of age.\nAll had underlying medical conditions.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200729.16.55.19"}