{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expanding Mental Health Care Through Recuperative Care Beds", "description": "The San Diego County Board of Supervisors has accepted a $12.4 million grant from the state and approved using $8 million in other funds to expand access to mental health services.", "datePublished": "2024-10-08T16:10:04-07:00", "url": "https://www.countynewscenter.com/county-expanding-mental-health-care-through-recuperative-care-beds/", "keywords": ["housing", "behavioral health", "bhs", "district 1", "mental health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-10-10T15:12:22-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe San Diego County Board of Supervisors has accepted a $12.4 million grant from the state and approved using $8 million in other funds to expand access to mental health services.\nThe grant from the state’s Behavioral Health Bridge Housing Program will fund 16 recuperative beds along with renovations to a building that will become a new County Substance Use Residential and Treatment Services facility in National City. It will also fund another 33 new recuperative care beds at other treatment centers.\nThe 16 recuperative beds at the substance use residential and treatment program will provide short-term housing for adults in substance use treatment to recover after being discharged from an acute care setting. Acute care facilities are higher security spaces providing round the clock care with constant supervision while the short terms beds help patients transition back into the community.\n“Recuperative care is a key service within our behavioral health continuum,” said Dr. Luke Bergmann, director of County Behavioral Health Services. “Patients with behavioral health conditions are five times more likely to have physical health challenges and are at higher risk of homelessness than those without. Recuperative care enables patients with behavioral health and other challenges to be safely discharged from hospital settings and put on a path towards recovery.”\nThe increase in recuperative care beds is also expected to serve people experiencing homelessness who are transitioning out of crisis and into more stable, long-term housing solutions.\nThe 33 new recuperative care beds create more access to mental health services through a community-based care model. They are part of the County’s expansion of short-term community-based care services that includes six Crisis Stabilization Units with one more under construction.\nFor more information about behavioral health services, go to County Behavioral Health department’s webpage. For more about the County’s Crisis Stabilization Units, visit the CSU webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241008.16.10.04"}