{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Modifies Vaccine and Testing Efforts to Vulnerable Populations", "description": "The County is modifying its COVID-19 testing and vaccination efforts to better reach San Diegans who struggle with accessing these services.", "datePublished": "2022-04-06T18:12:48-07:00", "url": "https://www.countynewscenter.com/?p=208151", "keywords": ["health", "coronavirus", "covid-19", "covid-19 vaccine", "testing"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-04-06T18:15:00-07:00", "articleType": "article", "articleContent": "\nThe County is modifying its COVID-19 testing and vaccination efforts to better reach San Diegans who struggle with accessing these services.\nThe focus will include providing its resources at public health centers and through mobile services, including two Live Well on Wheels buses and a bookmobile, which has been repurposed as a mobile vaccine clinic.\nThis shift comes as the majority of COVID vaccinations and tests in the region are now administered through pharmacies, medical offices and hospitals. About 10% of COVID-19 vaccines and boosters are being administered through the County.\n“We have seen low demand at several of our existing testing and vaccination sites and are therefore shifting our efforts to more of the underserved safety net approach,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The County remains committed to providing no-cost vaccinations and testing across the region but recognize that most people now get these services elsewhere.”\nChanges in the testing process have also come to the seven state-funded COVID-19 testing sites the County organizes. Individuals will now initially be administered an antigen test and wait about 15 minutes for the results to come back. If the results of the antigen test are positive, the individual is given a confirmatory PCR test, with results expected back within one day. In the meantime, they are advised to follow isolation protocol.\nFollowing are the seven locations across the County that are offering the no-cost antigen/PCR testing process. More information about appointments and walk-ups is available at coronavirus-sd.com:\n\nNorth Coastal Live Well Center, 3708 Ocean Ranch Blvd., Oceanside, 92056\nKimball Senior Center, 1221 D Ave., National City, 91950\nFormer Boys & Girls Club, 1301 Oleander Ave., Chula Vista, 91911\nAssessor Recorder County Clerk Building, 200 S. Magnolia Ave., El Cajon, 92020\nNorth Inland Live Well Center, 649 W. Mission Ave., Escondido, 92025\nImperial Beach Sports Park Recreation Center, 425 Imperial Beach Blvd., Imperial Beach, 91932\nFormer USD Electronics Recycling Center, 5330 Linda Vista Rd., San Diego, 92110\n\nVaccination Progress:\n\nReceived at least one shot: Close to 2.96 million or 94.0% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Nearly 2.60 million or 82.6%.\nBoosters administered: 1,221,004 or 55.7% of 2,192,606 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n27 new deaths were reported since the last report on March 30, 2022. The region’s total is 5,205.\n15 men and 12 women died between Jan. 16, 2022 and March 28, 2022.\n13 were age 80 or older, nine were in their 70s, two were in their 60s, two were in their 50s and one was in their 40s.\n21 of the people who died were fully vaccinated and six were not fully vaccinated.\nAll had underlying medical conditions.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n255 COVID-19 cases were reported to the County on April 5, 2022. The region’s total is now 752,078.\n1,733 cases were reported in the past week (March 30 through April 5) compared to 2,103 infections identified the previous week (March 23 through March 29).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 5.8 for people fully vaccinated and boosted, 4.2 for fully vaccinated people and 11.7 for not fully vaccinated San Diegans.\n5,386 tests were reported to the County on April 3, 2022, and the percentage of new positive cases was 2.9%.\nThe 14-day rolling percentage of positive cases among tests reported through April 3, 2022 is 2.7%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published every Wednesday, with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220406.18.12.48"}