{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Paul Parker Returns to Lead County Citizens’ Law Enforcement Review Board", "description": "A familiar face has returned to lead the County of San Diego’s Citizens’ Law Enforcement Review Board, CLERB, as the agency moves forward with expanded authority and increased law-enforcement oversight capabilities.", "datePublished": "2020-11-12T13:41:21-08:00", "url": "https://www.countynewscenter.com/paul-parker-returns-to-lead-county-citizens-law-enforcement-review-board/", "keywords": ["government", "citizens law enforcement review board", "clerb"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-11-12T13:42:09-08:00", "articleType": "article", "articleContent": "\nA familiar face has returned to lead the County of San Diego’s Citizens’ Law Enforcement Review Board, CLERB, as the agency moves forward with expanded authority and increased law-enforcement oversight capabilities.\nPaul Parker returned late last week to take over as CLERB’s executive officer, chosen by CLERB’s board to succeed Julio Estrada, who announced last month he was retiring from the County after serving 28 years, the last year and 10 months as CLERB’s leader.\nParker was CLERB’s executive officer in 2017-18 before leaving to become chief deputy director of the Los Angeles County’s medical examiner/coroner’s office. But Parker said this week that he was excited to return, not just to come back to San Diego, but to be involved in a key moment of nationwide change to “improve law enforcement and community relations.”\n“The challenges that CLERB faces now with expanded oversight approved by the Board (in June),” Parker said, “the increase in staff, the movement of CLERB to the County’s Finance and General Government Group, and with the national trend of improving law enforcement and community relations, all that together is why I jump at the challenge.”\nCLERB Board Chairwoman Susan Youngflesh said the agency was eager to have Parker back, someone with extensive experience in the law enforcement and the investigatory field, who has already done the job and proven to have familiar relationships with both the Sheriff’s and Probation departments.\nParker was a police officer for 10 years before spending most of the last 20 years in the medical examiner/coroner field in San Diego; Phoenix, Arizona; Las Vegas, Nevada; and Los Angeles.\nCLERB was created by San Diego County voters in 1990 to provide independent investigation and oversight of the County’s Sheriff’s and Probation departments. Part of its authority includes oversight of all County jails in the unincorporated areas and in the nine cities that use the County’s Sheriff’s Department to provide law enforcement.\nIn June, the County Board of Supervisors approved increasing CLERB’s independence and strengthening its oversight. The action came in response to protests here and across the country after the police killing in May of George Floyd in Minneapolis, Minnesota.\nThe Board’s action included:\n\nDirecting CLERB to increase community involvement in the appointment process for its 11-member, volunteer board of directors\nMoving CLERB from the County’s Public Safety Group, which includes the Sheriff’s and Probation departments, to the Finance and General Government Group “to make sure CLERB is independent from the departments it is tasked with overseeing”\nExpanding CLERB’s investigatory authority, funding and staffing\n\nBefore the Board action, CLERB already had the ability to subpoena witnesses and evidence in its investigations, but its investigatory power had limits. CLERB was authorized to investigate, without a complaint, all deaths arising out of or in connection to actions of peace officers or custodial officers employed by the Sheriff’s Department or Probation Department.\nBeyond that, CLERB could only investigate instances when a member of the public signed an official complaint. If people were hesitant for any reason to sign complaints, the agency could not investigate, even if CLERB felt there was merit to those complaints.\nThe Board of Supervisors vote in June changes that. CLERB will have the authority to investigate, without public complaints, any incidents that involve County custodial, Sheriff’s or Probation officers and: the discharge of a firearm; use of force resulting in great bodily injury; and use of force in protests or other events protected by the First Amendment.\nParker said one of CLERB’s first goals will be to increase community outreach in San Diego County, to better acquaint the public with CLERB’s role and work, to be “more proactive” with the public it serves.\n“I think this is the ideal time to be executive director of a civilian oversight entity in the United States,” Parker said. “And with my experience here in San Diego, already forming and having relationships, knowing the players involved at both the Sheriff’s and Probation departments … this is an exciting time. We have a lot of work to do.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201112.13.41.21"}