{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens Applications for Mini Home-Kitchen Restaurants", "description": "The first aspiring chefs looking to turn their homes or apartments into mini-restaurants gathered at the County Operations Center as the County officially opened its application process for “Microenterprise Home Kitchen Operations.”", "datePublished": "2022-02-25T13:46:31-08:00", "url": "https://www.countynewscenter.com/county-opens-applications-for-mini-home-kitchen-restaurants/", "keywords": ["consumer", "home kitchen", "home restaurant", "lueg", "mehko", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-02-25T13:46:31-08:00", "articleType": "article", "articleContent": "\nThe first aspiring chefs looking to turn their homes or apartments into mini-restaurants gathered at the County Operations Center Friday as the County officially opened its application process for “Microenterprise Home Kitchen Operations.”\nCounty supervisors unanimously approved a two-year, temporary authorization in January to let people countywide operate mini-restaurants out of their homes serving up to 30 in-person, take-out or delivery meals a day, with a maximum of 60 a week.\nOn Friday, County Department of Environmental Health and Quality staff and members of the San Diego Microenterprise Home Kitchen Operations (MEHKO) Coalition greeted a couple dozen people to help them navigate the application process and answer questions. The department has also created a website where people can apply and get information.\nHome cooks who want to operate a microenterprise kitchen will be required to submit an application, earn a food safety manager certificate from an approved school, pass an initial inspection, and undergo annual inspections. Kitchens that rely upon well water would also have to conduct private well tests to ensure the water is safe.\nThe state moved to allow microenterprise kitchens in 2019 with restrictions. Some of those include:\n\nThey must be operated by a resident living in the home or apartment\nThey cannot have more than one full-time employee, excluding family members.\nFood must be prepared and served on the same day and sold directly to consumers.\nThey’re limited to $50,000 in sales a year.\nThey cannot operate as caterers, temporary event vendors, mobile event vendors or cottage food operators that prepare and sell packaged foods.\n\nThe County is the regional local authority that conducts health inspections for all restaurants and food facilities countywide and is the governing body to consider MEHKO authorization for the unincorporated areas and the county’s 18 cities.\nCounty Board Vice Chair Nora Vargas and Supervisor Joel Anderson asked the Board to approve a microenterprise home kitchen operation ordinance. When the Board approved the ordinance last month, they said the kitchens would not compete with established restaurants but would help local communities, the economy and people with cooking skills trying to make ends meet.\nCounty staff said comments collected in public meetings and hearings also stated that home-kitchen restaurants had numerous potential economic and community benefits. For example, they would give aspiring restaurateurs a way to earn a living and way to test their skills and ideas for an overall startup cost of about $740, rather than spending the estimated $275,000 average cost of opening a storefront restaurant. They would also provide “food justice” and healthy, home-cooked meals for communities that don’t have lots of restaurants or that lack access to healthy food.\nCounty staff plan to study local home-kitchen restaurants during the two-year temporary authorization of the ordinance and bring that data back to the Board before the ordinance expires for supervisors to consider whether to make it permanent.\nFor more information, go to the Department of Environmental Health and Quality’s Home Kitchen Operations webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220225.13.46.31"}