{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Library Named Finalist for Prestigious National Medal", "description": "The San Diego County Library has been named one of the 30 finalists for the prestigious 2024 National Medal for Museum and Library Service by the Institute of Museum and Library Services.", "datePublished": "2024-03-27T14:32:18-07:00", "url": "https://www.countynewscenter.com/san-diego-county-library-named-finalist-for-prestigious-national-medal/", "keywords": ["library", "community", "national medal", "san diego county library"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-03-27T15:47:53-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe San Diego County Library has been named one of the 30 finalists for the prestigious 2024 National Medal for Museum and Library Service by the Institute of Museum and Library Services (IMLS). \nThis honor is the highest in the United States for libraries and a major recognition of unwavering commitment to excellence and service to communities.\nThe County library is the only finalist from California’s library institutions this year.\n“This recognition is a direct result of our collective efforts and the innovative spirit that permeates every corner of our library system to support the customers and communities we serve,” said Migell Acosta, Library Director.\nSince 1994, the award has honored more than 200 institutions that demonstrate innovative approaches to public service.\n“The 30 National Medal finalists from across the United States showcase the tremendous abilities of libraries and museums to serve as trusted, dynamic public spaces that meet the needs of their communities,” said IMLS Acting Director Cyndee Landrum.\nThe 2024 National Medal winners will be announced the last week in May and a ceremony will be held in Washington, DC, in July. \nTo learn more about San Diego County Library and the services it provides, go to www.sdcl.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240327.14.32.18"}