{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supervisors Approve Gun Violence Reduction Work Plan", "description": "The County Board of Supervisors approved a work plan to reduce gun violence activities in San Diego County.  ", "datePublished": "2024-02-07T11:55:39-08:00", "url": "https://www.countynewscenter.com/county-supervisors-approve-gun-violence-reduction-work-plan/", "keywords": ["public safety", "and crimes", "firearms-related deaths", "gun violence reduction"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-02-07T12:30:03-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County Board of Supervisors approved a work plan to reduce gun violence activities in San Diego County.  \nThe Board voted to receive the Gun Violence Reduction Work Plan, using recommendations from the Gun Violence Community Needs Assessment Final Report authored by Health Assessment and Research for Communities.  \nThe plan includes 17 actions for the County to take to protect against and prevent firearm-related violence. The Board also approved a staff position to coordinate gun violence reduction activities and authorized the submission of grant applications. \nThe report focuses on populations most impacted by firearm-related deaths, injuries, and crimes, including race, age and gender.  As stated in the report, between 2017-22, over 70% of firearm-related deaths in San Diego County were suicides and over 28% were homicides. One in five firearm-related deaths were veterans, 93.3% of that group died by suicide.  \nRecommendations in the report focused on services that support violence prevention and intervention programs, including communities at highest risk for violence, domestic and intimate partner violence and outreach programs.  \nThe report also highlights the need for mental health care, youth mentorship programs, strict enforcement for crimes, background checks and funding for community-based organizations. \nHearing from and collaborating with the community was at the center of the needs assessment project. A Gun Violence Reduction Community Advisory Group was formed to provide input and feedback to help assess community needs. Health Assessment and Research for Communities organized networking events with community organizations with diverse backgrounds to work together.  In addition to collaborating with the advisory group, study authors conducted surveys and hosted a dozen virtual and in-person listening sessions and community forums. \nThe Board directed that an annual report be prepared on gun violence in San Diego County. County staff will return to the board in early 2025 with an initial update on actions to implement the work plan. \nA link to the report can be found here. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240207.11.55.39"}