{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Millions Available to Support Housing Projects in San Diego County", "description": "Continuing its efforts to expand the supply of affordable housing, the San Diego County Board of Supervisors has made $25 million available for affordable housing developments. In addition to these funds, Project Based Housing Choice vouchers and Project Based Veterans Affairs Supportive Housing vouchers are also available. ", "datePublished": "2023-04-10T10:37:33-07:00", "url": "https://www.countynewscenter.com/millions-available-to-support-housing-projects-in-san-diego-county/", "keywords": ["housing", "affordable housing", "funding availability", "hcds"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-04-10T10:37:33-07:00", "articleType": "article", "articleContent": "\nContinuing its efforts to expand the supply of affordable housing, the San Diego County Board of Supervisors has made $25 million available for affordable housing developments. In addition to these funds, Project Based Housing Choice vouchers and Project Based Veterans Affairs Supportive Housing vouchers are also available. \nThe latest round of funding available is through the Innovative Housing Trust Fund. It will be administered by the County’s Housing and Community Development Services (HCDS). \nDevelopers can access the Notice of Funding Availability through the County Buynet system and HCDS website. The deadline to apply is June 5, 2023. Proposals to be considered will support housing for seniors, transition-aged foster youth, veterans, persons experiencing homelessness, low-income families and other at-risk groups. \n“This is a huge step forward to continue expanding permanent affordable housing options for our most vulnerable neighbors and our heroes who served,” said HCDS Director David Estrella. “We will continue chipping away at the housing crisis, getting more people off the street and into a place they can feel safe calling home.” \nThis funding is available for affordable developments across the county, and Project Based Housing Choice vouchers and Project Based Veterans Affairs Supportive Housing vouchers (VASH PBV) are available in all areas, except the incorporated cities of San Diego, Carlsbad, National City, Oceanside, and Encinitas which operate their own housing agencies. \nCounty of San Diego Housing and Community Development Services is helping more than 42,000 people a year through various affordable housing programs. Since 2017, the County has invested more than $240 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund. Efforts since then have resulted in the opening of 1,125 new units with an additional 3,144 units on the way. When all upcoming developments under construction or in planning are complete, the total number of affordable units supported by the County will reach nearly 7,600, providing homes to more than 16,700 people.  \nThis new funding availability and other endeavors are part of the County’s ongoing response to the region’s housing affordability crisis. Efforts also are underway to create a roadmap, or Housing Blueprint, to guide our ongoing response. Community input remains vital to the County’s efforts to address the crisis to date. People are encouraged to review the Housing Blueprint to help inform final recommendations for its goals and objectives before it is presented later this year to the Board of Supervisors.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230410.10.37.33"}