{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Show Steps Needed to Address Health Inequities in San Diego", "description": "The County Health and Human Services Agency today published two comprehensive reports that show the progress and work needed to reduce health inequalities in the region and improve the quality of life of all San Diegans.", "datePublished": "2020-12-21T14:27:38-08:00", "url": "https://www.countynewscenter.com/county-reports-show-steps-needed-to-address-health-inequities-in-san-diego/", "keywords": ["health", "cha", "chip", "health equity", "public health accreditatioh"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-21T16:42:20-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency today published two comprehensive reports that show the progress and work needed to reduce health inequalities in the region and improve the quality of life of all San Diegans.\nThe Community Health Assessment (CHA) report includes morbidity, demographic and health data of residents and communities in the region. The data was used to develop the strategic framework of the second report – the Community Health Improvement Plan (CHIP). These two documents, as well as Public Health Services’ Strategic Plan, are a requirement for national, voluntary public health accreditation.\nThe reports also show the importance of community engagement and planning to enhance opportunities for residents to improve their health, live safely and thrive, the three components of the County’s Live Well San Diego vision.\n“These plans are reflections of the leadership and dedication of our communities to the lives of our fellow San Diegans,” said Nick Macchione, director of the County Health and Human Services Agency. “These regional plans will continue to be living documents that evolve to reflect future strategies within each region to create safe, healthy and thriving communities.”\n\nIn the Community Health Improvement Plan, regional community leadership teams produced enrichment plans, many of them already underway, that lay out priorities to help each region address the most important issues in their communities.\nThey include:\n\nImprove access to quality care\nIncrease physical activity and support healthy eating\nStop tobacco, alcohol and other drug use\nProtect residents from crime and abuse and increase neighborhood safety\nCreate communities that are resilient in disasters and emergencies\nImprove built and natural environment\nIncrease prosperity and improve education levels and the economy\n\n“The CHA documents the local health status and priorities for improvement in San Diego County,” said Wilma Wooten, M.D., M.P.H. County public health officer. “The CHIP explains the community planning process to address regional priorities, with attention to health equity. It describes the important role that the Leadership Teams play in driving action on the ground. The CHIP also captures how collective impact is to be measured and describes the foundational infrastructure that supports success.”\nBoth reports will also be used to help the County Health and Human Services Agency retain its accreditation status from the national Public Health Accreditation Board, which it first received in May 2016.\nEarning public health accreditation is a rigorous process and the County is now applying to be re-accredited as is required every five years.\nThe national accreditation process was developed in recognition of the importance of having a strong infrastructure to address public health challenges. These include protecting the public from infectious and chronic diseases, responding to emergencies and advancing health equity across a diverse population.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201221.14.27.38"}