{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Offices Will Close for Thanksgiving Holiday", "description": "San Diego County offices, including family resource centers, library branches and animal shelters, will be closed for the Thanksgiving holiday on Thursday, Nov. 25 and Friday, Nov. 26. Essential services including Sheriff’s Department patrols and animal control emergency response will continue during the holidays. County parks and campgrounds will also be open with exceptions.", "datePublished": "2021-11-18T11:27:37-08:00", "url": "https://www.countynewscenter.com/county-offices-will-close-for-thanksgiving-holiday-3/", "keywords": ["government", "closures", "thanksgiving"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-11-18T13:36:12-08:00", "articleType": "article", "articleContent": "\nSan Diego County offices, including family resource centers, library branches and animal shelters, will be closed for the Thanksgiving holiday on Thursday, Nov. 25 and Friday, Nov. 26.\nCounty-operated COVID-19 vaccination and testing sites will also be closed Thursday and Friday, and will resume normal hours Saturday.\nEssential services including Sheriff’s Department patrols and animal control emergency response will continue during the holidays. All County parks and campgrounds will also be open during normal business hours with the exceptions below:\n\nThe Fallbrook Community Center will be closed Thursday and Friday.\nThe Lakeside Community Center will be closed Thursday and Friday.\nThe Lakeside Teen Center/REC Club will be closed Monday, Nov. 25 through Friday, Nov. 29.\nThe Spring Valley Community Center will be closed Thursday and Friday.\nThe Spring Valley Teen Center/REC Club will be closed Monday, Nov. 25 through Friday, Nov. 29.\nThe Spring Valley gym will be closed Thursday, Thanksgiving Day, only.\nThe 4S Ranch Sports Park offices will be closed on Thursday but open Friday. The recreation office is closed on Thursday and Friday. The park will be open both days.\n\nParks’ reservation phone line will not be available Thursday and Friday, but you can make reservations online at sdparks.org.\nCounty animal shelters will resume their regular business hours starting Saturday, Nov. 27. All other County offices will reopen for regular business hours on Monday, Nov. 29.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211118.11.27.37"}