{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Near-Drowning Incidents Increase in Children During Pandemic", "description": "An increasing number of San Diego children have had to be rescued from private pools after nearly drowning, the County Health and Human Services Agency announced today.", "datePublished": "2020-08-20T10:45:31-07:00", "url": "https://www.countynewscenter.com/near-drowning-incidents-increase-in-children-during-pandemic/", "keywords": ["health", "coronavirus", "covid-19", "drowning"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-20T12:21:58-07:00", "articleType": "article", "articleContent": "\nAn increasing number of San Diego children have had to be rescued from private pools after nearly drowning, the County Health and Human Services Agency announced today.\nLocal data shows that 49 rescues occurred in private pools, beaches and bays from March through July 2020 compared to 37 in the same time period of 2019 and 33 the year before that. Nearly all those rescued needed to be taken to local hospitals for treatment.\nOf the 49 near-drowning incidents reported this year, 28 occurred in pools, most of them private pools. Fourteen occurred in the ocean, lakes or bays and the rest in unknown bodies of water.\nTwenty-four of the swimming incidents reported over the same period occurred in private pools and involved children 14 years and under. Some public pools have been closed due to COVID-19. In comparison, 18 occurred in 2019 and 21 the year before that.\nFrom March through July over the past three years, nine children and babies drowned in San Diego County. All but two were 2 years of age or younger:\n2020:   2 (one in a bathtub and one in a private pool)\n2019:   5 (all in private pools)\n2018:   2 (one in a bathtub and one in a private pool)\n“Parents and guardians must take the necessary precautions to keep these incidents from happening,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Children who swim in pools at home are at higher risk of drowning, especially as parents struggle to supervise their children while continuing to work at home through the summer months because of the novel coronavirus.\n“Parents should think safety first when children are near or in pools or other bodies of water to prevent injury and accidental drowning,” Wooten said.\nHere are some tips to minimize your risk and your children’s risk of drowning.\nGeneral Water Safety:\n\nTeach children to swim\nNever leave a child unsupervised in or near water\nAvoid alcohol\nLearn cardiopulmonary resuscitation (CPR)\n\n Residential Swimming Pools and Spas:\n\nInstall a fence around the pool and hot tub. Many jurisdictions have detailed laws regarding how this is done.\nInstall alarms\nRemove toys. On the deck they can be a tripping hazard, or in the water they can attract children.\nBeware of drains\nFollow all swimming rules posted at swimming areas\nKeep emergency equipment handy\n\nNatural Bodies of Water:\n\nAlways swim with a buddy\nSwim only in areas that have a lifeguard\nWear a life jacket\nEnter water feet first for the initial descent\nNever leave children unobserved, even for short periods of time\n\nToilets, Bathtubs and Buckets:\n\nKeep the bathroom door closed\nSupervise bath time\nShut toilet lids\nStore buckets safely\n\nThe California Paramedic Foundation will soon be launching a social media campaign to warn parents about the dangers of unsupervised swimming.\nMore information and prevention strategies can be found at Mayo Clinic and Safe Kids.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200820.10.45.31"}