{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Locally Acquired Omicron Case Identified in San Diego County", "description": "A man in his 30s is believed to have contracted the Omicron COVID-19 variant locally, the County Health and Human Services Agency announced today.", "datePublished": "2021-12-10T14:36:44-08:00", "url": "https://www.countynewscenter.com/locally-acquired-omicron-case-identified-in-san-diego-county/", "keywords": ["health", "coronavirus", "covid-19", "locally acquired omicron", "omicron", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-13T16:22:58-08:00", "articleType": "article", "articleContent": "\nA man in his 30s is believed to have contracted the Omicron COVID-19 variant locally, the County Health and Human Services Agency announced today.\nThe patient tested positive for COVID-19 Dec. 8. The San Diego Epidemiology and Research for COVID Health Alliance conducted whole genome sequencing and determined it was the Omicron variant late in the evening Dec. 9. The latest case was first detected through the Expedited COVID Identification Environment lab at UC San Diego.\nThe San Diego County resident did not have a travel history, had mild symptoms which have resolved, and he did not need to be hospitalized. The man, who was fully vaccinated and had received his booster shot more than two weeks earlier, is currently at home in isolation.\nContact tracing is underway to identify people who may have had close contact with the patient.\n“This case confirms our expectation that the Omicron variant is now spreading in the community. While the Delta variant remains the main strain circulating in San Diego, we expect to see more Omicron cases in the region,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “San Diegans should continue taking the recommended precautions, especially getting all the recommended COVID-19 vaccine doses.”\nTo date, there have been two Omicron variant cases confirmed in San Diego County. The first local Omicron case was reported by the County Dec. 9 in a patient who traveled abroad.\nFuture Omicron cases will be tallied in the Summary of Variant Cases which is published by the County every Wednesday.\nThe County continues to work with the Centers for Disease Control and Prevention and the California Department of Public Health to review existing recommendations and determine if changes should be made in the region.\nDr. Wooten recommends the following measures to protect against all varieties of COVID-19, including the Omicron variant:\n\nGet vaccinated and get a booster if you qualify. The vaccine is available at health care providers, retail pharmacies and community clinics. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the My Turn website.\nWear a mask, especially in public indoor settings, regardless of vaccination status.\nGet tested if you’ve traveled or have any symptoms, whether you’ve been vaccinated or not. You can make a free test appointment or find a walk-in test clinic at coronavirus-sd.com.\nGet CA Notify to receive alerts if you were in close contact with someone who tests positive for COVID-19.\nWash your hands frequently and stay home if you’re sick and distance yourself from others.\n\nMore information about COVID-19, variants, testing and vaccinations can be found at coronavirus-sd.com.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211210.14.36.44"}