{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Parents Urged to Get Tweens, Teens Caught Up on Vaccinations", "description": "Feb. 27 through March 5, 2022 is Preteen Vaccine Week, and County health officials say this is the ideal time for parents to catch up and make sure their children get all the recommended vaccines.", "datePublished": "2022-03-02T10:48:37-08:00", "url": "https://www.countynewscenter.com/parents-urged-to-get-tweens-teens-caught-up-on-vaccinations/", "keywords": ["health", "chickenpox", "hpv", "meningococcal disease", "preteen vaccine week", "vaccinations", "whooping cough"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-03-02T12:47:06-08:00", "articleType": "article", "articleContent": "\nOne can prevent a bacterial illness that can cause infections of the lining of the brain, spinal cord and bloodstream. Another can protect against several viruses that cause cancer.\nThey are vaccines for meningococcal disease and human papillomavirus (HPV), and are two of five immunizations recommended for preteens and adolescents. The other three vaccines offer protection against whooping cough, chickenpox and influenza.\nFeb. 27 through March 5, 2022 is Preteen Vaccine Week, and County health officials say this is the ideal time for parents to catch up and make sure their children get all the recommended vaccines.\n“When preteens are vaccinated, they can safely enjoy sports, after-school activities and in-person learning,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Also, certain vaccines are required to attend public or private schools in California. Parents should make sure their children have gotten all the recommended vaccines to protect them from getting sick.”\nMaking sure students have all the required vaccines is part of the countywide Live Well San Diego vision, an effort to improve the health and well-being of residents in the region. Staying up to date on recommended vaccinations, including the series for COVID-19,  is key to prevent or reduce the severity of infectious diseases.\nThe Centers for Disease Control and Prevention recommends adolescent children get immunized against the following diseases:\n\nHPV\nBoys and girls need all shots in the series for full protection. HPV vaccine for girls and young women prevents cervical cancer, but the vaccine is also recommended for boys to prevent anal cancer and genital warts.\nMeningococcal disease\nThe vaccine protects against meningococcal bacteria, which are known to cause serious illness. The bacteria can infect the blood and cause inflammation of the tissues covering the brain and the spinal cord. Ten percent of teens who become ill die, and another 15% suffer long-term disability such as loss of limbs, deafness, nervous system problems or brain damage.\nTetanus, diphtheria and pertussis (grouped in one vaccine called Tdap)\nAll students entering 7th grade need proof of a Tdap booster in order to attend school.\nInfluenza\nThe flu vaccine is recommended every year for everyone 6 months and older. Even though influenza activity has been very mild this season, other seasons have been more severe. Everyone 6 months and older should get a flu shot.\nChickenpox\nChickenpox, or varicella, is a viral infection that causes an itchy rash with small, fluid-filled blisters. While chickenpox is a mild disease for most people, it can be life-threatening for some. Two doses are recommended.\n\nThe above vaccines are available at physician offices, community clinics and many retail pharmacies. For updates about COVID-19 vaccine requirements for schools in California, visit Shots for School. People without medical insurance can get vaccinated at one of six County locations; call 211 for a location nearest you.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220302.10.48.37"}