{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Get Important Tools That Could Save Someone’s Life ", "description": "Knowing how to perform CPR and how to locate and use an AED can help someone when seconds are critical.  The collapse of Buffalo Bills player Damar Hamlin during an NFL Monday Night Football game was a heart-wrenching sight.", "datePublished": "2023-01-04T09:39:47-08:00", "url": "https://www.countynewscenter.com/get-important-tools-that-could-save-someones-life/", "keywords": ["health", "3-4-50", "aed", "aed heart attack defibrillator", "buffalo bills", "cardiac arrest", "cpr", "damar hamlin", "hands-only cpr", "heart failure", "hhsa", "live well", "live well san diego", "love your heart", "preparedness", "san diego county"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-01-04T10:57:42-08:00", "articleType": "article", "articleContent": "\nKnowing how to perform CPR and how to locate and use an AED, automated external defibrillator, can help someone when seconds are critical. \nThe collapse of Buffalo Bills player Damar Hamlin during an NFL Monday Night Football game was a heart-wrenching sight. Medical professionals provided immediate support on the field, and it’s a vital reminder that you can learn some of those life-saving skills to help in an emergency.  \nMedical experts say every second counts once cardiac arrest has brought about the abrupt loss of heart function, breathing, and consciousness. Quick actions like CPR and defibrillation can improve outcomes while waiting for medical professionals to arrive. \nCPR, or cardiopulmonary resuscitation, is used when the heart can’t pump blood to the rest of the body. It uses chest compressions to mimic how the heart pumps. Many organizations like the American Heart Association and YMCA provide CPR certification courses.  \nAn AED can also help someone in cardiac arrest. They are located in many public places, and you can download and use the PulsePoint AED app to help build a regional registry of where the defibrillators are located. The app is the companion to the PulsePoint Respond app, which notifies nearby responders of a cardiac emergency, providing a map of the location and nearby approved AEDs.  \nAnother way to be prepared is by caring for your own heart health. Heart disease is a leading cause of death in the United States, according to the World Health Organization, and annually claims the lives of more than 4,600 San Diegans. The disease can lead to heart failure or cardiac arrest. \n“Cardiac arrest is sudden and can be caused by a variety of factors,” said Dr. Jennifer Tuteur, San Diego County’s Deputy Chief Medical Officer. “It often happens to people who didn’t know they had a heart problem. That is why it is so important to understand your heart health by knowing your blood pressure numbers and getting an annual physical. Youth are encouraged to receive a preparticipation physical evaluation, or sports physical, to help keep athletes safe and healthy while participating in sports. ”  \nHeart disease is one of three chronic diseases, caused by three behaviors – limited physical activity, poor diet and tobacco use – that lead to over 50% of all deaths worldwide. You can get a free blood pressure screening and learn more about your heart health during the Love Your Heart Week of Action Feb. 11 – 19.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230104.09.39.47"}