{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Annual Report-Tale of Two Counties", "description": "The County of San Diego’s new 2019-2020 Annual Report shows the striking difference between the beginning of the fiscal year and the end – what could be called a tale of two counties.", "datePublished": "2020-11-20T09:57:24-08:00", "url": "https://www.countynewscenter.com/new-annual-report-tale-of-two-counties/", "keywords": ["government", "2019-20 annual report", "annual report", "covid-19", "covid-19 economic crisis", "fgg", "fiscal year 2019-20", "racial equity", "social justice", "t3 strategy"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-11-20T11:24:04-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s new 2019-2020 Annual Report shows the striking difference between the beginning of the fiscal year and the end – what could be called a tale of two counties.\nAs the County hummed along meeting its many goals to serve the public, COVID-19 and the ensuing economic crisis hit our region. A spate of police killings led to renewed calls for social justice and racial equity worldwide. These upheavals completely changed the way we do business.\nThe County went into rapid emergency response mode to protect public health and, at the same time, found new innovative ways to continue offering the many services the public has come to expect.\nThe County began investing $100 million into the T3 strategy – test, trace and treat – to reduce the spread of COVID-19. At-risk businesses could apply for economic help. Struggling renters in the unincorporated area saw a moratorium on evictions. And the County made broad changes to address inequities in the region.\nBefore these unforeseen challenges, the Annual Report looks into the County’s strides in meeting or exceeding goals in five of its priority areas: helping the most vulnerable in the region, improving housing affordability, transforming the public safety and justice system, protecting our natural resources and investing in our neighborhoods.\nThis past year, the County addressed the increased need for behavioral health services, bolstered aid to those experiencing homelessness, and began transforming its juvenile justice and foster care systems.\nMore affordable housing became available as part of the County’s goal to double the number of units over five years to more than 5,000.\nA community air protection program expanded, a new electric vehicle roadmap was approved, and 354 tons of air pollutant emissions were removed.\nThe County opened its first archive and first bike park. Construction is underway for a new fire station and phase one of a juvenile justice campus. A new library is planned for Lakeside and the Southeastern Live Well Center is going into the design phase.\nThe Annual Report also allows you to meet the County Board of Supervisors, outlines how departments are organized and lists our top awards. Easy-to-read financial charts show where your tax dollars go.\nCheck out the Annual Report online and see just how the County is fulfilling a promise of a region that is healthy, safe and thriving. And, get in-depth information about the County’s latest budget plans in the adopted operational plan.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201120.09.57.24"}