{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Invites You to Family-friendly Budget Open House", "description": "Learn how the County budget affects you and have a little fun, too.", "datePublished": "2025-04-14T16:26:52-07:00", "url": "https://www.countynewscenter.com/county-invites-you-to-family-friendly-budget-open-house/", "keywords": ["government", "2025-26 budget", "community budget open house", "county budget", "open house"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-04-14T16:26:52-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteLearn how the County budget affects you and have a little fun, too.\nAn informational open house will take place Thursday, April 17 at the County Operations Center in Kearny Mesa. Drop in any time between 5 and 7 p.m.\nYou can find out how the budget process works, ask staff on hand questions about the County’s many services and give your feedback.\nYou’ll also get a chance to see some of our County services firsthand. Bring the kids so they can check out adoptable animals, meet a park ranger with a live hawk, see a dog-sniffing demonstration and look at a bomb squad vehicle and other emergency vehicles up close.\nThis open house will be the first of three designed to help residents learn about the budget and how it works.\nThe second open house will take place after the Chief Administrative Officer’s recommended budget is released on May 1. This open house invites visitors to stop by anytime between 5 and 7 p.m. on Thursday, May 22.\nA third session will be held virtually on Zoom at 5:30 p.m. on Wednesday, May 28.\nIf you would like to attend the April 17 open house, visit Engage San Diego County for details. You can register to let us know you are coming or request language and accessibility services.\nBudget hearings will take place before the Board of Supervisors at 9 a.m. on Tuesday June 3 and at 5:30 p.m. on Monday, June 9.\nThe Board will hold deliberations and adopt the budget on June 24. The adopted budget takes effect July 1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250414.16.26.52"}