{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Awarded Grant for Bicycle, Pedestrian Safety Education", "description": "The County Health & Human Services Agency has received a $125,000 grant from the California Office of Traffic Safety to improve the safety of bicyclists, pedestrians, and scooter riders.", "datePublished": "2020-11-13T09:28:34-08:00", "url": "https://www.countynewscenter.com/county-awarded-grant-for-bicycle-pedestrian-safety-education/", "keywords": ["health", "bike grant", "ots", "pedestrian safety", "scooter grant"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-12T13:38:23-08:00", "articleType": "article", "articleContent": "\nThe County Health & Human Services Agency has received a $125,000 grant from the California Office of Traffic Safety (OTS) to improve the safety of bicyclists, pedestrians, and scooter riders.\n“Our goal is that education will change poor behaviors and make our roads safer,” OTS Director Barbara Rooney said. “This funding will help ensure the safety of those out biking or walking.”\nGrant funds will be used for a variety of activities promoting bicyclist, pedestrian and scooter safety, including:\n\nEducation workshops geared toward youth, older adults, and community groups\nEducation on the importance of safety equipment that improves visibility such as reflective armbands, bicycle headlights and taillights\nBicycle and scooter safety courses\nPresentations to community groups, including disability community stakeholders\nA public relations education and outreach campaign directed to the mobility community, motorists, and businesses\n\nThe services, which will run through Sept. 30, 2021, will be provided by Circulate San Diego.\nThis safety campaign aligns with Live Well San Diego, the County’s vision for healthy, safe and thriving residents and communities.\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\nFor more information, contact Danielle Berger from Circulate San Diego at 619-544-9255 ext. 305.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201113.09.28.34"}