{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Social Worker’s Dedication to Foster Youth Recognized with Director’s Award", "description": "It was something of a full circle experience when Child Welfare Services (CWS) Protective Services Supervisor Abbie Brack was recognized with the Director’s Award for her impact on a former foster youth she helped more than a decade ago. ", "datePublished": "2023-05-17T10:42:51-07:00", "url": "https://www.countynewscenter.com/social-workers-dedication-to-foster-youth-recognized-with-directors-award/", "keywords": ["families", "child welfare services", "director s award", "foster youth"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-05-18T09:00:50-07:00", "articleType": "article", "articleContent": "\nIt was something of a full circle experience when Child Welfare Services (CWS) Protective Services Supervisor Abbie Brack was recognized with the Director’s Award for her impact on a former foster youth she helped more than a decade ago. \nTianna entered foster care in the early 2000s, and when she met social worker Abbie Brack she knew things would be better.  \n“She was the first person who told me that I am resilient,” Tianna said. “ I had never heard that word before, but Abbie saw resiliency in me, and that word stuck with me throughout my next several years of foster care. She also was the first person who believed me and gave me a voice against my abuser, and she stood right next to me through it.”  \nWith Abbie’s support, Tianna’s self confidence grew and even after aging out of foster care, Tianna was excited to see that Abbie stayed by her side.\n“She played a part in my resiliency, showing me that I matter,” Tianna said. “Showing me I can go to college and graduate from a university!”\nAbbie was in the stands cheering for Tianna the day she graduated from Point Loma Nazarene University in the last couple years. \nTianna reached out to Health and Human Services Agency Director, Nick Macchione, to convey how Abbie’s dedication to her job made a huge difference in her own life.  \n“The lives of our children and youth have been blessed because of social workers like Abbie and others on our team,” Macchione said. “I can’t say enough how much I appreciate Abbie for all she has done and continues to do to help our most vulnerable children in the county.” \nMacchione notified Child Welfare Services Director Kim Giardina, who was Abbie’s supervisor back then. \n“She was such a sweet young lady, and it was amazing seeing her blossom into a confident young woman,” Giardina said of Tianna. “It’s not every day that child welfare staff get to hear directly from children, youth and families about the positive impact we make in their lives.” \nGiardina knew this was a perfect time to recognize Abbie with the Director’s Award for her outstanding work. \n“This was such a special recognition because it came from one of our former foster youth,” Giardina said. “Abbie is very deserving of this recognition, and I think it also is emblematic of the work all our staff do every day.”\nThe ceremony was held April 20th at Abbie’s office in the East County Child Welfare Services office. Tianna handed her the plaque with some words on how positively Abbie impacted her life. \n“I have always believed that we have this privilege of being a part of someone’s story, a small piece in the puzzle of their life,” Abbie said. “To hear how the things I did and said as a social worker created positive ripples in her life and to get to hear that directly from her, meant the world to me.”\nIn part inspired by Abbie’s impact on her life, today Tianna works as a supervisor at Voices for Children training and mentoring Court Appointed Special Advocates for foster youth. \nFor her part, Abbie is training the next generation of social workers as a Protective Services Supervisor in the Workforce Training and Development Unit. \n“It brings me great joy in training the next generation of social workers to make an impact with the families we serve,” Abbie said. “Although we don’t always get to hear how the story ends, it’s our pleasure to be a part of the journey.” \nShowing compassion has the power to change a life and make waves to positively impact others. Learn more about Child Welfare Services, including career opportunities, on the CWS website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230517.10.42.51"}