{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Child Support Services and the County Library Get Parents “Tech Connected”", "description": "County Libraries and the Department of Child Support Services partnered to provide Chromebooks and mobile hotspots to parents who signed up to participate at Child Support Services Super Saturday event on Oct. 8 at the South Region Live Well Center in National City.", "datePublished": "2022-10-24T15:56:54-07:00", "url": "https://www.countynewscenter.com/?p=209804", "keywords": ["families", "chromebooks", "county library", "department of child support services", "hotspot", "laptops", "library high school diploma program", "online tutoring", "super saturday"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-10-24T15:56:54-07:00", "articleType": "article", "articleContent": "\nAt a recent Child Support Super Saturday event at the South Region Live Well Center in National City, San Diego County Library and Child Support Services teamed up to provide Chromebooks and mobile hotspots to families for one year.\nNearly 200 parents and more than 300 children preregistered for the devices and 303 were distributed at the event. Additional Chromebooks and hotspots were reserved for those who were unable to attend. The Chromebooks and hotspots were paid for as part of a $4.3 million federal grant.\nBeyond efforts promoting digital inclusion, Child Support Services was open to provide child support services to customers to accommodate those who may not be able to visit during regular business hours.\nCounty Library staff also provided the community attendees information about library services, such as the free Library High School Diploma Program and free online tutoring.\nFor more information on how to obtain a device, the San Diego County Library branches have laptop checkouts and free internet access through mobile hotspots.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221024.15.56.54"}