{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Bayview Crisis Stabilization Unit Serves South Bay", "description": "A partnership between Paradise Valley Hospital and the County was celebrated today with an official unveiling of the Crisis Stabilization Unit at the Bayview Campus.", "datePublished": "2023-02-27T17:17:45-08:00", "url": "https://www.countynewscenter.com/bayview-crisis-stabilization-unit-serves-south-bay/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-02-27T17:17:45-08:00", "articleType": "video.other", "articleContent": "\nA partnership between Paradise Valley Hospital and the County was celebrated today with an official unveiling of the Crisis Stabilization Unit at the Bayview Campus. This hospital-based CSU provides immediate behavioral health care 24 hours a day, 7 days a week, for anyone in crisis. Clients can be dropped off or walk up to receive the services and support they need.\nThe CSU offers crisis intervention, medication management, short-term counseling, care coordination, and connections to ongoing behavioral health and primary care services when applicable. It is a safe, compassionate alternative to emergency rooms and jails.\nThe CSU has proved to be a critical South County resource for families, friends, law enforcement, first responders and outreach partners. It’s presence has helped decrease the number of patients who end up in Emergency Departments and has shortened the time law enforcement officers wait with clients in crisis who need treatment.\nThe Bayview CSU opened in April of 2021. COVID restrictions delayed the ribbon cutting, which was celebrated today. The CSU is part of a network of six community-based crisis stabilization units across the county, serving more than 8,500 clients in 2022 alone.\nAnyone needing immediate behavioral health assistance should call 9-1-1. Help is also available by calling the County’s Access and Crisis Line at (888) 724-7240 or visiting www.Up2SD.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230227.17.17.45"}