{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "4 More COVID-19 Deaths Reported; Cases Increase to 1,628", "description": "The local number of COVID-19 deaths increased to 40 after four additional deaths were reported, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-09T17:04:09-07:00", "url": "https://www.countynewscenter.com/4-more-covid-19-deaths-reported-cases-increase-to-1628/", "keywords": ["health", "coronavirus", "covid dashboard", "covid-19", "covid-19 four deaths"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-11T08:47:41-07:00", "articleType": "article", "articleContent": "\nThe local number of COVID-19 deaths increased to 40 after four additional deaths were reported, the County Health and Human Services Agency announced today.\nThe age range of the people who have died from COVID-19 is between 23 and 100 years. All, except one, had underlying medical conditions. Two deaths are currently under investigation for chronic health issues.\n“It is sad and very unfortunate that people who are the most vulnerable to COVID-19 are dying,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We must do everything we can to keep those at higher risk of developing complications from the disease to keep them from getting the virus.”\nThe age, gender and race and ethnic breakdown of the 40 COVID-19 deaths reported is:\nAge:\n\n80 and older: 19\n70 to 79: 12\n60 to 69: 3\n50 to 59: 4\n20 to 29: 2\n\nGender:\n\n24 Men\n16 Women\n\nRace and Ethnicity:\n\n16 White\n10 Hispanic\n2 Asian\n1 Multiple races\n11 Unknown\n\nCounty COVID-19 Cases Reach 1,628\nThrough April 9, a total of 1,628 COVID-19 cases have been reported in San Diego County, including 98 new cases in the last day.\nOf San Diego County’s cases, 832 (51.1%) were men and 790 (48.5%) were women. The gender of six people is unknown. Of the known cases, 348 (21.4%) have required hospitalization and 132 (8.1%) of the total number of cases had to be placed in intensive care. Forty (2.5%) have died.\nOther measures and resources to deal with COVID-19 include:\n\nMore than 22,000 tests have been administered to San Diegans, including 920 tests reported April 8.\n\n\nThe County has distributed over 1.9 million personal protective equipment items to local health care providers, including over 788,000 N-95 respirators, nearly 363,000 surgical face masks and over 711,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,585 rooms for County Public Health Services use, 186 are occupied by 200 guests.\nOf the 441 rooms assigned to the Regional Task Force on the Homeless, 194 are being occupied by 321 people who are at higher risk of developing complications from COVID-19.\n\nInteractive Dashboard Launched\nThe County today officially launched an interactive dashboard with several data points on COVID-19. The dashboard allows you to see:\n\nTotal deaths\nTotal positive cases\nDaily case total\nReported tests\nNumber of patients who had to be hospitalized and place in intensive care\nCase count by city and ZIP Code\nCalifornia counties with highest number of cases\n\nMask Requirement for Banks, Public Transportation\nCounty officials are also reminding new businesses added to the Health Order they must comply with the new guideline by April 14, 2020. The order now requires employees of banks and public transportation to wear face coverings when serving the public and for childcare providers to wear face coverings when serving food.\nPeople should wear a face covering when in public.\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data will also be broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200409.17.04.09"}