{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Initiative Launched to Teach 1 Million San Diegans Hands-Only CPR", "description": "The County of San Diego is partnering with UC San Diego to launch Revive & Survive San Diego, a new initiative to help save lives.", "datePublished": "2024-02-26T12:51:08-08:00", "url": "https://www.countynewscenter.com/initiative-launched-to-teach-1-million-san-diegans-hands-only-cpr/", "keywords": ["health", "cpr", "hands-only cpr", "health", "revive & survive san diego", "uc san diego"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-02-26T13:28:46-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County of San Diego is partnering with UC San Diego to launch Revive & Survive San Diego, a new initiative to help save lives.\nRevive & Survive San Diego was created to train 1 million San Diegans on how to perform hands-only cardiopulmonary resuscitation (CPR) for people in cardiac arrest.\nHands-only CPR involves chest compressions at 100 to 120 per minute without using mouth-to-mouth breathing. If someone can perform this before medical professionals arrive, it vastly increases a person’s likelihood of survival.\nIn recent years, CPR training has shifted to the hand-only approach. Mouth-to-mouth breathing is no longer considered essential.\nIn 2021, 8 percent of people who experienced an out-of-hospital cardiac arrest in San Diego County were successfully revived and survived.\n“Cardiac arrest continues to be a leading cause of death across the country,” said Kristi Koenig, M.D., County of San Diego Emergency Medical Services medical director and co-lead of the Revive & Survive San Diego initiative. “No amount of preparedness in a hospital can save a life if the person does not make into the building. Receiving CPR at the scene will save lives.”\nBrain death starts to occur four to six minutes after someone experiences cardiac arrest if there is no CPR and defibrillation during that time. For every minute CPR is delayed, survival from cardiac arrest decreases by 7 to 10 percent.\nOn Monday, leaders from the County, UC San Diego, healthcare and the community participated in a news conference to share more details about the initiative.  Emergency doctors from across the region provided hands-on CPR demonstrations and training as part of the event.\nRevive & Survive San Diego will work with local healthcare providers and community partner organizations to offer free hands-only CPR training and perform community outreach countywide.\n“There is a critical need for community CPR education to help bystanders recognize and intervene when someone suffers from cardiac arrest,” said Cheryl A.M. Anderson, Ph.D., M.P.H., dean, UC San Diego Herbert Wertheim School of Public Health and Human Longevity Science and co-lead of Revive & Survive San Diego.\nFor more information about Revive & Survive San Diego, including opportunities for CPR training, becoming a partner or to support the initiative, visit revivesurvive.ucsd.edu.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240226.12.51.08"}