{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Free Padres Tickets, Other Prizes for Getting COVID-19 Vaccine", "description": "Getting a free pair of San Diego Padres tickets, a chance to win two more, a T-shirt and $50 on top of that is easy.", "datePublished": "2021-06-10T15:40:10-07:00", "url": "https://www.countynewscenter.com/free-padres-tickets-other-prizes-for-getting-covid-19-vaccine/", "keywords": ["health", "coronavirus", "covid-19", "padres free tickets", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-06-10T15:40:10-07:00", "articleType": "article", "articleContent": "\nGetting a free pair of San Diego Padres tickets, a chance to win two more, a T-shirt and $50 on top of that is easy.\nAll you have to do is remember the below dates and get vaccinated against COVID-19.\nOn June 12, from 9:30 a.m. to 3:30 p.m. and June 26, from 1:30 to 8 p.m., everyone who gets vaccinated at Petco Park’s Gallagher Square will get a free pair of tickets for a future Padres game and a Padres Hero T-shirt, while supplies last.\nYou can also enter a drawing for a free pair of tickets to a future game. Minors must have a parent present to receive Padres tickets and/or to enter the drawing. The clinics will be offering the single dose Janssen and limited quantities of the two-dose Pfizer vaccine (eligible minors 12 and older may only receive Pfizer). The entrance is at the 10th & K gate.\nThe County is teaming up with the Padres to help the region reach herd immunity against COVID-19. This is an especially exciting season for the Padres and officials hope that the prizes add extra encouragement and incentive for fans 12 years of age and older to be a Hometown Hero and get vaccinated against COVID-19.\nYou can also register for a chance to get a free pair of Padres tickets, while supplies last, if you get vaccinated at any County mobile clinic by June 30.\nYou can identify the clinics at coronavirus-sd.com/vaccine by the baseball logo next to the event and by following the County on social media.\nThe Petco Park vaccination events support Major League Baseball’s “MLB Vaccinate at the Plate” program taking place throughout June to increase vaccination rates.\nThere are other prizes for San Diegans who get vaccinated against COVID-19 anywhere in the county.\nYou can get a $50 gift card and automatically enter for a chance to win $1.5 million from the state if you get vaccinated before June 15.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210610.15.40.10"}