{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mobile Crisis Response Teams Successfully Operating Countywide", "description": "County of San Diego officials and community partners today announced early results and the launch of a broad, public awareness campaign for a program providing a specialized response to people experiencing a mental health, drug or alcohol-related crisis.", "datePublished": "2022-02-28T16:15:07-08:00", "url": "https://www.countynewscenter.com/mobile-crisis-response-teams-successfully-operating-countywide/", "keywords": ["health", "behavioral health", "csu", "mcrt", "mental health", "mobile crisis response teams"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-02-28T16:15:07-08:00", "articleType": "article", "articleContent": "\nCounty of San Diego officials and community partners today announced early results and the launch of a broad, public awareness campaign for a program providing a specialized response to people experiencing a mental health, drug or alcohol-related crisis.\nSince the Mobile Crisis Response Teams began services in January 2021, the non-law enforcement program has responded to 672 referrals and successfully linked over 110 people to treatment services. Forty-seven percent of referrals have resulted in people being able to access treatment in their community, without the need for law enforcement or more acute services. Of those MCRT has served, approximately 20% were experiencing homelessness.\n“Mobile Crisis Response Teams are working. Nearly 700 referrals for behavioral health services have resulted in better outcomes for individuals experiencing a behavioral health crisis,” said Nathan Fletcher, chair of the San Diego County Board of Supervisors. “Mobile Crisis Response Teams change a person’s entry point into the health care system and change their trajectory moving forward. Over time, we want to reduce the number of people who get to a state of crisis, and the way you do that is by engaging people in community care and other services.”\nRolled out throughout February, the countywide public awareness campaign includes print, radio, digital and billboard ads, in English and Spanish, encouraging people to call the County’s Access and Crisis Line at (888) 724-7240 if they or someone they know is having a nonviolent behavioral health crisis.\nBillboards like this one can be seen on freeways and streets throughout the region.\nFollowing the initial round of the MCRT campaign, a second phase of public messaging will provide more focused messaging, photos and engagement tailored to underserved populations.\n“These response teams are saving lives, demonstrating that this new approach to mental health is showing signs of real progress,” said Supervisor Terra Lawson-Remer. “San Diego, we need your help to get the word out. You can call the Access and Crisis Hotline at 888-724-7240 when someone is experiencing a mental health or substance use emergency that does not involve threats of violence. Remember this phone number, because it can change someone’s life.”\nWhat Are MCRTs?\nMobile Crisis Response Teams, or MCRTs, are available countywide for people experiencing a mental health or substance use crisis. The teams are comprised of licensed mental health clinicians, case managers and peer support specialists who travel to the person to provide assessment, crisis intervention services and connections to treatment and other services, as needed. The training, compassion and resources these teams bring with them on every call is proving to be a winning combination.\nMCRTs partner with Chula Vista and National City police departments, which refer calls to MCRT when appropriate. The County is also working with nine other jurisdictions to establish similar partnerships.\n“Innovative community-based interventions are critically important to meeting people where they are with the right response, thereby advancing our vision to provide an equitable and regional distribution of services,” Dr. Luke Bergmann, director of Behavioral Health Services division at the County Health and Human Services Agency, said at a news conference announcing the campaign and the early results. “MCRTs are an excellent example of innovative services, but they are not the only one.”\nIn the past few years, the County has made significant increases in investment and funding to provide better access to behavioral health services.\nThroughout 2021, the County significantly expanded capacity of crisis stabilization units for people experiencing a behavioral health crisis, providing much needed support to individuals who may otherwise end up at a local emergency room or jail.\nThe units provide services in a community-based or hospital setting for people experiencing a mental health or substance use crisis.\nServices are provided on a walk-in basis with stays of less than 24 hours. In addition to walk-in, community and mobile crisis team transport, law enforcement may drop off people experiencing a behavioral health crisis to the stabilization units as a safe alternative to jail or a hospital, allowing officers more options to connect people to care.\nCrisis stabilization units are designed to enable the smoothest transition possible from law enforcement engagement to care hand-off. The system is less taxing on individuals, allows officers to return quickly to the field and provides a care plan leading to less recidivism.\nCounty Conducting Community Outreach\nTo complement the public awareness campaign, the County has also begun a community-based outreach and engagement effort through a contract with Jewish Family Service’s Breaking Down Barriers program. The Breaking Down Barriers program is a prevention and early intervention program providing outreach and education to reduce stigma around mental illness through trusted community partners.\nThe program will engage new outreach workers and work with community organizations to connect to diverse communities and provide information about how to access services when there is a need. The plan is to reach about 1,000 community members each month through outreach events, presentations, community conversations, flyer dissemination, posters placed in community locations, outreach to local businesses and social marketing.\nIf you or someone you know is experiencing a behavioral health crisis, call the Access & Crisis Line at (888) 724-7240.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220228.16.15.07"}