{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Fire Starts New Year with New Name", "description": "The year 2021 will mean a new name for the San Diego County Fire Authority as the organization has been recently renamed the San Diego County Fire Protection District.", "datePublished": "2020-12-29T08:50:27-08:00", "url": "https://www.countynewscenter.com/county-fire-starts-new-year-with-new-name/", "keywords": ["public safety", "cal fire", "emergency", "fire authority", "public safety", "san diego county fire"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2020-12-29T09:09:01-08:00", "articleType": "article", "articleContent": "\nThe year 2021 will mean a new name for the San Diego County Fire Authority as the organization has been recently renamed the San Diego County Fire Protection District.\nThe name change became official Dec. 7 when the San Diego Local Agency Formation Commission (LAFCO) voted 8-0 in favor of becoming a dependent special district under the San Diego County Board of Supervisors. LAFCO oversees the establishment and organization of special districts.\n“The San Diego County Fire Protection District has been a long time coming,” said Herman Reddick, the district’s director. “It is the natural progression of growth and provides the long-term stability of the organization.”\nAccording to Reddick, in the last five years San Diego County Fire has been able to make significant improvements by increasing permanent career staffing and the assignment of paramedics at all San Diego County Fire Protection District stations and increasing the level of services provided to county residents.\nCAL FIRE/San Diego Fire Chief Tony Mecham said the actions to create the new district help to correct a decision made in the 1970s when the County of San Diego terminated the contract with California Department of Forestry and Fire Protection for fire services.\n“Supervisor Dianne Jacob and LAFCO began working on this issue in 1993 and after 27 years the fire district has become a reality,” said Mecham. “Last year, the voters in San Diego voted in favor of adding fire protection services to the San Diego County Charter. These two actions will ensure that fire protection services will always be provided across our 1.7-million-acre service area.”\nThe San Diego County Fire Protection District is comprised of elements from both the State of California and the County of San Diego working in unison as a single organization. More than 500 sworn personnel operate 35 fire stations to ensure San Diego County residents are living safely. The designation as a fire protection district is just one step in County Fire’s continuous efforts to achieve operational excellence in all programs and areas of responsibility.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201229.08.50.27"}