{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Framework to Guide Decarbonization of Regional Economy", "description": "The County of San Diego announced the development of a science-based approach to decarbonizing the region’s economy called the Regional Decarbonization Framework. Decarbonization, simply put, is about reducing the gases in the atmosphere that trap heat. The goal is to achieve a balance of the carbon cycle in nature.", "datePublished": "2021-09-08T10:42:20-07:00", "url": "https://www.countynewscenter.com/county-framework-to-guide-decarbonization-of-regional-economy/", "keywords": ["government", "climate action plan", "decarbonization", "energy", "sustainability"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2021-09-08T11:17:02-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego announced the development of a science-based approach to decarbonizing the region’s economy called the Regional Decarbonization Framework.  Decarbonization, simply put, is about reducing the gases in the atmosphere that trap heat. The goal is to achieve a balance of the carbon cycle in nature.\nThis will be nation’s first, truly localized effort and is being crafted with expertise from the UC San Diego School of Global Policy and Strategy, and the Energy Policy Initiatives Center (EPIC) at the University of San Diego School of Law. This framework, directed by the Board of Supervisors on January 27, 2021, will help guide the region toward zero-carbon emissions.\nThe framework will recommend paths forward for the following sectors of San Diego County’s economy: energy, land use, transportation, industry and building. To build the framework, UC San Diego will utilize six technical experts in energy, transportation and buildings systems to chart the pathways that reduce carbon in the region.\nTo ensure equity is upheld in the framework and the local government policies that follow, EPIC will compare recommended RDF policies to existing local government policies and identify gaps that should be addressed so underserved communities are included.\n“The County of San Diego is committed to reducing its carbon footprint and creating lasting change that benefits generations to come,” said Deputy Chief Administrative Officer Sarah Aghassi.\n“We are proud to partner with UC San Diego and EPIC that will provide the technical and analytical expertise needed to build this science-based Framework that guides future policy decisions.”\nThe County recently completed a week of focus groups with business, labor and environmental representatives to better understand their perspectives. These will be followed by a September 13 public workshop. A core consideration influencing the development of the framework are the environmental injustices the region’s underserved communities have experienced to date related to air quality, infrastructure, jobs and housing.\nAll stakeholder input will help shape the consultant reports from our academic partners that will form a draft framework scheduled for public release in November 2021. This will be further vetted by a technical working group and additional community workshops. The Board will consider adoption of a final framework in early 2022.\n“The collaboration with the County of San Diego is an example of the UC San Diego School of Global Policy and Strategy’s strengths in developing policy analysis that helps address the complex challenges of our time,” said UC San Diego Chancellor Pradeep K. Khosla.\n“In this case, the school is creating a scientific framework to help inform policies that will improve the lives of San Diegans and address the critical need of reducing CO2 emissions.”\nThe framework is a vision document being developed collaboratively through a locally based public-private partnership. The approach will serve as a model for other local governments throughout the nation.  Actual decarbonization results will come from its adoption and the implementation of policies enacted by various jurisdictions.\n“By bringing business, labor, environment and community stakeholders together, we have our best chance at fighting climate change locally and improving our collective future,” said the County Land Use & Environment Group’s Program Manager for Regional Sustainability Murtaza Baxamusa.\nClimate change has economic, social, and environmental impacts. It has immediate and long-term effects on our communities, ecosystems, food production, health, safety, jobs, businesses, and overall quality of life in San Diego region.\nThe regionally focused framework is different from the County’s Climate Action Plan Update (CAP) which is solely County-managed, limits greenhouse gases from activities only within the County’s municipal control and is tied to its General Plan.\nMore information about the framework, including the September 13 public workshop, can be found on its website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210908.10.42.20"}