{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Significant Spike in COVID-19 Cases, San Diegans Need to Get Vaccinated Now", "description": "The County of San Diego Health and Human Services Agency is seeing a significant spike in new COVID-19 cases.", "datePublished": "2021-07-23T13:00:10-07:00", "url": "https://www.countynewscenter.com/significant-spike-in-covid-19-cases-san-diegans-need-to-get-vaccinated-now/", "keywords": ["health", "coronavirus", "covid-19", "delta variant"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-07-23T13:14:47-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is seeing a significant spike in new COVID-19 cases. The County will report 1,264 new cases this afternoon, the highest number since February 5, 2021.\nThe increase in cases is not a single-day phenomenon, but part of a larger trend in recent weeks. In the 30 days between June 21 and July 20, 6,572 San Diegans tested positive for COVID-19. Of that group, 11 percent were fully vaccinated, while 89 percent were not.\nCommunity outbreaks, hospitalizations and ICU admissions are also up dramatically. The County will post an additional two community outbreaks today, bringing the total number of outbreaks in the last seven days to 25. One month ago, on June 23, only five community outbreaks were reported.\nHigher Risk for Unvaccinated\nA total of 98 percent of hospitalizations in the last 30 days are in individuals who are not vaccinated or have not completed the full series of the two-dose vaccine.\n“The vaccines are effective in preventing severe illness or death from COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “If you have not gotten vaccinated, the time to get vaccinated is now. If you are late for your second dose, the time to get that second shot is now.”\n“In the last few weeks, individuals who were not fully vaccinated against COVID-19 were seven times more likely to contract the virus,” said Seema Shah, M.D., medical director of HHSA’s Epidemiology and Immunization Services branch. “The more infectious Delta variant is on its way to becoming the dominant strain among San Diego County residents and a single dose of the vaccine is only about 30 percent effective in protecting people from getting sick.”\nClose to 150,000 San Diegans are only partially vaccinated and overdue for their second shot. The County is working with medical providers to help them remind patients and is also using the San Diego Immunization Registry to develop follow-up reminders for those who are behind schedule.\nTo facilitate access to COVID-19 vaccines, the County is now operating the Great Eight, a collection of geographically distributed no-cost vaccination sites that allow people to choose any one of the three vaccines available in the United States, Moderna, Pfizer and Johnson & Johnson. For a list of locations and more information, visit www.coronavirus-sd.com/vaccine.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210723.13.00.10"}