{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Rescuers Save Puppy Trapped in Boulders", "description": "After a rocky rescue, a months old Australian cattle dog is looking for a safe and loving home.", "datePublished": "2023-06-23T11:13:51-07:00", "url": "https://www.countynewscenter.com/rescuers-save-puppy-trapped-in-boulders/", "keywords": ["animals", "das", "pet adoption", "rescue"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-06-23T11:30:39-07:00", "articleType": "article", "articleContent": "\nAfter a rocky rescue, a months old Australian cattle dog is looking for a safe and loving home.\nNo one knows how the puppy managed to get himself wedged between two boulders at a Valley Center construction site over the weekend. Rescuers just knew they had to help the whimpering puppy and worked for over an hour to free him from the tight crevice.\n“I was not planning on leaving there until we got him out,” County Department of Animal Services Officer Alyssa Moreno said of the tricky rescue. “I was happy with the ending. We were able to get him out, get him warmed up and give him some water and food.”\nSometime Saturday, a construction worker on site on Viking Grove Lane heard whimpering and discovered the trapped puppy. He tried repeatedly to pull the puppy out but could not get his hips through and needed to head home for the day, Officer Moreno said.\nShe asked him to send her some pictures as she headed over so she could make sure she had the right tools. When she saw the pictures, she knew immediately she was going to need help. So, she called area dispatchers who sent Valley Center firefighters to meet her at the site.\nThe construction worker had placed a tire on top of the boulders to mark the spot and that’s where they found the puppy, who was dehydrated and whining in discomfort.\nMoreno said the firefighters used a long strap and a flat wooden board to support the puppy’s body while they worked on easing him through. A nearby property owner brought over some soapy water to help lubricate the rocks.\nAfter more than an hour, they got him out, she said. They promptly wrapped him in a towel, gave him water and Moreno took him to the County Department of Animal Services to be evaluated by a veterinarian. Luckily, he checked out fine besides some dehydration and he is fully recovered.\n\n“Now, he is doing good. I went to see him in his kennel and he was wagging his tail and has gained some weight. He’s a handsome guy, he’s a little shy but friendly and affectionate. He likes attention,” Moreno said.\nAnimal control is sometimes called out to assist wildlife who become trapped in the wild, but this case seemed unusual even to the firefighters because of how tightly wedged the puppy had gotten in the crevice, she said.\nThe puppy, who staff are calling “Snack,” will be available for adoption Sunday at the County Department of Animal Services shelter in Carlsbad.\nWalk-in hours are from 1 to 4 p.m. Tuesday through Friday and from 10 a.m. to 4 p.m. Saturday and Sunday at the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nAnimal Services is also running a donation-only special on adult medium to large sized dogs and adult cats through June. Visit the shelters Adoptions page to find your new buddy at the Bonita or Carlsbad shelters.\nThe Department of Animal Services promotes the humane and responsible care of pets by providing the unincorporated areas of San Diego County with 24-hour animal rescues; helping those who can no longer care for their pets; investigating and stopping animal cruelty or neglect; enforcing state and local laws related to animals as needed; and educating the public about responsible care which includes animal welfare, restraint, and licensing benefits.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230623.11.13.51"}