{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "DA Warns that Spiking Prices or Contracting without a License During Valley Fire is a Crime", "description": "San Diego County District Attorney Summer Stephan is warning businesses and scammers not to take advantage of consumers by price gouging during a state of an emergency – doing so can end in prosecution.", "datePublished": "2020-09-11T14:26:37-07:00", "url": "https://www.countynewscenter.com/da-warns-that-spiking-prices-or-contracting-without-a-license-during-valley-fire-is-a-crime/", "keywords": ["public safety", "district attorney", "emergency", "valley fire"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-09-11T15:13:21-07:00", "articleType": "article", "articleContent": "\nSan Diego County District Attorney Summer Stephan is warning businesses and scammers not to take advantage of consumers by price gouging during a state of an emergency – doing so can end in prosecution.\nAs a result of the devastating Valley fire in the eastern part of San Diego County, Governor Gavin Newsom and the San Diego County Board of Supervisors declared a state of emergency in San Diego County on September 6. During a declared state of emergency, it is illegal for a business to increase its prices for essential goods or services by more than 10 percent, unless they can show their own costs have been increased.\n“Wildfires leave a devastating effect on many of our neighbors and we want to send a clear message that we will not tolerate any unlawful activity by a greedy businesses, contractors or scammers who would seek to financially exploit victims of wildfires,” Stephan said. “Price gouging and unlicensed contracting during a state of emergency is not only a crime, it also can further victimize someone who may have lost everything in a wildfire.”\nViolations of the price gouging statute are subject to criminal prosecution that can result in one-year imprisonment in county jail and/or a fine of up to $10,000. Violations are also subject to civil enforcement actions including civil penalties of up to $5,000 per violation, injunctive relief and mandatory restitution.\nThe law applies to several products and necessities including: food and drink (including food and drink for animals); emergency supplies such as water, flashlights, radios, batteries, candles, blankets, soaps, diapers, toiletries; and building materials, medical supplies such as prescription and nonprescription medications, bandages, gauze, isopropyl alcohol, and antibacterial products.\nIt is also a misdemeanor for a hotel or motel to increase regular rates by more than 10 percent during a declared emergency and for the 30 days following the state of emergency.\nAnyone should be extremely cautious if approached by aggressive agents, adjusters or contractors after a disaster. Most businesses are honest and have good intentions, but there are always bad actors waiting to take advantage of disaster victims.\nWorking as an unlicensed contractor during a state of emergency is a felony. Keep these tips in mind when selecting a contractor:\n\nAsk for proof of licensing such as a pocket license and a second photo ID.\nAlways verify that the license number matches the contractor you are dealing with.\nBeware of scare tactics, odd calls or unsolicited contacts.\nMake sure the contractor carries workers’ compensation and liability insurance.\n\nIn the aftermath of natural disasters, debris-clearing scams often surface. Do not provide payment upfront and be sure to ask where the debris is being taken. Scammers often ask for money up-front and then disappear. Sometimes they dump debris on a neighbor’s property or park, which may cause you to be responsible for the costs and penalties.\nInvestigators from the District Attorney’s Office are assisting inspectors with the County Department of Environmental Health in checking properties that have been impacted by the Valley Fire for environmental hazards prior to residents returning to their property.\nThe District Attorney’s Office has historically played a role in incidents of wildfires, including the San Diego County wildfires of 2003, 2007 and 2014. During those events, investigators from the District Attorney’s Office, the California Department of Insurance, the Contractors State License Board, and the Department of Motor Vehicles fanned out over fire-ravaged areas to warn homeowners to beware of would-be criminals who prey on victims of natural disasters. They posted signs warning unlicensed contractors that operating in a declared state of emergency area is a felony. Our investigators expect to do so again, once the fire is contained.\nYou can report suspected price gouging to the District Attorney’s Consumer Protection Unit at (619) 531-3507, the California Attorney General’s Office or to:\nCalifornia Department of Insurance\n10021 Willow Creek Road, #100\nSan Diego, CA 92131\nHelpline 1-800-927-HELP (4357)\n \nContractors State License Board\n9246 Lightwave Avenue, Suite 130\nSan Diego, CA 92123\nwww.clsb.ca.gov\n1-800-321-2752\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200911.14.26.37"}