{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Three Non-Connected TB Exposures", "description": "The County’s Tuberculosis Control Program is working in close collaboration with the University of California San Diego, Sweetwater Union High School District and the San Diego County Sheriff’s Office to notify people who have been potentially exposed to tuberculosis (TB) in unrelated potential exposures at different sites during different time periods. ", "datePublished": "2024-09-05T14:54:26-07:00", "url": "https://www.countynewscenter.com/county-reports-three-non-connected-tb-exposures/", "keywords": ["health", "east mesa reentry facility", "public health", "sweetwater union high school", "tb", "tb exposure", "tuberculosis", "uc san diego"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-09-05T14:54:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County’s Tuberculosis Control Program is working in close collaboration with the University of California San Diego, Sweetwater Union High School District and the San Diego County Sheriff’s Office to notify people who have been potentially exposed to tuberculosis (TB) in unrelated potential exposures at different sites during different time periods. \nTuberculosis rates in San Diego, California, and the United States, have been rising since 2020.  \nAt UC San Diego, the County is working with university officials to notify students, employees and contractors potentially exposed to TB at UC San Diego’s La Jolla campus during the 2023-24 school year. The school is located at 9500 Gilman Drive in La Jolla. The dates of potential exposure are from July 1, 2023 to March 20, 2024. \nThe County is also working with Sweetwater Union High School District to notify residents, employees, and volunteers potentially exposed to TB at Chula Vista High School at 820 Fourth Ave. in Chula Vista. The dates of potential exposure are from Feb. 23, 2024, to May 22, 2024.   \nAt the East Mesa Reentry Facility, the County Tuberculosis Control Program is working with San Diego County Sheriff’s Office to notify people potentially exposed from Jan. 2, 2024 to June 5, 2024. \nThe diagnosis of tuberculosis can be difficult to establish, and people with TB may be sick for many months before they are diagnosed. As such, periods of exposure can be long. Exposures can be complex and require extensive planning and coordination between sites of exposure and the County TB program. \nTB is an airborne disease that is transmitted from person-to-person through inhalation of the bacteria from the air. The bacteria are spread when someone sick with TB coughs, speaks, sings or breathes. People with frequent and prolonged indoor exposure to a person who is sick with TB should get tested.  \nEffective treatments are available to cure people who are sick from active TB. It is especially important for people with symptoms of active TB and those who are immune compromised to see a medical provider to rule out active TB disease and to discuss treatment.  \n“Symptoms of active TB include persistent cough, fever, night sweats, and unexplained weight loss,” said Ankita Kadakia, M.D., County Interim Public Health Officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with tuberculosis will become ill in the future, sometimes even years later, if their latent TB infection is not treated. For people who think they may have been exposed, blood tests and skin tests are an effective way to determine an infection.” \nPeople who test positive for TB but who don’t have symptoms of an active disease should get a chest x-ray and talk to a medical provider, as they most likely have a latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from getting sick later.  \nThe number of people diagnosed with active TB in San Diego County had decreased since the early 1990s when more than 400 cases were reported annually. After decades of declining, TB cases have begun to rise since 2020. \nIn 2020, there were 193 TB cases, 201 in 2021 and 208 in 2022. In 2023, a total of 243 people were reported with active TB disease in San Diego County. The 17 percent increase in 2023 brought the County back to pre-pandemic levels.  \nAn estimated 175,000 people in San Diego County have latent TB infection. Of these, 5 to 10 percent are at risk for developing active TB disease if they go without preventive treatment.   \nPeople who would like more information on this potential exposure should call the County Tuberculosis Control Program at (619) 692-8621. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240905.14.54.26"}