{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Officials Give COVID-19 Update in Wake of Governor’s “Stay Home” Order", "description": "County officials re-emphasized California Gov. Gavin Newsom’s new coronavirus message a day after he issued a statewide “stay home order to stop the spread of the virus that causes the COVID-19 disease.", "datePublished": "2020-03-20T20:05:31-07:00", "url": "https://www.countynewscenter.com/county-officials-update-covid-19-in-wake-of-governors-stay-home-order/", "keywords": ["health", "coronavirus", "covid-19", "novel coronavirus"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-03-21T08:45:37-07:00", "articleType": "article", "articleContent": "\nCounty officials re-emphasized California Gov. Gavin Newsom’s new coronavirus message a day after he issued a statewide “stay home” order to stop the spread of the virus that causes the COVID-19 disease.\n“The message is very clear,” County Public Health Officer Dr. Wilma Wooten, M.D., M.P.H., said. “All Californians are being asked to stay at home if you do not need to go out for essential reasons.”\nEssential reasons include buying food, picking up medications and even exercising as long as people do so by practicing social-distancing and keeping six feet apart from individuals other than your household members.\nWooten and other County officials also said the number of San Diego County’s COVID-19 cases continues to rise. But they added that everyone in the general public does not need to get tested for the virus.\n“Eighty percent of individuals who get COVID-19 have mild to moderate symptoms,” Wooten said. “Those individuals can isolate and stay home. If they develop more advanced symptoms, they should call their doctor.”\nWooten and Dr. Eric McDonald, M.D., M.P.H., the medical director of the County’s Epidemiology and Immunization Branch, said that 80% recover without incident and their situations would not be changed by being tested. They said coronavirus testing should be reserved for the smaller percentage of individuals who present with severe symptoms and are hospitalized.\nGovernor’s Order\nSupervisor Nathan Fletcher said the County continues working with the state to gain a better understanding of the Governor’s detailed order. Newsom’s order said everyone had to stay home, except people in “essential” jobs, defined by the federal Department of Homeland Security’s “Critical Infrastructure Sectors.”\nFletcher said those generally reflected things like police, fire, utilities, government, grocery stores, banks, hospitals, transit systems and critical businesses like biotech.\nStaying at Home\nFletcher and the doctors said there were exceptions to the stay at home rule that allowed people to shop for groceries and essential household items, as well as engage in physical activity.\n“There are a number of things that are clear you can do,” Fletcher said. “Go to the gas station, go to the pharmacy, go to the grocery store, go to the bank. You can go outside for a walk. You can take your family unit who you live with in your home … and go to a field or an open park for play. You can use all the technology we have to stay connected to your loved ones and friends who are around you.”\nCounty Public Health Orders Remain in Place\nHowever, Fletcher and Wooten also said people — even those in essential services — had to continue to follow the public health orders:\n\nPeople are encouraged not to gather in groups of any size unless it’s absolutely necessary.\nDay care must be limited to groups of up to 10 children in the same room and must remain in the same group each day with the same staff person.\nPeople 65 years of age and older, or anyone who has a chronic underlying condition or who is immunocompromised, should stay home.\nHospitals must conserve resources and delay non-emergency surgeries and elective procedures.\n\nBusiness ordered closed include:\n\nBars and adult-entertainment establishments that serve alcohol and not food;\nRestaurants must close dining-areas, but may serve food for take-out, drive-through, or delivery;\nSchools; and\nGyms and fitness centers.\n\nSocial Distancing to Flatten the Curve \nGov. Newsom’s order came as public health officials around the globe have been urging people to “flatten the curve” of the novel coronavirus by staying home and keeping six feet away from others. That would keep the virus from racing through populations, making everyone sick in a huge spike that could overwhelm hospitals and healthcare systems.\nPeople can practice social distancing by staying at home — parents working remotely and students taking classes on line. Businesses should also practice social distancing by keeping employees and customers at least six feet apart, if in an essential job, as well as working remotely, if possible.\nPeople can go out to get food or other essentials, assist a family member or friend, get medical attention, pick up medications, or go to work as an “essential” employee.\nLocal COVID-19 Cases\nThrough 5 p.m. Friday, the County total number of confirmed COVID-19 cases increased to 131 — up by 26 from Thursday — with no deaths.\nOf the 131 cases 110 were San Diego County residents and 10 were non-residents. Cases under federal quarantine also increased to 11, up by three from Thursday.\nEighty-three of the 131 cases were people between the ages of 20 and 49; 14 were between 50 and 59; and 32 were 60 or older. The County’s daily coronavirus in San Diego webpage now also breaks down the number of cases by city and unincorporated communities.\nWhat Everyone Can Do to Minimize Chances of Getting COVID-19\nPeople can help limit the spread of infection, by taking these steps:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nGet COVID-19 Info Via Text\nCounty residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system. The system allows County health officials to send real-time information about COVID-19 in the region. To sign up to receive the messages, text COSD COVID19 to 468-311. The system was set up to let County public health officials issue information and instructions on changes related to COVID-19 in the region.\nIf you have individual questions, please talk to your health care provider. For community resources, please call 2-1-1 San Diego or visit 211sandiego.org or the County’s Coronavirus Disease webpage.\n\n\n\n\nWe’re live at the County Operations Center with another update on the coronavirus. For updates, visit coronavirus-sd.com or text COSD COVID19 to 468-311.\nPosted by County of San Diego – Government on Friday, March 20, 2020\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200320.20.05.31"}