{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Enhancing Emergency Medical Services Throughout the County of San Diego", "description": "A three-stage plan to implement a range of paramedic-based community health initiatives will improve emergency medical services in rural areas. The Board of Supervisors received an update on what is in place now and what will soon be launched.", "datePublished": "2023-05-31T16:53:08-07:00", "url": "https://www.countynewscenter.com/enhancing-emergency-medical-services-throughout-the-county-of-san-diego/", "keywords": ["public safety", "cal fire", "community health and injury prevention program", "community paramedicine", "county fire", "emergency medical services", "hands-only cpr", "in-home medical support", "nurse practitioners", "physician assistants", "reducing health disparities", "rural communities", "stop the bleed", "telehealth", "triage to alternate destination", "virtual medical visit"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-06-01T08:36:57-07:00", "articleType": "article", "articleContent": "\nA three-stage plan to implement a range of paramedic-based community health initiatives will improve emergency medical services in rural areas. The Board of Supervisors received an update on what is in place now and what will soon be launched.\n \nThe first phase began in 2021 and includes County Fire’s Community Health and Injury Prevention Program. County Fire, Emergency Medical Services and CAL FIRE are reaching hard-to-serve populations and reducing health disparities in our backcountry where many residents are older, lower income, and often speak a language other than English. Trainings are offered to residents to increase survival rates during emergency medical incidents. Hands-only CPR and Stop the Bleed interventions can be critical in the moments before paramedics arrive at an emergency. \n \nIn the Mountain Empire community, County Fire paramedics and nurses will soon work with patients recently discharged from Sharp Grossmont Hospital to provide in-home medical support, in concert with their primary care physicians. This program is a partnership with the Grossmont Healthcare District and the County Health and Human Services Agency to better support vulnerable residents in our rural communities by reducing hospital readmissions. \n \nThe Community Paramedicine and Triage to Alternate Destination model is the second phase of the plan and will offer Emergency Medical Services agencies opportunities to better serve residents in the field with additional services.\n \nUnder the Community Paramedic model, specially trained paramedics may offer case management for frequent 911 users or public health collaboration for tuberculosis patients. The second phase also includes Triage to Alternate Destination. Under this new state plan, medically stable patients could be transported not to an emergency department, but instead go to a behavioral health facility or a sobering center.\n \nThe Board also received an update on emerging best practices that can fully support residents’ needs. Telehealth offers paramedics the ability to connect with patients in a virtual medical visit in the future. Paramedics may be able to assist a doctor who is providing direction virtually and perform physical assessments that matches each patient with the most appropriate level of medical care. Plans to extend the services could soon include paramedics, nurse practitioners or physician assistants helping with minor wound care, prescriptions and possibly vaccinations.\n \nAll three phases of these health-focused plans can provide much-needed support to our district residents who are often far from traditional medical services and at the same time reducing health disparities for district residents. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230531.16.53.08"}