{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Eases Restrictions on Private Gatherings", "description": "New state guidance allows private gatherings of up to three households. They must take place outdoors. The new guidance goes into effect in San Diego County Saturday.", "datePublished": "2020-10-09T19:30:31-07:00", "url": "https://www.countynewscenter.com/state-eases-restrictions-on-private-gatherings/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2020-10-10T08:28:42-07:00", "articleType": "article", "articleContent": "\nThe state released new guidance Friday that allows private gatherings of up to three households. The new guidance goes into effect in San Diego County Saturday.\nThe gatherings must take place outdoors. If at someone’s home, guests may go inside to use a bathroom.\nAny interaction with others increases the risk of transmitting COVID-19. The smaller the gathering, the lower the risk. The new guidance recommends keeping the households you gather with stable over time.\nParticipants in a gathering need to stay at least six feet apart from non-household members and wear face coverings in accordance with state guidance. Gatherings should be kept to two hours or less.\nAnyone with COVID-19-like symptoms should stay home. If you attend a gathering and develop COVID-19 symptoms within 48 hours of a gathering, you should notify everyone who was there.\nThose in a high-risk group, such as older adults and people with chronic medical conditions, are strongly urged not to attend gatherings.\nSee complete guidance\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201009.19.30.31"}