{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s New District Boundaries Take Effect", "description": "More than 1 million San Diego County residents ― three out of every 10 ― woke up Saturday in a new supervisorial district. People can now see the new map online and use a built-in search bar to find out what district they live in.", "datePublished": "2022-01-18T13:40:13-08:00", "url": "https://www.countynewscenter.com/countys-new-district-boundaries-take-effect/", "keywords": ["government", "redistricting", "redistricting commission", "supervisorial districts", "voting"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-01-18T13:55:55-08:00", "articleType": "article", "articleContent": "\nMore than 1 million San Diego County residents ― three out of every 10 ― woke up Saturday in a new supervisorial district.\nThe boundaries of their County districts were revised by an independent redistricting commission that worked for a year with public input.\nPeople can see the new map and use a built-in search bar to find out what district they live in. Type in your address in the “find address or place” bar and the map will pin your location. Clicking the zoom out sign on the map will expand the map until you see the district boundaries and the County district your address is located in.\nThe general differences between the old boundaries set in 2011 and the new ones can be seen in the map below. The old boundaries are outlined in blue; the new boundaries are depicted by different colors for each district.\n\nRedistricting, the redrawing of political voting boundaries, is done every 10 years using U.S. Census data to ensure that voting districts have roughly equal numbers of people, while reflecting “shifting populations and demographics.”\nThis redistricting was the first for the County to be done by an independent commission rather than by the County Board of Supervisors. The 14-member Independent Redistricting Commission worked for more than a year, held 49 regular and special meetings, including 10 public hearings, throughout the County and in each of the County’s five supervisorial districts, to create and approve the new maps.\nThe new maps of the districts the commission submitted to the County Dec. 15 became final Jan. 15 after a 30-day referendum period, setting the new voting and jurisdictional boundaries for the next 10 years.\nIn consultation with the County Registrar of Voters, on Jan. 12, the commission approved in principle minor technical changes to the final map that shifted 23 unpopulated census blocks from one district to another to facilitate the implementation of the plan for elections. The adjustments had no impact to population of the districts or the intent of the plan.\nThe commission’s report states that the new redistricting maps meet all legal requirements. Those include maintaining substantially equal population in each district, complying with the federal Voting Rights Act that prohibits racial discrimination in voting and respecting the geographic integrity of city, local neighborhood or communities of interest, to the extent practicable.\nThe new map divides only one of the county’s 18 cities ― the City of San Diego, which, with more than 1.38 million people, is too populous for a single County district. The new district populations range in size from 636,285 people in District 2 to 689,991 in District 5.\nThe new map includes one supervisorial district that is a majority Latino district, District 1, currently represented by Supervisor Nora Vargas, with 61.4% of the total population identified as Hispanic/Latino. In general, District 1 includes the cities of Chula Vista, Imperial Beach and National City, portions of the City of San Diego, and unincorporated areas including the communities of Bonita and La Presa, Spring Valley, Sweetwater and Otay.\nDistrict 2, currently represented by Supervisor Joel Anderson, generally includes the cities of Poway, Santee and El Cajon, portions of the City of San Diego, and 20 unincorporated communities including Alpine, Boulevard, Campo, Jacumba, Jamul, Julian, Lakeside, Pine Valley and Ramona.\nDistrict 3, currently represented by Supervisor Terra Lawson-Remer, generally includes the cities of Coronado, Del Mar, Solana Beach, Encinitas and Carlsbad, parts of the City of San Diego and unincorporated communities including Elfin Forest, Fairbanks Ranch, Harmony Grove and Rancho Santa Fe.\nDistrict 4, currently represented by Supervisor and Board of Supervisors Chair Nathan Fletcher, generally includes the cities of Lemon Grove and La Mesa, parts of the City of San Diego, and unincorporated communities including Casa De Oro-Mount Helix, Rancho San Diego and Spring Valley.\nDistrict 5, currently represented by Supervisor Jim Desmond, generally includes the cities of Escondido, San Marcos, Oceanside and Vista, and 10 unincorporated communities including Bonsall, Borrego Springs, Fallbrook, Rainbow and Valley Center.\nAt their next meeting on Jan. 26, the commission will finalize the resolutions incorporating the technical adjustments to redistricting map and final report  approved on Jan. 12.\nTo see the Independent Redistricting Commission’s final report and maps, go to the commission’s website at www.drawyourcommunity.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220118.13.40.13"}