{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Flood Victims Should Watch for Mold", "description": "Flooding from Monday’s torrential storms was bad enough, but now residents cleaning up their damaged homes face the threat of mold.", "datePublished": "2024-01-27T08:46:48-08:00", "url": "https://www.countynewscenter.com/flood-victims-should-watch-for-mold/", "keywords": ["public safety", "flood", "flood recovery", "flood victims", "jan. 22", "jan. 22 severe storm", "mold", "mold cleanup tips"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-01-27T08:53:44-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteFlooding from Monday’s torrential storms was bad enough, but now residents cleaning up their damaged homes face the threat of mold.\nThe longer materials stay wet, the more likely mold will grow. It takes only two to three days for mold to form.\nMold can pose health problems, especially for young children, seniors and those who are already ill. Long-term exposure can affect anyone.\nTo take care of it, flood-impacted residents can hire a licensed mold remediation contractor with special training and equipment, or they can work to get rid of mold themselves.\nIn either case, take pictures of the damage for insurance purposes before cleanup begins.\nIf you plan to handle the job yourself, here are some tips to keep in mind:\n\nWear protective gear such as gloves, goggles and a respirator rated N-95 or higher.\nSeal off moldy areas from the rest of the house and keep it well ventilated.\nPut moldy porous materials like flooded carpeting, upholstery, fabrics and mattresses into plastic bags and throw them away.\nRemove wet fibrous insulation even if the wall board appears dry. Cut the wall covering above the water line because moisture can seep up.\nClean and disinfect non-porous materials like hard plastic, concrete, glass, metal and solid wood with non-phosphate all-purpose cleaners. Cleaning alone will remove the mold but not kill it. Dead spores can still be a problem so disinfect after cleaning.\nTo make disinfectant, mix one cup of household bleach with one gallon of water. Never mix bleach with ammonia.\nAfter cleaning and disinfecting, air out the building.\n\nFor more details on cleaning up mold, visit the Alert San Diego’s recovery page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240127.08.46.48"}