{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Encouraged to Get Tested for COVID-19", "description": "Given that people without symptoms can transmit the novel coronavirus, San Diegans should get tested for COVID-19, the County Health and Human Services Agency announced today.", "datePublished": "2020-06-04T17:46:35-07:00", "url": "https://www.countynewscenter.com/san-diegans-encouraged-to-get-tested-for-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "testing", "unsymptomatic"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-05T08:31:52-07:00", "articleType": "article", "articleContent": "\nGiven that people without symptoms can transmit the novel coronavirus, San Diegans should get tested for COVID-19, the County Health and Human Services Agency announced today.\n“Since we can’t be sure who is contagious, people should get tested even if they’re asymptomatic to make sure they’re not positive and infecting others,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nResidents without symptoms wishing to get a COVID-19 test should check first with their health care provider. They can also get tested at a state or County site where tests are administered for free.\nPeople showing symptoms of COVID-19 should contact their health care provider and arrange for testing. If you don’t have a health care provider, call 2-1-1 and ask for a public health nurse who will give you a referral.\nEveryone who wants to get tested needs an appointment.\n\nFor County site appointments, call 2-1-1.\nFor state sites, make an appointment online or call 888-634-1123. State sites are in Escondido, El Cajon, Chula Vista, San Ysidro and Southeastern San Diego.\n\nCAL FIRE and the San Diego County Fire Authority continue to schedule free testing in rural communities through 2-1-1.\nDrive-up testing sites will be available from 9 a.m. to 2 p.m. in five communities. An appointment is necessary, and you can make one by calling 2-1-1. The sites will be on:\nJune 5:             San Diego County Library, 3407 Hwy 78, Julian, CA 92036\nJune 6:             CAL FIRE Monte Vista HQ, 2249 Jamacha Rd., El Cajon, CA 92019\nAll are diagnostic tests, which take about 5-10 minutes. Results generally come back in 3-5 days.\nIf you make an appointment for a COVID-19 test in any location, it’s important that you keep it so that the spot does not go unused.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n3,714 tests were reported to the County on June 3 and 142 or 4% were positive.\n2.9% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n142 new cases were reported for a San Diego County total of 7,940.\n1,383 or 17.4% of the total cases have required hospitalization.\n395 or 5% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nFive new COVID-19 deaths were reported today, bringing the region’s total deaths to 288.\nFour men and one woman died, and their ages ranged from 38 to 91 years.\nFour had underlying medical conditions and one did not.\n\nThe number of active outbreaks, deaths and cases are:\n\n57 active outbreaks; 44 at congregate living facilities and 13 in community settings.\n19 outbreaks with 796 cases, including 78 deaths in skilled nursing facilities.\n25 outbreaks with 802 cases, including 60 deaths in other congregate settings.\n13 outbreaks with 353 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. The County also publishes the Weekly Coronavirus Disease Surveillance Report. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200604.17.46.35"}