{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Invites you to Check Your Mood ", "description": "When was the last time you asked yourself “How are you feeling?” It’s something we ask others all the time but less often do we ask the same of ourselves. The County’s Check Your Mood Day is an opportunity to do just that. ", "datePublished": "2024-10-10T12:37:09-07:00", "url": "https://www.countynewscenter.com/county-invites-you-to-check-your-mood/", "keywords": ["health", "behavioral health and substance use disorder", "check your mood", "county behavioral health", "depression", "feeling sad", "mental health"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-10-10T15:13:17-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesWhen was the last time you asked yourself “How are you feeling?” It’s something we ask others all the time but less often do we ask the same of ourselves. The County’s Check Your Mood Day is an opportunity to do just that. \nEvery year during Mental Illness Awareness Week, the County invites the community to get screened for depression and assess their mental health as part of Check Your Mood Day, celebrated the first Thursday of the first full week of October on National Depression Screening Day. This year’s local observance is Oct. 10.   \nA quick online self-assessments   is a simple way to check whether you are experiencing normal levels of stress. While these assessments are not diagnostic, they are a great way to help monitor your mood and overall emotional well-being. \n“Checking in on your mental health is just as important as getting your blood pressure checked or seeing your doctor for an annual physical,” said Luke Bergmann, Ph.D., director of the County Behavioral Health Services. “Check Your Mood Day is a great reminder that mental health plays a critical role in overall wellness. It’s an opportunity to take a moment to become more aware of how you’re feeling and evaluate whether some of the things you may be experiencing like poor appetite, having a hard time concentrating or having low energy are connected to emotional distress. If that’s the case, there are steps people can take to get support for their mental health.” \nPeople who experience mental illness like depression are not alone. The Department of Health and Human Services says one in five adults in the United States experiences a mental illness each year. \nDespite how common it is, many people do not know what they are experiencing is a mental illness. Others suffer in silence out of fear of being stigmatized. \nSymptoms of depression vary but include lack of energy, sadness, loss of interest in activities that previously brought joy, and trouble falling asleep or staying asleep.  \nWays to Feel Better \nResources are available to help people experiencing a mental health challenge that can affect thinking, emotions, behaviors or mood.    \nThe County’s 30-Day Mental Wellness Practice, is a free and friendly way to engage in daily self-care activities like developing a nighttime routine, trying a new recipe, calling a loved one, doing a one-day digital detox, coloring or watching the sunset. \nIf you or someone you know is experiencing a mental health challenge, call the San Diego Access and Crisis Line at 1-888-724-7240 or 988. Calls are answered 24 hours a day, seven days a week by experienced counselors, and offer help in more than 200 languages. \nThe County’s Up2SD.org and OwnYourMindset.org websites also have resources for adults and youth to take control of their mental health.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241010.12.37.09"}