{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Employees Honor Abandoned Veteran at Final Resting Place ", "description": "An average day for Tiffany Tsai usually includes some time spent leafing through case files at her desk in the County of San Diego’s Public Administrator’s Office. It is not every day that she is at Miramar National Cemetery accepting a folded flag for a three-time purple heart recipient, but on a recent late February morning that was exactly what she was doing. ", "datePublished": "2023-03-22T12:08:56-07:00", "url": "https://www.countynewscenter.com/county-employees-honor-abandoned-veteran-at-final-resting-place/", "keywords": ["veterans", "miramar national cemetary", "purple heart", "veteran"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-03-22T12:27:25-07:00", "articleType": "article", "articleContent": "\nAn average day for Tiffany Tsai usually includes some time spent leafing through case files at her desk in the County of San Diego’s Public Administrator’s Office. It is not every day that she is at Miramar National Cemetery accepting a folded flag for a three-time purple heart recipient, but on a recent late February morning that was exactly what she was doing. \n\nHow she came to be there started days earlier when Tsai saw Sgt. William Wilson’s case file. She was impressed by the honors noted in the file and the fact that Sgt. Wilson returned to combat three times even after injuries. \n“I thought it was incredible,” said Tsai, who has been in her position for 8 years. “You hear about a few purple heart recipients here and there but to recover from injuries and return to fight in the Army three times? That is the definition of service above self.”  \n\nTsai learned that Sgt. Wilson had served in the U.S. Army from 1967-1974, including serving in Vietnam. “I feel most Vietnam Veterans really had it hard,” she said.  \nPart of Tsai’s job at the Public Administrator’s Office is to find next of kin for abandoned or homeless veterans after they pass on. Sgt. Wilson was 72 when he died of natural causes in his Oceanside senior living residence. He didn’t leave much behind. She found his parents had passed, he had no known siblings, wasn’t married and had no known children. \n\nDespite not having next of kin, Tsai thought it vital he receive the honors he earned in service to his country. To ensure Sgt. Wilson received proper honors, she arranged his burial at Miramar National Cemetery. Partridge Creek Mortuary worked with the County’s Public Administrator’s office to provide a beautiful casket at a discount. Additionally, two volunteers donated the funds for a horse-drawn carriage to take Wilson to his final resting place.\n\nPatriot Guard Riders carried his casket and military members dressed in their blues folded the flag. They handed the flag to Tsai.  \n“We’re here to take care of our neighbors and ensure they are treated the same way we would want our family treated, all the way to their final resting place,” she said. \nTwo of her coworkers, Beatriz Blevins and Margarita Brokaw, made it a priority to attend as well.  \n\nTsai still has Sgt. Wilson’s flag, displayed neatly on her desk and considers it a privilege to have done her small part in honoring Sgt. Wilson’s service. \nThe Public Administrator‘s Office handles estates of people who die with no will or without an appropriate person to act as an administrator. They protect the person’s property from waste, loss or theft and ensure their wishes regarding their disposition and belongings are followed after passing. Each year the Public Administrator’s Office handles approximately 2,259 cases on average. Additionally, the office receives an average of 1,185 referrals each year. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230322.12.08.56"}