{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "All Aboard: APCD Helps Coaster Train Riders Improve Air Quality", "description": "Thanks to a helping hand from the County’s Air Pollution Control District, train riders on the North County Transit District’s Coaster line are doing more to keep climate-changing, polluting greenhouse gases out of our air.", "datePublished": "2021-02-17T10:53:35-08:00", "url": "https://www.countynewscenter.com/all-aboard-apcd-helps-coaster-train-riders-improve-air-quality/", "keywords": ["environment", "air quality", "apcd", "clean air for all", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-02-17T10:53:35-08:00", "articleType": "article", "articleContent": "\nThanks in part to a helping hand from the County’s Air Pollution Control District, train riders on the North County Transit District’s Coaster line are doing more to keep climate-changing, polluting greenhouse gases out of our air.\nLast week, NCTD, federal and local officials including County Board of Supervisors Chairman Nathan Fletcher introduced five new, cleaner-running, Coaster replacement locomotives paid for by a $10 million grant from the Air Pollution Control District and $46 million in state funding.\nNCTD officials who introduced the new locomotives along with several renovated Coaster passenger cars said they would increase service reliability, improve riders’ experience and be more environmentally friendly.\nAir Pollution Control District officials estimate the replacement locomotives will improve air quality each year by preventing the emission of 144 collective tons of greenhouse gases and pollution into local skies.\nThat will include 124.3 tons of nitrogen engine emissions (NOx) that react in the atmosphere to create ozone, 12.58 tons of reactive organic gases (ROG) that also affect ozone production, and 6.92 tons of diesel particulate matter (PM) — small particles of carbon-like soot. The Environmental Protection Agency says that in addition to polluting the air, greenhouse gases trap heat, make the planet warmer and contribute to climate change.\nThe Air Pollution Control District’s contribution came from Carl Moyer grants, a program the state created in 1998 to help reduce pollution and toxic emissions.\nThe grants, which have become part of the County’s Clean Air for All campaign, are used to reimburse selected businesses, local governments, schools and utilities for swapping out high-polluting, heavy-duty equipment for low-polluting or zero-polluting vehicles, boats, transportation and machinery.\nIn August, the Air Pollution Control District selected projects from 49 organizations to be eligible to receive $21.3 in grants funded by California’s Air Resources Board and Department of Motor Vehicles that would eliminate 692 tons of greenhouse gas and pollution out of local skies.\nOrganizations must sign contracts to start their projects and are reimbursed once their projects are completed.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210217.10.53.35"}