{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Face Coverings Protect Others and You", "description": "Research has shown that when face coverings are used properly, they reduce transmission of the novel coronavirus, which causes COVID-19.", "datePublished": "2020-05-28T08:48:04-07:00", "url": "https://www.countynewscenter.com/face-coverings-protect-others-and-you/", "keywords": ["health", "coronavirus", "covid-19", "face coverings", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-28T08:59:56-07:00", "articleType": "article", "articleContent": "\nAre you wearing a face covering when out and around others? If not, you should.\nResearch has shown that when face coverings are used properly, they reduce transmission of the novel coronavirus, which causes COVID-19.\nFace coverings are important because people can have COVID-19 and transmit the virus, but not have any symptoms.\n“Since we can’t be sure who is contagious, the best protection is to have everyone two years and older cover their face,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nWhen you wear a face covering, you protect those around you. When others use a face covering, they protect you.\nThe County’s local Health Officer Order requires San Diegans to wear a face covering when in public and less than six feet from others, or any time they enter a business, except when its use is prevented by a medical condition.\nFace coverings “disrupt the trajectory of a cough, sneeze or breath” preventing droplets carrying the virus from traveling between people, according to the Centers for Disease Control and Prevention. The CDC recently updated its guidance to note that the virus spreads very easily between people, even more so than influenza.\nThe strategy is most effective when compliance is high. Countries that recommend or require their citizens to wear face coverings in public have been shown to be more successful in their response to the COVID-19 pandemic. Also, see Face Masks Against COVID-19: An Evidence Review.\nThe cloth face coverings, which will be required until further notice, don’t have to be hospital grade. N-95 respirators and surgical masks should be reserved for health care workers. But they should cover the nose and mouth.\nHomemade masks, bandanas, scarves and neck gaiters are acceptable, since these items can be washed and reused. Facial coverings don’t need to be used when people are at home.\nThe CDC indicates cloth face coverings should:\n\nFit snugly but comfortably against the side of the face\nBe secured with ties or ear loops\nInclude multiple layers of fabric\nAllow for breathing without restriction\nBe able to be laundered and machine dried without damage or change to shape\n\nSan Diegans are required to wear a facial covering while in public and close to other people.\nWhere to Wear a Face Covering\n\nFace coverings must be worn in public settings, such as:\nWaiting in line to go inside a store\nShopping in a store\nPicking up food at a restaurant\nWaiting for or riding on public transportation\nRiding in a taxi or ride service vehicle\nSeeking health care\nGoing into facilities allowed to stay open\nWorking an essential job that interacts with the public\n\nFace coverings will be required in public until further notice.\nFace coverings are not required:\n\nAt home\nIn the car alone or with members of the same household\nWhen advised by a medical doctor\nFor children under 2 years old due to the risk of suffocation\nWhen swimming, walking, hiking, bicycling or running provided there is social distancing\n\nPeople who choose not to wear face coverings may be cited and denied access to businesses, transit or recreational areas.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200528.08.48.04"}