{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Are Encouraged to Keep Vaccination Numbers Trending Up", "description": "San Diegans are continuing to get vaccinated against COVID-19 and the flu, and the supplies and availability of both vaccines remain plentiful this holiday season.", "datePublished": "2022-11-17T16:29:19-08:00", "url": "https://www.countynewscenter.com/san-diegans-are-encouraged-to-keep-vaccination-numbers-trending-up/", "keywords": ["health", "coronavirus", "covid-19", "flu", "influenza", "vaccinations"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-11-17T16:29:19-08:00", "articleType": "article", "articleContent": "\nSan Diegans are continuing to get vaccinated against COVID-19 and the flu, and the supplies and availability of both vaccines remain plentiful this holiday season.\nIn the last week, 38,753 COVID-19 vaccinations and 63,149 flu shots have been administered.\nAs of Nov. 17, 2022, close to 2.69 million or 80.3% of San Diegans have received the primary series of one of the approved COVID-19 vaccines. Boosters have been administered to 1,495,492 or 60% of 2,491,808 eligible San Diegans.\nOf those with boosters, the County is now tracking separately COVID-19 bivalent boosters. As of Nov. 17, 2022, 15.1 percent of eligible San Diegans have received a bivalent booster.\nAs of Nov. 12, 2022, 813,065 San Diegans have received a flu vaccination, which is 24.3 percent of the 3,351,784 eligible. This year’s flu shot uptake is slightly higher when compared to the same time last year when 23 percent of the eligible population had received a flu vaccine.\nIt takes about two weeks after vaccination until the body develops sufficient immunity against both vaccinations.\n“I want to congratulate all of those who have recently been vaccinated against the flu or COVID-19, including those newly boosted, and encourage the community to help us improve on that progress,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Don’t let flu or COVID-19 ruin your family reunions this holiday season. You have the ability to protect yourself, your family, and your community.”\nCOVID-19 and flu vaccines are widely available across the region at pharmacies, medical centers and clinics. The two vaccines can be administered during the same visit. It is important to note that the COVID-19 primary vaccine series or booster does not protect against the flu and the flu vaccine does not protect people against COVID-19. Therefore, it is recommended that eligible San Diegans get vaccinated against both viruses.\nThere is no vaccine against respiratory syncytial virus (RSV), but established disease prevention measures can protect people from getting ill with any of the multiple respiratory viruses now circulating in the community.\nThese measures include:\n\nConsider a well-fitting, good-quality mask, especially indoors or in crowded spaces.\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nStay home and avoid contact with others, if you are sick.\n\nCOVID-19 Vaccination Progress:\n\nClose to 2.69 million or 80.3% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBoosters administered: 1,495,492 or 60% of 2,491,808 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nCOVID-19 Deaths:\n\n14 additional deaths were reported since the last report on Nov. 10, 2022. The region’s total is 5,557.\nOf the 14 additional deaths, seven were women and seven were men. They died between July 16, 2022 and Nov. 4, 2022. Three of the newly reported deaths occurred in the last two weeks.\nSeven of the people who died were 80 years or older, four were in their 70s and three were in their 60s.\n12 received at least the primary series of the vaccine and two had not.\n13 had underlying medical conditions and one has medical history pending.\n\nCOVID-19 Cases, Case Rates and Testing:\n\n2,298 COVID-19 cases were reported to the County in the past seven days (Nov. 8 to Nov. 14, 2022). The region’s total is now 935,554.\nThe 2,298 cases reported in the past week were higher compared to the 2,016 infections identified the previous week (Nov. 1 to Nov. 7, 2022).\n5,153 tests were reported to the County on Nov. 12, and the percentage of new positive cases was 5.3% (Data through Nov. 12).\nThe 14-day rolling percentage of positive cases, among tests reported through Nov. 12, is 4.3%.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Nov. 12, 2022, the report shows the following:\n\nNo additional flu deaths, the season’s total remains at 2\nEmergency department visits for influenza-like illness: 10% of all visits (compared with 9% the previous week)\nLab-confirmed influenza cases for the week: 2,361(compared to 1,754 the previous week)\nTotal lab-confirmed cases to date: 7,854 (compared to 314 at the same time last season and a 306 prior 5-year average during the same week)\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221117.16.29.19"}