{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Recognizes World Elder Abuse Awareness Day ", "description": "World Elder Abuse Awareness Day is observed June 15 and highlights the importance of building strong support for elders. It is meant to bring people together to identify, address and prevent abuse.", "datePublished": "2024-06-14T11:51:16-07:00", "url": "https://www.countynewscenter.com/county-recognizes-world-edler-abuse-awareness-day/", "keywords": ["health", "adult protective services", "elder abuse", "elder abuse awareness day"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-06-14T13:20:18-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesElder abuse can affect anyone, but everyone can be part of the solution.  \nWorld Elder Abuse Awareness Day is observed June 15 and highlights the importance of building strong support for elders. It is meant to bring people together to identify, address and prevent abuse.  \nAs many as one in 10 older adults living at home have experienced abuse, including neglect, according to the Centers for Disease Control and Prevention. \nLocally, County Adult Protective Services processed more than 24,000 reports of elder abuse in fiscal year 2022-2023, which is a 19% increase over the previous year. The number of reports this fiscal year, which ends this month, is also trending upward and expected to rise by 17% over last year.  \nSocial isolation and loneliness can make older adults more vulnerable to abuse. Those most at risk can also include minorities including immigrants and members of the LGBTQ+ community and older adults who have been victims of mistreatment.  \nThere are things everyone can do help prevent elder abuse: \n\nCheck in on the older adults in your life, including family members, friends and neighbors.  \nRegardless of your age, make new connections with older adults in your community to help prevent isolation which can be a risk factor for abuse. \nLearn about the signs of abuse including confusion or being withdrawn, isolation, unexplained injuries, appearing underfed, over or under-medicated and recent changes in spending patterns. \nShare about elder abuse with your friends and family via social networks to spread awareness. \nProvide or find resources for respite care for caregivers.  \n\nSome people who experience elder abuse may be reluctant to report it for a variety of reasons. These include feeling embarrassed, like they are somehow to blame, worried about getting the perpetrator in trouble or being unaware that what they are experiencing is abuse or neglect.  \nIf you know or believe an older adult is experiencing abuse, report it to County Adult Protective Services by calling 800-339-4661 or if a life-threatening situation is happening, call 9-1-1.  \nOn Saturday, the County will light the County Administration Center building purple in recognition of World Elder Abuse Awareness Day. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240614.11.51.16"}