{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Unveils a New Logo", "description": "You may have noticed something new on the County’s social media or during budget hearings — a new logo reflecting diverse community input and the County’s values and commitment to service.", "datePublished": "2023-07-03T12:48:34-07:00", "url": "https://www.countynewscenter.com/county-unveils-a-new-logo/", "keywords": ["government", "county logo", "county seal"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-07-03T12:49:59-07:00", "articleType": "article", "articleContent": "\nYou may have noticed something new on the County’s social media or during budget hearings — a new logo reflecting diverse community input and the County’s values and commitment to service.\nThe new logo was created by County designers, shaped by public and internal surveys, focus groups, and selected from more than 100 options by hundreds of people. Those people represented more than 150 diverse sectors including education, healthcare, private business, our own employees and many others.\nCollaboration. Connection. Community. Diversity. Sunshine. Beaches. Mountains.\nThese are just a few of the frequently heard words shared by this group to describe the County of San Diego.\nAccess. Belonging. Equity. Excellence. Integrity. Sustainability.\nThe concepts coupled with values at the center of the County of San Diego’s General Management System led to the creation of the winning design.\nThe Design\nThe iconic downtown San Diego County Administration Center is featured surrounded by elements of San Diego’s renowned natural environment, with sea, sand, mountains, and green spaces. The building represents the foundation for the programs and services provided to the community while the surrounding elements and colors are a nod to the County’s rich natural and welcoming environment.\nA mix of blue, greens, greys and orange colors come together in motion to represent new energy.\n\nThe blue colors of the sky and curved ocean waves represent open spaces, peace, and tranquility, but also symbolize trust and responsibility.\n\n\nThe soaring seagull represents freedom and fearlessness, as a nod to the County’s quest for innovation and resourcefulness.\nThe orange color of the shoreline wraps around the building to symbolize security, optimism and new energy.\n\nThe logo is meant to complement the County seal which has been in use since 1937. The County seal will continue to be used for formal official communications documents.\nLearn more about the new logo.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230703.12.48.34"}