{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "All Local Law Enforcement Agencies to Refer Calls to County Mobile Crisis Response Teams", "description": "County behavioral health officials, law enforcement representatives and community partners today announced that all of the region’s 911 dispatchers have signed on to a memorandum of understanding to refer certain mental health calls to the County’s Mobile Crisis Response Teams.", "datePublished": "2022-05-12T15:00:32-07:00", "url": "https://www.countynewscenter.com/?p=208497", "keywords": ["health", "behavioral health", "mcrt", "mobile crisis response teams"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-05-12T15:03:50-07:00", "articleType": "article", "articleContent": "\nCounty behavioral health officials, law enforcement representatives and community partners today announced all of the region’s 911 dispatchers have signed on to a memorandum of understanding to refer certain mental health calls to the County’s Mobile Crisis Response Teams.\nMCRTs began in January 2021 as a pilot in the North County. Since then, the non-law enforcement program has expanded countywide and responded to 1,277 referrals: 1,099 through the County’s Access and Crisis Line and 178 through referrals from law enforcement. The service also expanded in April to offer in-person response 24 hours a day.\nOf the 1,277 calls received:\n\n47% were about people who were able to be stabilized in the community and referred to treatment services\n22% of people were transported to crisis behavioral health treatment services, such as a crisis stabilization unit\n13% of the people declined services\n18% were people who needed more acute intervention (such as going to an emergency department), people who could not be located or canceled calls while MCRT was en route\n43% were white, 30% were Hispanic, 10% were Black, 6% were Asian/Pacific Islander and 9% were other, mixed or unknown ethnicity\n\nOf those MCRT has served, approximately 20% were people experiencing homelessness.\nWhat do MCRTs Do?\nThe Mobile Crisis Response Teams provide non-law enforcement, community-based crisis response. The Teams provide crisis intervention, triage and connection to appropriate behavioral health services.\nMCRT County contractors are Exodus Recovery, Inc. and Telecare, they initially received referrals from the Access and Crisis Line, Chula Vista and National City police departments. Now, all other law enforcement agencies have agreed to refer calls, including the Sheriff’s Department.\n“As a County we have continued to work to better address the mental health needs and crisis that we face in our street,” Board of Supervisors Chair Nathan Fletcher said at a news conference outside the County Administration Center. “We are incredibly grateful that this is a regional response. Our entire region is committed to doing things differently and to figure out how we can do more.”\nMobile Crisis Response Teams are for people experiencing a mental health or substance use crisis. Calls about people who are a threat to themselves or others are handled by law enforcement who are better suited to manage the situation.\n\n“When someone is experiencing a behavioral health crisis, our teams of clinicians, case managers and peer staff who are trained to respond to a behavioral health crisis meet the person in the community where they live,” said Christian Hodges, clinical director at Telecare. “We know how to deescalate the situation, connect with them on a personal level, and provide them with the care and services they need to improve their circumstances.”   \n\nThe teams of behavioral health experts offer non-law enforcement intervention whenever possible. They travel to the patients to assess the individual’s condition, expedite medication, connect them to support services including food and shelter and even provide transportation.\n“The ability to offer the community a non-law enforcement, clinician-led, behavioral health crisis response benefits the community, individuals and families who need assistance in a crisis,” said Dr. Piedad García, deputy director of Behavioral Health Services at the County Health and Human Services Agency. “Although we have come a long way, the MCRT is still in its infancy stage. We will continue to expand, adjust and modify as needed based on input from the community and our partners to ensure we are meeting the needs of our community.”\nThe County funds prevention and treatment services throughout the region. If you, or someone you care about, needs treatment, please call the Access and Crisis Line at (888) 724-7240.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220512.15.00.32"}