{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on Phase One of Bonsall Community Park", "description": "County officials and community members broke ground Tuesday on a project that will transform a former golf course in North County into more than 24 acres of recreational amenities for the Bonsall community.", "datePublished": "2025-02-18T16:14:01-08:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-phase-one-of-bonsall-community-park/", "keywords": ["parks and rec", "community development", "equity and access", "parks and recreation", "sustainable communities"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2025-02-24T08:55:28-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty officials and community members broke ground Tuesday on a project that will transform a former golf course in North County into more than 24 acres of recreational amenities for the Bonsall community.\nThe Bonsall Community Park is located at 5290 Camino Del Rey and W. Lilac Road. The park was selected for active recreation because of its location. The acreage is next to Bonsall Elementary School, Bonsall Community Center, several housing developments and Highway 76.\nThe first phase of the new park will include:\n\nPlaygrounds\nShade structures with picnic tables\nMulti-use sport and soccer fields\nRestrooms\nA park office\nVolunteer host sites for added security\nParking, with two new vehicle access points to the property\nSidewalk and intersection improvements to Camino Del Rey\n\nThe active recreation site is one of two parks in the County’s San Luis Rey River Park Master Plan. The Master Plan is made up of more than 1,700 acres along the San Luis Rey River between Interstate 15 and the Old Bonsall Bridge. It sets aside 95% of the San Luis Rey River Park for passive, open space uses and trails.\nBuilding this park makes progress toward the County’s goal of providing 3 acres of local, public parkland for every 1,000 residents. Currently, the Bonsall community does not have any designed public parks.\nThe County’s Department of Parks and Recreation gathered community input and engaged residents, businesses and other stakeholders about their needs for the park. This feedback helped to shape the design and types of features planned for this location. County staff will continue to work with the community about future phases of Bonsall Community Park.\nLast year, the County finalized a construction contract to build the first phase of Bonsall Community Park, set to open Summer 2026. For more information about the project, visit sdparks.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250218.16.14.01"}