{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens Cool Zones to Help San Diegans Beat the Heat", "description": "A select number of County Cool Zones are opening Monday to provide much-needed relief from soaring temperatures. The seven Cool Zones are air-conditioned and located throughout the hottest areas of the County.", "datePublished": "2020-06-13T08:12:37-07:00", "url": "https://www.countynewscenter.com/county-opens-cool-zones-to-help-san-diegans-beat-the-heat/", "keywords": ["health", "cool zones", "heat"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2020-06-13T08:12:37-07:00", "articleType": "article", "articleContent": "\nA select number of County Cool Zones are opening Monday to provide much-needed relief from soaring temperatures. The seven Cool Zones are air-conditioned and located throughout the hottest areas of the County.\nThe locations are:\n\nBorrego Springs Library\nFallbrook Community Center\nLakeside Community Center\nPotrero Branch Library\nSanta Ysabel Nature Center\nSpring Valley Community Center\nValley Center Branch Library\n\nAll sites will be open from noon to 5 p.m. Monday to Friday. Animals, except service animals, are not permitted at any of these Cool Zone locations. The libraries are offering their sites only, no library services.\nDue to COVID-19, safety measures will be in place to protect the health of Cool Zone visitors and staff. Anyone entering a County Cool Zone will have their temperature taken. All visitors and staff must also wear face coverings and practice social distancing.\n“Although we need to take steps to keep seniors safe, it still remains important to also keep them cool,” said Supervisor Dianne Jacob. “Cool Zones provide a refuge during the hot summer months, so it’s helpful the County has developed a plan to get them open.”\nThe Cool Zones program is offered in partnership with the San Diego County Health and Human Services Agency Aging & Independence Services and San Diego Gas and Electric (SDG&E). It was started by Supervisor Jacob in 2001 to allow seniors and people with disabilities to escape extreme heat during the summer.\nHomebound individuals, those lacking transportation, and those who decide to stay home due to the risk of COVID-19, may be eligible to receive a free electric fan. The County, in partnership with SDG&E, provides fans to San Diegans who are living on limited incomes.\nTo be eligible for a free fan, a resident must not have access to an air-conditioned space at their home or apartment building. To learn more about the fan program or to request a fan, call Aging & Independence Services at (800) 339-4661.\n“We want to thank our SDG&E community partner for making this program available to give some relief from the heat to our more vulnerable residents,” said Supervisor Jim Desmond, whose district covers parts of North County out to the desert.\n“SDG&E appreciates and supports the County of San Diego for initiating the Cool Zones program back in 2001 and for making it such a success,” said Jessica Packard, SDG&E communications manager. “The County’s leadership has benefitted our region for almost 20 years and SDG&E is proud to be a part of this program since its inception.”\nFor more information about the Cool Zones program, visit www.CoolZones.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200613.08.12.37"}