{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Libraries Move to Digital to Help Stop Coronavirus", "description": "County library branches are going to curb-side pickup to help county residents practice social-distancing to stop the spread of coronavirus and still enjoy all the library books, digital magazines, music, movies and other fare they love.", "datePublished": "2020-03-17T13:09:48-07:00", "url": "https://www.countynewscenter.com/county-libraries-move-to-curb-side-pickups-to-help-stop-coronavirus/", "keywords": ["library", "books", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-03-19T11:24:13-07:00", "articleType": "article", "articleContent": "\nEditor’s Note: Due to the quickly moving nature of the County’s response to the novel coronavirus and to protect the public, County libraries will not be able to provide curbside pickup of books and library materials.\nHowever, library patrons can still digitially access all the Library’s e-books and e-magazines around the clock — 24 hours a day, seven days a week — by downloading the Libby app for e-books or Flipster (under e-books and e-magazines) for e-magazines like Sports Illustrated, People, Time.\nResidents who do not have a library card, can sign up for an Instant Digital Card and use their mobile phone number as their library card!\nThe County of San Diego’s libraries are going to curb-side pickup to help county residents practice social-distancing to stop the spread of coronavirus and still enjoy all the library books, digital magazines, music, movies and other fare they love.\nStarting Wednesday, March 18, County library patrons can use the Library’s online catalog or call their branch libraries, place orders for the books they’re looking for and then pick them up at the Library’s curbside weekdays between the hours of 9 a.m. and 4:30 p.m. when the material is ready.\nAt the same, County Library Director Migell Acosta said library patrons can still access all the Library’s e-books and e-magazines around the clock — 24 hours a day, seven days a week — by downloading the Libby app for e-books or Flipster (under e-books and e-magazines) for e-magazines like Sports Illustrated, People, Time. The New York Times and other reference resources are available on our website.\nCounty libraries are moving to the curb-side pickup to help the public deal with calls from the federal, state and the County Public Health Officer to stay at home, away from crowds and practice social-distancing to stop the spread of novel coronavirus, which can cause the disease COVID-19.\nAcosta said using curbside pickup will be easy to use. Residents with County library cards can go to the Library website sdcl.org, use the catalog search to find the books or materials they’re looking for, then place their order right then online, or call their respective library to place their order.\nLibrary staff will then send patrons an email letting them know when their books are ready for them to call ahead and pick them up at the curbside, again, from 9 a.m. to 4:30 p.m. Monday through Friday.\nAll of the library’s online resources can be accessed here. Residents who do not have a library card, can sign up for an Instant Digital Card and use their mobile phone number as their library card. To download the Libby app, San Diego County residents can go to sdEbooks.org. Library patrons can even order books and materials that are available at any of the County’s 33 branch libraries and have them delivered to their own branch library for them to pick up.\nThe County Library system also announced this week that under guidance from the state and County Public Health Officer it was canceling all library-sponsored and co-sponsored events, programs and classes through the end of March to help stop the spread of novel coronavirus.\nFor more information about the County library, go to the Library’s webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200317.13.09.48"}