{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board Adopts First Environmental Justice Element for General Plan", "description": "County Supervisors voted this week to adopt a first-ever Environmental Justice Element for the County’s general plan and heard updates on the County’s new Climate Action Plan and the regional zero-carbon plan they approved pursuing in January.", "datePublished": "2021-07-15T13:21:37-07:00", "url": "https://www.countynewscenter.com/county-board-adopts-first-environmental-justice-element-for-general-plan/", "keywords": ["government", "climate action", "climate action plan", "environmental justice", "general plan", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-07-15T13:33:06-07:00", "articleType": "article", "articleContent": "\nCounty Supervisors voted Wednesday to adopt a first-ever Environmental Justice Element for the County’s general plan and heard updates on the County’s new Climate Action Plan and the regional zero-carbon plan they approved pursuing in January.\nThe County general plan guides community development in San Diego County’s unincorporated communities, setting the long-term vision for housing, jobs, infrastructure and public services.\nThe Board’s unanimous vote to adopt the new Environmental Justice Element will help ensure the County’s general plan promotes fair treatment for people of all races, cultures and incomes when it comes to having access to safe and livable communities, and opportunities for civic engagement.\nThe Environmental Justice Element will also help to improve underserved communities that are more prone than others to have environmental disadvantages, like more exposure to air and chemical pollution because of traffic or industry, fewer public facilities, infrastructure and services, and less access to healthy food and recreation.\nBoard Chair Nathan Fletcher applauded the addition and said a lot of positive passion and energy went into developing the Environmental Justice element.\n“I think the EJ element is absolutely essential, and I think it’s important,” Fletcher said. “I think it’s a wonderful addition to (the general plan).”\nUsing County Live Well and state Environmental Protection Agency criteria, the new element currently identifies 17 census tracts in four unincorporated communities as environmental justice communities: north El Cajon, north Lemon Grove, Spring Valley and Sweetwater.\nWith the Board’s vote to adopt the Environmental Justice Element, County staff plan to continue stakeholder and public meetings to develop additional criteria to identify additional environmental justice communities.\nSupervisors also voted Wednesday to update two of the general plan’s other seven elements, the housing and safety elements.\nClimate Action Plan Update and Regional Zero-carbon Plan \nThe Board of Supervisors also received updates on two related, but different climate-related plans Wednesday. The first was the County’s Climate Action Plan Update. The second was the regionwide decarbonization plan, called a Regional Decarbonization Framework, the Board voted to pursue in January to move the San Diego region toward zero carbon by 2035.\nCounty staff said both plans would seek to reduce greenhouse gas and carbon emissions, focusing on both equity and zero-carbon goals, but they differ in scope and approval process.\nThe County’s Climate Action Plan Update will be designed to reduce greenhouse gas emissions generated by anticipated future development in unincorporated San Diego County communities — the 772,000 acres over which the County has land-use authority — and from County operations. That plan can be approved by the County Board of Supervisors alone.\nIn contrast, the Regional Decarbonization Framework will affect the entire region, not just the unincorporated areas. That plan would require the County to work with, and have the participation of, other public agencies including cities, transportation agencies and school districts.\nThe County is working with the UC San Diego School of Global Policy and Strategy and the Energy Policy Initiatives Center at the University of San Diego School of Law to create a framework for its proposed regional zero-carbon plan. County staff said they’re also studying the best emissions reduction plans from across the nation. Staff members said Wednesday they expect to complete a draft framework for the regional effort in November and bring it to the Board for consideration in February.\nCreating the Climate Action Plan  Update\nTo prepare the Climate Action Plan Update, County staff is collecting emissions data from five sectors throughout 2019 to establish a baseline from which reduction goals can be set and progress measured. The goal is to reach net-zero emissions by 2035-2045.\nCounty Planning & Development Services staff have already started working on several aspects of the Climate Action Plan Update, processing emissions data to create the inventory, reviewing emissions-reduction measures and preparing an environmental study.\nThe department is also preparing to hold several more public workshops to gather community feedback, starting July 28. County staff estimate they will complete a draft plan next year. They expect to bring a completed Climate Action Plan and Supplemental Environmental Impact Report to the Board for consideration in winter 2022.\nThe County is currently continuing to implement many of the 26 greenhouse gas reduction measures that were in the County’s 2018 Climate Action Plan. The Board of Supervisors rescinded that plan in September 2020 after deciding not to further appeal a court ruling. That ruling and legal challenge, however, took no issue with the measures, which decreased carbon dioxide emissions by 160,743 metric tons, exceeding the County’s 2020 goal by 22%.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210715.13.21.37"}