{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Remain in Red Tier", "description": "After being on the brink of falling into the most restrictive Purple Tier, the County will remain in Tier Two, or the Red Tier, of the state’s system of assessing COVID-19 risk, the state announced today.", "datePublished": "2020-09-22T18:33:59-07:00", "url": "https://www.countynewscenter.com/county-to-remain-in-red-tier/", "keywords": ["health", "coronavirus", "covid-19", "red tier"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-09-23T10:16:19-07:00", "articleType": "article", "articleContent": "\nAfter being on the brink of falling into the most restrictive Purple Tier, the County will remain in Tier Two, or the Red Tier, of the state’s system of assessing COVID-19 risk, the state announced today. The change means indoor activities that recently reopened can continue for at least two more weeks.\nThe County’s adjusted case rate dropped from 8.1 (unadjusted 7.9) to 6.9 per 100,000 and is now below the Red Tier maximum of 7.0, allowing it to remain in that tier of the state’s reopening plan. The figures used to calculate this new rate are from Sept. 6 through Sept. 12.\n“It is because of the efforts of most San Diegans that the County is able to remain in the Red Tier,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The only way for the case rate to continue going down is if all local residents take the necessary precautions to avoid getting and spreading COVID-19.”\nThe region will now remain in the Red Tier for at least 14 days but could drop to the Purple Tier if the local case rate goes above 7.0 per 100,000 residents for two consecutive weeks. It would take three weeks for the County to be able to move to Tier 3 or the Orange Tier but not before driving its case rate down below 3.9 cases per 100,000 residents for 14 consecutive days.\nReopening tiers are based on a county’s case rate and testing positivity percentage. The County’s positivity percentage, now 3.8%, has been below the 4.9% that qualifies it for the Orange Tier since the state adopted the new ranking system. However, the state goes with the more restrictive measure to assign tiers.\nThe California Department of Public Health assesses counties on a weekly basis, and the next report is scheduled for Tuesday, Sept. 29.\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed on Sept. 21 in a business setting.\nIn the past seven days (Sept. 15 through Sept. 21), 18 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n8,130 tests were reported to the County on Sept. 21 and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,748.\n\nCases:\n\n222 new cases were confirmed among San Diego County residents on Sept. 21. The region’s total is now 45,147.\n29 of the 222 new cases are connected to San Diego State University. The total number of cases connected to SDSU students is here.\n3,435 or 7.6% of cases have required hospitalization through Sept. 21.\n809 or 1.8% of all cases and 23.6% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFive new COVID-19 deaths were reported in San Diego County on Sept. 21, and region’s total is now 765.\nThree men and two women died between Sept. 19 and Sept. 21, and their ages ranged from mid 50s to early 60s.\nThree did not have underlying medical conditions.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200922.18.33.59"}