{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Emergency Services Earns Highest Honor of Accreditation", "description": "San Diego County’s Office of Emergency Services earned re-accreditation by the Emergency Management Accreditation Program. The honor was announced this week. After a comprehensive and rigorous review of 66 standards of excellence in emergency management programs and capabilities, the Emergency Management Accreditation Program granted San Diego County the five-year re-accreditation.", "datePublished": "2023-09-29T11:48:54-07:00", "url": "https://www.countynewscenter.com/emergency-services-earns-highest-honor-of-accreditation/", "keywords": ["government", "alertsandiego.org", "emap accreditation", "emergency management accreditation program", "holly porter", "jeff toney", "sd emergency app", "unified disaster council"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-09-29T14:06:09-07:00", "articleType": "article", "articleContent": "\nSan Diego County’s Office of Emergency Services earned re-accreditation by the Emergency Management Accreditation Program. The honor was announced this week. After a comprehensive and rigorous review of 66 standards of excellence in emergency management programs and capabilities, the Emergency Management Accreditation Program granted San Diego County the five-year re-accreditation. San Diego County is one of only three emergency management programs in California to receive this accreditation and is the only program in the state to earn its fourth consecutive accreditation, having earned accreditations in 2007, 2012, 2017 and now in 2023.  \nThe Emergency Management Accreditation Program, as an independent nonprofit organization, fosters excellence and accountability in emergency management, by establishing standards applied in a peer review accreditation process.  County Emergency Services had to demonstrate compliance with 66 standards in 16 areas, such as program administration; hazard identification, risk assessment, and consequence analysis; hazard mitigation and prevention; planning; incident management; resource management; communications and warning; training; exercises, evaluations, and corrective actions; and emergency public information. \n“The Emergency Management Accreditation Program requires standards which define a high performing team, which we have serving the people of San Diego County,” said Jeff Toney, Emergency Services Director.  “This honor is a result of years of public safety investments made by leaders in our region, the training and hard work of county and city emergency managers and first responders, and the culture of collaboration as we respond to and recover from disasters in our region.” \n“San Diego County is home to diverse landscapes, beautiful beaches, and great weather.  But our region is also vulnerable to a variety of natural disasters, like wildfires, earthquakes, extreme heat, flooding, and even tsunamis, and others,” said Holly Porter, Deputy Chief Administrative Officer for the County of San Diego. “The County’s ability to meet the standards required through the Emergency Management Accreditation Program is confirmation that our County is a leader in the fields of emergency preparedness, mitigation, response and recovery.” \nThe County’s Office of Emergency Services coordinates the overall county response to disasters and is responsible for alerting and notifying appropriate agencies or populations when disaster strikes; coordinating the responding agencies; ensuring resources are available and mobilized in times of disaster; developing plans and procedures for response to and recovery from disasters; and developing and promoting preparedness in the community. \nEmergency Services also staffs the Operational Area Emergency Operations Center, a central facility which provides regional coordinated emergency response. Emergency Services also serves as staff to the Unified Disaster Council, a joint powers agreement between all 18 incorporated cities and the County of San Diego. The Unified Disaster Council coordinates plans and programs throughout the County to ensure protection of life and property.  \nEveryone has a role in disaster readiness. Register with AlertSanDiego.org to receive the latest emergency updates and download the SD Emergency app. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230929.11.48.54"}