{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Health Reports Increase in Whooping Cough Cases ", "description": "County public health officials are reporting an increased number of pertussis cases, also known as whooping cough, in San Diego County this year. The increase is notable when compared to 2023 and is even more marked when compared to 2020 to 2022 numbers. ", "datePublished": "2024-11-14T16:03:05-08:00", "url": "https://www.countynewscenter.com/county-public-health-reports-increase-in-whopping-cough-cases/", "keywords": ["health", "cough", "pertussis", "whooping cough"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-11-14T16:08:26-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty public health officials are reporting an increased number of pertussis cases, also known as whooping cough, in San Diego County this year. The increase is notable when compared to 2023 and is even more marked when compared to 2020 to 2022 numbers. \nThere have been 547 confirmed and probable pertussis cases reported in San Diego County to date this year. This compares to 332 cases in all of 2023. Ages have ranged from less than 1 month to 85 years old with the majority in the 11 to 17-year-old age range. There have been no pertussis deaths reported in San Diego County since 2016, and no deaths reported in California since 2019.  \n “Coming out of the COVID-19 pandemic, pertussis activity continues to increase, and we are seeing an upswing in cases that on track to returning to pre-pandemic numbers,” said Dr. Ankita Kadakia, Interim County public health officer. “We are working with local health care professionals and educators to stress the need for everyone to be up to date with their vaccinations.” \nDr. Kadakia said it’s critical for pregnant women and people who come into close contact with young infants to get vaccinated. Newborns are very susceptible to whooping cough because they are too young to be fully vaccinated. It is vital for pregnant women to be vaccinated in the third trimester to give protection to their unborn infants.  \nA typical case of pertussis starts with a cough and runny nose for one to two weeks, followed by weeks to months of rapid coughing fits that sometimes end with a whooping sound. Fever, if present, is usually mild. Babies younger than 1 year old are at greatest risk for getting whooping cough and having severe complications from it including periods of not breathing, called apnea.  The last death in San Diego County due to pertussis was in a 5-week-old infant in 2016.  Antibiotics can lessen the severity of symptoms and prevent the spread of the disease to others, but vaccination is effective at reducing severe complications. \nThe Centers for Disease Control and Prevention recommends the following vaccination schedule: \n\nYoung children need five doses of DTaP by kindergarten: at 2 months, 4 months, 6 months, 15 to 18 months, and 4 to 6 years. \n\n\nAll students entering 7th grade need proof of a whooping cough booster immunization (Tdap). \n\n\nA Tdap booster is recommended for pregnant women during the 27th through 36th week of each pregnancy, preferable during the earlier part of this time period. \n\n\nOne dose of Tdap is recommended for adults 19 years of age and older who did not get Tdap as an adolescent. \n\nParents can obtain the DTaP vaccine series and the Tdap booster vaccine for themselves and their children through their primary care physicians. Local retail pharmacies offer vaccinations for a fee, and anyone who is not covered by a medical insurance plan can get the vaccine from a County Public Health Center at minimal or no cost. \nFor more information about whooping cough and ongoing vaccination clinics, call the HHSA Immunization Branch at (866) 358-2966, or visit www.sdiz.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241114.16.03.05"}