{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Respondiendo a los niños sobre incidentes violentos", "description": "Los niños que se enteran de incidentes violentos como el tiroteo en las escuelas de Uvalde, Texas, pueden experimentar una gran ansiedad y miedo. Esas emociones pueden durar días o semanas.", "datePublished": "2022-05-25T13:05:14-07:00", "url": "https://www.countynewscenter.com/?p=208616", "keywords": ["families"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-05-26T09:11:41-07:00", "articleType": "article", "articleContent": "\nLos niños que se enteran de incidentes violentos como el tiroteo en las escuelas de Uvalde, Texas, pueden experimentar una gran ansiedad y miedo. Esas emociones pueden durar días o semanas.\nPara muchos, los sentimientos podrían verse agravados por la ansiedad sufrida después de tiroteos masivos anteriores, incluidos los de una tienda en Buffalo, Nueva York y una iglesia en el condado de Orange.\nLa subdirectora de Servicios de Salud del Comportamiento del Condado de San Diego, la Dra. Piedad García, dijo que es importante que los padres estén al tanto de las respuestas de sus hijos. Deben estar dispuestos a hablar abiertamente, pero sin dar demasiados detalles.\n“Cada niño exhibe angustia de manera diferente”, dijo García. “Tiene que ver con su edad, su madurez, sus experiencias individuales”.\nLos padres deben monitorear como les va a sus hijos y reconocer que sus sentimientos están bien. Sus rutinas de sueño y apetito pueden verse interrumpidos. Todas son reacciones normales, dijo García. Proporcionar apoyo emocional. Pueden pasar minutos, horas o días para que el incidente afecte a los niños. Cuando lo haga, brinde apoyo (abrazos, empatía, amabilidad, apoyo tranquilo) y pregúntele sobre sus pensamientos y sentimientos.\nElla aconseja a los padres que limiten la exposición de los niños a la información sobre la tragedia. Los informes de los medios a menudo repiten imágenes angustiantes y la cobertura continua puede exagerar el evento en la mente de los niños.\n“A veces lo que sucede es que la información los estimula demasiado y eso puede créales más ansiedad”, dijo García.\nLos padres pueden enfatizarles a los niños que el evento ha terminado y asegurarles que están a salvo, dijo García.\nDijo que respondiera a las preguntas de los niños de manera simple, sin dramatizar el incidente. Y proporcionar una perspectiva, explicando que estos incidentes no ocurren con frecuencia.\nGarcía dio que los cuidadores de los niños deben ser conscientes de sus propios niéveles de estrés y tratar de mantener la calma. Los niños buscan en los padres una sensación de seguridad y protección. Los adultos también deben hablar con otros adultos sobre lo que sienten.\nEl Condado también opera la Línea de Acceso y Crisis los siete días de la semana, las 24 horas del día, donde las personas pueden obtener ayuda para problemas como depresión, ansiedad u otros problemas de salud mental. El número es 888-724-7240.\nLos expertos en salud mental también ofrecieron estas señales de comportamiento que pueden mostrar que su hijo está reaccionando al incidente:\n\nLos bebés de hasta dos años pueden reaccionar a la ansiedad u otras respuestas de sus padres. Los bebes pueden estar irritables, pueden llorar más de lo normal y quieren que los abracen.\nLos niños en edad preescolar no pueden comprender completamente la tragedia, pero pueden saber los suficiente como para sentirse impotentes y abrumados. Pueden sentir miedo e inseguridad por estar separados de los cuidadores. Pueden tratar de recrear el incidente a través de actividades de juego.\nLos niños en edad escolar primarias tienen una mejor capacidad para comprender la tragedia. Pueden estar intensamente preocupados por los detalles del evento y quieren discutirlo. Otras reacciones pueden incluir tristeza, temores generalizados o específicos de que el evento vuelva a ocurrir otra vez, así como sentimientos de culpa, reacción exagerada o inacción. Pueden sentirse enojados porque el evento no se impidió o tener fantasía de rescatar a otros.\nLos niños de edad de escuela intermedia y secundaria podrían involucrarse en comportamientos peligrosos y arriesgados, como conducir de manera imprudente o consumir alcohol y drogas. Otros pueden tener miedo de salir de casa. Un adolescente puede tener sentimientos intensos, pero no querer discutirlos. Es posible que no quieran asistir a la escuela o participar en activadas escolares. El rendimiento escolar puede disminuir. Los adolescentes pueden volverse argumentativos y/o retraídos.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220525.13.05.14"}