{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Highlights First Year of CARE Act Accomplishments", "description": "A year into the Community Assistance, Recovery and Empowerment (CARE) Act program, San Diego County leads the state in results with 71 CARE agreements and two graduations.  ", "datePublished": "2024-10-24T16:29:37-07:00", "url": "https://www.countynewscenter.com/county-highlights-first-year-of-care-act-accomplishments/", "keywords": ["health", "behavioral health", "care act", "dr. bergmann"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-10-24T16:35:06-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA year into the Community Assistance, Recovery and Empowerment (CARE) Act program, San Diego County leads the state in results with 71 CARE agreements and two graduations.  \nLast October, San Diego County was among seven counties statewide to pilot the CARE Act program. To date, the number of CARE agreements in San Diego County is about double that of the other six pilot counties combined. \n“Today the County of San Diego’s CARE Act program has been a major success. Talk about policy making a difference in people’s quality of life,” said Board of Supervisors Chairwoman Nora Vargas. “We applaud the incredible work of participants, and the CARE team that has done so much to support participants’ well-being.” \nThe voluntary program provides another pathway to treatment for people ages 18 and older who are diagnosed with schizophrenia or other psychotic disorders. \nClients with a recent history of needing crisis services reduced their reliance on these kinds of services by two-thirds after enrolling in a CARE Agreement. \n“They want to continue to see us to tell us how well they’re doing, said Desirae Sanders, County Deputy Public Defender and Supervisor of the Mental Health Unit. “They want to see the judge and tell them how great it is. They want to talk about how they’re feeling better. We’ve had two graduates who have moved out of state and called to say I am doing so great thank you so much.” \nSince it started, the County has received more than 200 petitions from the courts. More than half of the petitions have been from family members who are trying to help loved ones get connected to care. \n“The success of this pilot program is due to the excellence of the personnel, from various parts of government, and the community, coming together to create processes that work and change lives,” said Dr. Luke Bergmann, director of County Behavioral Health Services. “We are being tapped as the expert to teach other counties how to build this program as it expands to every county across the state.” \nWhile the program is not specifically focused on addressing the unsheltered population, more than half of the 71 agreements are with people who were unhoused at the time the agreement was filed. More than 80% have since been housed. \nThe County began its CARE Act program on Oct. 1, 2023. \nSan Diego’s first CARE Court graduation took place in August of this year. \nThe CARE Act gives people an active role in creating their own CARE agreement for mental health treatment and housing support.  \nServices include assessment, services planning, case management, housing assistance, pre-employment and vocational services, psychiatry and medication management, co-occurring disorder services, peer services, and assistance building natural supports.  \nFamilies, clinicians, first responders, and others can file a petition with the civil court to connect adults to court-ordered voluntary treatment if they meet criteria related to health and safety. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241024.16.29.37"}