{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Live Well Advance Celebrates the Power of Partnerships", "description": "Focusing on the power of partnerships and youth mental health, the ninth-annual Live Well Advance Conference & School Summit drew nearly 2,000 people on Nov. 21 to an all-day event at the San Diego Convention Center.", "datePublished": "2024-11-25T16:04:27-08:00", "url": "https://www.countynewscenter.com/live-well-advance-celebrates-the-power-of-partnerships/", "keywords": ["health", "advance", "community", "conference", "equity", "live well"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-11-25T16:46:45-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteFocusing on the power of partnerships and youth mental health, the ninth-annual Live Well Advance Conference & School Summit drew nearly 2,000 people on Nov. 21 to an all-day event at the San Diego Convention Center.\nThousands of partners and stakeholders spent the day networking, sharing information and best practices. Issues big and small, but all of importance, were discussed in depth during breakout sessions. The keynote panel discussion focused on the rapidly evolving social media environment, its effects on students, educators and families, and where changes to technology to protect youth might be headed.\nEach year these Live Well Advance conversations breathe life into new ideas, programs and services that foster a more healthy, safe, and thriving San Diego region.\nThe cost-free event was presented by the County of San Diego, the San Diego County Office of Education, Alliance Healthcare Foundation and sponsored by the Prebys Foundation, California Schools VEBA, VEBA Elev8 Online Schools, Learn4Life High Schools, Rady Children’s, Blue Shield Promise Health Plan, AARP, and First 5 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241125.16.04.27"}