{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More than 58,000 Screened for ‘Love Your Heart’", "description": "San Diego County released its 2024 Love Your Heart Report Monday, showing the annual February public health campaign gave more than 58,000 people free blood pressure checks and potentially saved 806 people from medical emergencies like strokes or heart attacks. ", "datePublished": "2024-06-10T12:48:21-07:00", "url": "https://www.countynewscenter.com/more-than-58000-screened-for-love-your-heart/", "keywords": ["health", "blood pressure", "equity", "health", "hhsa", "love your heart"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-06-10T13:17:49-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County released its 2024 Love Your Heart Report  Monday, showing the annual February public health campaign gave more than 58,000 people free blood pressure checks and potentially saved 806 people from medical emergencies like strokes or heart attacks. \nIn February, the County and its partners performed and collected results from a combined 58,079 blood pressure readings.  \nLocally, 193 sites offered free blood pressure checks. Sites were also offered throughout Mexico, and in Mexican consulates in the United States under the “Ama Tu Corazon” program. \n“It is incredible to see this effort strengthen each year with more people and more sites getting involved, all having the same goal to save lives,” said Dr. Eric McDonald, County Health and Human Services Agency interim director. “Together we can take just 5 minutes to protect ourselves and loved ones, we just need more people to know how to Love Your Heart.” \nThe County started the Love Your Heart campaign at 15 sites in 2012. The goal was to help people to “know their numbers” with free blood pressure checks, and to promote education about the dangers of high blood pressure, which is often referred to as “the silent killer.” \nEach year these screenings identify underlying health issues and concerns for some participants who were otherwise unaware. This year, screenings showed 806 people that their blood pressure had reached “crisis levels,” giving them the opportunity to seek immediate medical help. \nAnother 15,863 people—roughly 27%—were alerted their higher-than-normal blood pressure levels categorized them as stage 1 or stage 2 hypertension. Those people were provided information on how to improve their blood pressure with ways to reduce stress, lose weight, eat healthier and exercises they could incorporate into their daily life. \nHigh blood pressure is a major risk for strokes and heart disease. The Centers for Disease Control and Prevention (CDC) report that heart disease is still the leading cause of death for men, women and people of most racial and ethnic groups in the United States. The CDC says high blood pressure became known as “the silent killer” because it usually has no warning symptoms and the only way to know if you have it is to get your blood pressure checked. \nSome of the other data the Love Your Heart Report included: \n\n48% of blood pressure screenings showed people they had above-normal readings. \n2,700 blood-pressure monitors were given out to participants across San Diego County. \n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240610.12.48.21"}