{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Additional COVID-19 Test Sites Opening Next Week", "description": "The region’s COVID-19 testing is expanding next week, with new sites being added in central and southeastern San Diego, the County Health and Human Services Agency announced today.", "datePublished": "2020-05-15T18:50:27-07:00", "url": "https://www.countynewscenter.com/additional-covid-19-test-sites-opening-next-week/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-15T18:50:27-07:00", "articleType": "article", "articleContent": "\nThe region’s COVID-19 testing is expanding next week, with new sites being added in central and southeastern San Diego, the County Health and Human Services Agency announced today.\nThe County will open an appointment-only drive-up testing site at San Diego County Credit Union Stadium in Mission Valley on Monday. That site can test up to 180 individuals a day and will operate Monday through Saturday from 9 a.m. to 3 p.m.\nTo make an appointment for the site at SDCCU Stadium, county residents can call 2-1-1.\nIn addition to the County’s site at SDCCU Stadium, state-run walk-up test sites will open at the Tubman-Chavez Center at 415 Euclid Avenue and at the San Diego County Assessor Office at 200 S. Magnolia Avenue in El Cajon.\nThe state-run sites open on Tuesday, May 19, and are in addition to state sites already operating in Escondido and Chula Vista. To make an appointment at any of the state-run locations, visit www.lhi.care/covidtesting or call (888) 634-1123.\nAdditionally, the County’s Live Well on Wheels Mobile Office tomorrow will once again offer COVID-19 testing at Euclid Health Center, located at 292 Euclid Ave. An appointment is required and can be set up by calling 2-1-1. The mobile test site will continue to operate at Euclid Health Center each Saturday for the foreseeable future.\nCOVID-19 testing options include calling your doctor or medical provider to schedule an appointment, signing up on the state website, or calling 2-1-1.\nFlattening the Curve\nMore than 4,000 COVID-19 tests were reported May 14, the highest daily total since testing started in the region. At the same time, the percentage of positive COVID-19 cases continues to trend down.\nA total of 132 new cases were reported yesterday, which is 3% of the total number of people tested. This metric continues a downward trend of positive cases and is a sign that the region is moving in the right direction in containing the spread of the novel coronavirus.\n“We will continue to monitor these data to support further opening of local businesses and activities,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “As life slowly starts to move toward the new normal, I commend the efforts of our community and strongly encourage each of you to keep up the good work by practicing physical distancing, wearing a face covering, washing your hands regularly and conducting routine sanitation.”\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n4,055 tests were reported to the County May 14 and 132 or 3% were positive.\nYesterday’s 14-day, rolling average percentage of positive tests was 4.4%, down from 4.6% on May 13.\n\nCases:\n\n132 new cases were reported for a San Diego County total of 5,523.\n1,070 or 19.4% of the total cases have required hospitalization.\n325 or 5.9% of all cases had to be placed in intensive care.\n\nDeaths:\n\nEight additional COVID-19 deaths were reported today, bringing the region’s total to 208.\nThe new reported deaths were six women and two men. Their ages ranged from 65 to 94 years.\nAll eight had underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n69 active outbreaks, 46 at congregate living facilities and 23 in community settings.\n1,269 cases, including 97 deaths in congregate living facilities.\n275 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200515.18.50.27"}