{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "When to Expect Statewide General Election Results", "description": "On election night, we all want to know the results right away, but counting ballots takes time.", "datePublished": "2022-11-07T14:30:28-08:00", "url": "https://www.countynewscenter.com/when-to-expect-statewide-general-election-results/", "keywords": ["elections", "election results", "election results updates", "fgg", "mail ballot drop-off boxes", "mail ballots", "nov. 8 statewide general election", "provisional ballots", "san diego county registrar of voters", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-11-07T15:12:00-08:00", "articleType": "article", "articleContent": "\nOn election night, we all want to know the results right away, but counting ballots takes time. Here are some reasons why:\n\nOver 1.9 million registered voters.\nEvery active registered voter received a ballot in the mail.\nMail ballots can be counted if postmarked on or before Election Day and received up to 7 days after.\nThose not registered can conditionally register and vote provisionally up until Election Day.\n\nSo, what can you expect on election night?\nThe first set of unofficial election night results comes in shortly after 8 p.m. This will include mail ballots received before Election Day and vote center ballots from early voting between Oct. 29 – Nov. 7.\nFor the latest results update on election night, you can visit sdvote.com or follow the Registrar’s office on Twitter.\nAfter the first unofficial report, election night updates will include vote center ballots cast on Election Day only. There will be no more updates to mail ballots on election night.\nThe Election Day ballots come in after the vote centers close at 8 p.m. There will be a gap in time for the next set of results due to poll workers packing up supplies and driving in from the county’s 218 vote centers.\nUpon arrival to the Registrar’s office, the vote center ballots will be scanned, and results will be periodically updated until all of the vote center ballots have been counted.\nSince there are fewer vote center locations compared to the traditional polling place model, the Registrar’s office expects to provide less frequent result updates.\nThe final unofficial election night results may not come in until midnight or 1 a.m. and will only cover the ballots that could be counted immediately. The counting of ballots does not end election night. \nWhat’s left to count?\nMail ballots. The Registrar’s office mailed over 1.9 million ballots for this election and a portion of those were dropped off at vote centers, official ballot drop box locations, or picked up by the U.S. Postal Service on Election Day. Mail ballots sent right before or on Nov. 8 have seven days to arrive if postmarked by Election Day.\nThen there are provisional ballots. People who missed the Oct. 24 registration deadline may conditionally register and vote provisionally in person up to and on Election Day.\nOnce their voter registration is processed and the Registrar’s offices confirms the voter did not vote elsewhere in the state, the voter registration becomes active, and the provisional ballot is counted.\nAfter election night, the next release of unofficial results is scheduled to be posted by 5 p.m. on Thursday, Nov. 10. Additional updates will occur at the discretion of the Registrar of Voters. The Registrar’s office will be closed on Thursday, Nov. 24 and Friday, Nov. 25 in observance of Thanksgiving.\nHowever, the results must be certified by Dec. 8, and the Registrar expects to use the full certification period to make sure the results are accurate. All updates will be posted on sdvote.com with the final certified results posted on Dec. 8.\nFor more information, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221107.14.30.28"}