{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Health Responds to Growing Number of Hepatitis A Cases", "description": "Cases of Hepatitis A in San Diego County continue to grow, with 28 reported so far this year and 18 of them among people experiencing homelessness (PEH). The County typically reports about two cases of the virus each month with only one case reported in the PEH population last year.", "datePublished": "2023-05-16T10:11:01-07:00", "url": "https://www.countynewscenter.com/county-public-health-responds-to-growing-number-of-hepatitis-a-cases/", "keywords": ["health", "hepatitis a", "san diego county", "vaccinations"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-05-16T10:13:49-07:00", "articleType": "article", "articleContent": "\nCases of Hepatitis A in San Diego County continue to grow, with 28 reported so far this year and 18 of them among people experiencing homelessness (PEH). The County typically reports about two cases of the virus each month with only one case reported in the PEH population last year.\nWhile no single outbreak location has been identified, and no specific food or water source found, cases are running above baseline and the County is actively taking and expanding steps to prevent further spread of the disease. This current increase in hep A cases is a form of person-to-person transmission and not by food.\nPublic Health Services began a coordinated vaccination and education plan with local cities and organizations in early February after reaching three cases and one death in the homeless population. Since that time, more than 4,500 vaccinations have since been administered to those considered most at-risk from the disease as these efforts continue.\n“We’re expanding ongoing efforts to reach the homeless community because this is a setting where cases could spread more quickly,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We need all of our partners, from shelter operators, cities and the healthcare systems, to join us in this response.”\nHomeless individuals are more vulnerable to getting sick from the virus because of its ability to spread in areas without convenient access to bathrooms and handwashing.\nSince February, 126 vaccination events have taken place. Another 18 are scheduled this month. Three outreach worker foot teams deployed twice a week have recently been expanded to five days a week and are providing vaccinations, Hepatitis A education and HARM Reduction Program resources, with focus on encampments in downtown San Diego. This effort is in addition to a regular County-wide foot team distributing information and hygiene kits.\nThe County also met in April with local cities to discuss a fall 2022 sanitation survey and the cities’ plans. A report on the results was recently sent back to all cities.\nIn a separate letter, all cities were asked to locate encampments and provide housing and/or more frequent cleaning along with handwashing stations and portable restrooms. Outreach workers also are identifying locations where increased sanitation would be beneficial.\nPeople experiencing homelessness often use hospital emergency departments to get treatment for health issues. For that reason, County Public Health Services has issued an updated California Health Alert Network (CAHAN) to the healthcare community. The alert summarizes the increasing cases among people experiencing homelessness and illicit drug users and asks medical emergency departments and hospitals to vaccinate those at risk and screen for Hep A infections. When a case is found, providers are asked to contact the County Epidemiology Program so an epidemiologist can interview the patient while they are still in the medical setting.\nHepatitis A vaccination schedule is generally a two-dose series. The first dose of the Hepatitis A vaccine is considered to be around 95 percent effective. Because this protection will eventually begin to decrease, a second shot is recommended at six months to 18 months later to provide immunity for between 20 and 40 years, according to the Centers for Disease Control and Prevention.\nCounty Public Health Services updates Hepatitis A case and vaccination numbers online each Wednesday afternoon at sandiegocounty.gov/hepa. The website also contains links to resources and other information. While there have been reports this year of Hepatitis A cases tied to frozen strawberries, none have been confirmed in San Diego County. In the United States, five states report person-to-person Hep A outbreaks and an outbreak related to organic strawberries with cases in three states.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230516.10.11.01"}