{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Votes to Restore, Improve El Monte River Valley Land in Lakeside", "description": "Calling it a great project for the entire region, San Diego County’s Board of Supervisors voted unanimously Wednesday to set aside $6.44 million to restore and improve roughly 98 acres of newly acquired open space, trails and recreational facilities in El Monte River Valley in Lakeside.", "datePublished": "2021-03-03T14:57:35-08:00", "url": "https://www.countynewscenter.com/board-votes-to-restore-improve-el-monte-river-valley-land-in-lakeside/", "keywords": ["government", "county parks", "lakeside", "parks", "sustainability", "sustainable communities", "trails"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-03-03T15:03:47-08:00", "articleType": "article", "articleContent": "\nCalling it a great project for the entire region, San Diego County’s Board of Supervisors voted unanimously Wednesday to set aside $6.44 million to restore and improve roughly 98 acres of newly acquired open space, trails and recreational facilities in El Monte River Valley in Lakeside.\nThe Board previously voted Feb. 10 to spend $3.2 million to buy the property that includes important coastal sage scrub, riparian scrub and riparian forest habitats, open space and already existing equestrian and youth sports playing fields.\nBoard members envision the land as the home for future trail connections to other County parks, and recreational facilities for the public to enjoy in addition to the open space. The land is located nearby the County’s existing Cactus County and Louis A. Stelzer parks, and its future $18 million Lakeside Equestrian Park.\nSupervisor Joel Anderson, who represents the County’s second district that includes Lakeside, said he was excited about the project and that the $6.44 million will help restore the land to its pristine nature and let people enjoy and hike through it.\nBoard Chair Nathan Fletcher said the project could also provide an important piece of the planned San Diego River Park Regional Trail.\n“This can be a wonderful regional asset,” Fletcher said. “Of particular importance it also helps us with another step toward completing the San Diego River Park — this is the vision of 52 miles of interconnected walkways and bikeways (running) all the way from Ocean Beach to the mountains. This is an incredible opportunity and this is one piece of that puzzle, a section of that that we can complete.”\nThe $6.44 million the Board of Supervisors agreed to use to restore the property Wednesday would spend:\n\n$2,641,000 to improve and expand the existing Little League ballfield, including rehabilitating the existing field and adding new accessible pathways, restrooms and parking improvements, replacing the existing concession building and restrooms, irrigation and amenities like bleachers and tables.\n$800,000 on trails, including design, environmental work and trail construction.\n$3 million to restore habitat, including removing invasive species like tamarisk, pepper and eucalyptus trees, and planting and seeding with native vegetation that would include a five-year maintenance and monitoring plan.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210303.14.57.35"}