{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "The Library’s Summer Learning Challenge is Back", "description": "Do you like to read? Do you like to learn? How about, do you like to earn prizes? Well, this summer you can do all three. The County Library Summer Learning Challenge is back!", "datePublished": "2024-06-03T12:14:07-07:00", "url": "https://www.countynewscenter.com/the-librarys-summer-learning-challenge-is-back/", "keywords": ["library", "community", "county library", "empower", "equity", "summer reading challenge"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-06-03T12:14:07-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDo you like to read? Do you like to learn? How about, do you like to earn prizes?\nWell, this summer you can do all three. The County Library Summer Learning Challenge is back! This summer’s “Read, Learn, Create” reading challenge started Saturday and runs through Aug 31. Anyone and everyone can take part.\nRegister online or at any of the 33 County libraries, read some books, have some fun, engage in some new activities and you could just earn a prize—from achievement badges to a new book of your choice or Library tote bag.\nThe summer challenge is open to people of all ages. But its main goal is to encourage kids and teens to read during their summer vacations. That can help prevent what some educators call the “summer slide,” a time where students can lose some of what they achieved during the school year.\nTaking part is easy! Come into your local County library to register or do it online.\nFirst, pick up a printed “learning log,” in any of eight languages at a County library branch, or print one out at home, to track your progress.\nThen, over the course of the three-month challenge, track what you read, and mark the activities you complete in the log to win stuff. Activities, some of which are in the log itself, can include directions to visit a website and answer questions, by submitting a drawing or trying out a new recipe. Activities and books are offered in English and Spanish. All 33 branch libraries will host programs as well.\nYou can win achievement badges in the online summer learning challenge by completing four of the five educational activities, by reading books, spending hours reading, submitting book reviews, or by a combination of those.\nEarning a badge is worth five points. Earn 10 points and you win your choice of a free book or a Library tote bag. You can earn 10 points by earning two badges, or one badge and five books, or a combination of reading books, or reading for a number of hours, etc.\nAnd you don’t even have to come into the library to check out books or read. That’s because the County’s e-book collection is available to everyone using your library card through the library’s online Overdrive platform or by downloading the Libby app and connecting to the library. And if you don’t already have a County library card, you can do that online or at a branch, just by using your cell phone number.\nSo, summer’s here! Read, Learn, Create. And win something too!\nTo sign up for the Summer Learning challenge drop into any County branch library or go to sdcl.org/summer.\nFor more information about the County Library, to find programs, activities and more, go to the Library’s webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240603.12.14.07"}