{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Blue Envelopes Let Law Enforcement Know of Communication Issues", "description": "Imagine a scenario in which your loved one is being pulled over or approached by a Sheriff’s deputy and is unable to communicate effectively with the officer. Whether your loved one has an autism spectrum disorder, dementia, becomes anxious around authority figures or is living with another condition that could impact how they react to the deputy, the deputy should be aware. ", "datePublished": "2023-12-20T11:02:26-08:00", "url": "https://www.countynewscenter.com/blue-envelopes-let-law-enforcement-know-of-communication-issues/", "keywords": ["public safety", "blue envelope", "san diego county sheriff s department"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-12-20T11:02:26-08:00", "articleType": "article", "articleContent": "\nImagine a scenario in which your loved one is being pulled over or approached by a Sheriff’s deputy and is unable to communicate effectively with the officer. Whether your loved one has an autism spectrum disorder, dementia, becomes anxious around authority figures or is living with another condition that could impact how they react to the deputy, the deputy should be aware.\nOften, there are no outward indicators of these conditions, and without this extra information, a deputy might think the person was uncooperative or was acting suspiciously. That is where the Blue Envelope Program comes in with people displaying a Blue Envelope logo on a sticker, pin, a seat belt cover, ribbons, key chains, lanyards, wallet information card or a bracelet. Immediately deputies who see the logo know there is some communication issue to consider.\nThe free program requires no registration and is voluntary. It includes an actual blue envelope that the person can give to the deputy or any other community service personnel that includes the person’s identification, pertinent documents such as medical information, instructions regarding communication preferences, and for driving, the vehicle registration, proof of insurance and contact information.\n“The Blue Envelope Program is part of our commitment to foster connection and understanding of the people we serve,” said San Diego Sheriff Kelly Martinez.\n\nTo learn more about the program or to obtain the free materials, visit the Sheriff’s web page.\nThe program expands on the Sheriff Department’s regional efforts to provide the highest standard of service for San Diego County. A related program is its Take Me Home Program which gives law enforcement quick access to critical information about a registered person with dementia, autism or other developmental disabilities in case they get lost or wander away.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231220.11.02.26"}