{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Year Brings Reminder to Get Vaccinated", "description": "The County Health and Human Services Agency is continuing to urge San Diegans to get tested if they develop COVID-19 symptoms and to get vaccinated with the bivalent booster if they haven’t already as the region enters the first week of 2023. COVID-19 cases continue to slowly decline this week.", "datePublished": "2023-01-05T17:33:37-08:00", "url": "https://www.countynewscenter.com/?p=210438", "keywords": ["health", "covid-19", "flu", "influenza"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-01-05T18:02:35-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is continuing to urge San Diegans to get tested if they develop COVID-19 symptoms and to get vaccinated with the bivalent booster if they haven’t already as the region enters the first week of 2023.\nCOVID-19 cases remain relatively flat this week. However the County’s new report comes before potential cases from New Year’s gatherings and celebrations might bring a surge.\n“It’s never been more important to get tested if you feel COVID-19 symptoms and to get the bivalent booster vaccination if you haven’t,” said County Public Health Officer Dr. Wilma Wooten, M.D., M.P.H. “It’s still less than two weeks from Christmas and we don’t know what New Year’s celebrations could bring. So, take care of yourself and get tested if you feel sick. If you are not ill, get boosted to stay healthy.”\nCOVID-19 vaccines, including bivalent boosters, and flu vaccines are widely available at local medical providers and pharmacies. The County continues to offer vaccinations throughout the region at its vaccination sites. Check online for the days and hours sites will be open.\nPreventive Measures \nIn addition to vaccination and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often.\nStaying away from sick people.\nWearing a facial covering, especially in crowded indoor settings.\nRegularly cleaning commonly touched surfaces.\nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests  through the U.S. Postal Service.  For more information about testing, go to the County of San Diego COVID-19 testing webpage.\n\nCOVID-19 Vaccination Progress\n\nMore than 2.69 million or 80.5% of San Diegans have received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 524,101 or 21% of 2,496,008 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nCOVID-19 Deaths\n\n21 additional deaths were reported since the last report on Dec. 29, 2022. The region’s total is 5,662.\nOf the 21 additional deaths, 13 were women and eight were men. They died between Sept. 4, 2022, and Dec. 28, 2022. Twelve of the newly reported deaths occurred in the past two weeks.\nTen of the people who died were 80 or older, five were in their 70s, five were in their 60s and one was in their 50s.\nFourteen of the people had been vaccinated and seven had not received any COVID-19 vaccines.\n19 had underlying medical conditions. Two determinations of underlying medical conditions are pending.\n\nCOVID-19 Cases, Case Rates and Testing\n\n4,714 COVID-19 cases were reported to the County in the past seven days (Dec. 27, 2022, to Jan. 2, 2023). The region’s total is now 967,078.\nThe 4,714 cases reported in the past week were higher compared to the 4,537 infections identified the previous week (Dec. 20, 2022, through Dec. 26, 2022).\n4,456 tests were reported to the County on Dec. 31, 2022 and the percentage of new positive cases was 13.6% (Data through Dec. 31, 2022).\nThe 14-day rolling percentage of positive cases, among tests reported through Dec. 31, 2022 is 12.4%.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Dec. 31, 2022, the report shows the following:\n\nOne additional flu death; the season’s total is now 30.\nThe additional flu death was a woman who died Dec. 28, 2022.\nThe woman had received a flu shot this season.\nShe had underlying medical conditions and was not coinfected with COVID-19.\nEmergency department visits for influenza-like illness: 6% of all visits (compared with 6% the previous week).\nLab-confirmed influenza cases for the week: 643 (compared to 912 the previous week).\nTotal lab-confirmed cases to date: 20,030 (compared to 1,253 at the same time last season and a 3,144 prior 5-year average during the same week).\n\nMore Information\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230105.17.33.37"}