{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Probation Launches Fire Service Training Program for Youth", "description": "County Probation and County Fire have introduced a comprehensive education and training program to help justice-involved young people at Probation. The Fuel Crew training program provides hands-on experience in vegetation and fuel management, preparing participants for careers in the fire service.", "datePublished": "2024-09-04T13:23:54-07:00", "url": "https://www.countynewscenter.com/county-probation-launches-fire-service-training-program-for-youth/", "keywords": ["public safety", "chairwoman nora vargas", "chief probation officer tamika nelson", "county fire", "county fire director jeff collins", "county probation", "east mesa juvenile detention facility", "fuel crew program", "justice-involved"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-09-05T13:39:42-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Probation and County Fire have introduced a comprehensive education and training program to help justice-involved young people at Probation. The Fuel Crew training program provides hands-on experience in vegetation and fuel management, preparing participants for careers in the fire service.\nThose who successfully complete the program will become eligible to apply for positions in the fire service as Seasonal Firefighters or Forestry Technicians. They may also have the opportunity to join the California Conservation Corps in a paid role, further expanding their career prospects. The one-year training will also support young people interested in working in land management or resource conservation jobs for private companies.\nFor this program, County Fire Training Captains provide classroom instruction, physical fitness instruction, medical training, and training on fuel management. Participants then apply what they’ve learned in the community, working to mitigate wildfire risks.\nAt the program’s inauguration celebration on August 28, Board of Supervisors Chairwoman Nora Vargas acknowledged the achievements of the first two groups of trainees. “We believe in you, and we know that these types of programs will give you the skills that you need to continue to move forward. “\nSan Diego County Probation is committed to supporting youth on their journey to restore their lives, families and communities through this and other programs.\nIn speaking to the program’s broader goals, Chief Probation officer Tamika Nelson said, “Probation and County Fire developed this program to bring opportunities to young adults where they can learn and develop skills, build a connection to the broader community and empower them to use their knowledge to serve their communities.”\n“This program helps to break down barriers and build diversity, equity and inclusion opportunities for those who have been justice-involved, while also helping to protect our communities from disasters and other emergencies,” she continued.\nParticipants in the program earn certification in wildland firefighting operations and gain experience in brush clearing, urban landscaping and removing wildfire fuels throughout San Diego County.\nAt the celebration, County Fire Director Jeff Collins underscored the program’s long-term benefits, stating, “Your hard work is why we’re doing this. There is a lot of opportunity for you in the fire service or something else, and the life skills gained in the Fuel Crew program are tools you can use throughout your career.”\nThe Fuel Crew program is based at the East Mesa Juvenile Detention Center in Otay Mesa, where young people are provided education and valuable training, creating a pathway towards positive change and a brighter future.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240904.13.23.54"}