{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Be Alert, Stay Prepared During Red Flag Conditions", "description": "Residents are being asked to be alert for wildfires as the National Weather Service has issued a red flag warning from Wednesday night through Friday evening, with the potential for strong gusty winds and low humidity.", "datePublished": "2021-11-24T12:52:26-08:00", "url": "https://www.countynewscenter.com/be-alert-stay-prepared-during-red-flag-conditions/", "keywords": ["public safety", "alertsandiego", "fire preparedness", "readysandiego", "red flag", "san diego county fire/ fire protection district", "sd emergency"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-11-24T12:57:51-08:00", "articleType": "article", "articleContent": "\nResidents are being asked to be alert for wildfires as the National Weather Service has issued a red flag warning from Wednesday night through Friday evening, with the potential for strong gusty winds and low humidity.\nThe alert has been issued for San Diego County’s inland valleys and mountains. However, all residents should be alert because if any fires ignite under red flag conditions they could spread rapidly.\nFor example, residents should refrain from using power tools — including lawn mowers — outside during high-fire conditions because they can potentially spark on rocks and ignite grass or brush fires.\nIf you do choose to cut away and remove dead and dying plants near your homes or structures, use hand tools only.\nResidents are always encouraged to maintain defensible fire-space around their homes and to remove dead leaves, debris and other flammable items such as wood piles that may be stacked against structures. Those kinds of things can be ignited by embers from wildfires.\nHere are some other guidelines to follow:\n\nBe particularly careful with smoking materials to avoid accidentally starting a fire.\nNever pull your vehicle over in grass as it can ignite a grass fire. Make sure your vehicle is well maintained as faulty catalytic converters have been a major cause of accidental fires in San Diego County.\nIf you have a trailer on your vehicle, make sure the chains don’t drag on the ground while driving and spark a fire.\n\nAn important factor in being prepared is to stay informed in the events of a regional emergency.\nHere are some ways to be informed:\n\nResidents can download the County’s SD Emergency app in English or Spanish from the Google Play store or the Apple App Store. The app provides news updates, maps, shelter locations and includes disaster planning templates and interactive checklists. If a regional emergency, such as a wildfire, does occur, updates and other information will be posted at sdcountyemergency.com  and sent out via the app.\nRegister for AlertSanDiego  or at ListoSanDiego, the County’s cell phone notification service. By doing that, you will receive any emergency messages such as evacuation warnings that apply to your neighborhood on your cell phone.\nDon’t wait until an emergency, when you’re already stressed to figure out what you need to do in the event of an evacuation. Complete a family disaster plan template from the app or from ReadySanDiego.org to help your family plan for an emergency including where to meet if you are separated and cannot return home.\nYou can also stay in touch with official emergency information by following CAL FIRE on Twitter in the event of a fire. More weather forecast information and updates are available at the National Weather Service.\n\nTo find more information about safeguarding your home from wildfires and general disaster preparation, visit ReadySanDiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211124.12.52.26"}