{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Children Ages 5-11 Now Eligible for COVID-19 Vaccine", "description": "COVID-19 vaccinations are now available to San Diego children age 5 and older.", "datePublished": "2021-11-03T15:10:37-07:00", "url": "https://www.countynewscenter.com/children-ages-5-11-now-eligible-for-covid-19-vaccine/", "keywords": ["health", "children 5 and older", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-11-04T09:20:46-07:00", "articleType": "article", "articleContent": "\nCOVID-19 vaccinations are now available to San Diego children ages 5 and older.\nThe California Department of Public Health has approved Pfizer’s COVID-19 vaccine for use in 5- to 11-year-olds, and health care providers in the region are now vaccinating children in this age group.\n“Clinical trials have shown that the Pfizer vaccine is both safe and effective for use in children,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Getting this newly eligible age group vaccinated will allow kids and their families to return to a more normal daily life and will protect younger siblings who are not eligible to be vaccinated yet.”\nThe Pfizer vaccine is the only COVID-19 vaccine currently authorized for use in 5- to 11-year-olds and 12- to 17-year-olds. Parents should take their children ages 5 to 11 to their primary pediatrician for a vaccine, but if that is not an option, the majority of County-operated COVID-19 vaccination sites also carry the Pfizer vaccine, as do many pharmacies, clinics and other medical providers. Parents can also visit MyTurn.ca.gov or call the hotline at 833-422-4255 beginning tomorrow to find a nearby vaccination site.\nA child gets vaccinated against COVID-19 at Rady Children’s Hospital.\nChildren in the newly eligible 5- to 11-year-old group will receive a two-dose regimen three weeks apart. The vaccine will be administered with smaller needles, and doses will contain only a third of the dosage compared to what is being administered to teens and adults.\n“While the risk of children dying from COVID-19 is much lower than it is for adults, kids now make up about one in five cases here in the County,” said Kelly Motadel, M.D., M.P.H., County child health officer. “Despite often showing only minor symptoms while they are ill, kids are at risk, while lower than adults, of developing long COVID and suffering debilitating long-term effects from the virus.”\nParental consent is required prior to vaccination for anyone under the age of 18. In addition to parental consent, minors must be accompanied to the vaccination appointment by a parent, guardian, or caregiver to verify the child’s age and identity.\nState figures show San Diego County has 322,774 children ages 5-11, and the County has plenty of vaccine doses on hand or coming in to vaccinate all eligible youths in the coming weeks.\nAdditional information about scheduling appointments and what types of documentation children will need to get vaccinated is available at coronavirus-sd.com/vaccine.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211103.15.10.37"}