{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Widens Ban on Gatherings; COVID-19 Cases Reach 55", "description": "As the number of COVID-19 cases continues to increase in the region and the virus starts to spread in our communities, the County today issued new guidance to slow the spread of the novel coronavirus.", "datePublished": "2020-03-16T17:15:22-07:00", "url": "https://www.countynewscenter.com/county-widens-ban-on-gatherings-covid-19-cases-reach-55/", "keywords": ["health", "ban on bars", "coronavirus", "covid-19", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-17T05:51:30-07:00", "articleType": "article", "articleContent": "\nAs the number of COVID-19 cases continues to increase in the region and the virus starts to spread in our communities, the County today issued new guidance to slow the spread of the novel coronavirus.\nTo date, a total of 55 cases have been reported in the region — 47 in San Diego County residents, four from the federal quarantine and four in non-residents.\nTo slow the spread of COVID-19, the following guidance is being issued and is effective from March 17 through March 31, 2020:\n\nAll public and private gatherings of more than 50 people are prohibited. Non-essential gatherings of any size are strongly discouraged.\nAll bars and adult entertainment establishments that serve alcohol and no food must close.\nAll restaurants or businesses that serve food must close on-site dining. Food delivery, pick-up or drive-through needs to be done using social distancing or keeping people six feet apart.\nAll schools of all grades to close; students who are minors must stay at home and not participate in activities prohibited by the order.\nAll people 65 or older, or anyone who has a chronic underlying condition or are immunocompromised should stay home.\nNon-essential personnel must stay away from hospitals or long-term care facility.\nAll businesses need to enact social distancing, increase cleaning standards and have employees work from home, if possible. Businesses must suspend doctor verification for sick or other leave approval.\nHospitals must preserve resources and delay non-emergency surgeries and elective procedures.\n\n“We are taking these measures to slow the spread of COVID-19 and keep our health care system from being overwhelmed,” said Wilma Wooten, M.D., M.P.H., County public health officer. “There is now community spread of COVID-19 and the public needs to heed these measures to avoid contracting the virus.”\nThe County Health and Human Services Agency (HHSA) is aggressively working to do contact tracing of all the patients who have tested positive for COVID-19. The appropriate people will be placed under self-quarantine and monitored for possible symptoms of COVID-19.\nAll people returning from the list of impacted countries —South Korea, Japan, Italy, China and Iran, and others added to the list — need to follow a 14-day home quarantine to keep the virus from spreading in case they are infected.\n“People should remain at home to monitor for symptoms and no go out in public,” Wooten said.\nFlattening the Curve\nAs the number of COVID-19 cases continues to increase across the nation, the state and the County, health officials are closing schools, businesses and other institutions to try to flatten the curve of the pandemic.\nThe goal is to practice social distancing to slow the spread of the pandemic so that many people don’t get sick at the same time and overwhelm the health care system. Should that occur, there might not be enough hospital beds or mechanical respirators for everyone who needs them.\n“By slowing the spread of the virus, new cases won’t occur all at once,” Wooten said. “Hospitals and health care systems can adjust and be able to handle all people who might get sick and need to be hospitalized.”\nWhat Residents Can Do to Minimize Chances of Getting COVID-19\nIt’s important for the public to take measures to reduce chances of getting and spreading the disease. To limit the spread of infection, you should:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nResidents should also follow these important tips to help both prepare and respond to this public health threat.\n\nStore a two-week supply of food, beverages and water, including food for family pets. Ensure an adequate supply of prescribed and routine medications are on hand.\nPlan ways to care for those who are at greater risk for serious complications and who will take care of sick family members.\nIf you have family members with increased risk of getting seriously sick, check with your medical providers about symptoms and treatment.\nCreate an emergency contact list of family and friends, teachers and employers.\nHave a plan in case your school, childcare, or employer closes temporarily.\nTalk with your children, family, and friends about what to do if an outbreak occurs and what each person would need.\n\nFollowing these steps now helps protect you and your family.\nIf you have individual questions, please talk to your healthcare provider. For community resources, please call 2-1-1 San Diego or visit www.211sandiego.org. or www.coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200316.17.15.22"}