{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Highlights Resources for Older Americans Month", "description": "The County is honoring the many contributions of residents over 60 this Older Americans Month, which is celebrated every May, and sharing resources available in the region. ", "datePublished": "2024-05-24T10:42:53-07:00", "url": "https://www.countynewscenter.com/county-highlights-resources-for-older-americans-month/", "keywords": ["health", "older americans month", "resources for seniors"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-05-24T10:57:48-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County is honoring the many contributions of residents over 60 this Older Americans Month, which is celebrated every May, and sharing resources available in the region. \nThe County estimates that by 2030, the number of older adults in the region will climb to nearly one million, up from 783,500. \n“We’re seeing rapid growth in our region’s aging population and that is why the County is focused on supporting healthy aging with a framework called the Aging Roadmap,” said Naomi Chavez, County Aging & Independence Services Acting Director. “This Older Americans Month, we’re celebrating by highlighting County resources for older adults.” \nThe Aging Roadmap, which launched in 2019, outlines the region’s efforts to make sure the needs of older adults are met when it comes to care and support, affordable housing, accessible transportation and opportunities to work and volunteer. \nThis year’s Older Americans Month theme is Powered by Connection, which recognizes the impact meaningful relationships and social connections have on the health and well-being of older adults.  \nSeveral County programs help older adults stay connected and provide activities for well-being including: \n\nThe Feeling Fit Club: classes for older adults of all abilities. Classes focus on building strength, balance, cardio and flexibility. There are nearly 40 classes a week held in person or virtually throughout the region. Tai Chi classes are also available.  \nMeals and Senior Dining: hot, nutritious meals are served for people over 60 years old weekly at nearly 30 locations around the region. Many locations also offer transportation.  \nTech2Connect: gives internet-connected tablets and technology training to encourage social connection and resources for mental health. The program is available to eligible In-Home Supportive Services (IHSS) recipients who live alone and are at greatest risk of social isolation by calling (858)505-6972. \nMultipurpose Senior Services Program (MSSP): helps eligible older adults stay in their home by providing help with certain tasks like laundry, shopping or making bill payments.  \nVolunteer opportunities: older adults can find social connections and serve the community in a variety of ways through Senior Volunteers in Action (SVA) or the Retired Senior Volunteer Program (RSVP). Volunteers can also serve in the Long-Term Care Ombudsman Program to visit long-term care sites to ensure residents receive quality care and advocate for their rights. \n\nTo learn more about available resources or to report suspected elder abuse, contact the County Aging & Independence Services Call Center at 800-339-4661 or visit their website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240524.10.42.53"}