{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Free Flu Shots Available at County Clinics", "description": "The County of San Diego is ramping up its flu vaccination efforts to lower the risk of San Diegans getting influenza and the novel coronavirus at the same time and prevent the local healthcare system from being overwhelmed.", "datePublished": "2020-10-15T09:44:16-07:00", "url": "https://www.countynewscenter.com/free-flu-shots-available-at-county-clinics/", "keywords": ["health", "flu", "influenza", "pods"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-10-19T10:08:58-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is ramping up its flu vaccination efforts to lower the risk of San Diegans getting influenza and the novel coronavirus at the same time and prevent the local healthcare system from being overwhelmed.\nEvery year, the County sponsors free vaccination clinics throughout the region where you can get a flu shot. Six clinics will take place in October and early November with vaccine available for adults and children ages six months and up.\n“The clinics are free and primarily for people with no medical insurance,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We want everyone to be protected against the flu and its possible complications.”\nThe upcoming clinics will be open from 10 a.m. to 4 p.m. at:\nOct. 22\nNorth Central Public Health Center – 5055 Ruffin Rd., San Diego, CA 92123\nOct 24\nSouth Public Health Center – 690 Oxford St., Chula Vista, CA 91911\nOct. 27\nNorth Coastal Public Health Center – 3609 Ocean Ranch Blvd, Oceanside, CA 92056\nOct, 28\nCentral Public Health Center VIP Trailer – 3177A Oceanview Blvd., San Diego, CA 92113\nOct. 29\nEast Public Health Center – 367 N. Magnolia Ave., El Cajon, CA 92020\nNov. 3\nNorth Inland Public Health Center – 640 W. Mission Ave #2, Escondido, CA 92025\nThe Centers for Disease Control and Prevention recommends that everyone six months of age and older get flu shot every year.\nThe flu vaccine is safe and effective. It takes about two weeks for immunity to develop, so it’s best to get your vaccine now before influenza starts to spread in the community.\nVaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if your symptoms are under control\nPregnant women\nPeople 65 years and older\nPeople who live with or care for others who are at higher risk\n\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nThe flu vaccine is covered by medical insurance and is also available at doctors’ offices and retail pharmacies.\nPeople with no healthcare coverage can get vaccinated at a Community Health Center or County public health center throughout the flu season. For a list of locations, visit sdiz.org or call 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201015.09.44.16"}