{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Business Owners Encouraged to Take County Survey", "description": "Business owners are encouraged to take a survey to help the County of San Diego improve its outreach about contracting opportunities. ", "datePublished": "2024-08-16T15:34:54-07:00", "url": "https://www.countynewscenter.com/business-owners-encouraged-to-take-county-survey/", "keywords": ["government"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-08-16T15:34:54-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteBusiness owners are encouraged to take a survey to help the County of San Diego improve its outreach about contracting opportunities. \nThe goal is to find out what businesses, including non-profits, need to successfully bid or propose on providing goods and services that help the County serve the public. \nThis information will help the County determine improvements to its procurement and contracting program and increase the diversity of businesses that successfully bid or propose for County contracts, particularly local small businesses.  \nThe County is one of the largest buyers in the region. It spends about $2 billion a year to provide departments with everything they need from pencils to new buildings.  \nThe County regularly holds free workshops to inform small businesses about how to do business with the County.  \nThe survey takes about 10 minutes to complete and will remain open through Sept. 30. Questions ask for feedback on any past bid and proposal experiences, input on opportunities to improve the process, and preferences for enhanced outreach and technical assistance.  \nVisit the County’s Engage San Diego County site to access the survey.  \n  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240816.15.34.54"}