{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves More Funds for Businesses Impacted by COVID-19", "description": "The County Board of Supervisors today voted to provide more stimulus funds to businesses forced to close indoor operations after the region was placed in the Purple Tier.", "datePublished": "2020-11-25T16:10:51-08:00", "url": "https://www.countynewscenter.com/board-approves-more-funds-for-businesses-impacted-by-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "stimulus funds", "thanksgiving"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-25T16:13:21-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today voted to provide more stimulus funds to businesses forced to close indoor operations after the region was placed in the Purple Tier.\nAt a special meeting, the Board gave the green light for $20 million in general funds to be added to the Small Business Stimulus Grant Program established in May.\nThe funds will be available to businesses and nonprofit organizations in the following industries:\n\nRestaurants\nGyms and fitness centers, including yoga studios\nMovie theaters\nMuseums\nZoos and aquariums\nEvent planners (weddings, festivals, fairs, etc.)\n\nBusinesses in these industries had to close or stop indoor operations to limit the spread of COVID-19. The financial relief will help them to reverse some of the disproportional impact on their operations and keep some from having to close permanently.\nThe County’s five supervisorial district offices will review and recommend applicants for $4 million in funds each. Applications are available at the Small Business Stimulus Grant Program website. Award recipients will also be posted on the site.\nBusinesses that submitted a previous application do not need to reapply.\nThis is the fourth time the Board has voted to provide stimulus grant funds for restaurants and other small businesses. In past months, the Board approved a total of $27.5 million in Coronavirus Aid, Relief and Economic Security or CARES Act funds.\nCOVID-19 Testing on Thanksgiving Holiday\nThe County will continue to operate free, COVID-19 testing sites throughout the holiday weekend.\nNov. 26:\nThree no-appointment sites will be open from 8:30 a.m. to 2 p.m. on Thanksgiving Day:\n\nCal State University San Marcos, 333 S. Twin Oaks Valley Road\nTubman-Chavez Community Center, 415 Euclid Ave.\nUniversity of San Diego former recycling center, 5330 Linda Vista Road\n\nNov. 27:\nAll sites will be open, with the exception of Sycuan Market and any locations operated by the San Diego County Fire Authority.\nNov. 28 and 29:\nSites will operate on the normal schedule.\nFor more information on testing, visit 211sandiego.org or call 2-1-1.\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure of case rate or testing positivity to assign tiers regarding what activities are permitted. Indoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed.\nThe County’s state-calculated, adjusted case rate is currently 13.1 cases per 100,000 residents and the region is in Purple Tier or Tier 1 for that metric.\nThe testing positivity percentage is 3.1%, placing it in Tier 3 or the Orange Tier for that metric.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 9.3% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health announced that tier assignments, typically given each Tuesday, may now occur any day of the week and may occur more than once a week.\n\nCommunity Setting Outbreaks:\n\n10 new community outbreaks were confirmed on Nov. 24: four in business settings, two in restaurant/bar settings, one in a government setting, one in a distribution warehouse setting, one in a retail setting and one in a higher education setting.\nIn the past seven days (Nov. 18 through Nov. 24), 76 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n20,738 tests were reported to the County on Nov. 24, and the percentage of new laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 5.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 21,316.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n944 new cases were confirmed among San Diego County residents on Nov. 24, the second highest one-day total. The region’s total is now 75,305.\n4,470 or 5.9% of all cases have required hospitalization.\n1,006 or 1.3% of all cases and 22.5% of hospitalized cases had to be admitted to an intensive care unit.\nA new COVID-19 case rate mapshows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nFour new deaths were reported in the County on Nov. 24. The region’s total is now 988.\nFour men died between Nov. 14 and Nov. 22, and their ages ranged from late 50s to mid-80s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201125.16.10.51"}