{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Investigating Salmonella Outbreak Linked to Local Restaurant ", "description": "County public health officials are investigating an outbreak of salmonella linked to dining at Aladdin Mediterranean Café in the Clairemont area of San Diego. ", "datePublished": "2025-05-02T16:12:56-07:00", "url": "https://www.countynewscenter.com/county-investigating-salmonella-outbreak-linked-to-local-restaurant/", "keywords": ["health", "outbreak", "restaurant", "salmonella"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-02T16:12:56-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty public health officials are investigating an outbreak of salmonella linked to dining at Aladdin Mediterranean Café in the Clairemont area of San Diego. \nCounty epidemiologists have identified 14 confirmed and probable cases associated with this outbreak ranging between 18 and 79 years of age. Five people have been hospitalized.  \nPeople who reported getting sick ate food from Aladdin Mediterranean Cafe between April 25 and April 26, 2025.  \nThe County’s Environmental Health and Quality Department is investigating along with Public Health Services. No source of the outbreak has been determined, however once the investigation is complete and it is determined there is no ongoing risk, the restaurant will be cleared to resume operation.  \nAladdin Mediterranean Café voluntarily closed when notified of the situation to allow health officials to do more testing and interview staff and continues to work closely with the County. \nSalmonella causes an infection called Salmonellosis. Symptoms include nausea, vomiting, diarrhea that might have blood or mucous, abdominal cramps and fever. Symptoms generally begin 12 to 72 hours after eating contaminated food. Illness from salmonella can last 4 to 7 days. Most people recover without treatment. \nPeople who are at higher risk for serious illnesses from salmonella include: \n\nChildren younger than 5 years \n\n\nAdults older than 65 years \n\n\nPregnant women \n\n\nPeople with weakened immune systems \n\nPeople who dined at Aladdin Mediterranean Café in the Clairemont area April 25 –26, 2025, and feel ill with any of the symptoms listed should consider contacting a healthcare provider as needed.  \nAs of April 28, the County has identified 184 cases of Salmonellosis in 2025 across the region. In 2024, there were 753 cases identified, compared with 685 in 2023 and 683 in 2022.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250502.16.12.56"}