{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Citrus Disease Detection in San Diego County Prompts Quarantine", "description": "The California Department of Food and Agriculture declared a quarantine in parts of north San Diego County Thursday, after detecting a potentially devastating citrus disease in the county for the first time.", "datePublished": "2021-08-06T08:10:26-07:00", "url": "https://www.countynewscenter.com/citrus-disease-detection-in-san-diego-county-prompts-quarantine/", "keywords": ["agriculture", "agriculture", "citrus", "citrus psyllids", "huanglongbing", "pests"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-08-06T08:10:26-07:00", "articleType": "article", "articleContent": "\nThe California Department of Food and Agriculture declared a quarantine in parts of north San Diego County Thursday, after detecting a potentially devastating citrus disease in the county for the first time.\nThe bacterial disease, known as Huanglongbing or “citrus greening,” was detected in two citrus trees on a residential property in Oceanside. The disease is not harmful to people but is deadly to citrus and could be devastating to the county’s citrus industry. Huanglongbing  is spread by tiny insects, the Asian citrus psyllid, if they are carrying the bacterium when they feed on citrus plants and trees.\nCalifornia Department of Food and Agriculture (CDFA) officials said the 60-square-mile quarantine area will prohibit people and businesses from moving citrus nursery stock, plant parts and fruit outside the quarantine boundaries, with the exception of commercially cleaned and packed fruit that adhere to specific requirements. The quarantine also prohibits people from moving residential citrus plants and plant parts off the properties on which they are grown.\nThe quarantine area is bordered on the north by Vandergrift Boulevard; on the south by Carlsbad Village Drive; on the west by the Pacific Ocean; and on the east by Melrose Drive.\n“Unfortunately, Huanglongbing is fatal to citrus,” said San Diego Agricultural Commissioner Ha Dang, “so our goal is to stop this from spreading any farther. By working together, we can all protect San Diego County’s $150 million citrus industry from this deadly disease.”\nThe California Department of Food and Agriculture  (CDFA), the United States Department of Agriculture and San Diego County’s Department of Agriculture, Weights and Measures (AWM) are working together on the quarantine. Work includes treating the residential location where the disease was found, establishing the quarantine boundaries and notifying businesses and residents within the quarantine area.\nCDFA and AWM will coordinate informational meetings for commercial growers, nurseries and residents in the quarantine area. AWM will have information available on its website with links to Google translator that can translate the information into multiple languages.\nDang said this was a critical time for homeowners to protect their backyard citrus trees by searching for evidence of the Asian citrus psyllid and the disease.\nHuanglongbing affects the vascular system of citrus trees and plants. Once a tree is infected, it cannot be saved and will die within a few years.\n\nHuanglongbing symptoms include blotchy yellowing of leaves, yellow shoots, lopsided, small and rancid-tasting fruit, and premature, excessive fruit drop. If people are not sure if their plants are infected, they can contact the CDFA “Report-a-Pest” hotline at 1-800-491-1899.\nInside the quarantine area, CDFA urged residents to take the following steps:\n\nDo not move citrus plants, leaves or foliage into or out of the quarantine area.\nCooperate with agricultural officials who are placing traps, inspecting trees and treating for the pest.\nIf you no longer wish to care for your citrus tree, consider removing it so it does not become a host to the pest and disease.\n\nInspectors first found the Asian citrus psyllid in San Diego County in 2008. But this is the first time they have found Huanglongbing disease. There are existing Huanglongbing quarantine areas in parts of Orange, Los Angeles, Riverside and San Bernardino counties, where more than 2,400 trees have tested positive for the disease and been removed.\nCommercial growers in the quarantine area can contact Sandra Zwaal at szwaal2@gmail.com for more information. Zwaal is the Asian Citrus Psyillid Huanglongbing Grower liaison for the California Citrus Pest & Disease Prevention Program, which is primarily funded by California growers and CDFA. Zwaal will also be working with the San Diego County Farm Bureau and San Diego County Pest Control District.\nNurseries and retail businesses that sell citrus should contact CDFA Environmental Scientist Jemellee Urbino at Jemellee.Urbino@cdfa.ca.gov for more information.\nMaps of the quarantine area and updated information can be found on CDFA’s website Please check this link for future quarantine expansions, should they occur.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210806.08.10.26"}