{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Cool During Weeklong Heatwave ", "description": "High temperatures over the next week in San Diego, particularly the deserts, are cause for extra precaution. Residents are advised to stay cool, avoid activities that may cause overheating, and pay extra attention to older adults, people with chronic medical conditions, young children and pets because they are more susceptible to heat illness.", "datePublished": "2021-06-11T18:26:25-07:00", "url": "https://www.countynewscenter.com/stay-cool-during-weeklong-heatwave/", "keywords": ["health", "cool zones", "emergency", "heat"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-06-14T11:58:23-07:00", "articleType": "article", "articleContent": "\nHigh temperatures over the next week in San Diego, particularly the deserts, are cause for extra precaution. Residents are advised to stay cool, avoid activities that may cause overheating, and pay extra attention to older adults, people with chronic medical conditions, young children and pets because they are more susceptible to heat illness.\nThe National Weather Service issued an excessive heat warning for county deserts starting Monday and continuing through Friday. Temperatures are predicted to range from 112 to 120 degrees in those areas including the community of Borrego Springs. Forecasters also issued an excessive heat watch for the mountains and valleys, with the hottest temperatures expected Tuesday through Thursday.\nHot temperatures can be particularly dangerous for seniors, and they are advised to stay home. Borrego residents who do not have access to air conditioning at home can visit the Borrego Springs County Library branch, a County Cool Zone, from 10 a.m. to 4 p.m. at 2580 Country Club Road. Additional sites will be posted next week on the Cool Zones website.\nPlease note that regardless of vaccination status, anyone who enters a cool zone must wear a facial covering inside. This is in adherence to guidance from the California Department of Public Health.\nHealth officials recommend people do the following to avoid overheating\n\nIf available, stay in an air-conditioned area during the hottest hours of the day\nWear light, loose-fitting clothing\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty\nTake cool showers\nNever leave a child, elderly person, or pet unattended in a car\nKeep pets cool in hot weather\nAvoid unnecessary hard work or activities outside during the hottest part of the day\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun\nAvoid using the oven to cook\n\nAn extremely high body temperature (103 or higher), dizziness, nausea, confusion, and headache are signs of heatstroke or exhaustion. If someone shows these signs, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature and continue cooling efforts\nDo not give the victim fluids to drink\n\nFor more information on extreme heat, visit the Centers for Disease Control and Prevention. For more information on the Cool Zones program as well as tips to stay cool at home, visit www.coolzones.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210611.18.26.25"}