{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "First Flu Death of Season Reported in San Diego", "description": "A 55-year-old man from the North Central region of the county is the first influenza death reported in San Diego this season, the County Health and Human Services Agency announced today.", "datePublished": "2022-10-27T10:37:17-07:00", "url": "https://www.countynewscenter.com/first-flu-death-of-season-reported-in-san-diego-3/", "keywords": ["health", "first flu death", "flu", "influenza"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-10-27T11:25:07-07:00", "articleType": "article", "articleContent": "\nA 55-year-old man from the North Central region of the county is the first influenza death reported in San Diego this season, the County Health and Human Services Agency announced today.\nThe man died on Oct. 15. He had underlying medical conditions and had not been vaccinated against the flu. He tested negative for COVID-19.\nNew influenza cases also continued to increase last week. The County Health and Human Services Agency is reporting 856 lab-confirmed flu cases for the week ending Oct. 22. That’s an almost 45% increase when compared to the previous week, when 591 new infections were reported.\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Oct. 22, 2022, the report shows the following:\n\nEmergency department visits for influenza-like illness: 6% of all visits (compared with 5% the previous week)\nLab-confirmed influenza cases for the week: 856 (compared to 591 the previous week)\nTotal lab-confirmed cases to date: 2,528 (compared to 232 at the same time last season and a 196 prior 5-year average during the same week)\n\n“Every flu death is tragic and our condolences go out to the man’s family and friends,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Unfortunately, we see influenza deaths every fall and winter and I encourage San Diegans to do their part to stop the spread of illnesses and prevent deaths.”\nGet Vaccinated\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest public health center location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\n“Vaccination is the best defense we have against the flu,” Wooten said. “It is still early in the flu season and we are already seeing cases spike, so we have reason to believe that the flu could be extremely disruptive this year. Protect yourself and your family now and get the flu shot as soon as you can.”\nIt takes about two weeks after immunization until immunity develops.\nIn addition to getting vaccinated, Wooten recommends that people, especially those who are at a higher risk of severe outcomes, recommit themselves to the following precautions this fall and winter:\n\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nFlu Symptoms\nThe flu and COVID-19 are both spread from person-to-person, especially indoors and in crowded places. Symptoms for both viruses include fever, headache, and muscle and joint pain, as well as a sore throat and coughing.\nSince symptoms for both the flu and COVID are similar, but treatment varies, COVID testing, which is still widely available across the region, is a good first step to help sick individuals determine a plan of action.\nIt is recommended that San Diegans who develop flu-like symptoms get tested for COVID-19, especially if you have an underlying condition that puts you at an increased risk of severe outcomes from the flu or COVID.\nHigh-risk individuals include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control;\nPregnant women;\nPeople aged 65 years and older; and\nPeople who live with or care for others who are at higher risk.\n\nDuring the 2021-2022 flu season, 4,192 flu cases were reported and eight San Diegans died from influenza. During the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, and two San Diegans died from the flu.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221027.10.37.17"}