{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Second COVID-19 Pediatric Death Reported", "description": "A 15-year-old girl died from COVID-19 and is the second death of someone under the age of 18 in the region during the pandemic, the County Health and Human Services Agency announced today. The girl died on Feb. 3, 2022, had underlying medical conditions, and had not been vaccinated.", "datePublished": "2022-04-13T16:32:26-07:00", "url": "https://www.countynewscenter.com/?p=208191", "keywords": ["government", "coronavirus", "covid-19", "second pediatric death", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-04-13T16:39:21-07:00", "articleType": "article", "articleContent": "\nA 15-year-old girl died from COVID-19 and is the second death of someone under the age of 18 in the region during the pandemic, the County Health and Human Services Agency announced today.\nThe girl died on Feb. 3, 2022, had underlying medical conditions, and had not been vaccinated.\n“Pediatric deaths are very tragic and unfortunate. Our condolences go out to the family and friends of this young girl,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “This unfortunate death reminds us that COVID-19 can impact anyone, regardless of age or gender, and we must do everything to protect ourselves and our loved ones.”\nCounty health officials continue to encourage everyone eligible to get vaccinated against COVID-19 to get all the recommended doses.  In addition to deaths, the pediatric age group is at risk for developing Multisystem Inflammatory Syndrome in Children (MIS-C), a rare but serious condition associated with COVID-19 in which different body parts become inflamed. \nNinety-six MIS-C cases have been reported in San Diego County since the COVID-19 pandemic began.\nIn San Diego County, about 94% of those eligible—age 5 and older—have received at least one dose of a COVID-19 vaccine. About 84% of those 12-17 have gotten at least one dose. The percentage drops to about 43% for those between the ages of 5 and 11.\nA child gets vaccinated against COVID-19 at Rady Children’s Hospital.\nThe California Department of Public Health is working with local community organizations and pediatric medical providers to get children age 5 and up vaccinated against COVID-19. As part of the nine-week vaccination campaign, COVID-19 vaccinations will be offered at after school programs, libraries, local parks and other recreational areas.\n“The more people who are vaccinated, the better protected we all will be,” Wooten said.\nThe region has plenty of COVID-19 vaccines and booster doses. Vaccinations are available at pharmacies, medical providers, clinics, and County locations. You can also make an appointment or find a site near you by calling (833) 422-4255 or 2-1-1 or by visiting the MyTurn or coronavirus-sd.com websites.\nSan Diegans Encouraged to Take Part in COVID-19 Antibody Study\nSan Diego County is one of seven California counties participating in CalScope, a study that will help public health professionals better understand how many people in California have antibodies against COVID-19.\nThe California Department of Public Health has randomly selected about 45,000 San Diego households to participate in the study.\nIf your household was selected, you should have received or should be receiving an invitation with a unique access code to sign up online or over the phone. You’ll be asked to complete an anonymous survey and a free, at-home COVID-19 antibody test using a finger-prick blood sample.\nEach participant will receive a $20 gift card for completing the survey and a $20 gift card for returning the blood test sample.\nThe study will help CDPH and local health departments in California monitor the COVID-19 pandemic and refine strategies to protect the health of Californians.\nFor more information about CalScope, visit the study website at CalScope.org.\nVaccination Progress:\n\nReceived at least one shot: Over 2.96 million or 94.2% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.60 million or 82.7%.\nBoosters administered: 1,229,500 or 55.9% of 2,200,612 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n24 new deaths were reported since the last report on April 6, 2022. The region’s total is 5,229.\n16 men and eight women died between Sept. 17, 2021 and April 5, 2022.\nSix were age 80 or older, six were in their 70s, five were in their 60s, two were in their 50s, one was in their 40s, two were in their 30s, one was in their 20s and one was in her teens.\nThree of the people who died were fully vaccinated and 21 were not fully vaccinated.\n20 had underlying medical conditions and four did not.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n242 COVID-19 cases were reported to the County on April 12, 2022. The region’s total is now 753,939.\n1,964 cases were reported in the past week (April 6 through April 12) compared to 1,733 infections identified the previous week (March 30 through April 5).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 5.9 for people fully vaccinated and boosted, 3.4 for fully vaccinated people and 9.8 for not fully vaccinated San Diegans.\n5,879 tests were reported to the County on April 12, 2022, and the percentage of new positive cases was 3.0% (Data through April 10, 2022).\nThe 14-day rolling percentage of positive cases, among tests reported through April 10, 2022, is 2.8%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220413.16.32.26"}