{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More Flu Deaths This Season Than Last, Cases Drop in San Diego", "description": "More San Diegans have died from influenza this season than in all of last season, the County Health and Human Services Agency announced today.", "datePublished": "2020-03-05T10:41:03-08:00", "url": "https://www.countynewscenter.com/more-flu-deaths-this-season-than-last-cases-drop-in-san-diego/", "keywords": ["health", "80 flu deaths", "flu", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-05T11:43:38-08:00", "articleType": "article", "articleContent": "\nMore San Diegans have died from influenza this season than in all of last season, the County Health and Human Services Agency announced today.\nSix more flu deaths were reported last week, bringing this season’s total to 80. In comparison, 77 San Diegans died from influenza last season. All but three of the people who have died from influenza this season had underlying medical conditions.\n“It’s very unfortunate but influenza deaths do occur every flu season,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “It’s important for people to get vaccinated since the flu season is not over yet.”\nThe number of lab-confirmed cases decreased again last week, when 784 cases were reported. That’s 431 fewer flu cases compared to the previous week when 1,215 cases were reported. To date, a total of 18,696 cases have been reported.\nThe County Health and Human Services Agency publishes the Influenza Watch weekly report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Feb. 29, 2020, the report shows the following:\n\nEmergency department visits for influenza-like illness: 5% of all visits (compared to 6% the previous week).\nTotal influenza deaths to date: 80 (compared to 44 at this time last season).\nTotal lab-confirmed cases to date: 18,696 (compared to 6,103 last season).\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\nFlu vaccination is especially important for people who are at high risk of developing serious complications from influenza. They include:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nThe flu vaccine is available at doctors’ offices and retail pharmacies. If you don’t have medical insurance, you can go to a County public health center to get vaccinated. For a list of locations, visit www.sdiz.org or call 211 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200305.10.41.03"}