{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Offers Guidance Following Increase in Tijuana River Valley Sewage Odors ", "description": "The County is monitoring reports of an uptick in primarily overnight hydrogen sulfide (H2S) readings in the Tijuana River Valley, creating odor issues in the South County.  ", "datePublished": "2025-04-14T13:11:35-07:00", "url": "https://www.countynewscenter.com/county-offers-guidance-following-increase-in-tijuana-river-valley-sewage-odors/", "keywords": ["health", "air pollution", "mexico", "odors", "sewage", "tijuana", "tijuana river"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-04-14T13:11:35-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County is monitoring reports of an uptick in primarily overnight hydrogen sulfide (H2S) readings in the Tijuana River Valley, creating odor issues in the South County.  \nThe hydrogen sulfide readings are provided by the Air Pollution Control District which operates a specialized H2S analyzer network. In addition, the International Boundary and Water Commission (IBWC) that operates a sewage treatment plant and works directly with wastewater officials in Mexico provides data on flows into the river valley. The County also works with state and federal agency partners. \nThe increase in odors appears to be associated with reports from the IBWC that sewage infrastructure work in Mexico has resulted in the release of up to 5 million gallons per night of sewage into the Tijuana River Valley. This is in addition to rogue sewage flows being investigated by the IBWC with its partners in Mexico. \nCounty Public Health experts advised APCD on hydrogen sulfide guidance.  For affected residents, guidance includes limiting outdoor activities when odors are bothersome, keeping doors closed, increasing air circulation with indoor fans, and using air purifiers indoors. APCD offers free purifiers for those in the three principally effected ZIP codes remain available. \nPeople with asthma, chronic obstructive pulmonary disease (COPD), or other chronic lung conditions should have emergency medications such as rescue inhalers readily available. If symptoms from strong odor persists, are worrisome or worsen, seek medical care. \n“Our friends, co-workers and families who live or work near the Tijuana River Valley deserve access to clean air and beaches,” said Dr. Ankita Kadakia, the county’s interim public health officers. “While the County continues to advocate to the federal government for a solution that stops the flow of untreated wastewater, we also want people to be aware of the steps they can take when confronted by offensive hydrogen sulfide odors.” \nThe County of San Diego urges federal officials to continue working with their counterparts in Mexico on stopping the flow of raw sewage and bringing an ultimate resolution to this longtime source of water and air pollution.  \nMore information about the response to the ongoing flows of wastewater into the Tijuana River Valley are available from the APCD, IBWC and the County. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250414.13.11.35"}