{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Receives Grant to Run a Program for High-Risk DUI Offenders", "description": "County Probation  received a $642,600 grant from the California Office of Traffic Safety (OTS) for an intensive probation supervision program for high-risk individuals with serious felony and/or multiple driving under the influence (DUI) convictions. The grant program runs through September 2025.", "datePublished": "2024-11-13T14:48:10-08:00", "url": "https://www.countynewscenter.com/ots-awards-probation-a-grant-to-run-a-program-for-high-risk-dui-offenders/", "keywords": ["public safety", "county probation", "dui grant", "ots grant"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-11-14T09:26:32-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty Probation received a $642,600 grant from the California Office of Traffic Safety (OTS) for an intensive probation supervision program for high-risk individuals with serious felony and/or multiple driving under the influence (DUI) convictions. The grant program runs through September 2025.\n“This funding empowers our team to ensure community safety remains at the forefront of all we do by enhancing our ability to effectively balance support and accountability in the monitoring of and case planning for probation clients who have committed serious and/or multiple DUI offenses,” San Diego County Probation Chief Tamika Nelson said.\n“It allows our department to continue making impactful strides toward assisting these probation clients in achieving their rehabilitative goals and in restoring their lives and families, increasing successful outcomes for both clients and public safety.  We are grateful for this opportunity that positions us closer to accomplishing one of our main priorities, to reduce the number of impaired drivers on our streets.”\nThe probation grant will pay for field operations, including multi-agency efforts to reduce DUI and unlicensed driving, conducting compliance checks during business and non-traditional hours, alcohol testing, officer training in Standardized Field Sobriety Testing (SFST), distribution of DUI “Be on the Lookout” (BOLO) alerts, and collaborating with courts and prosecutors to establish and enforce probation orders.\n“Intensive supervision programs are essential in reducing the harmful impact of DUI offenses,” said OTS Director Barbara Rooney. “This is one important measure to help prevent the tragic consequences of impaired driving and create safer roads for everyone.”\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241113.14.48.10"}