{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Case of Vaping-Related Lung Injury Confirmed in San Diego", "description": "A new local case of vaping-associated lung injury was confirmed on Wednesday, Jan. 8, by the County Health and Human Services Agency.", "datePublished": "2020-01-09T14:01:50-08:00", "url": "https://www.countynewscenter.com/new-case-of-vaping-related-lung-injury-confirmed-in-san-diego/", "keywords": ["health", "teen vaping", "vaping", "vaping-associated lung injury", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-09T14:13:36-08:00", "articleType": "article", "articleContent": "\nA new local case of vaping-associated lung injury was confirmed on Wednesday, Jan. 8, by the County Health and Human Services Agency.\nTo date, 43 cases of vaping-associated lung injury have been reported among San Diego County residents, while an additional three cases are under investigation. While there have been no local deaths, all patients had to be hospitalized.\n“Vaping-related lung injuries continue to be reported in the region and that’s concerning,” said Wilma Wooten, M.D., M.P.H., County public health officer. \nLast June, doctors across the nation started reporting sudden and severe lung injuries associated with vaping. As of Jan. 7, a total of 2,602 hospitalized cases or deaths have been reported to the Centers for Disease Control and Prevention from all 50 states, the District of Columbia and two U.S. territories (Puerto Rico and U.S. Virgin Islands). Fifty-seven deaths have been confirmed in 27 states and the District of Columbia.\nThe CDC currently recommends that e-cigarette, or vaping, products should never be used by youths, young adults or pregnant women.  Adults who do not use tobacco products should not start using e-cigarette, or vaping, products.\nThe CDC has determined that vitamin E acetate and tetrahydrocannabinol (THC) are closely linked with e-cigarette, or vaping, product-use associated lung injury (EVALI).  CDC recommends that people not use THC-containing e-cigarettes or vaping products particularly from informal sources such as friends, family, or in-person or online sellers.\nThe San Diego County Board of Supervisors is scheduled on Tuesday, Jan. 14 to discuss several actions related to electronic smoking device regulations.\nReducing Vaping Among Teens\nLast year, more than 27% of high school students in the nation reported using electronic cigarettes in the past 30 days. That figure is up from the nearly 21% who did the previous year, according to the CDC’s annual National Youth Tobacco Survey.\n\nAccording to the California Department of Public Health (CDPH), vaping devices are the most used tobacco product, and 86% of high school teens who consume tobacco use a vaping device.\nFurthermore, of the California teens who consume tobacco products, nearly 90 percent report using a flavored vaping product.\n“Most electronic cigarettes contain nicotine and are unsafe for teens and young adults,” Wooten said. “Research has found that nicotine is highly addictive and can harm brain development. If you currently do not use tobacco or vaping products, you should not start.”\nFor more information about lung injury associated with e-cigarettes or vaping visit the County EVALI webpage, the CDPH Tobacco Free California webpage, or the CDC EVALI outbreak webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200109.14.01.50"}