{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Youth Showcase Artistic Creativity", "description": "Several students from the Youth Transition Campus (YTC) were invited to show their art at the Downtown Central Library in San Diego this month, and they were there to discuss their inspiration for their pieces at a special private reception.", "datePublished": "2025-04-29T16:12:26-07:00", "url": "https://www.countynewscenter.com/probation-youth-showcase-artistic-creativity/", "keywords": ["public safety", "art", "county probation", "youth transition campus"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-04-29T16:12:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSeveral students from the Youth Transition Campus (YTC) were invited to show their art at the Downtown Central Library in San Diego this month, and they were there to discuss their inspiration for their pieces at a special private reception.\nThe showcase is located on the second floor in the Pauline Foster Teen Center through April 30. The exhibition celebrates student voices through the arts.\n“Watching their faces when they walked into the room at the library where their art was displayed was a really special moment,” said Kara Wilson, education specialist with the San Diego County Office of Education (SDCOE). “The students had been working on these art projects for a month not knowing that they were going to be displayed or that they could go talk about their art.”\nSeveral of the teen artists’ pieces that were hung in the Downtown Central Library gallery.\nWilson said two different projects were displayed, one where students had been asked to create an image of how they would describe their mental health and another one that focused on the Civil Rights Movement.\nProbation leaders know the art and strength of collaboration to make this happen for the teens.\nOfficers collaborate with SDCOE which staffs the campus’ SOAR Academy that many of the students attend. Campus courses include options to join exceptional programs that allow students to try new forms of expression or vocational interests.\nIn this case, Probation and educators also worked with an art nonprofit organization in the community to contribute instruction, expertise and encouragement. The organization  specializes in helping trauma-impacted youth and veterans find their creative voice.  The organization says that art can provide therapeutic relief from stress and requires no special skills, just access to opportunities they might not otherwise experience.\nThe Downtown Central Library hosts the YTC Art Show with sponsorship from The Friends of the Library and the SDCOE. The library adds to the collaboration by offering a community hub for the showing.\nWilson said on that day, the library set up a magnet machine so patrons could request a miniature version of their favorite art piece to take home. The public interest and knowing their art was going out in the world as magnets was a first-time, amazing experience for them, she said.\nSometime later in the month, Wilson attended an exit interview for a girl who had completed her court commitment, and the teen was asked if there was something she was proud about that occurred while she was at the YTC. The art exhibition at the library was her immediate response, Wilson said.\nCounty Probation is dedicated to helping teens succeed through their rehabilitative commitment and provides YTC students training and skills necessary to transition and reintegrate into their communities.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250429.16.12.26"}