{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Chairwoman Delivers Her Second State of the County Address", "description": "County Board of Supervisors Chairwoman Nora Vargas gave her second State of the County address during an evening presentation Wednesday, Feb. 21.", "datePublished": "2024-02-22T10:10:14-08:00", "url": "https://www.countynewscenter.com/chairwoman-delivers-her-second-state-of-the-county-address/", "keywords": ["government", "2024 state of the county address", "chairwoman nora vargas", "day of service", "state of the county address"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-22T10:10:14-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Board of Supervisors Chairwoman Nora Vargas gave her second State of the County address during an evening presentation Wednesday, Feb. 21.\nThe chairwoman talked about the County’s many accomplishments over the last year, but said she was particularly proud of the community for rallying together to help flood victims from the devastating Jan. 22 storms.\nShe postponed her original date for the State of the County address to host a Day of Service. The chairwoman said 1,000 volunteers responded to help more than 1,000 families start rebuilding their lives.\nShe thanked the local community groups who collected donations at four locations across the county. And everyone who put together food kits, filled sandbags and pitched in help flood victims.\nChairwoman Vargas said residents stepped up with all their ‘corazon,’ the Spanish word for heart.\nAs a first-generation immigrant, she said she won’t turn her back on the thousands of immigrants and asylum seekers arriving in the county. The Board has already declared a humanitarian crisis and put $6 million toward supporting a Migrant Transitional Center.\nBut now the funds have run out forcing the center to close. Chairwoman Vargas said she sent a letter to President Biden asking for funds to operate the center. She said the County has done its part and it’s time for the federal government step up.\nThe Chairwoman also said the County has made progress on many fronts. They include homelessness, affordable housing, behavioral health, expanding health and human services programs.\nShe talked about advances in climate and environmental justice, public safety and boosting the economy.\nDespite making great strides forward, Chairwoman Vargas said there is still a lot of work to do. But she’s looking forward to building on what the County has accomplished.\nThe live address was available in American Sign Language and on social media channels and television. The broadcast offered live interpretation in Spanish and Tagalog via Zoom.\nThe event took place at Southwestern Community College in Chula Vista.\nFor details and additional proposals, watch the entire address above.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240222.10.10.14"}