{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Approves Plan to Improve Pedestrian Safety in Unincorporated Communities", "description": "County Supervisors voted this week to make improvements for pedestrians at four intersections in the unincorporated communities of La Presa, Spring Valley and Fallbrook, and to make additional improvements at 17 different locations to improve pedestrian safety.", "datePublished": "2024-03-14T09:52:57-07:00", "url": "https://www.countynewscenter.com/county-approves-plan-to-improve-pedestrian-safety-in-unincorporated-communities/", "keywords": ["transportation", "lueg", "pedestrian safety", "roadways"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-03-14T09:52:57-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesCounty Supervisors voted this week to make improvements for pedestrians at four intersections in the unincorporated communities of La Presa, Spring Valley and Fallbrook, and to make additional improvements at 17 different locations to improve pedestrian safety.\nThe Department of Public Works maintains nearly 2,000 miles of roadways, bridges, guardrails, signs, traffic signals and crosswalks in the unincorporated area.  The County secured grants for both projects from the Highway Safety Improvement Program, a federal aid program to reduce traffic fatalities and injuries.\nThe program allows states to use up to 10% of the funds on safety projects.  The funds will be used for the design and construction of improvements.\nIn October 2018, the Board adopted a plan to support efforts to promote active and safe travel options through pedestrian and bicycle improvements in the unincorporated areas. As part of the plan, the pedestrian safety data was gathered and ranked in each community.\nBuilding on these efforts, to enhance the region’s transportation system, the County also developed a Local Roadway Safety Plan to help identify roadway intersections with the highest safety needs to reduce injury and fatal collisions on the roads.\nAmong the four intersections listed below, there have been 12 reported pedestrian-involved collisions within underserved communities from January 2015 to December 2019.\n\nJamacha Road and Elkelton Boulevard (La Presa/Spring Valley)\nSweetwater Road and Troy Street (Spring Valley)\nSouth Mission Road and West Alvarado Street (Fallbrook)\nSouth Mission Road and Clemmens Lane (Fallbrook)\n\nThe intersections are also part of the County’s General Mobility Element, which provides a framework for a balanced transportation system for people within the unincorporated areas.\nThese intersections are located on essential roadways that provide access within the unincorporated areas, which requires these roadways to be safe and efficient.\nInstalling high-visibility crosswalks, curb ramps, audible and tactile pushbuttons, and pedestrian countdown signal heads will improve accessibility and safety for pedestrians, including children and individuals with vision or hearing loss.\nThe purpose of providing pedestrian connections that are safe and continuous is to support and encourage people to walk for everyday trips. Active modes of travel are increasingly recognized as an important way of improving public health, incorporating sustainable practices, and increasing the quality of life in communities.\nThe total estimated project cost is $958,554, including design, environmental review, and construction support. Construction is scheduled to begin by June 2024 and completed by August 2024.\nThe following 17 locations in the unincorporated communities of Spring Valley, La Presa, Bonita, Valley Center, Ramona, Fallbrook, Jamul, and El Cajon were identified in the Local Roadway Safety Plan for the implementation of pedestrian safety that include accessible pedestrian pushbuttons that beep/vibrate, and pedestrian countdown signal heads.\n\nAustin Dr. and Sweetwater Spring Blvd. (Spring Valley, District 4)\nLoma Ln. and Sweetwater Springs Blvd. (Spring Valley, District 4)\nElkelton Blvd. and Paradise Valley Rd. (La Presa, District 1)\nJamacha Rd. and Leland St. (La Presa, District 1)\nJamacha Rd. and Kempton St. (La Presa, District 1)\nSweetwater Rd. and Blossom Lane. (La Presa, District 1)\nBonita Rd. and Sweetwater Rd. (Bonita, District 1)\nCole Grade Rd. and Pauma Heights Rd. (Valley Center, District 5)\nCole Grade Rd. and Valley Center School Rd. (Valley Center, District 5)\nD Street and Tenth Street. (Ramona, District 2)\nH Street and Tenth Street. (Ramona, District 2)\nHanson Ln. and San Vicente Rd. (Ramona, District 2)\nFallbrook St. and Heald Lane. (Fallbrook, District 5)\nFallbrook St. and Stage Coach Ln. (Fallbrook, District 5)\nJamul Dr. and Steele Canyon Rd. (Jamul, District 2)\nMarlinda Way and Pepper Dr. (El Cajon, District 2)\nPeerless Dr. and Pepper Dr. (El Cajon, District 2)\n\nThe total estimated project cost is $576,107 including design, environmental review and Construction support. Construction is scheduled to begin by the summer of 2024 and be completed by fall 2024.\nFor more information on road related issues, visit the County’s Public Works website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240314.09.52.57"}