{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Restrictions Eased on Camping, Recreation Rentals", "description": "The County today revised its Health Officer Order, further relaxing restrictions on recreational activities, including camping and the rentals of certain recreational equipment.", "datePublished": "2020-05-08T18:40:01-07:00", "url": "https://www.countynewscenter.com/restrictions-eased-on-camping-recreation-rentals/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-08T18:53:07-07:00", "articleType": "article", "articleContent": "\nThe County today revised its Health Officer Order, further relaxing restrictions on recreational activities, including camping and the rentals of certain recreational equipment.\nEffective May 9, local campgrounds can begin to reopen, but certain restrictions will apply. Campgrounds will have to operate at 50% of their regular capacity and occupants of individual campsites must be members of the same household.\nPlaygrounds and other campground amenities will not be available at this time. Local jurisdictions within the county may have their own camping restrictions, and residents should check the rules for the specific campsite before visiting.\nIn addition, businesses that rent recreational equipment, including bicycles, surfboards, boats, kayaks and other watercraft can reopen if, like other businesses allowed to reopen, they prepare a Safe Reopening Plan.\nGroups renting equipment that can be used by multiple people have to be members of the same household. Rental facilities are required to sanitize all equipment with a disinfectant effective against the novel coronavirus after each use.\nAlso under the revised orders, childcare facilities can increase the number of children from 10 to 12 children per group. Employees at childcare facilities are no longer required to wear face coverings.\nWhile certain restrictions are being lifted, County officials are reminding residents that gatherings of any size are still banned.\n“People should stay at home as much as possible and not mingle with individuals who are not part of their own household,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Gathering restrictions remain in place to protect San Diegans from getting and spreading the virus.”\nAdditional Safety Measures for Essential Businesses\nThe revised health order also requires essential businesses that have been operating during the public health crisis to implement additional safety measures. They will be required to take the temperature of employees and not allow anyone with a temperature of 100 degrees or more into the workplace. If a thermometer is not available, businesses can screen for symptoms and should not allow in any employees who have a cough, shortness of breath or trouble breathing, or two or more of the following: fever, chills, repeated shaking with chills, muscle pain, headache, sore throat or new loss of taste or smell.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,572 new tests were reported to the County May 7, and 233 or 7% were positive.\n6% was yesterday’s 14-day, rolling average percentage of positive tests.\nSo far, nearly 73,000 tests have been administered in the County.\n\nCases:\n\n233 new cases were reported for a San Diego County total of 4,662.\n919 or 19.7% of cases have required hospitalization.\n289 or 6.2% of all cases had to be placed in intensive care.\n\nDeaths:\n\nFour more COVID-19 deaths have been reported, bringing the region’s total to 169.\nThe new deaths were three women and one man between the ages of 58 and 92. All of them had underlying medical conditions.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n61 active outbreaks; 39 at congregate living facilities and 22 in community settings\n1,110 cases, including 85 deaths in congregate living facilities\n191 cases, including five deaths in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200508.18.40.01"}