{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Got COVID? Get Treatment Now!", "description": "Chances are that you or someone you know has tested positive for COVID-19 amid the current wave of new infections in the region. Treatment is available and can help prevent severe infection, but it is important to seek help as soon as possible to see if it’s right for you.", "datePublished": "2022-07-21T16:47:52-07:00", "url": "https://www.countynewscenter.com/?p=209016", "keywords": ["health", "coronavirus", "covid-19", "monoclonal antibody treatment", "paxlovid"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-07-21T19:16:15-07:00", "articleType": "article", "articleContent": "\nChances are that you or someone you know has tested positive for COVID-19 amid the current wave of new infections in the region.\nTreatment is available and can help prevent severe infection, but it is important to seek help as soon as possible to see if it’s right for you.\n“If you’re already vaccinated then treatment gives you extra protection, and it can reduce your risk of hospitalization or worse even if you’re not,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Treatment works best if it’s started as soon as possible after infection, so get tested as soon as symptoms develop.”\nAntiviral medications require a doctor’s prescription and should be started within five days of developing symptoms of COVID-19. Monoclonal antibodies should be given no more than seven days after the onset of symptoms.\nTreatment centers and medical offices in the region may offer oral antiviral pills, such as Paxlovid and/or monoclonal antibodies delivered as an intravenous infusion. A provider will determine what treatment option is best for each individual patient based on their symptoms, age and potential underlying conditions.\nTreatment is available to individuals who meet the U.S. Food and Drug Administration’s guidelines for the medications, including those who are at high risk for developing severe COVID-19:\n\nAdults age 50 or older\nPeople of color\nLower economic status\nPeople with underlying condition(s)\nUnvaccinated San Diegans\n\nTo determine which treatment is best for you, talk to your doctor or health care provider, or call 2-1-1 to find a provider.\nPrevent Illness\nSan Diego is currently in the CDC’s high-risk community level for COVID-19, meaning virus transmission is widespread throughout the region. San Diegans should take precautions to slow the spread of the virus and:\n\nWear a mask indoors when in public\nGet all the vaccine doses and boosters\nStay home if you are sick and get tested\nAvoid crowded places\nTake other precautions, such as washing your hands and staying away from people who are visibly sick\n\n“Treatment helps,” said Kaiser, “but the best approach is always prevention.”\nVaccination Progress:\n\nReceived at least one shot: Over 3.0 million or 89.8% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: More than 2.65 million or 79.3%.\nBoosters administered: 1,406,860 or 58.0% of 2,425,587 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n17 additional deaths were reported since the last report on July 14. The region’s total is 5,387.\nOf the 17 additional deaths, five were women and 12 were men. They died between June 6 and July 13, 2022; six deaths occurred in the past two weeks.\nNine of the people who died were 80 years or older, five were in their 70s, two were in their 60s and one was in their 50s.\n14 were fully vaccinated and three were not.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n5,488 COVID-19 cases were reported to the County in the past three days (July 18 to July 20, 2022). The region’s total is now 870,079.\n12,528 cases were reported in the past week (July 14 through July 20) compared to 12,948 infections identified the previous week (July 7 through July 13).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 51.52 for people fully vaccinated and boosted, 30.02 for fully vaccinated people and 89.64 for not fully vaccinated San Diegans.\n9,564 tests were reported to the County on July 16, and the percentage of new positive cases was 14.9% (Data through July 16).\nThe 14-day rolling percentage of positive cases, among tests reported through July 16, is 15.8%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220721.16.47.52"}