{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Hold Second Budget Hearing Thursday Evening", "description": "The Board of Supervisors will hold a second public hearing at 5:30 p.m. on Thursday, June 6 at the County Administration Center.", "datePublished": "2024-06-04T10:26:20-07:00", "url": "https://www.countynewscenter.com/county-to-hold-second-budget-hearing-thursday-evening/", "keywords": ["government", "2024-25 budget", "2024-25 operational plan", "2024-25 recommended budget", "evening budget public hearing", "fgg", "public hearing"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-06-04T10:26:20-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe Board of Supervisors will hold a second public hearing at 5:30 p.m. on Thursday, June 6 at the County Administration Center.\nThe evening hearing gives people another chance to attend if the morning hearing on June 4 didn’t work for their schedule.\nThe recommended budget came out May 2 and totals $8.48 billion, an increase of $317.7 million or 3.9% over the 2023-24 adopted budget. The budget also includes roughly 72 new positions, a 0.4% increase.\nThe plan maintains core services and calls for funding to support the County’s budget priorities. They include behavioral health, homelessness, affordable housing, roads, justice reform and environmental sustainability.\nOverall, the recommended budget increase is smaller than previous years, limiting the growth of staffing and reducing spending on capital projects.\nThe County provides many services across the region, including food and restaurant inspections, beach and bay water testing, elections, social services, health programs, foster care, adult protective services and more.\nIn addition, the County provides city-type services for those who live outside of the region’s 18 cities in the unincorporated area, including law enforcement and fire protection, and maintenance of parks, libraries and roads.\nCounty staff prepared the budget using community input collected throughout the year, an equity assessment to evaluate potential impacts to vulnerable populations and additional data.\nAbout half of the County’s budget funding comes from federal, state or other governments. The Governor released the revised state budget recently, and staff is currently reviewing it for impacts to the County and monitoring areas where revisions may be needed pending the final state budget. The overall economy may also affect projected County funding in the next couple of years.\nThe County will release its revised recommended budget June 13, with approval of the final budget by the Board of Supervisors expected on June 25. The budget will take effect July 1.\nLearn more about the recommended budget by reviewing an executive summary or the full recommended budget plan.\nGive your feedback and let us know how you prefer to receive updates on the budget process by leaving comments at Engage San Diego County now through June 13.\nYou can also watch, listen and participate in the budget hearing, and the June 25 Board meeting for deliberations and adoption.\nAttend the Meeting in Person\nThe meetings will take place in room 310 at the County Administration Center located at 1600 Pacific Highway, San Diego, CA 92101.\nSpanish language translation services for public speakers are available at Board meetings.\nArabic, Chinese (Mandarin), Korean, Persian (including Farsi, Dari), Somali, Spanish, Tagalog (including Filipino), and Vietnamese translations of the overall proceedings are also available upon request at least 72 hours prior to the meeting. Contact the Clerk’s office at (619) 531-5434 or email PublicComment@sdcounty.ca.gov.\nWatch Online\nThe live stream broadcast online may be delayed by 45-seconds or more depending on the service and your internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo  \nCounty YouTube Channel (Closed captioning available)\nFacebook Live\nTwitter\n\nWatch on TV\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nAT&T U-Verse Channel 19\n\nListen on the Phone\n\nCall in to (619) 531-4716 for a listen-only line to the live Board meeting while it is in session.\n\nComment Online or by Phone\n\nOnline: Submit your feedback on the budget at Engage San Diego County’s budget page before public hearings formally end on June 13.\nBy phone: To speak during the live meeting by phone, fill out the Board of Supervisors tele-comments form and submit it before the meeting starts. After submitting the form, you will receive instructions on how to call in to the meeting.\n\nFor more information, visit the Clerk of the Board’s website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240604.10.26.20"}