{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Giving Children Special Holiday Memories with County “Cops”", "description": "Regional law enforcement, including San Diego County Probation, Sheriff’s and District Attorney officers, accompanied 300 specially selected local third graders for a fun day that ended with a $200 holiday shopping spree at Target.", "datePublished": "2023-12-06T09:51:41-08:00", "url": "https://www.countynewscenter.com/giving-children-special-holiday-memories-with-county-cops/", "keywords": ["public safety", "district attorney", "probation", "san diego county sheriff s department", "shopwithacop"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-12-06T16:03:43-08:00", "articleType": "article", "articleContent": "\nRegional law enforcement, including San Diego County Probation, Sheriff’s and District Attorney officers, accompanied 300 specially selected local third graders for a fun day that ended with a $200 holiday shopping spree at Target.\n“The Probation Department is proud to partner with STAR/PAL in this wonderful event that benefits youth in our community.  This is an opportunity to be part of a joyful holiday for children who, without this event, may not experience one,” said Chief Probation Officer Tamika Nelson.  “It’s also a chance for positive interaction with officers in a fun setting.  We’ve supported this event for many years, and we are excited to be the host agency next year.”\nEvery year, the Probation and Sheriff’s departments and District Attorney investigators help raise money with raffles, swag and other fundraising ideas to go toward the event, as do all the law enforcement agencies. Next year’s event is planned for Dec. 7.\nThe youth participants in this year’s 30th annual “Shop with a Cop” event enjoyed breakfast and a private Dolphin Show at SeaWorld followed by shopping at Target. Shop with a Cop is an annual event hosted by STAR/PAL and a committee of local law enforcement agencies, led this year by the National City Police Department, SeaWorld, and Target. Law enforcement officers from over 25 different local, state, and federal agencies participated in the event by partnering with a school on their beat and spending the day getting to better know the youth and families they serve in the neighborhoods they patrol.\n\nThe children were selected from local elementary schools by counselors and teachers as well as officer referrals.\nFor STAR/PAL, the aim of the day was not only to provide children with a happier holiday season, but also build meaningful relationships between law enforcement and youth through nonenforcement interactions that cultivate communal trust.\nThe San Diego District Attorney’s Office\nSan Diego County Probation Department\nSan Diego County Sheriff’s Department\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231206.09.51.41"}