{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Take Precautions, Be Prepared During Red Flag Conditions", "description": "Extreme low humidity and forecasted high winds will result in elevated wildfire danger and a red flag warning through Saturday in the San Diego County mountains and inland valleys.", "datePublished": "2020-12-02T12:09:12-08:00", "url": "https://www.countynewscenter.com/take-precautions-be-prepared-during-red-flag-conditions/", "keywords": ["public safety", "alertsandiego", "fire preparedness", "readysandiego", "red flag", "sd emergency"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-12-02T12:09:12-08:00", "articleType": "article", "articleContent": "\nExtreme low humidity and forecasted high winds will result in elevated wildfire danger and a red flag warning through Saturday in the San Diego County mountains and inland valleys.\nResidents are asked to be alert for wildfires and to take steps around their homes and properties to reduce the risk of wildfire. Be careful to restrict use of certain power tools since they can sometimes spark fires.\nWhat you can do now is cut away and remove dead and dying plants near your home and other structures, but only by using hand tools since power tools, including lawn mowers, can potentially spark on rock and start a grass fire.\nRemove dead leaves and other debris leading up to your home, including wood piles that may be stacked against structures. These things can all be ignited by embers from a wildfire.\nBe particularly careful with smoking materials to avoid accidentally starting a fire.\nNever pull your vehicle over in grass as it can ignite a grass fire. Make sure your vehicle is well maintained as faulty catalytic converters have been a major cause of accidental fires in San Diego County.\nAlso, if you have a trailer on your vehicle, make sure the chains don’t drag on the ground while driving and spark a fire.\nAn important way to prepare is to stay informed in the event of a regional emergency.\nRegister for AlertSanDiego or ListoSanDiego, the County’s cell phone notification service. By doing that, you will receive any emergency messages such as evacuation warnings that apply to your neighborhood on your cell phone.\nResidents can download the County’s SD Emergency app in English or Spanish from the Google Play store or the Apple App Store. The app provides news updates, maps, shelter locations and includes disaster planning templates and interactive checklists. If a regional emergency, such as a wildfire, does occur, updates and other information will be posted at sdcountyemergency.com and sent out via the app.\nDon’t wait until an emergency, when you’re already stressed to figure out what you need to do in the event of an evacuation. Complete a family disaster plan template from the app or from ReadySanDiego.org to help your family plan for an emergency including where to meet if you are separated and cannot return home.\nTo find more information about safeguarding your home from wildfires and general disaster preparation, visit ReadySanDiego.org.\nYou can also stay in touch with official emergency information by following CAL FIRE on Twitter in the event of a fire. More weather forecast information and updates are available at the National Weather Service.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201202.12.09.12"}