{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Celebrates National Adoption Month with 31 Families", "description": "The County’s Child and Family Well-Being Department (CFWB) hosted its annual Adoption Day Party Friday at the Juvenile Courthouse to celebrate National Adoption Month.", "datePublished": "2024-11-25T13:53:00-08:00", "url": "https://www.countynewscenter.com/county-celebrates-national-adoption-month-with-31-families/", "keywords": ["families", "adoption", "cfwb", "community", "equity", "foster"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-11-25T13:57:43-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County’s Child and Family Well-Being Department (CFWB) hosted its annual Adoption Day Party Friday at the Juvenile Courthouse to celebrate National Adoption Month.\nEach November dozens of children and their new parents celebrate officially becoming a family. This year 31 families finalized the adoption of 36 children.\nOne of those families is Raymond and Ricciee Soriano, who adopted three-year-old Parker.\n“I couldn’t sleep last night… This overwhelming feeling of oh my god this is really it,” Raymond said.\nTissues and tears, cheers of celebration and moments of embrace throughout the event illuminated how much love surrounds these children.\n“When we were signing our paperwork and saw his name, what his new name is going to be, that’s when it just was oh my gosh, this is really happening… he’s finally ours,” Ricciee said of her son Parker.\nThe couple started fostering Parker when he was four months old and were overjoyed when the adoption became official.\nInformation about becoming a resource parent is available at SDCares4kids.com.\nFamily strengthening is a pillar of the 1-year-old CFWB. Focused on providing prevention and support services, the new Child and Family Well-Being Department started its transformation in July 2023, combining the First 5 Commission and what was then called Child Welfare Services.\nIn its first year of operation, the department reduced the number of children in foster care by nearly 12 percent. For children placed into foster care, 44 percent found a home with relatives, a 10 percent increase over the previous year.\nThe department continues to evolve and work with the community and experts to identify how to best serve families. This includes developing a Community Response Guide and continuing efforts related to the Child Care Blueprint.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241125.13.53.00"}