{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "150 Official Ballot Drop Boxes Open for November Presidential General Election", "description": "Starting Tuesday, Oct. 8, registered voters can return their mail ballot for the November Presidential General Election to any one of 150 official ballot drop boxes located around the county.", "datePublished": "2024-10-08T13:00:28-07:00", "url": "https://www.countynewscenter.com/150-official-ballot-drop-boxes-open-for-november-presidential-general-election/", "keywords": ["elections", "2024 presidential general election", "ballot drop boxes open", "county registrar of voters", "equity", "fgg", "general election", "nov. 5 presidential general election", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-10-10T15:16:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesStarting Tuesday, Oct. 8, registered voters can return their mail ballot for the November Presidential General Election to any one of 150 official ballot drop boxes located around the county.\nMail ballots for the County’s 1.9 million registered voters are expected to arrive this week.\nWhat do the Registrar’s official ballot drop boxes look like?\nThe Registrar’s official ballot drop boxes are red, white and blue and feature the Registrar’s logo along with the County seal. All boxes are labeled “Official Ballot Drop Box” and made from high grade, heavy gauge stainless steel.\nEach official ballot drop box is designed to prevent physical damage and unauthorized access to mail ballots. The boxes feature double-locking access doors, anti-pry door jambs and other anti-theft construction measures. The Registrar’s ballot retrieval team is responsible for collecting ballots inside the box.\nHow do I return my ballot to an official ballot drop box?\nMark your ballot, seal your completed ballot inside your return envelope, date and sign your name on the return envelope, and return it in the mail or to one of the Registrar’s official ballot drop boxes around the county. Remember, your signature is required for your vote to count.\nOut of the 150 official ballot drop boxes, 118 are located outdoors and are open 24 hours a day up until 8 p.m. on the final day of voting, Nov. 5. The thirty-two remaining boxes are located indoors and only available when the facility where they are housed is open. Visit sdvote.com to check the location list or the locator map for each facility’s hours of operation before heading out to return your ballot.\nHow do I vote in person?\nEarly voting began Monday at the Registrar of Voters office located on the County Operations Center campus in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday.\nStarting Saturday, Oct. 26, you can vote in-person at any one of 39 vote centers. They’ll be open daily from 8 a.m. to 5 p.m.\nOn Saturday, Nov. 2, over 200 locations will be available. The vote centers will be open daily from 8 a.m. to 5 p.m. through Nov. 4. On the final day of voting, Nov. 5, all vote centers and official ballot drop boxes will be open from 7 a.m. to 8 p.m.\nWith a significant number of contests on the ballot, the voting process may take longer than usual. The Registrar’s office recommends using early voting options to avoid long lines. You have the option of casting your ballot by mail, at an official ballot drop box or at any vote center around the county.\nIf you plan on voting in person, be prepared. Read your pamphlet and mark your selections on the sample ballot in advance. When you go inside the voting booth at the vote center, you can refer to your choices on the sample ballot to conveniently mark your selections on your official ballot.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet or you can look it up online at sdvote.com.\nLearn more about voting in the November Presidential General Election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241008.13.00.28"}