{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Announces Transition Plan for Emergency Temporary Lodging Program Participants", "description": "More than 800 households will be transitioning from the County’s Emergency Temporary Lodging program on or before May 11. The Emergency Temporary Lodging Program was created as a bridge to provide temporary lodging for those displaced by the January floods.", "datePublished": "2024-03-29T16:43:43-07:00", "url": "https://www.countynewscenter.com/county-announces-transition-plan-for-emergency-temporary-lodging-program-participants/", "keywords": ["government", "emergency temporary lodging program", "january flood"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-03-29T16:57:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesMore than 800 households will be transitioning from the County’s Emergency Temporary Lodging program on or before May 11. The Emergency Temporary Lodging Program was created as a bridge to provide temporary lodging for those displaced by the January floods.\nThe County and partners from the City of San Diego and National City have been calling more than 400 program participants who have not yet applied for FEMA assistance to encourage them to apply for the federal aid as soon as possible. Applying to FEMA is an important step as part of the County Emergency Temporary Lodging Program.\nOne hundred and sixty-nine households have not answered phone calls or responded as of March 29. To register with FEMA, call the FEMA hotline at 1-800-621-3362 or go to disasterassistance.gov/.\nStarting Tuesday, April 2, letters will go out to program participants who may no longer be eligible to remain in the Emergency Temporary Lodging Program. The letter will notify them they are currently ineligible for the program and if they remain ineligible, their reservation will expire in seven days.\nMore than 6,000 individuals and households have registered for FEMA assistance and 2,299 are already approved to receive financial assistance from FEMA to support home repair or finding a new place to stay. More than $17 million has been dispersed. The County is notifying program participants on when they will need to transition from the program based on their specific circumstances.\nAll households have been grouped into one of three categories, those who need to transition from the program within seven days, 14 days, and those who can remain in the program up to May 11.\nThose who will be asked to transition from the program within seven days are households who the County does not have a record they registered for FEMA aid, violated the code of conduct, did not have documentation their home was impacted by January flooding, and did not submit proof of claim filed to homeowners or renters’ insurance.\nIf you are a County Emergency Temporary Lodging program participant with questions concerning your eligibility for assistance through FEMA, please call 858-715-2255 as soon as possible. County Disaster Service Workers will be prepared to answer questions and provide guidance when the packets are handed out. Staff will be returning phone messages over the weekend.\nSeven days allows people to find other arrangements or to be connected with resources available through housing agencies or programs.\nPeople transitioning from the County’s temporary lodging program in 14 days are those who have received notification from FEMA that their home is safe to move back into. Fourteen days allows time to make moving arrangements, clean and buy items for their residence.\nMany are working toward finding a suitable place to stay with FEMA disaster aid and may stay up to May 11. The end date for all participants of the County’s temporary lodging program is May 11. This allows households to prepare and move to a more permanent housing location.\nTo support all program participants, the County is providing a resource packet with letters that will notify them of the transition. The packets will include flyers with information on mental health, volunteer support, food support and FEMA or state resources.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240329.16.43.43"}