{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands COVID-19 Vaccination Availability To Ages 75 And Up", "description": "Due to a slowing of appointments at COVID-19 vaccination sites, the County of San Diego today expanded the category of those eligible to include those aged 75 and up.", "datePublished": "2021-01-18T13:10:30-08:00", "url": "https://www.countynewscenter.com/county-expands-covid-19-vaccination-availability-to-ages-75-and-up/", "keywords": ["health", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-18T13:40:31-08:00", "articleType": "article", "articleContent": "\nDue to a slowing of appointments at COVID-19 vaccination sites, the County of San Diego today expanded the category of those eligible to include those aged 75 and up.\n“We took this action today to add individuals 75 years of age and older because they are at the greatest risk,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “It remains our intention to expand vaccines to those 65 and older the week of January 25, contingent of vaccine availability.”\nThese new requirements apply to the Petco Park Vaccination Super Station and other Point of Distribution sites providing County vaccine. More information is at coronavirus-sd.com/vaccine and reservations can be made at vaccinationsuperstationsd.com.\nOnly Health Care Workers (Phase 1A, All Tiers) and those 75 and older (Phase 1B, Tier 1) can visit vaccination sites.\n\nHealth care workers are encouraged to first contact their doctor or healthcare providers to request the vaccine, but if none are available, then they should make an appointment for a County site\n\n\nAppointments are required; walk-ups and drive-ups without appointments will be turned away.\nDo not schedule an appointment if you have COVID-19, or are sick. Please follow CDC guidance for those situations\nMedical professionals administering the vaccine will be wearing personal protective equipment\nWear a mask\nAcceptable forms of proof to be presented at the County’s Vaccine Super Station\nEmployee ID badge with photo or other documents, including a professional license and a photo ID, signed letter from their employer on facility letterhead and a photo ID; or, a payment stub or timesheet from their healthcare employer or in-home supportive services with a photo ID\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210118.13.10.30"}