{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Rural Health Discharge Program Extended", "description": "A medical team that provides in-home follow-up care to patients who were recently hospitalized at Sharp Grossmont Hospital is helping them avoid unplanned returns to the emergency room.", "datePublished": "2024-10-03T12:02:04-07:00", "url": "https://www.countynewscenter.com/rural-health-discharge-program-extended/", "keywords": ["health", "county fire", "county public health", "hhsa", "psg", "rural health discharge program"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-10-03T12:02:04-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesA medical team that provides in-home follow-up care to patients who were recently hospitalized at Sharp Grossmont Hospital is helping them avoid unplanned returns to the emergency room.\nThe County, Grossmont Healthcare District, and Sharp Grossmont Hospital partnered to pilot this program in June 2023 and are extending the mobile service for another year. Plans are underway to expand it.\nIn the three years prior to the pilot program, 12% of patients were readmitted to Sharp Grossmont Hospital within 30 days of discharge. A little more than a year after launching the Rural Health Discharge Program, the unplanned readmission rates are down to 4% for those rural residents who opted into the program, according to Sharp Healthcare.\n“One of our very first patients at the beginning of the program, he was just in awe that the program would travel so far out there to see him and check on him. He said he previously felt that the population out there in the rural areas were the forgotten population,” said County public health nurse Amy Dull, one of three nurses who rotate on the team.\nNick Johnson, a CAL FIRE/County Fire captain paramedic, who goes on all the calls said each patient gets 30 days, and the team goes out once a week to check on patients for that time period.\n“We give them tools to make them more self-sufficient,” he said.\nPatients receive a battery-operated automated blood pressure cuff, an oximeter that measures oxygen saturation, an oral thermometer and educates them and a caregiver or family member, if one is around, on normal to dangerous ranges for readings, he said.\nJohnson said once they have determined that the patient is stable, he looks around to see how he can help with fall risk and fire risk issues. He checks to see if they have working smoke detectors, and if they do not, he installs one for them. Johnson does basic defensible space work around the home because many of them cannot do it themselves as they are medically fragile.\n“A lot of these folks are by themselves, so we may be the only person who goes to see them and have a true conversation with them in a week. We become attached to our patients,” he said.\nBeing isolated “affects mental health a lot, so we try to link them up with certain programs like YANA, (the Sheriff’s) You Are Not Alone program which checks in with them once our 30 days are up, or their neighbors, if they give us permission, to set up a plan,” Dull said. “It’s nice to establish these relationships with people. I think it means as much to us as it does to them.”\nRural residents have traditionally had a higher readmission rate than people who live in more urban . For some, longer travel distances to hospitals for follow-up care may be more challenging, and for some it may be due to economic disparity.\nTo address the disparity, the County, Grossmont Healthcare and Sharp Grossmont Hospital partnered to begin a pilot program last summer to see if it would reduce the percentage of patients who are discharged from the hospital, then have an unplanned readmittance within a 30-day period.\nThe Post-Hospital Rural Health Discharge Program is modeled on one the healthcare district has in place for people who live in more urban communities. The rural expansion began in collaboration with Supervisor Joel Anderson’s office, San Diego County Fire, the County Health and Human Services Agency, Grossmont Healthcare District, San Ysidro Health and Sharp Grossmont Hospital.\nThe hospital district and the County split costs of the County public health nurse and CAL FIRE/County Fire paramedic team.\nNot only does the program improve patient care by assessing them at home, it also helps the hospital avoid costs that can add up to upwards of $350,000 annually.\n“The Grossmont Healthcare District is dedicated to ensuring that all residents, particularly those in underserved rural areas, receive the care and support they need to stay healthy after leaving the hospital,” said Amy Abrams, MSW, MPH, Chief Community Health Officer at Grossmont Healthcare District. “This program exemplifies the power of public-private partnerships in addressing critical healthcare challenges while also demonstrating cost-effective solutions that benefit the entire healthcare system.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241003.12.02.04"}