{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Exercise Safety First When Hiking in the Heat", "description": "There are hundreds of hiking trails available to San Diego County residents and visitors, but it can be dangerous, and even deadly, to not take the heat into consideration before lacing up your boots.", "datePublished": "2024-06-26T10:11:23-07:00", "url": "https://www.countynewscenter.com/exercise-safety-first-when-hiking-in-the-heat/", "keywords": ["public safety", "cal fire", "county parks", "emergency", "hiking safety tips", "san diego county fire"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-06-26T10:11:23-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThere are hundreds of hiking trails available to San Diego County residents and visitors, but it can be dangerous, and even deadly, to not take the heat into consideration before lacing up your boots.\nOver the weekend, a 50-year-old woman died after leaving a group of hikers she was hiking with and setting out on her own in the Black Mountain Open Space Park in the City of San Diego.\nThe County routinely closes parks in remote areas due to excessive heat to protect hikers, but heat can be an issue on any trail. Often, CAL FIRE/San Diego County firefighters and sheriff’s deputies are called to help rescue people who have become ill or injured while on hikes. In 2024 to date, CAL FIRE/San Diego County Fire have responded to 50 hiker rescue/aid calls, though not all were heat-related.\nTo avoid becoming ill or injured, CAL FIRE/San Diego County Fire Capt. Brent Pascua suggests people, especially less experienced hikers, avoid hiking during the hottest parts of the day, head out early before it gets hot or later in the day, when it is starting to cool off.\nAdditionally, he offered these safety tips to help people prepare for hiking in warm weather.\n\nChoose hikes that are appropriate for your skills and physical condition. Go with the safest option trail in intense heat.\nStay hydrated. Drink water before, during and after hiking.\nCheck weather forecasts and be familiar with the terrain for your trail.\nLet someone know where you will be and when you plan to return. Don’t just rely on your cell phone because it can lose reception in remote areas.\nHike with others, never alone.\nBring a backpack or bag with food and water, extra sunscreen to reapply and a flashlight, first aid kit, multipurpose tool or knife and a whistle.\nPark rangers recommend one liter (about a quart) for every 2 to 3 miles. Bring more water than you think you’ll need — and even more water on longer or strenuous trails.\nNon-perishable items like dried fruit, energy bars, trail mix, peanut butter, canned tuna, whole grain crackers and jerky are a perfect, healthy snack. They provide fuel to boost your energy levels and to make up for lost calories.\nDon’t forget your hat and sunglasses and apply sunscreen.\nDress in layers of breathable, light-colored, loose-fitting clothes that you can take on and off, based on the temperature and can prevent sunburns.\nGood boots provide grip in rocky and slippery areas, but they also provide a thick layer of protection from the hot earth.\nFollow posted safety rules.\nPrint out a map of the trail to bring along to stay on track. Prolonged exposure to heat can cause disorientation or heat stroke.\nIf your body temperature gets too high during a hike, you run the risk of suffering heatstroke. Heatstroke is usually caused by dehydration, which leads to the failure of the body’s natural temperature control system. Symptoms include headache, dizziness, muscle cramps, nausea, disorientation, lack of sweat, and loss of consciousness. If you start to experience any of these signs, stop and find a shady area along the trail where you can rest, drink water and refuel with a healthy snack. If symptoms persist, call 911.\nLeave your dog or dogs at home. Dogs get overheated easily. Never leave your pet in the car. On an 85 degree day, a car can reach 102 degrees in 10 minutes and soar upward to 120 degrees –even with the windows down an inch or two.\nIf you do take your dog, bring plenty of water for your pet and please don’t walk your dog on hot pavement, asphalt or sand in the heat, it will burn their paws.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240626.10.11.23"}