{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Permit Refunds Provide More Pandemic Assistance to Restaurants", "description": "The County will begin notifying restaurants today of $4.5 million in permit fee refunds for the period of March 16, 2020 through June 15, 2021.", "datePublished": "2021-08-12T15:11:47-07:00", "url": "https://www.countynewscenter.com/county-permit-refunds-provide-more-pandemic-assistance-to-restaurants/", "keywords": ["government"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-08-12T16:15:34-07:00", "articleType": "article", "articleContent": "\nThe County will begin notifying restaurants today of $4.5 million in permit fee refunds for the period of March 16, 2020 through June 15, 2021. The amount, which is the result of a recent settlement in a lawsuit brought by a local restaurant group, is in addition to $118.9 million already provided to restaurants by the San Diego County Board of Supervisors to help offset the impact of California’s stay-at-home and local public health orders.\nMore information on the 640 Tenth LP v. County of San Diego, et al. case and settlement can be found here.\n“Restaurant owners and their employees suffered significant losses because of COVID-19. As the industry rebuilds, this refund will aid restaurants in their economic recovery and is in addition to the tens of millions of dollars provided to them during the height of the pandemic,” said Nathan Fletcher, Chair of the San Diego County Board of Supervisors. “To help restaurants recover and ensure we can continue to move San Diego County forward, everyone who has not received the vaccine should get it. The economic recovery of restaurants and other businesses depend on it.”\nSarah Aghassi of the County’s Land Use & Environment Group added, “The restaurant industry is a valued and important part of our local economy, and it has been seriously impacted by the pandemic closures. We look forward to maintaining our partnership as we move forward with our economic recovery.”\nTo date, the County has provided $123.4 million to specifically help restaurants. This includes:\n$12 million from County fee-related actions supporting restaurants: \n\nMarch 24, 2020 – Deferred health permit fees through Sept. 1, 2020 for food facilities negatively impacted by the March 16, 2020 Local Health Officer and Emergency COVID-19 Regulations and the California Stay-at-Home Order.\nOctober 27, 2020 – Extended the deferral of annual health permit fees, plan check fees, and late fees for restaurants and food facilities through March 31, 2021.\nApril 7, 2021 – No increases for Department of Environmental Health & Quality fees for fiscal year 2021-22 and funding to offset the needed increases proposed.\nMay 5, 2021 – Waived health permit fees for all restaurants and limited food preparation facilities for fiscal year 2021-22.\n\n$90.2 million to fund the Great Plates program that partnered with restaurants during the pandemic to deliver meals to participating seniors from May 2020 through July 30, 2021.\n$4.5 million from the lawsuit settlement: \nJune 8, 2021 – Agreed to a class action lawsuit settlement (640 Tenth LP v. County of San Diego, et al.) for all restaurants and limited food preparation facilities in the County of San Diego that paid or were required to pay annual permit fees to the County of San Diego Department of Environmental Health and Quality from March 16, 2020 through June 15, 2021.\n\nThis provides a 50% refund of annual permit fees to restaurants that paid, and 50% credit to those that owe annual permit fees.  It also waives late fees for untimely payment of permit fees that were due from March 16, 2020 through June 15, 2021, as long as the fees are paid within 12 months of the original due date or by December 31, 2021, whichever is sooner.\n\n$16.72 million in support was provided to restaurants and limited food preparation facilities through Small Business Stimulus Grant program.\nThe County of San Diego is committed to supporting the region’s ongoing economic recovery and is working with stakeholders to find different ways to support the business community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210812.15.11.47"}