{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voter Information Pamphlets Go Out to Registered Voters for March Presidential Primary Election", "description": "Voter information pamphlets are on their way to the County’s 1.9 million registered voters for the March 5 presidential primary election.", "datePublished": "2024-01-26T10:46:35-08:00", "url": "https://www.countynewscenter.com/voter-information-pamphlets-go-out-to-registered-voters-for-march-presidential-primary-election/", "keywords": ["elections", "fgg", "march 5 presidential primary", "registrar of voters", "sample ballot and voter information pamphlets"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-01-26T10:57:03-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteVoter information pamphlets are on their way to the County’s 1.9 million registered voters for the March 5 presidential primary election.\nWhen you receive your pamphlet, check the back for your party registration. Your political party preference determines which presidential primary candidates will appear on your primary election ballot.\nThe Registrar urgers voters to review each political party’s rules if you plan to vote in the presidential primary contest.\nStarting this election, you’ll see the Registrar’s voter information pamphlets will look a little different. They will provide the same important information but will be larger in size, similar to the Secretary of State’s Voter Information Guide.\nThe pamphlet contains election information on voting options, election deadlines, candidate statements, ballot measures and more. Voters may also view their sample ballot pamphlet online with the View your Sample Ballot tool at sdvote.com.\nIf you signed up to get your voter information pamphlet electronically, you should have received an email giving you the same information and a link to your pamphlet.\nVoters who want to be among the first to see their pamphlet every election can sign up to receive all future pamphlets electronically. Voters who take this option will no longer receive a paper copy in the mail but will get an email notification when the pamphlet becomes available online.\nMeantime, the Registrar is still looking for poll workers, especially bilingual poll workers.\nLearn more about voting in the March presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240126.10.46.35"}