{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Water-Quality Device Named Public Works ‘Project of the Year’", "description": "The County’s Sweetwater Lane Community Park Trash Capture project was recognized on May 11, as the American Public Works Association (APWA) San Diego/Imperial Counties Chapter’s 2023 Project of the Year.", "datePublished": "2023-05-17T17:13:18-07:00", "url": "https://www.countynewscenter.com/county-water-quality-device-named-public-works-project-of-the-year/", "keywords": ["environment", "county parks", "lueg", "trash", "water pollution", "water quality"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-05-17T17:20:29-07:00", "articleType": "article", "articleContent": "\nThe County’s Sweetwater Lane Community Park Trash Capture project was recognized on May 11, as the American Public Works Association (APWA) San Diego/Imperial Counties Chapter’s 2023 Project of the Year. This state-approved trash capture device will prevent a large amount of pollutants from impacting the community, the San Diego Bay and ultimately, the ocean.\nAPWA’s Awards Program recognizes outstanding individuals, groups and chapters representing the best in the public works profession.\nInstalled and managed by the Public Works Department (DPW), the project’s primary goal is to protect the environment and improve water quality. DPW worked closely with local residents, landowners, the Spring Valley Community Planning Group and the County’s Department of Parks and Recreation to bring it to fruition.\nThe project team changed the storm drain system to include an offline underground stormwater treatment facility that is a trash capture device. The device, also known as a debris-separating baffle box (DSBB), removes trash, debris, sediment and other pollutants found in runoff.\nThe DSBB receives approximately 274 acres, or more than 200 football fields, of runoff that contains trash, sediment and debris from residential and commercial land uses.\nConstruction of the DSBB was completed December 2021 and took approximately four months. The park was able to remain open during that time, limiting impact to the community. The total project cost was just under $890,000.\nDuring the first maintenance of the device, which occurred in October 2022, approximately 6 cubic yards, or about three pickup truck beds full, of trash, sediment and debris was removed, preventing those pollutants from entering San Diego’s waterways.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230517.17.13.18"}