{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Grants Now Available to Improve Neighborhoods, Communities", "description": "The County is now accepting proposals for grants to improve neighborhoods and communities in San Diego’s unincorporated area.", "datePublished": "2021-09-08T13:05:45-07:00", "url": "https://www.countynewscenter.com/county-grants-now-available-to-improve-neighborhoods-communities/", "keywords": ["housing", "cbdg", "grant proposals", "housing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-08T13:05:45-07:00", "articleType": "article", "articleContent": "\nThe County is now accepting proposals for grants to improve neighborhoods and communities in San Diego’s unincorporated area.\nFunding for the projects comes from the U.S Department of Housing and Urban Development’s Community Development Block Grant (CDBG) program, which provides an annual grant to County department of Housing and Community Development Services.\nThe purpose of the grant is to allow residents and nonprofits to submit projects that benefit low- to moderate-income residents if the project aligns with the County’s Consolidated Plan. Grant applications for the 2022-2023 CDBG awards are now open and will be accepted through Nov. 1, 2021 at 5 p.m.\nThe CDBG program provides funding for a wide range of activities focused on community facilities and infrastructure development, affordable housing acquisition or preservation, neighborhood enhancement and a limited range of public services targeted at low- and moderate-income communities.\nDepending on the project, federal money may be available to improve your community. In the past, federal CDBG funds have been used for community centers, parks, streets, accessibility issues and public facilities and services.\nResidents and nonprofits working in the unincorporated area of the county may propose projects for CDBG funding that benefit low- and moderate-income persons and align with one of the County’s Consolidated Plan goals:\n\nIncrease affordable housing opportunities across the region for low-to moderate-income and special needs residents\nPrevent or end homelessness through accessible housing and supportive services\nEnhance community infrastructure and facilities to provide a suitable and sustainable living environment\nProvide housing and support services for those living with HIV/AIDS.\n\n Applications should be submitted via email to marco.delatoba@sdcounty.ca.gov, freddy.villafan@sdcounty.ca.gov, and sarahsnook.brunson@sdcounty.ca.gov. If unable to submit electronically, applications may be mailed to 3989 Ruffin Rd., San Diego, CA 92123.\nFor more information about the CDBG program and to access applications, please visit our CDBG page. If you have any questions or concerns, please contact Marco De La Toba (858-694-8724), Freddy Villafan (858-694-8747), or Sarah Snook Brunson (619-375-3346).\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210908.13.05.45"}