{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Treatment Option Added in South Bay", "description": "San Diegans now have an additional option to access a treatment that significantly reduces symptoms for COVID-19 patients, with the opening of a Monoclonal Antibody Treatment Center (MARC) in Chula Vista today.", "datePublished": "2021-04-19T16:21:32-07:00", "url": "https://www.countynewscenter.com/covid-19-treatment-option-added-in-south-bay/", "keywords": ["health", "coronavirus", "covid-19", "marc", "monoclonal antibody"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2021-04-19T16:21:32-07:00", "articleType": "article", "articleContent": "\nSan Diegans now have an additional option to access a treatment that significantly reduces symptoms for COVID-19 patients, with the opening of a Monoclonal Antibody Treatment Center (MARC) in Chula Vista today.\nThe treatment is available at no cost regardless of health insurance or immigration status, and a doctor’s referral is not required. San Diego County and San Ysidro Health worked with federal, state and community partners to open the new facility inside the former Chula Vista Fire Station #5. This is the second MARC facility in the county.\nThe FDA has authorized the use of combination monoclonal antibody therapies to treat mild-to-moderate COVID-19 in adults and children. Monoclonal antibodies are laboratory-made proteins that mimic the immune system’s ability to fight viruses. The combination therapy has proven to significantly reduce hospital visits and death in COVID-19 positive patients, if administered within 10 days of the onset of symptoms. It can also help people get back to work and back to their lives without the lingering symptoms of COVID-19.\nIn early February, Palomar Medical Center Downtown’s MARC became the first in the county to be dedicated to this treatment model. The intravenous treatment takes less than an hour and is for people who are at high risk for serious complications from COVID-19. Patients or providers can call (619) 685-2500 to schedule an appointment at either site. The MARC at San Ysidro Health is open 8 a.m. to 5 p.m., seven days a week.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210419.16.21.32"}