{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Groundbreaking Celebration for New Public Health Lab", "description": "Shovels sent dirt flying and with that, construction work could begin on a new state-of-the-art public health lab. County officials broke ground for the facility at the County Operations Center in Kearny Mesa Wednesday.", "datePublished": "2023-10-04T15:09:55-07:00", "url": "https://www.countynewscenter.com/groundbreaking-celebration-for-new-public-health-lab/", "keywords": ["health", "county operations center", "fgg", "groundbreaking", "hhsa", "office consolidation", "parking structure", "public health lab"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-10-04T15:09:55-07:00", "articleType": "article", "articleContent": "\nShovels sent dirt flying and with that, construction work could begin on a new state-of-the-art public health lab.\nCounty officials broke ground for the facility at the County Operations Center in Kearny Mesa Wednesday.\nThe new $93.3 million lab will be nearly three times the size of the old, cramped and outdated building on Rosecrans. The facility closed due to its aging infrastructure.\nThe new two-story facility will measure 52,000 square feet and create space for nearly 90 employees and contractors, and still allow room to grow.\nThe County’s public health lab protects the health of everyone in the region by testing for infectious diseases like COVID-19, Respiratory Syncytial Virus known as RSV, flu and a host of other diseases.\nLab workers also test for food and water safety, animal rabies and dangerous pathogens like anthrax. They conduct research, assess environmental health and help with emergency preparedness and response.\nThe new facility will serve as the Centers for Disease Control and Prevention Lab for San Diego and Imperial Counties.\n\nThe expanded facility also allows for additional services such as whole genome sequencing and testing for tuberculosis.\nThe County moved forward on the lab construction project after an analysis showed that consolidating campus offices could empty an existing four-story office building.\nThat meant 600 staff members for the Health Services Center could move inside and save the County from spending $130 million to build them a new facility.\nThose savings allowed for the construction of the lab and a new six-level parking garage nearby.\nThe $33.8 million structure will feature more than 700-spaces and up to 260 electric vehicle charging stations.\nThe lab’s equipment and cold storage needs require more electricity than a typical office building. Solar panels on both the building and parking structure will provide a big offset, covering about 60% of the needed electricity.\nConstruction will move quickly on the combined lab and garage project. The garage is expected to open in September 2024 and the lab in spring 2025.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231004.15.09.55"}