{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More Vote Centers Open Saturday for Total of 218", "description": "Voters can take advantage of early voting at an additional 179 vote centers starting Saturday, June 4. That will make a total of 218 centers open for the four days leading up to and including Election Day.", "datePublished": "2022-06-02T13:10:31-07:00", "url": "https://www.countynewscenter.com/?p=208689", "keywords": ["elections", "ballot marking devices", "electioneering", "fgg", "june 7 gubernatorial primary election", "san diego county registrar of voters", "vote centers open", "where s my ballot"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-06-02T13:10:31-07:00", "articleType": "article", "articleContent": "\nVoters can take advantage of early voting at an additional 179 vote centers starting Saturday, June 4. That will make a total of 218 centers open for the four days leading up to and including Election Day.\nThirty-nine vote centers opened Saturday, May 28 for 11 days. Voters can cast their ballot at any one of the vote centers in the county.\nThe hours are 8 a.m. to 5 p.m. through Monday, June 6. All locations will be open again on Election Day, June 7, when voting hours change to 7 a.m. to 8 p.m. You can find a location near you at sdvote.com.\nVote centers replace polling places and provide more services. You can:\n\nVote in-person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selections on the ballot marking device.  When finished, the voter will print out the official ballot with their selections. The voter can review the ballot and then give it to the poll worker to place it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nDue to the San Diego Rock ‘n’ Roll Marathon held on June 4 – 5, road closures may affect the following vote centers located on the race’s route:\n\nSan Diego City College (P Building, Flex Room)\n\n1480 Park Blvd., San Diego, 92101\n\n\nSan Diego LGBT Community Center\n\n3909 Centre St., San Diego, 92103\n\n\nSpreckels Masonic Temple (Dining Hall)\n\n3858 Front St., San Diego, 92103\n\n\nPatrick’s Catholic Parish (Rear Hall)\n\n3585 30th St., San Diego, 92104\n\n\n\nRemember that campaigning and electioneering within 100 feet of a vote center or ballot drop box location is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate on the ballot. Additionally, an individual may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nVoters can still mark their ballot conveniently from home. Be sure to sign and date the return envelope, seal your completed ballot inside and return it to one of the Registrar’s official ballot drop box locations or vote centers. Or return your ballot through the U.S. Postal Service as long as it’s postmarked by June 7, Election Day.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nLearn more about voting in the June Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220602.13.10.31"}