{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Reconstruction of Affordable Housing Complex Underway in San Marcos", "description": "The County of San Diego Health and Human Services Agency and its partners broke ground Thursday on the replacement for an aging affordable housing complex in San Marcos.", "datePublished": "2021-09-02T15:54:03-07:00", "url": "https://www.countynewscenter.com/reconstruction-of-affordable-housing-complex-underway-in-san-marcos/", "keywords": ["housing", "affordable housing", "groundbreaking", "villa serena"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-09-02T15:54:03-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency and its partners broke ground Thursday on the replacement for an aging affordable housing complex in San Marcos. Villa Serena, located just north of state Route 78, will help address the ongoing housing crisis in the region by providing affordable housing in an area known for its high cost of living.\n“I believe it’s extremely important that we keep our young, working families in our region. This project, which provides workforce housing is an excellent example of what is needed in North County,” said County Supervisor Jim Desmond. “As the former mayor of the wonderful city of San Marcos, I am proud to see the city and the county coming together to make strides in addressing our housing crisis while staying true to the character of our well-loved communities.”\nThe former 136 units at Villa Serena are being replaced by 148 upgraded apartment homes for individuals and families whose household incomes are below the area’s median income. The County is partnering with the City of San Marcos and National Community Renaissance, also known as National CORE, to transform the aging complex.\n“A quality development like Villa Serena provides long-term affordable housing to the families and individuals who need it most,” said David Estrella, director of Housing and Community Development Services at the County Health and Human Services Agency. “We look forward to generations of residents living and thriving as they enjoy safe and stable housing.”\nVilla Serena was first built more than 50 years ago and over the years underwent several smaller renovations and upgrades. It will be replaced with a modern development that emphasizes units for families.\nThe original Villa Serena had only one three-bedroom apartment; the reconstruction will create 47 three-bedroom homes to better meet the needs of the surrounding family-centric neighborhood. The County and its partners will also set aside eight apartment homes for young adults who are aging out of the foster care system.\nOnce completed, residents will have access to an array of services and resources right inside their complex. Villa Serena’s 1,933-square-foot community center will serve as a hub for community events and activities, and residents will be able to participate in programs that promote their financial stability, self-sufficiency, and overall well-being.\nThe County invested $5.5 million from its Housing Trust Fund in the development.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210902.15.54.03"}