{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Nearly 380 Guns Exchanged For Gift Cards", "description": "A gun for gift cards promotion by the Sheriff’s Department, District Attorney’s Office, City of Vista, Oceanside Police, Carlsbad Police and North Coastal Prevention Coalition drew a huge turnout and collected nearly 380 guns. The weapons collected will be processed by investigators.", "datePublished": "2022-08-31T10:49:15-07:00", "url": "https://www.countynewscenter.com/?p=209332", "keywords": ["government"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-08-31T10:49:15-07:00", "articleType": "article", "articleContent": "\nA gun for gift cards event by the Sheriff’s Department, District Attorney’s Office, City of Vista, Oceanside Police, Carlsbad Police and North Coastal Prevention Coalition drew a huge turnout Sunday and collected nearly 380 guns.\nThe weapons were dropped off anonymously with “no questions asked” and were collected by a deputy. Later, the weapons will be processed by investigators. If any guns are found to be have been used in a crime, the weapons will be turned over to the appropriate law enforcement agency. If any guns are found to be stolen, the original owners will be contacted. All remaining weapons will be destroyed.\n    \nThe event was held at the Vista Traffic Court parking lot and dozens of people in cars lined up to trade the guns for gift cards. People were given a $100 gift card for handguns, rifles and shotguns or a $200 gift card for assault weapons.\nAnyone unable to attend the event can turn in any unwanted gun at any Sheriff’s station or substation. In these cases, do not bring the weapon into the station or substation, just let someone at the front desk know and a deputy will retrieve the gun from the trunk of your car. Click for a list of Sheriff’s patrol stations. You can also call the Sheriff’s non-emergency line at (858) 565-5200.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220831.10.49.15"}