{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "With Rain in Forecast, It is Important to Prepare", "description": "Now is the time to make a preparedness plan in the wake of the devastating recent storm and rain in the forecast. The County Office of Emergency Services asks people to be ready by creating a plan, building an emergency go-kit and signing up for alerts and information.", "datePublished": "2024-01-28T15:57:29-08:00", "url": "https://www.countynewscenter.com/with-rain-in-forecast-it-is-important-to-prepare/", "keywords": ["public safety", "disaster preparedness", "prepare", "preparedness"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2024-01-28T15:58:09-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesNow is the time to make a preparedness plan in the wake of the devastating recent storm and rain in the forecast.\nThe County Office of Emergency Services asks people to be ready by creating a plan, building an emergency go-kit and signing up for alerts and information. Here’s what you can do.\n\nReview your family disaster plan, or create one if you don’t have one yet.\n\nBe prepared to evacuate with only minutes’ notice. Practice evacuating with your family.\nHave a go-kit to keep necessary items handy if you had to evacuate., including food and medication.\nHave contingency plans for different times of the day, such as an emergency while some family members are at work or school.\nCheck with schools or childcare providers to make sure you are aware of emergency plans and how you will be contacted.\nIn case you are separated during a disaster, discuss where to reunite because phone service may not be reliable during a disaster.\n\n\nYour pets are part of your family too. Make sure they are microchipped and you have evacuation items for them as well – including crates for small pets. In addition, have evacuation plans for larger animals such as horses or livestock.\n\nRegister your –and other family members’– cellphones with AlertSanDiego so that you will all be notified of an emergency affecting your neighborhood. This is especially important if you no longer have a landline at your home. And download the SDEmergency App to receive updates.\nSandbags\nGet free sand and sandbags at locations throughout the County. Sandbags help to divert or redirect water, mud and debris from your property and help prevent soil erosion.\n\nInformation for Those Recovering from Flooding\nFor those impacted by the recent storm, support and resources are available at the County Local Assistance Center at the Spring Valley Library located at 836 Kempton Street. Flood victims can walk in without an appointment from 10 a.m. to 7 p.m. Monday through Wednesday. The center will act as a one-stop shop for residents who need information on how to recover from the damaging storms.\nAdditional storm recovery information and updates are available on the County recovery website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240128.15.57.29"}