{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens Unique Campground and Newest Bike Park in South Bay", "description": "County and other officials held opening events Wednesday for two eagerly awaited projects: the new Tijuana River Valley Regional Park Campground and the Otay Valley Regional Park’s Bike Park, named for the district’s former County Supervisor Greg Cox.", "datePublished": "2021-04-28T17:52:07-07:00", "url": "https://www.countynewscenter.com/county-opens-unique-campground-and-newest-bike-park-in-south-bay/", "keywords": ["parks and rec", "bike park", "camping", "greg cox bike park", "tijuana river valley regional park", "tijuana river valley regional park campground"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-04-29T10:48:48-07:00", "articleType": "article", "articleContent": "\nCounty and other officials held opening events Wednesday for two eagerly awaited projects: the new Tijuana River Valley Regional Park Campground and the Otay Valley Regional Park’s Bike Park, named for the district’s former County Supervisor Greg Cox.\nThe events were attended by Vice Chair Nora Vargas, who represents the first supervisorial district where the projects are located, Chula Vista Mayor Mary Casillas Salas and Cox, who was the district’s County supervisor for 25 years and Chula Vista’s mayor for nine years.\n“We are excited for the new recreation opportunities these two new parks are bringing not only to the South County but to all San Diego County,” said Vargas. “We must work together to continue to open new public spaces, along with more inclusive play spaces like the Bike Park, and to balance that growth with the necessary protections of our land and local resources.”\nThe projects are about seven miles, or 15 minutes’ drive, apart from one another in South County and will provide all County residents with two new recreational destinations.\nThe $14.3 million, 79-acre Tijuana River Valley Regional Park Campground offers scenic views of the valley, access to more than 20 miles of trails and 51 primitive campsites, including 16 for tents, five for equestrian campers, 30 multi-use sites that can accommodate trailers, and 10 yurts.\nThe campground is across from 1942 Monument Road and features County Parks’ only yurts — modern versions of ancient, round, tent-like, covered camping spaces, with doors, windows, bed frames and space for four to 10 people. Each ADA-accessible yurt site has a picnic table, fire ring and a parking spot, with the option to add a second car. Primitive campsites do not offer hookups, power or water at each site.\nThe campground also has an amphitheater, a nature education center and nature play equipment made of natural objects for children, and restrooms and showers.\nThe campsite is taking reservations for the regular sites and yurts will be available starting this weekend. Camping can be booked for $24 for tent, equestrian and multi-use sites, plus a $5 reservation fee. Reservation fees for the yurts are $60 for the smaller ones and $90 for the larger ones.\nThe Greg Cox Bike Park is the second bike skills park the County has built and it will be operated by the city of Chula Vista from 8 a.m. to sunset. The County’s first bike park, the popular Sweetwater Bike Park, opened to rave reviews in January 2020. Like Sweetwater, the Greg Cox Bike Park was built to create exercise and fun for riders of all ages and is free for users. The 3.2-acre, $1.05 million park located just beyond 253 Rancho Drive features beginner and intermediate bike trails, a beginner’s zone, a jump line and what County officials say is California’s largest modular pump track — a bicycle course of rollers, banked turns and other features that let bikers ride without pedaling.\nCox was thanked at the opening ceremony for his efforts and said he was “honored with the recognition and the naming,” but said it’s been a collaborative effort among three jurisdictions.\n“It’s going to bring a lot of kids out and give them the skills they need to get outside and get some exercise and become healthier,” said Cox. “So, it’s a real joy to see and it’s even more exciting to see the kids out here – and adults, using this facility.”\nThe bike park was immediately opened to the public at the end of Wednesday’s ribbon-cutting, which was performed by riders bicycling through a large ceremonial ribbon.\n“Both of these projects have been a labor of love for County Parks,” said Brian Albright, director for the County of San Diego Department of Parks and Recreation. “Research shows that spending time outdoors and in nature is good for you. We hope our parks will inspire more people to be active and build social connections – two things that seem especially vital, given the past year, for our physical, emotional and mental well-being.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210428.17.52.07"}