{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Live Oak County Park Celebrates 100-Plus-One Years with Party Saturday", "description": "It’s a party! An all-day party, a 100-plus-one party — and everyone is invited. Live Oak County Park in Fallbrook is turning 101 years old, and the County and Fallbrook are holding a free day-long celebration from 9 a.m. to 9:30 p.m. Saturday, July 17.", "datePublished": "2021-07-12T08:59:10-07:00", "url": "https://www.countynewscenter.com/live-oak-county-park-celebrates-100-plus-one-years-with-party-saturday/", "keywords": ["parks and rec", "dog park", "fallbrook", "live oak county park", "live well", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-07-12T08:59:10-07:00", "articleType": "article", "articleContent": "\nIt’s a party! An all-day party, a 100-plus-one party — and everyone is invited.\nLive Oak County Park in Fallbrook is turning 101 years old, and the County and Fallbrook are holding a free day-long celebration from 9 a.m. to 9:30 p.m. Saturday, July 17.\nThe celebration will feature events — live reptile and birds of prey demonstrations, a “peeps and pooches” dog walk, the planting of two large live oak trees and a sunset showing of “Toy Story 4” — and fun activities including bounce houses, face-painting, a photo booth and climbing wall.\nThere will also be two food trucks with Mexican food fare and a giveaway of 100 1-gallon live oak trees grown from acorns gathered from the park.\nAnd of course, visitors will also have the chance to enjoy Live Oak County Park itself. Dedicated in 1920, nestled among beautiful oak trees, the park has grown from 10 to 27 acres and into the heart of Fallbrook’s community, becoming a favorite spot for recreation, weddings, picnics and relaxation.\nVisitors can still see grinding holes in the park’s bedrock where Native Americans ground acorns long before the park was dedicated. In recent years the park has added an amphitheater, native plant garden, play area, softball and soccer fields, volleyball and basketball courts, and exercise stations. In 2015, Live Oak County Park became the first in the County’s parks system to add an off-leash dog park, a 3,000 square-foot area with fencing, gates, tables, benches and pet waste stations where pets can frolic with their owners and other dogs.\nCounty Parks and Recreation staff have been preparing the park for its “Centennial+1” celebration for the past year, adding new benches, replacing walkways, installing exercise equipment, improving the park’s restrooms, restoring two concrete tables that date back to the park’s opening and planting more than 100 additional native trees and shrubs.\nThe party’s schedule of events includes:\n\n10 a.m. “Peeps and Pooches” walk\n11:30 a.m. “Jumbo Tree Planting,” the planting of two 36” box live oak trees (visitors can pitch in to help, or just watch)\n11:45 a.m. Live reptile demonstrations and animal touch tables\n1 p.m. Face-painting, photo booth and balloon artists will run from 1 p.m. until the movie starts.\n3:30 p.m. Raptors (birds of prey) demonstration\n5 p.m. Bounce houses, climbing wall and an inflatable obstacle course will open as pre-movie events\n7:30 p.m. Movie in the Park, “Toy Story 4”.\n\nSo come and celebrate. It’s not every year you get to celebrate a 100-plus-one party!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210712.08.59.10"}