{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County and Sharp Chula Vista Partner to Expand Crisis Stabilization Unit Network", "description": "The County is expanding its Crisis Stabilization Unit (CSU) network by partnering with Sharp HealthCare to add six new specialized beds at the Chula Vista Medical Center. ", "datePublished": "2025-01-28T15:02:37-08:00", "url": "https://www.countynewscenter.com/county-and-sharp-chula-vista-partner-to-expand-crisis-stabilization-unit-network/", "keywords": ["health", "behavioral health", "chula vista", "crisis stabilization unit", "sharp", "south bay"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2025-01-28T16:13:55-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County is expanding its Crisis Stabilization Unit (CSU) network by partnering with Sharp HealthCare to add six new specialized beds at the Chula Vista Medical Center. \nApproved Tuesday by the Board of Supervisors, the new beds will serve Medi-Cal patients at the hospital. This will be the region’s seventh CSU with an eighth expected to open late this year in El Cajon. \nThe partnership comes as the rate of emergency department discharges for people diagnosed with a behavioral health disorder has climbed from 275 per 10,000 to 304 per 10,000 between 2020 and 2022 at Sharp Chula Vista Medical Center.  \n“The need and impact of these units is clear. CSUs have been demonstrated to lead to up to 70 percent reductions in inpatient placements,” said Dr. Luke Bergmann, director of County Behavioral Health Services. “Instead, patients cared for in CSUs are more likely to be efficiently and effectively connected to ongoing care in community-based, less restrictive settings, where they have the best chance to sustain long-term recovery.” \nThe new model of housing these services within a hospital is called Emergency Psychiatric Assessment, Treatment and Healing model, or EmPATH. This model creates a seamless transition to a setting specifically designed for crisis stabilization and eases the burden on emergency departments. \n“Sharp recognizes the dire need for the community to be able to access mental health and substance use disorder treatment services across different levels of care, including crisis care,” said Nancy Greengold, MD, MBA, Chief Operating Officer at Sharp Chula Vista Medical Center. “We are proud to partner with the County to provide crisis stabilization services at Sharp Chula Vista Medical Center in our Emergency Psychiatric Assessment, Treatment and Healing (EmPATH) unit.” \nSharp HealthCare received a one-time state grant of $2.9 million to establish the unit at the Sharp Chula Vista Medical Center. It is anticipated to cost a maximum of $9.1 million annually to operate the new unit. \nCrisis Stabilization Units provide immediate mental health and substance use support and treatment for those experiencing a psychiatric emergency. \nSince 2018, the County expanded these specialty units, with locations across the region. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250128.15.02.37"}