{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Encourages Flu Vaccines for Children and Teens", "description": "County public health officials are reminding everyone, particularly families with children and teenagers, that it is not too late to get the flu vaccine. ", "datePublished": "2025-02-06T10:57:53-08:00", "url": "https://www.countynewscenter.com/county-encourages-flu-vaccines-for-children-and-teens/", "keywords": ["health", "flu", "flu deaths", "flu shot", "flu vaccine", "public health", "teenagers"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-02-06T10:57:53-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty public health officials are reminding everyone, particularly families with children and teenagers, that it is not too late to get the flu vaccine. \nThis flu season, which is between fall and winter, three teenagers have died from the flu. None were vaccinated.  \n“These recent flu deaths among our youth are tragic and concerning as we head into what historically is the peak of flu season,” said Dr. Ankita Kadakia, Interim Public Health Officer. “The flu vaccine is the best protection against getting seriously sick and preventing death. This has been a particularly long and difficult flu season compared to recent years and it’s not over yet. I highly encourage the flu vaccine, it’s not too late.” \nIn San Diego County, nearly 80 percent of 5- to 17-year-olds have not received this flu season’s vaccine.  \nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot yearly since the components of the vaccine change year to year to match the circulating strains.  \nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page, myturn.ca.gov, or call 2-1-1 San Diego.   \nIn addition to getting vaccinated, people should also do the following to avoid getting sick:   \n\nWash hands thoroughly and often   \n\n\nUse hand sanitizers, if unable to wash hands  \n\n\nStay away from sick people  \n\n\nAvoid touching your eyes, nose, and mouth  \n\n\nClean commonly touched surfaces  \n\n\nIf you are sick, stay home and avoid contact with others  \n\nCounty Health and Human Services Agency publishes the Respiratory Viruses Surveillance report, which tracks key flu, COVID-19, and RSV indicators and summarizes respiratory virus surveillance in the region.   \nIn total, there have been 73 people who have died from the flu this flu season. Most were people 50 years and older. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250206.10.57.53"}