{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Input Sessions to Guide New Behavioral Health Workforce Programs Planned Next Week  ", "description": "The County is taking the next step in its strategy to expand the region’s public behavioral health workforce to support the community.  ", "datePublished": "2025-03-28T18:11:45-07:00", "url": "https://www.countynewscenter.com/input-sessions-to-guide-new-behavioral-health-workforce-programs-planned-next-week/", "keywords": ["health", "behavioral health workforce", "jobs", "mental health", "san diego county", "training"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-03-28T18:11:45-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County is taking the next step in its strategy to expand the region’s public behavioral health workforce to support the community.  \nLocal organizations are asked to participate in input sessions next week to review upcoming contracting opportunities for new programs that will help bolster the workforce.  \nA workforce assessment completed in 2022 at the request of the County Board of Supervisors found that an additional 18,500 behavioral health workers will be needed to meet anticipated demand for mental health and substance use disorder (SUD) treatment services in the region by 2027. \nFunding for these new programs is made possible through $75 million from Mental Health Services Act (MHSA) Innovation funding approved by California’s Mental Health Services Oversight and Accountability Commission to support a first-of-its-kind workforce development and retention program.  \nThe San Diego-based Policy & Innovation Center is administering the County’s ELEVATE Behavioral Health Workforce Fund and will host initial informational sessions for interested organizations and prospective program participants.  \nThe Fund will support the establishment of four contracted programs: \n\n Nurse Practitioner (NP) Expansion Program – supporting NP students in getting educational and clinical experience in public behavioral health settings. \n\n\nBehavioral Health Apprenticeship Network Program – providing apprenticeships to help individuals become substance use disorder (SUD) counselors, case managers, community health workers, and other in-demand roles. \n\n\nPeer Support Training Grant Program – training, placing, and retaining Peer Support Specialists. \n\n\nSocial Work, Counseling, and Therapy Internship Program – providing paid, high-quality internships in public behavioral health settings to master’s level social work, counseling, and therapy students. \n\nThese programs will provide and enhance the skills of current and prospective professionals interested in supporting the community by working in local public behavioral health. \nEight virtual input sessions will take place from Tuesday, April 1 through Friday, April 4, with two sessions for each program listed above. Learn more about the programs and how to participate on the County’s Behavioral Health website.  \nThe ELEVATE Behavioral Health Workforce Fund will support qualifying students, current behavioral health professionals, and others with lived mental health and substance use experience in accessing training or going back to school to advance their degrees. \nThe program is anticipated to support about 2,800 people over five years, filling critical positions and supporting retention within the local behavioral health continuum of care. Funding may be available by this fall in alignment with the new school year.  \nIf you or a loved one is in need of behavioral health support, learn how you can get help. Call 9-8-8 or 1-888-724-7240 to speak to a trained specialist. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250328.18.11.45"}