{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Second Flu Death of this Season", "description": "An unvaccinated 95-year-old man from the North Coastal region of the county has become the second County resident to die of influenza this season, the County Health and Human Services Agency announced today.", "datePublished": "2022-01-26T10:35:11-08:00", "url": "https://www.countynewscenter.com/county-reports-second-flu-death-of-this-season/", "keywords": ["health", "flu", "flu shot", "influenza", "second flu death"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-01-26T10:35:11-08:00", "articleType": "article", "articleContent": "\nAn unvaccinated 95-year-old man from the North Coastal region of the county has become the second County resident to die of influenza this season, the County Health and Human Services Agency announced today.\nThe man had underlying medical conditions and died on Jan. 5. He was also routinely tested for COVID-19, for which he tested negative.\nMeanwhile, influenza cases continued to decrease last week, with 29 new cases being reported for the week ending Jan. 22, 2022. That’s 14 fewer cases compared to the previous week. In comparison, 26 flu infections were reported during the same week last season.\n“While the slowing of influenza activity in our region is good news, the new death being reported today is a sad reminder of how dangerous the flu can be,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Protect yourself and your loved ones and get the flu shot. It is the best defense we have against influenza.”\nThe latest Influenza Watch Report from the County Health and Human Services Agency shows the following for the week ending Jan. 22, 2022:\n\nEmergency department visits for influenza-like illness: 5% of all visits (compared with 7% the previous week).\nLab-confirmed influenza cases for the week: 29 (compared to 43 the previous week).\nTotal lab-confirmed cases to date: 1,314 (compared to 668 at the same time last season and a 5,966 prior 5-year average during the same week).\nInfluenza-related deaths reported to date: 2 (compared to 0 at the same time last year).\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe flu vaccine is especially important for people at higher risk of having serious complications from the virus.\nThey include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nDuring the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths. During the 2019-2020 flu season, a total of 108 San Diegans died from influenza and more than 20,700 flu cases were reported.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220126.10.35.11"}