{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Wild Bat Found in Oceanside Parking Lot Tests Positive for Rabies", "description": "County public health officials are looking for anyone who may have come into contact with a bat found in a parking lot in Oceanside that later tested positive for rabies.", "datePublished": "2024-10-28T14:29:06-07:00", "url": "https://www.countynewscenter.com/wild-bat-found-in-oceanside-parking-lot-tests-positive-for-rabies/", "keywords": ["health", "bat with rabies", "oceanside rabies", "rabies"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-10-28T14:40:28-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty public health officials are looking for anyone who may have come into contact with a bat found in a parking lot in Oceanside that later tested positive for rabies.  \nThe bat was discovered on the ground in the parking lot outside of a Petco retail store around 9 a.m. on Wednesday, Oct. 23. The Petco parking lot is located at 2130 Vista Way, Oceanside, 92054. \nIf you or someone in your family or group were in the parking lot that morning and had direct contact with the bat, or you know of someone who may have touched the animal, you are urged to contact County Public Health Services as soon as possible at (619) 692-8499.  \n“Human rabies is usually fatal without prompt post-exposure vaccine and treatment,” said Dr. Seema Shah, County interim deputy public health officer. “Rabies transmission can happen from a bat bite or if a bat’s saliva comes in contact with a cut or abrasion, or with mucous membranes, such as the eyes, nose or mouth.”   \nThe County has detected 10 rabid bats in 2024 throughout the San Diego region. Although bats can carry rabies, they are also an important part of nature.  \nMany species of local bats feed on insects such as mosquitoes. Other bat species in San Diego County feed on nectar from plants and pollinate them in the process.  \nYou may see bats occasionally around sunset when they are most active. It is important to appreciate wildlife from a safe distance and not touch wild animals.  \nIf you do come in direct contact with a bat, wash the affected area thoroughly with soap and water and get medical advice immediately.  \nRabies is a preventable viral disease that is most often transmitted through the bite of a rabid animal.   \nSymptoms of rabies in people can take weeks to months to develop after being exposed to a rabid animal.  Once symptoms develop, rabies is almost always fatal. However, prompt post-exposure treatment following exposure to the virus will prevent the disease.  \nLearn more information about bats and rabies on the County’s website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241028.14.29.06"}