{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Examines Job Impacts of Decarbonization", "description": "Recognizing things will change for workers in a decarbonized economy, the County of San Diego has undertaken a study to better understand how different policies may affect the region’s labor force and to identify tailored workforce development resources to adapt the skills of our region’s worker...", "datePublished": "2021-09-13T16:13:53-07:00", "url": "https://www.countynewscenter.com/county-examines-job-impacts-of-decarbonization/", "keywords": ["environment", "decarbonization", "sustainability"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2021-09-13T16:13:53-07:00", "articleType": "article", "articleContent": "\nRecognizing things will change for workers in a decarbonized economy, the County of San Diego has undertaken a study to better understand how different policies may affect the region’s labor force and to identify tailored workforce development resources to adapt the skills of our region’s workers, including those from disadvantaged communities.  The study will help the County develop a coordinated regional strategy to address workforce needs, including the transition of any displaced fossil fuel workers.\n“As we move toward a zero-carbon future, we must make policy decisions with equity in mind so that it benefits our communities, especially the most vulnerable,” said Board of Supervisors Vice Chair Nora Vargas.” These communities are disproportionately impacted by pollution and climate change, and we must focus our efforts so that we can develop lasting and sustainable solutions that mitigate these impacts.”\nThe report will be presented to the Board of Supervisors early next year and is being led by two distinguished women: Dr. Carol Zabin, a renowned UC Berkley professor who co-wrote California’s most comprehensive study on green jobs, and Betony Jones, a nationally recognized expert on the impacts of climate and energy policies on job quality and job access. Dr. Zabin serves on the executive council of the California Workforce Development Board, and Jones recently prepared the “High-Road Workforce Guide for City Climate Action,” a national toolkit on workforce development for the American Cities Climate Challenge project.\n“As we transition to a decarbonized economy, we must consider how this will impact our region’s workforce,” said Sarah Aghassi, deputy chief administrative officer for the County’s Land Use and Environment Group. “This study, combined with local labor and industry collaboration, will help ensure thoughtful policies are advanced for the Board’s consideration, and that the best training opportunities are available to those most affected by this shift.”\nThe report will consider the policy recommendations generated from the Decarbonization Framework pathways advanced by UC San Diego’s David Victor, Ph.D., and Gordon McCord, Ph.D.  Both professors are part of the university’s Sustainable Development Goals Policy Initiative, which belongs to a national coalition of experts who have laid out the path forward to reach zero carbon emissions in the United States by 2050.  Dr. McCord is the Associate Teaching Professor and SDG Policy Initiative Director, UC San Diego School of Global Policy and Strategy.  Dr. Victor is professor of Innovation and Public Policy at the UC San Diego School of Global Policy and Strategy.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210913.16.13.53"}