{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Poll Workers Needed for March 5 Presidential Primary", "description": "Poll workers, especially those who are bilingual in any of ten specific languages, are needed for the March 5 Presidential Primary Election.", "datePublished": "2023-12-11T11:00:45-08:00", "url": "https://www.countynewscenter.com/poll-workers-needed-for-march-5-presidential-primary/", "keywords": ["elections", "2024 presidential primary election", "bilingual poll workers", "fgg", "march 5", "march 5 presidential primary", "poll workers wanted", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-12-11T12:08:24-08:00", "articleType": "article", "articleContent": "\nPoll workers, especially those who are bilingual in any one of 10 specific languages, are needed for the March 5 Presidential Primary Election.\nThe Registrar’s office is required by federal law to provide bilingual speakers and voting materials to voters who speak Spanish, Filipino, Vietnamese and Chinese.\nIn addition, state and county requirements show a need for Arabic, Japanese, Korean, Laotian, Somali and Persian (Farsi and Dari) speakers at select vote centers across the county, so the Registrar’s office is also recruiting poll workers who are bilingual in those languages.\nPoll workers play an essential role in elections and can receive a daily stipend while serving their community. Under the Voter’s Choice Act, vote centers replace traditional polling places.\nVote centers are open throughout the county for an extended period before Election Day. Rather than a single day of service, poll workers are now needed to staff vote centers for up to 11 days in the two weeks before Election Day.\nDepending on the assignment, poll workers will receive a stipend ranging from $135 to $160 for each day of service at a vote center between Feb. 24 and March 4.\nOn Election Day, March 5, poll workers will receive a stipend ranging from $220 to $270 due to the extended hours. Those who are bilingual will receive an additional $5 for each day of service at the vote center with an increase to $10 on Election Day.\nResponsibilities include:\n\nProviding excellent customer service\nAssisting voters\nSubmitting stipend paperwork\nAttending a two-day, paid poll worker training ($95 daily stipend)\nOpening/closing a vote center\nAnswering voter questions\n\nApplicants must be 18 years old, a U.S citizen and registered to vote in California, or lawfully admitted for permanent residence in the United States. Applicants must also provide their own transportation to their assigned vote center.\nThe Registrar is seeking people who are team players, exhibit strong leadership and customer service skills, and display flexibility, patience and the highest level of integrity at all times. Poll workers must represent the Registrar of Voters in a professional, nonpartisan manner.\nApplications are available at sdvote.com. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231211.11.00.45"}