{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Adopt a Cat or Big Dog to Help Reduce Pet Homelessness", "description": "More than 400 animals in care at County shelters in Bonita and Carlsbad are waiting for adopters or fosters! June is Adopt a Shelter Cat Month, but County shelters continue to care for a high inventory of medium- to large- dogs, so the department is promoting both this month.", "datePublished": "2023-06-07T09:30:53-07:00", "url": "https://www.countynewscenter.com/adopt-a-cat-or-big-dog-to-help-reduce-pet-homelessness/", "keywords": ["animals", "adopt pets", "das", "pet adoptions"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-06-07T09:30:53-07:00", "articleType": "article", "articleContent": "\nMore than 400 animals in care at County shelters in Bonita and Carlsbad are waiting for adopters or fosters!\nJune is Adopt a Shelter Cat Month, but County shelters continue to care for a high inventory of medium- to large- dogs, so the department is promoting both this month. Instead of the normal adoption fees for cats and big dogs, County Department of Animal Services staff are asking people to donate to a fund that provides access to affordable spay/neuter services for pet owners experiencing financial hardship.\nAll cats and big dogs will be vaccinated, spayed or neutered, and microchipped. A dog license will be included as well.\nAs a result of a 65% increase in animals at the County’s shelters, medium- to-large dogs are living at shelters longer than normal. The average stay for one of these dogs is now 60 days, and some dogs have been at the shelter for more than a year.\nScientific studies have shown that animals have a beneficial effect on people’s physical and mental health–and while not noted, it surely has a beneficial effect on the adopted animal’s physical and mental health as well.\nFind your new cat or bigger dog, as in 50+ pounds, by browsing through the County shelters’ animal inventory. Kittens, smaller dogs, pigs and bunnies are also available for regular adoption now on the Adoptions page. Pick a second and third choice too, just in case your first choice is already adopted.\nWalk-in hours are from 1 to 4 p.m. Tuesday through Friday and from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad. People can save time by completing a pet adoption application in advance.\nThe County Department of Animal Services’ top priority is providing excellent care in its shelters while finding good homes for every healthy and treatable animal. While the goal is to find the right fit for animals and their permanent adopter to form a lasting and loving bond, animal fostering is another opportunity for animals to learn how to be in a home and socialize with people and other animals.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230607.09.30.53"}