{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Where’s My Ballot? Track It Every Step of the Way", "description": "If you are an active registered voter, you can now sign up to track the status of your mail ballot ­ - when the ballot is mailed to you, when the Registrar of Voters gets it back from you in the mail and when it is counted.", "datePublished": "2020-09-08T10:28:48-07:00", "url": "https://www.countynewscenter.com/wheres-my-ballot-track-it-every-step-of-the-way/", "keywords": ["elections", "mail ballot", "nov. 3 presidential general election", "registrar of voters", "registration", "where s my ballot"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-09-08T10:33:10-07:00", "articleType": "article", "articleContent": "\nIf you are an active registered voter, you can now sign up to track the status of your mail ballot ­ – when the ballot is mailed to you, when the Registrar of Voters gets it back from you in the mail and when it is counted.\nDue to the COVID-19 pandemic, every active registered voter in California will receive a ballot in the mail for the Nov. 3, 2020, Presidential General Election.\nThe ballot tracking tool is new. Voters can sign up for Where’s My Ballot? at sdvote.com to receive automatic email, text, or call notification on the status of their ballot.\nIt’s also a good idea for voters to double-check their registration in the next couple of weeks to make sure the Registrar of Voters sends the mail ballot to the correct address.\n\nCheck your registration information. Make sure your residence and, if different, your mailing address is up to date.\nHave you moved or changed your name? Whether you are new to San Diego County or just moved down the street you need to re-register to vote.\nAre you a first-time voter? Register to vote – it takes less than two minutes.\n\nThe Registrar of Voters office will be preparing ballots for the mail by mid-September, and ballots will start going out to registered voters the week of Oct. 5. If your voter information is up to date you should expect to receive your ballot the same week.\nVoting by mail is simple, safer, and secure. The Registrar of Voters has launched an awareness campaign, Vote Safer San Diego, to educate the public on the safety, security and ease of voting in the upcoming election amid the COVID-19 pandemic.\nThose who want to vote in person will still have the opportunity to do so, but they may run into long lines, both at the polls and the Registrar’s office.\nTo learn more about Vote Safer San Diego and voting in the Nov. 3 election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200908.10.28.48"}