{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Supervisors Formally Call District One Special Election", "description": "The Board of Supervisors made it official Tuesday and called an April 8 special primary election for the First Supervisorial District.", "datePublished": "2025-01-14T13:12:46-08:00", "url": "https://www.countynewscenter.com/board-supervisors-formally-call-district-one-special-election/", "keywords": ["government", "bos", "bos calls special election", "district 1", "district 1 special election", "fgg", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-01-15T15:02:49-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe Board of Supervisors made it official Tuesday and called an April 8 special primary election for the First Supervisorial District. Voters in District 1 will fill a supervisorial seat that became vacant when the former supervisor ended her tenure on Jan.6.\nOver 376,000 voters living in District 1 will receive a ballot in the mail the week of March 10 for the election. The official ballot packet will also include an “I Voted” sticker, voting instructions and other important election information.\nThe person elected will fill District 1’s vacant seat for the remainder of the current term ending in January 2029. If no candidate receives a majority vote at the April 8 election, the top two vote-getters will move on to the special general election held on July 1, 2025. Only those who live in the district can vote in the election.\nDistrict 1 spans from the Pacific Ocean on the west to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The First Supervisorial District includes the cities of Chula Vista, Imperial Beach, National City and some communities within the City of San Diego, such as Barrio Logan, East Village, Golden Hill and more. Additionally, District 1 includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside and La Presa.\n\n \n \n \n \n \n \n \n \n \nIf you’re not sure whether you reside in District 1, you can look it up at sdvote.com.\nEarly voting begins Monday, March 10 at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nYou can vote at home and return your voted ballot through the mail – no postage needed – or to any of the Registrar’s 26 official ballot drop boxes around the district starting Tuesday, March 11 through Election Day.\nIf you want to vote in person, you can avoid long lines by taking advantage of early voting. Starting Saturday, March 29, seven vote centers will be open daily from 8 a.m. to 5 p.m. until Election Day, Tuesday, April 8, when 13 vote centers will be open from 7 a.m. to 8 p.m.\nLearn more about voting in the District 1 special primary election at sdvote.com or call (858) 565-5800 or toll free at (800) 696-0136.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250114.13.12.46"}