{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "SBA Loans Available to Assist with Impacts from Tropical Cyclone Hilary", "description": "San Diego County businesses, nonprofits and residents can now apply for low-interest federal disaster loans if they were affected by Tropical Cyclone Hilary.", "datePublished": "2023-09-29T15:28:14-07:00", "url": "https://www.countynewscenter.com/sba-loans-available-to-assist-with-impacts-from-tropical-cyclone-hilary/", "keywords": ["government", "bonita-sunnyside library branch", "sba loans", "tropical cyclone hilary"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-09-29T16:08:02-07:00", "articleType": "article", "articleContent": "\nSan Diego County businesses, nonprofits and residents can now apply for low-interest federal disaster loans if they were affected by Tropical Cyclone Hilary.\nThe U.S. Small Business Administration (SBA) will have two loan officers on site, at the San Diego County Library’s Bonita-Sunnyside Branch, at 4375 Bonita Road, Bonita, CA 91902. The loan officers can answer questions about SBA’s disaster loan programs, explain the application process and help people complete their loan application.\n“SBA’s team stands ready to help California’s small businesses and residents impacted by tropical storm Hilary,” said SBA Administrator Isabella Casillas Guzman. “We’re committed to providing federal disaster loans swiftly and efficiently, with a customer-centric approach to help businesses and communities recover and rebuild.”\nPotential loans of up to $2 million could be used by businesses to repair or replace damaged or destroyed real estate, machinery and equipment, inventory, and other business assets. Potential loans of up to $500,000 are available to homeowners to repair or replace damaged or destroyed real estate. Homeowners and renters are also potentially eligible for up to $100,000 to repair or replace damaged or destroyed personal property, including personal vehicles. SBA can also lend additional funds to businesses and homeowners to help with the cost of improvements to protect, prevent or minimize the same type of disaster damage from occurring in the future.\nFor small businesses, small agricultural cooperatives, small businesses engaged in aquaculture and most private nonprofit organizations of any size, SBA offers Economic Injury Disaster Loans to help meet working capital needs caused by the disaster. Economic injury assistance is available regardless of whether the business suffered any property damage.\nApplicants may apply in person at the Disaster Loan Outreach Center, hosted at the San Diego County Library’s Bonita-Sunnyside Branch. Open Monday, October 2 through Friday, October 13 through close of business: Monday, Oct. 2 1:00 pm – 6:00 pm, Tuesdays 12:00 pm – 7:00 pm, Wednesdays and Thursdays 10:00 am – 6:00 pm, Fridays 10:00 am – 5:00 pm, Closed indigenous People’s Day holiday, Monday, October 9\nMore information about this program is available in this SBA Disaster Loans Fact Sheet.\nPeople can also receive additional disaster assistance information and download applications online at https://disasterloanassistance.sba.gov/. Applicants may also call SBA’s Customer Service Center at (800) 659-2955, or email disastercustomerservice@sba.gov for more information on SBA disaster assistance.\nPeople who are deaf, hard of hearing, or who have a speech disability, please dial 7-1-1 to access telecommunications relay services.\nCompleted applications should be mailed to U.S. Small Business Administration, Processing and Disbursement Center, 14925 Kingsport Road, Fort Worth, TX  76155.\nThe deadline to apply for physical damage loans is November 21st, 2023 \nThe deadline to apply for economic injury loans is June 24th, 2024\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230929.15.28.14"}