{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Case Reports Down, But Increased Deaths are Reminder to Get Vaccinated, Boosted", "description": "New lab-confirmed COVID-19 infections are beginning to decline in the region, but actual case counts may be higher due to the increasing popularity and availability of home antigen tests, results of which are not reported to the County.", "datePublished": "2022-02-02T18:37:54-08:00", "url": "https://www.countynewscenter.com/covid-19-case-reports-down-but-increased-deaths-are-reminder-to-get-vaccinated-boosted/", "keywords": ["health", "coronavirus", "covid-19", "omicron variant"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-02-02T18:37:54-08:00", "articleType": "article", "articleContent": "\nNew lab-confirmed COVID-19 infections are beginning to decline in the region, but actual case counts may be higher due to the increasing popularity and availability of home antigen tests, results of which are not reported to the County.\nIn the past week, a total of 29,508 lab-confirmed cases were reported in the region which represents about half of the lab-confirmed COVID-19 cases compared to the week prior when 60,548 COVID-19 lab-confirmed infections were reported.\n“It’s important to note that lab-confirmed cases currently only make up a portion of the actual cases in the region, as more and more people rely on home antigen tests,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Virus activity in the region is likely a lot higher than confirmed cases reflect, so people should continue to take precautions to protect themselves and their loved ones.”\nNew hospitalizations in the region have started to decrease in the past week, indicating that the peak of infections from the Omicron variant wave may have occurred.\nMeanwhile, the County is reporting an additional 113 deaths since the last update on Jan. 26, 2022. Since the beginning of the year, COVID-19 has claimed the lives of 225 San Diegans.\n“There is a common misconception that the Omicron variant is not as deadly as prior strains of COVID-19,” Wooten said. “The latest data show that since the Omicron variant was first identified, COVID-19 deaths are on the rise, both here in San Diego and across the country. While you can still get COVID-19 despite being vaccinated and boosted, the vaccine keeps most people out of the hospital and reduces the risk of virus-related deaths.”\nThe region has plenty of COVID-19 vaccines and booster doses. The county has more than 400 vaccination sites including pharmacies, medical providers, clinics, and County locations. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nDoses administered: Close to 6.67 million.\nReceived at least one shot: Almost 2.88 million or 91.4% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.53 million or 80.4%.\nBoosters administered: 1,072,823 or 51.8% of 2,071,384 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n113 new deaths were reported since the last report on Jan. 26, 2022. The region’s total is 4,735.\n62 men and 51 women died between Dec. 29, 2021 and Jan. 28, 2022.\n45 were age 80 or older, 24 were in their 70s, 28 were in their 60s, six were in their 50s, six were in their 40s, three were in their 30s and one was in their 20s.\n46 of the people who died were fully vaccinated and 67 were not fully vaccinated.\n100 had underlying medical conditions, two did not and 11 had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n2,925 COVID-19 cases were reported to the County on Feb. 1, 2022. The region’s total is now 702,789.\n29,508 cases were reported last week (Jan. 26 through Feb. 1, 2022) compared to 60,548 COVID-19 infections identified the previous week (Jan. 19 through Jan. 25, 2022).\nSan Diego County’s case rate per 100,000 residents is 140.6 for people fully vaccinated and boosted, 253.4 for fully vaccinated people and 419.9 for not fully vaccinated San Diegans.\n16,768 tests were reported to the County on Jan. 30, 2022, and the percentage of new positive cases was 12.2%.\nThe 14-day rolling percentage of positive cases among tests is 18.6%.\n\nCommunity Setting Outbreaks:\n\n33 new community outbreaks were confirmed in the past seven days (Jan. 26, 2022 through Feb. 1, 2022): 11 in TK-12th grade school settings, eight in daycare/preschool/childcare settings, four in healthcare settings, three in business settings, two in government settings, two in retail settings, one in a college/university setting, one in a community-based organization setting and one in an emergency services setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220202.18.37.54"}