{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Free Summer Movies in the Park Season Starts Friday at Waterfront Park", "description": "The County of San Diego’s free “2024 Summer Movies in the Park” season starts at 6 p.m., Friday, May 24 with an event and sunset showing of the Oscar-winning blockbuster “Barbie” at the Waterfront Park downtown.", "datePublished": "2024-05-20T09:31:17-07:00", "url": "https://www.countynewscenter.com/countys-free-summer-movies-in-the-park-season-starts-friday-at-waterfront-park-2/", "keywords": ["parks and rec", "county parks", "summer movies in the park"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-05-20T10:12:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County of San Diego’s free “2024 Summer Movies in the Park” season starts at 6 p.m., Friday, May 24 with an event and sunset showing of the Oscar-winning blockbuster “Barbie” at the Waterfront Park downtown.\nTo celebrate the opening, there will be a variety of features and free fun for kids and families, including music, games, bounce houses, themed crafts, and other free activities. Although the movie starts at dusk, about 15 minutes past sunset, a host of free activities are expected to begin at 6 p.m. Make sure to bring a chair and blankets to cozy up for a night under the stars.\nThis year’s schedule includes more than 100 movies at dozens of parks across the County. If you’re a fan of modern-day classics there will be a variety of showings that may spark your interest, including “Wonka;” “The Goonies;” “The Sandlot;” “ET the Extra-Terrestrial” and the 1954 version of “Rear Window.”\nIf cartoon heroes and villains are what you prefer, you won’t want to miss “Teenage Mutant Ninja Turtles: Mutant Mayhem;” “Monsters Inc;” “Kung Fu Panda 4;” or “The Little Mermaid.”\nAnd for those mystery with a sprinkle-of-horror fans there will be showings of “Hocus Pocus;” “Ghostbusters: Afterlife;” and “Scooby-Doo on Zombie Island.”\nThe line-up has something for everyone to enjoy. View the full list of movies and plan to attend movies near you as the Department of Parks and Recreation celebrates 17 years of taking back parks, after dark, through safe and fun nighttime activities. Movies, dates and locations are subject to change, go to Summer Movies in the Park.\nThe 2024 Summer Movies in the Park series is presented by Rose SD Realtor and sponsored by the County of San Diego Health and Human Services Agency, Child and Family Well-Being Department, Live Well San Diego, The Super Dentists, Project Clean Water, Bill Howe, First 5, ACANA Pet Food, and the San Diego County Parks Society.\nFor more information about all County of San Diego’s parks and events, go to sdparks.org. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240520.09.31.17"}