{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Takes Action to Balance Housing and Climate Action", "description": "County Supervisors voted this week to take a two-phased approach to implement the state’s Vehicle Miles Traveled law to balance the need for housing with the need to address climate change.", "datePublished": "2022-02-10T11:13:49-08:00", "url": "https://www.countynewscenter.com/board-moves-to-apply-traffic-law-balance-housing-climate-action/", "keywords": ["government", "climate action", "development", "housing", "lueg", "planning and development services", "sustainability", "sustainable communities", "traffic"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-02-10T14:57:38-08:00", "articleType": "article", "articleContent": "\nThe County’s Board of Supervisors voted Wednesday to take a two-phased approach to implement the state’s Vehicle Miles Traveled law to balance the need for housing with the need to address climate change.\nThe first phase will be to firm up within six months the current definitions of “infill” areas in unincorporated communities where housing developments could be built without triggering Vehicle Miles Traveled study and mitigation.\nPhase two will be to begin longer-term work to explore “unlocking” vast portions of the unincorporated areas where development could by stymied by Vehicle Miles Traveled requirements.\nThe state’s Vehicle Miles Traveled law seeks in part to reduce greenhouse gas emissions by requiring land use jurisdictions to ask proposed developments how many miles the cars their projects would add to roads will have to drive.\nDevelopments where cars would travel 15% fewer miles than the regional average ― like infill development in urbanized areas near roads, jobs and transit ― can be built without expensive study and mitigation.\nProjects where drivers would have to drive more than the regional average would have to pay to study and mitigate. That could make it much more expensive for developers to build in the County’s unincorporated areas, where people typically drive farther to reach jobs and amenities.\nOn Wednesday, the Board members voted 3-2 to finish identifying infill areas in unincorporated communities that could potentially allow interested developers to build as many as 5,441 homes without Vehicle Miles Traveled study and mitigation.\nThe Board also voted 3-2 to the longer-range phase, which would start with staff coming back to the Board in four months with a ”sustainable land use framework” that could ultimately lead to an update of the County general plan.\n“Adopting a VMT (Vehicle Miles Traveled) policy is not an option,” Board Chair Nathan Fletcher said, “it is the requirement of state law.\n“The opportunity in front of us,” he continued, “is to accept that we have to tackle climate change and we have to build housing ― and look for the most legally viable way in which we can put the housing in the right places, meet our climate goals and build more housing than we have ever built before.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220210.11.13.49"}