{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Adopt a Pet from the County Shelters for the “Pawlidays”", "description": "Oh there’s “Snow Place Like Home Fur the Pawlidays” so the San Diego County Department of Animals Services is hosting a special fee-waived adoption event for all its wonderful and lovable dogs, cats and other animals.", "datePublished": "2023-12-06T11:47:38-08:00", "url": "https://www.countynewscenter.com/adopt-a-pet-from-the-county-shelters-for-the-pawlidays/", "keywords": ["animals", "das", "free pet adoptions"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-12-06T12:03:05-08:00", "articleType": "article", "articleContent": "\nOh there’s “Snow Place Like Home Fur the Pawlidays” so the San Diego County Department of Animals Services is hosting a special fee-waived adoption event for all its wonderful and lovable dogs, cats and other animals.\nThis is Sweetness, a shepherd mix at the North Shelter.\nThe event includes a visit from Santa Paws and will be held from 10 a.m. to 4 p.m. on Saturday, Dec. 9 at both the Carlsbad North Shelter, 2481 Palomar Airport Road and Bonita South Shelter, 5821 Sweetwater Road.\nDon’t miss out on the joy of pet companionship this holiday season, take part in fee-waived adoptions during the event. You can watch the fun as furry friends engage in lively dog play groups and perhaps even find your new best friend.\nThis is JimBob the Bulldog available at the South Shelter.\nPeople who adopt can commemorate the special day in a winter wonderland photo booth with a Santa Paws meet and greet. Your new pet can share his or her wishes and get a special treat.\nPets adopted on Saturday will receive custom pet tags that allows their new owner to add a personal touch for their new beginning. Animal Services is also offering free microchipping for animals whose owners reside in unincorporated San Diego.\nThis tortoiseshell kitty has no name yet. She’s at the South Shelter.\nAdopters of the shelters’ longest-stay pets will receive special stockings filled with goodies as a token of appreciation. And while supplies last, some complimentary pet supplies will be available for adopters.\nChildren at the event can also visit our craft table for fun activities.\nDogs and cats adopted from County shelters will be spayed or neutered, microchipped, have vaccinations and a one-year license for dogs in the service area.\nMeet Butters, a cattle dog at the North Shelter.\nPlease visit County Animal Services’ Adoptions page and browse the amazing animals from cats to dogs to turtles, roosters, pigs, rabbits and guinea pigs available now, then stop by Saturday to meet your favorites. Adoptions are completed at the shelter on a first come, first serve basis.\nThe County Department of Animal Services’ top priority is providing excellent care in its shelters while finding good homes for every healthy and treatable animal. While the goal is to find the right fit for animals and their permanent adopter to form a lasting and loving bond, animal fostering is another opportunity for animals to learn how to be in a home and socialize with people and other animals.\nThis is Dobby at the South Shelter.\nThis is Whooper, a Siberian husky and German Shepherd mix at the North Shelter.\nThis is Daisy Mae, she’s a Beagle and Basset Hound mix at the South Shelter.\nThis is Magnolia and she’s at the North Shelter.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231206.11.47.38"}