{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens Free-Standing Crisis Stabilization Unit in North County", "description": "People experiencing a behavioral health crisis in North County now have a new resource available to them.", "datePublished": "2021-09-30T16:22:22-07:00", "url": "https://www.countynewscenter.com/county-opens-free-standing-crisis-stabilization-unit-in-north-county/", "keywords": ["health", "crisis stabilization unit", "csu", "mental health"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-01T10:56:23-07:00", "articleType": "article", "articleContent": "\nPeople experiencing a behavioral health crisis in North County now have a new resource available to them.\nA new community-based crisis stabilization unit (CSU) opened today in Vista. This new service, the first of its kind outside a hospital setting, provides much needed support to individuals who might typically end up at a local emergency room or jail.\nCounty Board of Supervisors Chair Nathan Fletcher said in the last three years, the Board has made significant increases in investment and funding to provide better access to behavioral health services.\n“It is about how do we build a system that works…Projects like this, crisis stabilization units are a vital component,” Chair Fletcher said. “It is so important that we meet people where they are. That we get the right care, to the right person at the right time and get the right outcomes.”\nFor the CSU opening, Chair Fletcher was joined by Supervisor Jim Desmond, District Attorney Summer Stephan, Undersheriff Kelly Martinez, Nick Macchione, director of the County Health and Human Services Agency, Dr. Luke Bergmann, director of County Behavioral Health Services and Luana Murphy, president and CEO of Exodus Recovery, Inc.\nWhat Are Crisis Stabilization Units?\nCrisis stabilization units provide services in a community-based or hospital settings for people experiencing a mental health or substance use crisis.\nServices are provided on a walk-in basis with stays of less than 24 hours. In addition to walk-in, community and mobile crisis team transport, law enforcement may drop off people experiencing a behavioral health crisis to CSUs as a safe alternative to jail or a hospital, allowing deputies more options to connect people to care.\nCSUs are designed to enable the smoothest transition possible from law enforcement engagement to care hand-off, which is less taxing on individuals; allows deputies to return quickly to the field and provides a care plan leading to less recidivism. Services at the Vista CSU, located at 524 W. Vista Way, are being provided by Exodus Recovery, Inc.\nThis is the second CSU the County has opened in North County. The first one, a hospital-based CSU, opened at Palomar Health in Escondido several years ago and earlier this year, doubled its capacity to 16 recliners. A third crisis stabilization unit is also slated to open in Oceanside later this year at the North Coastal Live Well Health Center and will offer 12 additional recliners.\n“This is a lifesaver for North County,” said Supervisor Desmond. “I don’t say this as an exaggeration. This will save lives for those who are going through a crisis in their life, who are struggling with a burden and need the assistance to get their life back on track.”\nThe Crisis Stabilization Unit in vista will start serving clients Oct. 1, 2021.\nThe crisis stabilization units are part of the County’s efforts to expand access to behavioral health services throughout the region.\nA new psychiatric health facility is also being built, in partnership with Tri-City Medical Center, on its campus in Oceanside. This facility will provide 16 beds and is expected to break ground in Spring 2022.\nThe County is also working with UC San Diego Health to open a large behavioral health hub in Hillcrest that will offer an array of services to the community. The new facility will be located on a County-owned property on Third Ave. that has been vacant for years.\n“Following the leadership of our Board of Supervisors, and guided by direction of Dr. Bergmann, these efforts add to the array of crisis services in the North regions and are part of an expanding effort to get more people with mental illness the help they need,” said Macchione.\nPeople needing immediate behavioral health help should call 9-1-1. Help is also available by calling the County’s Access and Crisis Line at (888) 724-7240 or visiting www.Up2SD.org.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210930.16.22.22"}