{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: A Safe Place to Sleep", "description": "It’s been a little over a year since the Safe Parking site opened below the State Route 67 overpass on North Magnolia Ave in East County. The program has served 104 people onsite, 30% of them being seniors.", "datePublished": "2023-11-27T14:23:18-08:00", "url": "https://www.countynewscenter.com/a-safe-place-to-sleep/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-11-27T14:23:18-08:00", "articleType": "video.other", "articleContent": "\nIt’s been a little over a year since the Safe Parking site opened below the State Route 67 overpass on North Magnolia Ave in East County. The space had previously grown into a large encampment where drug use was common and trash spilled into the street.\nThe County teamed up with Dreams for Change and several other agencies, organizations and community partners to clean up and designate the space for people experiencing homelessness and living in their vehicles. The lot includes overnight 17 parking spaces, restrooms, handwashing stations and security 24/7. County outreach teams offer supportive, wrap-around services directly to clients.\nSince the program launched in 2022, 104 people have been served onsite, with 30% being seniors. Nearly half of those receiving assistance have exited the program into stable housing and over ten thousand meals have been served. The Safe Parking Program has provided a much-needed option for people who’ve had to use their vehicle as their home.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231127.14.23.18"}