{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Don’t Be a ‘Kitnapper’", "description": "With kitten season underway, the San Diego County Department of Animal Services is reminding people not to be a “kitnapper.” That means if you encounter an unattended kitten litter in your community, don’t be so quick to scoop them up and bring them to a shelter.", "datePublished": "2023-05-08T13:12:32-07:00", "url": "https://www.countynewscenter.com/dont-be-a-kitnapper/", "keywords": ["animals", "das", "kitten season", "kittens", "pet adoptions", "pet foster"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-05-08T15:50:40-07:00", "articleType": "article", "articleContent": "\nWith kitten season underway, the San Diego County Department of Animal Services is reminding people not to be a “kitnapper.” That means if you encounter an unattended kitten litter in your community, don’t be so quick to scoop them up and bring them to a shelter.\nBut why wouldn’t you rush to comfort them and get them food and warmth? The mother cat may just be out hunting for her meal before returning to nurse her neonatal kittens. Neonatal kittens are four weeks and under and are still nursing; they cannot survive on their own and need special care.\nMother cats typically leave litters alone for stretches of time. And sadly, sometimes return to find their kittens are gone because a well-meaning person wanted to rescue them.\nFrom this time through October every year, unaltered outdoor cats give birth to litters of kittens.\nKittens are usually better off staying with their mothers until they are 8 weeks old, if possible.\nAnimal experts advise people who find a kitten litter to first just observe the kittens from a distance where your presence wouldn’t scare a returning mother cat away. In most cases, she will be back.\nWhen to step in sooner:\n\nIf the kittens are in immediate danger from such things as traffic or predators\nIf the kittens are visibly sick or injured\nIf you don’t see a mother cat return after six hours and feel the kittens need care\n\nIf you are going to help, consider caring for them yourself, or checking with a neighbor or friend to see if they can help. Many local pet stores carry kitten milk replacers and the proper bottles (please don’t use an eyedropper). Bottle-feeding kittens can be rewarding but is very time intensive since round-the-clock feedings are needed until the kittens are old enough to eat solid food.\nA kitten’s age is a critical factor in its ability to thrive (learn how to estimate a kitten’s age). Contact your veterinarian for details on caring for neonates.\nAs a last resort, you can bring them to your jurisdictional animal shelter. If kittens are healthy and strong, shelter staff make every effort to immediately find a partner shelter, foster caregiver, or rescue organization to properly care for neonatal kittens that are brought to a shelter. This is done because the County shelters do not have overnight staff to care for them. Underage kittens also cannot be vaccinated yet and are susceptible to illnesses in a shelter environment.\nCounty Animal Services oversee the care and placement of many litters of kittens in addition to the hundreds of other animals in its care.\nFor these reasons, it’s so important to help reduce the number of unwanted kittens by spaying and neutering your cats, the free-roaming cats you see in your neighborhood, and by encouraging your neighbors to alter their cats.\nThe County’s Department of Animal Services is currently in need of fosters for all species of animals including kittens, but more urgently for medium to large dogs.  If you’d like to learn more about becoming a lifesaving foster caregiver, please contact the Department of Animal Services at  DAS_placement@sdcounty.ca.gov for more  information or complete a Foster Interest Form to sign up.\nAnd of course, if you’d like to adopt, please keep an eye on our adoptable pets page as new animals are added daily, who will be spayed or neutered, to add to your family.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230508.13.12.32"}