{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Site Managers Needed for In-Person Voting Locations", "description": "The Registrar of Voters is seeking temporary site managers to operate an assigned in-person voting location for the Sept. 14 California Gubernatorial Recall Election.", "datePublished": "2021-07-12T13:28:47-07:00", "url": "https://www.countynewscenter.com/site-managers-needed-for-in-person-voting-locations/", "keywords": ["elections", "2021", "2021 recall election", "gubernatorial recall election", "in-person voting locations", "sept. 14", "site managers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-07-12T13:30:13-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters is seeking temporary site managers to operate an assigned in-person voting location for the Sept. 14 California Gubernatorial Recall Election. Site managers earn $20 per hour and work approximately 125 hours over a five-week period.\nFor the upcoming election, in-person voting locations will be open for four days instead of one. The Registrar’s office will hire election workers rather than use volunteer poll workers because training is more extensive for the expanded time period.\nSite managers will be required to train and lead election workers while representing the Registrar of Voters in a professional, nonpartisan manner. The Registrar is seeking people who are team players, exhibit strong leadership skills and display flexibility, patience and the highest level of integrity at all times.\nSite managers work up to three days a week during the pre-election weeks, attend training to learn procedures, tasks, and responsibilities, and train their election workers.\n\nSite managers must be available to work from 8 a.m. to 5 p.m. on assigned workdays but may be required to work more than eight hours a day and will work some weekends.\nOn Election Day, Sept. 14, site managers must work from 5:30 a.m. to 10 p.m.\n\nThe Registrar’s office is working with Public Health Services to ensure the health and safety of election workers and voters. Recommended personal protective equipment and sanitation supplies will be provided to workers so they can conduct the election process safely.\nEnglish speakers who are bilingual in Spanish, Filipino, Vietnamese or Chinese are also needed. If you are fluent in one of these languages, be sure to indicate it on your application.\nSite manager applications are available online. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210712.13.28.47"}