{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Spirit Fund Helps Injured Dog", "description": "A 2-year-old Belgian Malinois named Eagle found her spirit again, after a County Animal Services officer came upon the injured dog while out on an unrelated investigation.", "datePublished": "2025-02-04T16:25:11-08:00", "url": "https://www.countynewscenter.com/spirit-fund-helps-injured-dog/", "keywords": ["animals", "animal services", "das", "spirit fund"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-02-05T14:53:03-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA 2-year-old Belgian Malinois named Eagle found her spirit again, after a County Animal Services officer came upon the injured dog while out on an unrelated investigation.\nAnimal Services Lt. N. Harrington noticed Eagle with an open, necrotic wound on her right hind leg. Eagle’s owner was uncooperative in getting Eagle veterinary care or surrendering her, resulting in a court-ordered seizure to allow Animal Services to get Eagle immediate veterinary attention. Unfortunately, the medical team was unable to save her leg, and a costly surgery was her only chance.\nCounty Animal Services dipped into its Spirit Fund to pay for Eagle’s surgery.\n“She’s almost all healed and she’s doing great,” said Harrington. Eagle is not yet available for adoption, but Harrington is hopeful she will be soon.\nSince her surgery, Eagle’s demeanor has completely changed, the lieutenant said. She is more open to interactions with people.\nWithout emergency veterinary care funds, animals like Eagle would likely have to be euthanized to alleviate suffering.\nCounty Animal Services established the Spirit Medical Fund in July 2008, after people around the County donated to help a 10-week-old puppy who had been rescued with severe injuries caused by a beating. Shelter staff named the puppy Spirit because, despite her extensive injuries, her spirit was not broken, and she was still a loving dog.  Spirit was adopted by a caring family, but the love for her and other animals continues.\nSo many donations had come in for Spirit that the remaining money was used to help other animals in need, like a puppy found in a dumpster bin with his ears cut off and a dog that was relinquished because the owner couldn’t afford medical care for a broken limb.\nYou can help animals like Eagle, through adoption, fostering or donating to the Spirit Medical Fund. All donations are tax deductible and can be made online, scroll down to the Donations section, or in person or mail with a check made payable to County Animal Services” and “Donation for Spirit Fund” in the memo field of the check.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250204.16.25.11"}