{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Case Rate Improves as Region Remains in Red Tier", "description": "Two of the three metrics used by the state to determine tier placement for COVID-19 risk declined in the San Diego region, placing the County further from falling into the Purple Tier, or Tier 1, the most restrictive on activities.", "datePublished": "2020-10-27T16:51:24-07:00", "url": "https://www.countynewscenter.com/county-covid-19-case-rate-improves-as-region-remains-in-red-tier/", "keywords": ["health", "coronavirus", "covid-19", "fees", "permits", "red tier"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-10-28T13:07:54-07:00", "articleType": "article", "articleContent": "\nTwo of the three metrics used by the state to determine tier placement for COVID-19 risk declined in the San Diego region, placing the County further from falling into the Purple Tier, or Tier 1, the most restrictive on activities.\nAt an update to the County Board of Supervisors, local health officials announced the region’s COVID-19 adjusted case rate decreased from 7.0 to 6.5 cases per every 100,000 residents, keeping the region in the Red Tier or Tier 2.\nThe state’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, decreased from 5.5 to 5.1%. San Diego’s figure moved from the Red Tier into the Orange Tier, but the metric does not on its own allow counties to advance to a less restrictive tier.\nThe testing positivity percentage went up slightly from 3.3 to 3.5%, keeping this metric in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the most restrictive tier. Therefore, San Diego County will stay in the Red Tier or Tier 2.\nCounty health officials continue to urge San Diegans to follow the local health guidance to slow the spread of COVID-19.\n“Washing your hands, keeping six feet apart from others, wearing a face covering, avoiding crowds and large gatherings and staying home if you’re sick are critically important in determining the future local course of the COVID-19 pandemic,” said Wilma Wooten, M.D., M.P.H., County public health officer.\n“Until a vaccine is available to achieve herd immunity, these strategies directly impact both the testing positivity and the case rates and are evidence-based practices to prevent the spread of COVID-19,” Wooten added.\nThe California Department of Public Health will continue to assess counties on a weekly basis, with the next report scheduled for Tuesday, Nov. 3.\nCounty Waives Multiple Fees\nAt the meeting, the Board voted to extend the deferral deadline of annual health permit fees, plan check fees and late fees for restaurants and food facilities to aid businesses and the local economy affected by the COVID-19 pandemic.\nThe action also includes an extension of permit and inspection fee waivers and deferrals, lease payment deferrals, ordinance amendments, new programs, extended services and continue business assistance programs as directed by the Board on May 5, 2020.\nThe deferral and waiver period for these fees had expired or will expire at the end of the month or end of December. The deferral, proposed by Board Vice Chairman Jim Desmond and Supervisor Kristin Gaspar, has been extended until March 31, 2021.\nThe action was needed to help local businesses contend with the loss of revenue associated with the COVID-19 health emergency.\nMost County-managed testing sites do not require an appointment.\nCommunity Setting Outbreaks:\n\nTwo new community outbreaks were confirmed on Oct. 26: one in a daycare setting and the other in a business.\nIn the past seven days (Oct. 20 through Oct. 26), 24 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n10,456 tests were reported to the County on Oct. 26, and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,173.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n269 new cases were confirmed among San Diego County residents on Oct. 26. The region’s total is now 55,210.\n3,875 or 7.0% of all cases have required hospitalization.\n898 or 1.6% of all cases and 23.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSeven new deaths were reported in the County on Oct. 26. The region’s total is now 877.\nFive men and two women died between Oct. 22 and Oct. 25, with one death occurring July 19. Their ages ranged from early 60s to mid-80s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201027.16.51.24"}