{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What You Should Do If You See a Coyote in Your Neighborhood", "description": "Are you seeing more urban coyotes in your neighborhood? If so, don’t panic! The County’s Department of Animal Services has some tips to keep them away and help you, your family and pets stay safe.", "datePublished": "2023-10-18T11:24:55-07:00", "url": "https://www.countynewscenter.com/what-you-should-do-if-you-see-a-coyote-in-your-neighborhood/", "keywords": ["animals", "animal services", "coyote", "pets", "wildlife"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-10-18T11:24:55-07:00", "articleType": "article", "articleContent": "\nAre you seeing more urban coyotes in your neighborhood? If so, don’t panic! The County’s Department of Animal Services (DAS) has some tips to keep them away and help you, your family and pets stay safe.\nCoyotes will often roam out of their immediate area because of things residents do to attract them – like leaving your pet’s food and water outside or unsecured trash cans in the backyard. Try to remove all food sources, including fallen fruit from trees.\nThere are also some things you can do to prevent coyotes from getting into your backyard. Have you ever heard of a “coyote roller?” It’s a metal tube that you put on top of your fence, when the coyote tries to climb over the fence the tube will spin and prevent any traction. It’s an easy and humane way to keep coyotes out.\nThere’s another simple and effective technique to use if you see a coyote in your path called “coyote hazing.” When hazing you scare animals away by making the animal afraid of people and not wanting to return to your neighborhood.\nIf you see a coyote approaching you, here’s what you should do:\n\nStop and yell at it to go away.\nMake yourself look big and scary by waving your arms above your head.\nMaintain eye contact.\nStomp your feet and make loud noise.\nAlways maintain a safe distance.\n\nWhen hazing a coyote, it’s very important to continue to do this until the coyote leaves the area and is out of sight. If the coyote continues to hang around, take a couple steps forward, stop and yell again.\nWhat to do when I need help with wildlife?\n\nThe County will respond when a wild animal is an immediate threat to people or other animals.\nThe County will respond if the animal is sick or injured, too young to survive on its own or trapped.\nThe County will respond if the wild animal is a rabies agent (raccoons, skunks, bats, foxes or coyotes, for example) AND has attacked you or your pet.\n\nHowever, the County will NOT respond to reports of wildlife being loose or simply roaming. The County cannot help you with wildlife nuisance problems like skunks under your porch or opossums raiding your pet’s food.\nCoyotes are a “rabies vector species,” which means rabies, a preventable viral disease, can spread through the bite of a rabid coyote to people or other animals. This is why it’s very important to take proper precautions and avoid coyotes when you see them in your community.\nIf you enjoy the County’s preserves or parks when you take your dog for a walk, make sure to always keep them on a leash and don’t let them stray too far away from you. If you have a cat, make sure to keep it indoors. If you see a coyote and you have a small dog with you, pick it up immediately. Keeping it on the ground will cause a coyote to charge.\nAccording to California Department of Fish and Wildlife, coyotes play an important role in the ecosystem and help keep the rodent populations under control. So, we need to learn how to live with them.\nFor more information about wildlife, visit the DAS’s website at www.sddac.com or call (619) 767-2675.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231018.11.24.55"}