{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Public’s Help Needed to Identify Woman", "description": "Do you know this woman? The San Diego County Medical Examiner’s Office needs assistance identifying a woman found unresponsive in the brush on the southern border of Forester Creek in Santee.", "datePublished": "2024-02-02T12:56:09-08:00", "url": "https://www.countynewscenter.com/publics-help-needed-to-identify-woman/", "keywords": ["public safety", "jane doe", "medical examiner"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-02-02T12:56:09-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteDo you know this woman? The San Diego County Medical Examiner’s Office needs assistance identifying a woman found unresponsive in the brush on the southern border of Forester Creek in Santee.\nParamedics responded to help on the afternoon of Monday, Jan. 22, but she could not be resuscitated.\nA forensic sketch artist created this drawing of the woman. Photographs of the tattoo and jewelry are also provided.\nShe is either Caucasian or Hispanic and appears to be between 45 and 55 years of age with brown eyes and brunette hair approximately 20 inches in length. She was approximately 5 feet 5 inches and weighed 229 pounds. She had no clothing or identification, and investigators have not been able to identify her with fingerprints.\nShe wore a bracelet engraved with “Mama B” on the front and “4/21/2006” on the back of it. She also had a tattoo on her right leg of a dolphin with wings on it and some hearts.\nThis is jewelry that was worn by the unidentified woman.\nIf you think you recognize this woman, please contact the Investigations Unit of the San Diego County Medical Examiner’s Office at (858) 694-2905 and reference case number 2024-00240.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240202.12.56.09"}