{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Paves Way for New Investments into Mental Health Resources", "description": "The County Board of Supervisors today voted unanimously to accept two grants that will allow the County to make significant investments into behavioral health services.", "datePublished": "2022-08-16T16:51:43-07:00", "url": "https://www.countynewscenter.com/?p=209232", "keywords": ["health", "acute psychiatric care", "edgemoor", "mental health", "youth mental health"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-08-16T16:51:43-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today voted unanimously to accept two grants that will allow the County to make significant investments into behavioral health services.\nThe grants include $12.4 million of Behavioral Health Continuum Infrastructure Program Launch Ready Grant funding from the California Department of Health Care Services and $1.2 million of Mental Health Student Services Act funding from the Mental Health Services Oversight & Accountability Commission.\nAcute Psychiatric Services\nThe first grant will pay for the construction of a new 12-bed acute psychiatric unit within the existing Edgemoor Distinct Part Skilled Nursing Facility in Santee. Edgemoor provides long-term skilled nursing care for individuals with complex medical needs who require specialized interventions from highly trained staff.\nThe new services will support Edgemoor residents in receiving the specialty psychiatric care they need, in close proximity to where they live. The addition will also improve access to care for other adults in need of acute psychiatric services in East County.\nOnce construction is completed, the new acute psychiatric unit is expected to connect people to community-based care, diverting them from unnecessary hospitalization.\nYouth Mental Health\nThe second grant will make significant investments into suicide prevention programs for young people. The grant will allow the County to enhance the existing Creating Opportunities in Preventing and Eliminating Suicide, or COPES program.\nCOPES is a suicide prevention and mental health wellness education program that makes suicide prevention resources and information more accessible for school staff, students, and families.\nTuesday’s Board action will allow schools to hire additional mental health personnel, provide professional development for school staff, and support other strategies that respond to the mental health needs of children and youth.\n“The funding from these grants will support the department in advancing efforts to transform the behavioral health continuum of care by enhancing services for some of the most vulnerable populations in our region,” said Dr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency. “They are important parts of our continuing work to expand and normalize the delivery of behavioral health care in our region.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220816.16.51.43"}