{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Parks Earn National Thumbs Up", "description": "The County’s parks and recreation system was awarded reaccreditation this week from the national Commission for Accreditation of Park and Recreation Agencies, once again winning kudos for its parks, programs, community involvement and operations.", "datePublished": "2021-09-23T15:31:50-07:00", "url": "https://www.countynewscenter.com/county-parks-earn-national-thumbs-up/", "keywords": ["parks and rec", "county parks and recreation", "health", "live well", "parks", "parks and recreation", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-09-23T16:10:45-07:00", "articleType": "article", "articleContent": "\nThe County’s parks and recreation system was awarded reaccreditation this week from the national Commission for Accreditation of Park and Recreation Agencies, once again winning kudos for its parks, programs, community involvement and operations.\nThe accreditation marked the third consecutive time the County Parks and Recreation Department has earned the five-year national commendation — after earning it in 2011 and 2016 — and the first time the County system met 100% of the commission’s 154 judging standards.\nSome of the commission’s standards include whether park operators have comprehensive plans to provide facilities, programs and services; how they include communities in the planning process; how they recruit, train and retain park volunteers; how they acquire and maintain park lands, and how they collaborate with other groups like schools, other agencies and groups to coordinate programs.\nThe commission is the only national accrediting agency for park operators. To earn accreditation, park operators must meet 36 of the 154 standards that are deemed “fundamental,” and at least 85% of the remaining 118.\nThe County Department of Parks and Recreation is one of just 192 parks agencies nationwide — and one of four in California — to earn the recognition.\nThe department’s accreditation is even more impressive because of the sheer size and scope of the county’s system.\nParks and Recreation operates 152 facilities on 56,000 acres of land, including parks, camping parks, sports parks, community centers, nature centers open space preserves, historic sites and 380 miles of trails from the coast to the valleys to the desert.\nParks’ programs and services run the gamut, from all types of events — such as Halloween, Earth Day, yearly egg hunts and weddings — to educational demonstrations about nature and the environment; fishing and boating; Track Trails that encourage kids to enjoy getting outside and hiking by using their smart phones to track their progress in online nature journals; learning and practicing bike skills; camping and even enjoying Summer Movies in the Park and other cool fun.\nThe accreditation process required two years of preparation by County Park’s leaders and staff, including extensive self-assessment, and gathering and organizing data and documents to demonstrate best practices in all parts of the department. The information was evaluated by industry professionals working on behalf of the commission.\nFor more information about the County’s parks and recreation system, places to go and things to do, go to the https://www.sdparks.org/.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210923.15.31.50"}