{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Free COVID-19 Testing Available Over Holidays", "description": "Free COVID-19 testing will continue to be offered seven days a week by the County throughout the holidays, with fewer locations and shorter hours on certain days.", "datePublished": "2020-12-22T13:27:57-08:00", "url": "https://www.countynewscenter.com/free-covid-19-testing-available-over-holidays/", "keywords": ["health", "coronavirus", "covid-19", "holiday testing", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-23T15:36:23-08:00", "articleType": "article", "articleContent": "\nFree COVID-19 testing will continue to be offered seven days a week by the County throughout the holidays, with fewer locations and shorter hours on certain days.\nOn Dec. 24 and Dec. 31, sites will operate on a regular schedule, with each closing at 4 p.m.\nOn Dec. 25, three sites – University of San Diego, San Marcos and Southeastern San Diego – will be open from 10:30 a.m. to 2:30 p.m.\nOn Jan. 1, five sites – Tubman-Chavez Community Center, Lemon Grove, the University of San Diego site in Linda Vista, Imperial Beach and Vista – will be open from 10 a.m. to 2:30 p.m.\nWalk-in testing sites do not require appointments. However, as of Dec. 20, nearly all drive-up COVID-19 testing sites have become appointment-only locations. This change is in response to safety concerns caused by traffic backups. Appointments are accepted up to three days in advance with new appointments becoming available each day about noon.\nThe exception to the appointment-only drive-up testing will be sites operated by the San Diego County Fire Protection District. While appointments are highly recommended, and those with them are given preference, people without appointments will be tested as capacity permits.\n“With vaccine distribution in its very earliest stage, COVID-19 testing remains extremely important to protect the public’s health,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People experiencing any symptoms, or who feel they have been exposed, are encouraged to get promptly tested. Those with symptoms should isolate until getting results, while others should adhere to the best practices of wearing a mask, social distance, and good hygiene.”\nHoliday testing demand is expected to be high. Wait times at walk-up locations will exceed an hour at times, and the public’s patience is appreciated.\nFor details on testing locations, or to make an appointment at a drive-up location, visit 211sandiego.org or call 2-1-1.\nCertain testing sites are also offering separate no-cost, no-appointment flu vaccination shot clinics.\nTubman Chavez Community Center, 415 Euclid Ave, 92114:\n\nWeekly on Sundays, 9:30 a.m. to 4 p.m.\n\nImperial Beach Sports Park Recreation Center, 425 Imperial Beach Blvd, 91932:\n\nEvery other Saturday, 9:30 a.m. to 4 p.m., with the next clinic on Dec. 26.\n\nSt. Francis of Assisi Catholic Church (Live Well Mobile Office), 525 W. Vista Way, 92083:\n\nEvery other Tuesday, 9:30 a.m. to 4 p.m., with the next clinic Dec. 29.\n\nFree flu clinics are available throughout the week with new ones added regularly. More information is at sandiegocounty.gov/iz as well as at 211sandiego.org.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201222.13.27.57"}