{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "TB Case Reported at Southwestern College; Case Not Related to Previous Exposures", "description": "A person at Southwestern College has tested positive with tuberculosis and may have exposed others to the disease, the County Health and Human Services Agency announced today.", "datePublished": "2020-03-10T15:36:57-07:00", "url": "https://www.countynewscenter.com/tb-case-reported-at-southwestern-college-case-not-related-to-previous-exposures/", "keywords": ["health", "southwestern college", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-10T15:38:51-07:00", "articleType": "article", "articleContent": "\nA person at Southwestern College has tested positive with tuberculosis and may have exposed others to the disease, the County Health and Human Services Agency (HHSA) announced today.\nHHSA is working closely with Southwestern College (SWC) officials to notify people who were possibly exposed to tuberculosis. This TB case is not related to previous exposures at the community college.\nThe period of possible exposure is from Sept. 10, 2019 to Feb. 21, 2020.  This incident is not associated with prior exposures.\nTuberculosis is transmitted from person to person through indoor air during prolonged contact with an infectious person. Most people who are exposed do not become infected.\n“We are recommending that all the identified people get tested to make sure they are not infected,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Early diagnosis and prompt treatment can prevent the infectious form of the disease.”\nHHSA and SWC will provide free testing to identified people at the college’s Student Health Services– Student Center, Room 601F, 900 Otay Lakes Rd., Chula Vista, CA 91910. Testing will be offered Wednesday & Friday from 8 a.m. to 3 p.m. SCW employees will be tested by Occupational Health.\nSymptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss. Tuberculosis can be treated and cured with medication. People who have TB symptoms or are immuno-compromised are encouraged to see their medical health care provider to rule out TB.\nPeople who would like more information on this potential exposure are asked to call:\n\nSouthwestern Students Health Services at (619) 482-6354\nCounty TB Control Program at (619) 692-8621\n\nTuberculosis is not uncommon in the San Diego region but has been decreasing since the early 1990s and has stabilized in recent years.  In 2013, 206 cases were reported in the county, the lowest number since local TB cases peaked at 469 in 1993. There were 237 cases reported in 2017 and 226 in 2018.  Last year, 265 local residents were diagnosed with TB.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200310.15.36.57"}