{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Parks and Recreation Hits Bullseye with Outdoor Archery Range", "description": "The County opened its much-anticipated outdoor Archery Range at Kumeyaay Valley Park this week.", "datePublished": "2025-05-15T16:22:15-07:00", "url": "https://www.countynewscenter.com/county-parks-and-recreation-hits-bullseye-with-outdoor-archery-range/", "keywords": ["parks and rec", "county parks", "district 2", "infrastructure", "lueg", "parks and recreation"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2025-05-15T16:50:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County opened its much-anticipated outdoor Archery Range at Kumeyaay Valley Park this week.\nLocated at 10964 Ashwood Street in Lakeside, CA, the new facility fills a community need for public outdoor archery ranges in San Diego County to support both beginner and competitive-level archery training.\n“We’re so excited to be bringing this new and much anticipated archery range to East County,” said Supervisor Joel Anderson, who represents the County’s second supervisorial district where the range is located. “It will continue to enhance our region by providing all residents with a new outdoor space to engage in this sport.”\nThe park was selected for the archery range because of its location. There are currently no public outdoor ranges in East County. This new range will increase access to the sport by reducing travel times.\nThe self-regulated range is open from 8:30 a.m. to sunset and features 10 shooting lanes designed for different skill levels. It is fully ADA-compliant with accessible footpaths, parking, shooting lanes and toilet facilities.\nParks and Recreation staff engaged with local archery advocacy groups, archery clubs, archery industry professionals and the Lakeside Community Planning Group to create an amenities list for the range. This feedback was used to guide the development of the project and concept plan.\nFor more information about the project, visit sdparks.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250515.16.22.15"}