{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is Last Day to Vote in District Four Special Primary Election", "description": "Tuesday, Aug. 15 is the final day to cast your ballot in the special primary election for the Fourth Supervisorial District. Eligible voters can vote early from 8 a.m. to 5 p.m. Monday, Aug. 14 at any one of seven vote centers or 29 official ballot drop boxes around the district.", "datePublished": "2023-08-14T07:30:50-07:00", "url": "https://www.countynewscenter.com/tuesday-is-last-day-to-vote-in-district-four-special-primary-election/", "keywords": ["elections", "aug. 15 special primary election", "county registrar of voters", "district 4 special primary election", "early voting", "fgg", "supervisorial district 4", "tuesday last day to vote"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-08-14T08:25:32-07:00", "articleType": "article", "articleContent": "\nTuesday, Aug. 15 is the final day to cast your ballot in the special primary election for the Fourth Supervisorial District.\nEligible voters can vote early from 8 a.m. to 5 p.m. Monday, Aug. 14 at any one of seven vote centers or 29 official ballot drop boxes around the district.\nOn the final day of voting, Aug. 15, the Registrar’s office and an additional seven vote centers will open for a total of 14 vote centers. All will be open from 7 a.m. to 8 p.m. Any voter who is in line at a vote center or an official ballot drop box location at 8 p.m. will be allowed to vote. However, no one can join the line after the 8 p.m. deadline.\nThe person elected will fill District 4’s vacant seat for the remainder of the current term ending in January 2027. If no candidate receives a majority vote at the Aug. 15 election, then a special general election will be held on Nov. 7.\nOnly those who live in the district can vote in the election. If you’re not registered to vote and want to participate in the election, you may visit any vote center to conditionally register and vote provisionally through Aug. 15.\nOnce the voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the district, the voter registration becomes active and the provisional ballot is counted.\nVote centers replace polling places and provide these services:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate on the ballot. Additionally, an individual may not circulate any petitions, including for initiatives, referenda, recall or candidate nominations.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com.\nLearn more about voting in the District 4 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\nGet mobile updates by texting COSD D4Election to 468311.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230814.07.30.50"}