{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County of San Diego Hires Chief Dental Officer", "description": "The County of San Diego has a new Chief Dental Officer, Fadra M. Whyte, DMD, M.P.H., who has joined to help develop policies and expand programs that promote oral health to all San Diegans. ", "datePublished": "2023-07-05T13:03:51-07:00", "url": "https://www.countynewscenter.com/county-of-san-diego-hires-chief-dental-officer/", "keywords": ["health", "fadra m. whyte", "oral health program"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-07-06T10:36:47-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego has a new Chief Dental Officer, Fadra M. Whyte, DMD, M.P.H., who has joined to help develop policies and expand programs that promote oral health to all San Diegans. \n“Dr. Whyte will be a valuable addition to our team,” said Dr. Eric McDonald, interim director of the Health and Human Services Agency. “She brings a wealth of experience working with children and youth and will really help us expand our oral health outreach.” \nWhyte has worked as a board-certified pediatric dentist at San Ysidro Health for the past 10 years.  She is faculty for the NYU Langone Pediatric Dental Residency Program co-located on Rady Children’s Hospital in San Diego campus, mainly treating children with special health care needs. \n“I’m very excited and grateful for this opportunity,” said Whyte, who is joining the HHSA’s Medical Care Services department. “I am looking forward to expanding oral health initiatives to all San Diegan’s including youth, adults with special health care needs, seniors, and those in the County’s most rural areas.” \nWhyte earned her undergraduate degree at the University of Pittsburgh, and her doctorate of dental medicine at the University of Pennsylvania. She went on then complete a two-year residency in pediatric dentistry in Brooklyn, NY and a master’s degree in public health from A.T. Still University.  She worked as a pediatric dentist in New York City prior to moving to San Diego. \nWhyte will also work closely with the Local Oral Health Program, which is managed under Public Health Services. The programs include the Dental Health Initiative/Share the Care program and the Child Health and Disability Prevention program. Those programs work with other public agencies, private groups and a network of pro-bono dentists to conduct no-cost or reduced-cost emergency dental care for children. They also organize dental health screenings and promote preventive dental care for children. And they teach people about the important link between oral health and people’s overall health. \nSome of the other actions Whyte will lead include: \n\nStudying and making recommendations about proposed legislation that would affect people’s access to dental services.\nTalking with professional organizations across the state, engaging with San Diegans, community groups, public officials and County staff to further develop the County’s oral health strategic plan.\nIdentifying grant opportunities and training County staff to help write grant applications.\n\nLast year, HHSA reported numerous accomplishments from its Local Oral Health Program, including:  \n\nWorked with the state to train 23 pediatric providers who care for infants, children and youth about oral health and how to apply teeth-protecting fluoride varnish treatments.\nTrained more than 80 dental providers who serve people receiving Medi-Cal to help educate their patients about the importance of oral health, and linkages between nutrition and oral health.\nConducted annual trainings for new school nurses and health care staff across the county about the importance of oral health education, prevention, and about reporting data about children’s oral health on the Kindergarten Oral Health Assessment (KOHA). The percentage of schools reporting that data in the county has increased from 43% in 2018 to 77% in 2021.\nGave out 3,555 free toothbrush kits through school meal programs during school closures during the COVID-19 pandemic.\n\nFor more information about the County Health and Human Services Agency, go to its website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230705.13.03.51"}