{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "IMAGE: Mexican Fruit Fly Quarantine Declared in Valley Center", "description": "Mexican Fruit Fly Quarantine Declared in Valley Center", "datePublished": "2022-08-23T14:35:54-07:00", "url": "https://www.countynewscenter.com/?p=209264", "keywords": ["mexican fruit fly", "quarantine", "image"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2022-08-24T12:05:18-07:00", "articleType": "article", "articleContent": "\nThe California Department of Food and Agriculture (CDFA) declared a 77-square-mile quarantine covering Valley Center and surrounding areas on August 19 after discovering several Mexican fruit flies (MXFF), an agricultural pest that can infect more than 50 types of fruit, including citrus, avocados, and a wide variety of tropical fruit.\n\nCDFA officials said anyone growing or packing “host” fruit inside the quarantine area — commercially or in private yards — are urged not to move fruit off their properties. Local residents and home gardeners affected by the quarantine should consume homegrown produce on-site, to include canning, freezing or juicing and should not move host items from their property. Residents with questions are encouraged to call the consumer hotline at (800) 491-1899.\nFruit on the host list include all types of tropical citrus, but also includes certain varieties of avocados, guava, pomegranate, and many exotic fruits that are grown in the area.\nAs of Aug. 19, 2022, the quarantine area is bordered on the north by Pauma Valley; on the south by Lake Wohlford; on the west by the Moosa Canyon; and on the east by Rincon Reservation.\nAs the lead agency for a quarantine in California, CDFA is the designated point of contact for quarantine inquiries. CDFA will also conduct informational meetings with commercial growers, nurseries, packinghouses and residents inside the quarantine area.\nThe County Department of Agriculture, Weights and Measures (AWM) supports CDFA during a quarantine to help prevent the spread of the detected pest and any expansion of the quarantine area. AWM has alerted area agriculture stakeholders of the findings, including the San Diego County Farm Bureau, and as the host County, will assist CDFA with outreach and facilitation of grower meetings. The County will also work with growers adjacent to the quarantine area to help lessen the impact of a potential quarantine expansion and is responsible for regulating all pesticide use.\nMexican fruit flies, which are larger than a house fly, can wreak expensive agricultural destruction. Countywide, the 2020 crop value of MXFF hosts in San Diego County is $306 million.  Within the quarantine boundaries, that value is $49M of San Diego County’s $1.8 billion total agricultural value.\nFemale flies inject their eggs inside ripening fruit. Hatched larvae then eat the fruit’s flesh, causing it to rot and drop to the ground. Larvae crawl out of the rotting fruit and into the ground to pupate. Adult flies emerge from the ground in 12 to 100-days, depending on temperatures. A single female fly can lay several thousand eggs in their lifetime.\nMedia inquiries should be directed to CDFA’s Public Information Officer Steve Lyle at Officeofpublicaffairs@cdfa.ca.gov  or 916-654-0462.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220823.14.35.54"}