{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Leaders Reflect on 20th Anniversary of 2003 Firestorm", "description": "Leaders from across San Diego County gathered Wednesday to reflect on the historic and devastating 2003 fires and to highlight the progress, cooperation and preparations made since then. Seventeen people died in the four fires that started Oct. 25, 2003.", "datePublished": "2023-10-26T12:56:40-07:00", "url": "https://www.countynewscenter.com/community-leaders-reflect-on-20th-anniversary-of-2003-firestorm/", "keywords": ["government", "2003 firestorm", "cal fire unit chief tony mecham", "cedar fire", "community", "district two supervisor joel anderson", "emergency services director jeff toney", "otay fire", "paradise fire", "roblar 2 fire", "san diego fire-rescue chief colin stowell", "scripps ranch", "sheriff captain tom seiver"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-10-26T13:02:09-07:00", "articleType": "article", "articleContent": "\nLeaders from across San Diego County gathered Wednesday to reflect on the historic and devastating 2003 fires and to highlight the progress, cooperation and preparations made since then.\nSeventeen people died in the four fires that started Oct. 25, 2003. Thousands of homes and buildings were destroyed and there was widespread damage to infrastructure and the natural environment. Nearly every San Diegan was affected by the firestorm. Many of those who were spared came to help their neighbors recover from the firestorm.\n“My neighbors in Alpine came together to show the true fiber of the community.  We were close before but became even closer after surviving that experience together,” said Joel Anderson, District Two County Supervisor. “I am grateful to the leaders before me who worked so hard to make our communities safer.”\nSupervisor Anderson spoke about the purchase of a new twin-engine firefighting rescue helicopter for the Sheriff’s Department coming online soon. Anderson also pointed out the County has invested more than $800 million in fire protection and emergency services through County Fire and the Fire Protection District.\nCAL FIRE San Diego Chief Tony Mecham talked about the improved collaboration and communication between community leaders.\n“Every fire department in this County sees wildland fire as a collective problem, I share the same vision with the other fire chiefs. The emergency response must be quick and sufficient to suppress wildland fires before they get out of hand,” said Mecham.\n“We have learned a great deal from the Cedar Fire, and we have used that knowledge to improve our operations and make our community safe,” said San Diego Fire-Rescue Chief Colin Stowell.\nChief Stowell spoke about his experience working as a Fire Captain 20 years ago in Scripps Ranch. He said the tragedy taught us valuable lessons about interagency communications and the importance of investing in air assets here at home. San Diego Fire-Rescue now operates three firefighting helicopters.\nSheriff’s Department Captain Tom Seiver spoke of law enforcement’s role in disasters. Captain Seiver emphasized the need for people to evacuate when told to do so.\n“If you choose to stay at home during an evacuation order, not only do you put your life in danger, but also the lives of first responders,” said Captain Seiver.\nThe speakers encouraged the community to have an evacuation plan.\n“Investments in technology over the years have bolstered our regional preparedness and response capabilities,” said County Emergency Services Director Jeff Toney. “We encourage everyone to have an evacuation plan and heed the messages to evacuate whether it is delivered to your phone, through law enforcement, or through the media.”\nYou can register your cell phone with AlertSanDiego to receive emergency alerts and download the SD Emergency app to stay informed through all disasters.\n“No matter the patch or color of the fire engine, firefighters in San Diego County take wildland fires seriously and will come together to protect the lives and property of the residents we serve,” said Mecham. “We believe in ‘one team, one mission’ and that is what has been created in San Diego County.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231026.12.56.40"}