{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Santee Homeless Court Pop Up Event", "description": "Community resources pop-up events bring essential services directly to people experiencing homelessness and have become an important part of the County’s homeless outreach strategy. These events, held twice a month, are key opportunities for engagement, service delivery, and legal support in locations chosen based on community need and city requests.", "datePublished": "2025-05-28T13:29:16-07:00", "url": "https://www.countynewscenter.com/santee-homeless-court-pop-up-event/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-05-28T13:29:16-07:00", "articleType": "video.other", "articleContent": "\nReading Time:  < 1 minuteCommunity resources pop-up events bring essential services directly to people experiencing homelessness and have become an important part of the County’s homeless outreach strategy. These events, held twice a month, are key opportunities for engagement, service delivery, and legal support in locations chosen based on community need and city requests.\nPop ups that include Homeless Court usually draw the most participants. At these events, attendees can get support in resolving legal issues including outstanding warrants and DMV holds on driver’s licenses or vehicle registration. Once those issues are cleared, participants can immediately apply, on site, for Calfresh or other benefits they may have previously been restricted from receiving.\nThis County Homeless Court model of outreach is so successful it is now being replicated in other communities. Those include Orange County and Santa Clara County, which have now held two pop ups, while Savannah, GA is working on its second event. San Bernardino County is visiting this month to learn how the real-time warrant clearing process works.\nPop up events are possible due to the collaboration between the Public Defender, District Attorney, multiple County departments, community-based and non-profit organizations and individual cities and businesses.\nEvent locations are chosen by need and through requests from host cities and communities. From two per year in 2021, they now are generally being held twice a month throughout the region.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250528.13.29.16"}