{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Accepts $44.3 Million in One-Time Behavioral Health Bridge Housing Grant Funding", "description": "The County of San Diego Board of Supervisors approved Tuesday using $44.3 million in state Behavioral Health Bridge Housing Program funds to provide more housing for San Diegans who have serious behavioral health conditions and are experiencing homelessness. ", "datePublished": "2023-07-18T16:37:41-07:00", "url": "https://www.countynewscenter.com/county-accepts-44-3-million-in-one-time-behavioral-health-bridge-housing-grant-funding/", "keywords": ["housing", "behavioral health", "bhs", "board and care", "luke bergmann", "optimal care pathways model"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-07-18T16:37:41-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Board of Supervisors has approved using $44.3 million in state Behavioral Health Bridge Housing Program funds to provide more housing for San Diegans who have serious behavioral health conditions and are experiencing homelessness. \nThe funds will help address the need for board and care beds which are typically home-like settings for five or six adults or seniors who need some specialized care, but not in a hospital or clinical setting. \nIn 2022, the Board approved the Optimal Care Pathways Model, which is the result of an in-depth review of current and historical data and existing care models to better understand and project regional need. Recommendations guided by the Optimal Care Pathways Model indicate the region needs to increase board and care capacity by nearly 150%. This translates to about an additional 450 beds to assist this vulnerable population.\n“This funding comes at a time of growing need for more behavioral health housing resources,” said Dr. Luke Bergmann, director of Behavioral Health Services. “These new funds will allow us to preserve and optimize current community-based care infrastructure in alignment with the Optimal Care Pathways Model and help ensure that those who are most vulnerable will get the care and housing that they need.”\nToday’s action allocates $41.5 million for new board and care payments to supplement funds for Medi-Cal clients and help them meet escalating board and care rent costs.  \nThe remaining $2.8 million will be used for infrastructure start-up costs to speed up the creation of new beds. \nApproved uses for the Behavioral Health Bridge Housing Program funds include hiring more assisted living workers, outreach and engagement, and start-up infrastructure and housing expenses, which include shelter, interim housing, rental assistance and patch funds for assisted living settings and housing navigation. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230718.16.37.41"}