{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Got COVID? Get Treatment to Recover Faster", "description": "The County Health and Human Services Agency is reminding San Diegans that monoclonal antibody treatment is available for people at high risk of serious illness from COVID-19.", "datePublished": "2022-02-15T09:30:01-08:00", "url": "https://www.countynewscenter.com/got-covid-get-treatment-to-recover-faster/", "keywords": ["health", "coronavirus", "covid-19", "monoclonal antibody treatment"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-02-15T10:12:36-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is reminding San Diegans that monoclonal antibody treatment is available for people at high risk of serious illness from COVID-19.\nThe first Monoclonal Antibody Regional Center opened in the region just one year ago. Since then, more than 8,100 patients have been treated in ten regional outpatient settings, six of which remain open today. The treatment centers have availability to treat people with sotrovimab, a monoclonal antibody that is effective against the Omicron variant.\n“Despite the thousands of new COVID-19 cases being reported, we have a lot of capacity for monoclonal antibody treatment,” said Jennifer Tuteur, M.D., County deputy chief medical officer, adding that every eligible San Diegan should get all the recommended doses of the COVID-19 vaccine, including the booster shot.\n“Vaccination is the best protection we have against COVID-19, but if people get sick, we want all high-risk people to know they may be eligible for treatment, and there are several options throughout the County to serve them.”\nThese monoclonal antibody therapies are used to treat mild-to-moderate COVID-19 in adults and children 12 years and older.\nMonoclonal antibody treatment has proven to significantly reduce hospital visits and death in COVID-19 positive patients, if administered within 10 days of the onset of symptoms.\nAccording to National Institutes of Health researchers, clinical trials showed “an 85% relative reduction…in the risk of hospitalization or death among those who received sotrovimab.” Studies have also shown patients feel better and get back to work faster after receiving monoclonal antibodies.\nThe treatment is available at no cost regardless of health insurance or immigration status, and a doctor’s referral is not required. The intravenous treatment takes less than an hour.\nYou may be eligible for treatment if you:\n\nTested positive for COVID-19; and\nHave symptoms of COVID-19, but not for more than 10 days; and\nAre at high risk for developing severe illness from COVID-19.\n\nThe County has partnered with the California Medical Services Authority and local health care providers to open several of the monoclonal antibody regional centers, or MARCs. In addition, a Mobile Monoclonal Antibody Administration Team provides treatment at skilled nursing facilities across the region. Skilled nursing facilities interested in monoclonal antibody treatment should contact the mobile team at MCSDNursingM_MAT.HHSA@sdcounty.ca.gov.\nPatients or providers can call (619) 685-2500 to schedule an appointment. More information is also available at COVIDtreatment@sdcounty.ca.gov\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220215.09.30.01"}