{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Applications Open for Teen Summer Camp Focused on Public Health", "description": "A popular summer camp for local high school students who want to learn more about public health is accepting applications. Public Health Advocate Camp gives students access to public health professionals and practical experience at no cost.", "datePublished": "2025-04-18T07:44:44-07:00", "url": "https://www.countynewscenter.com/applications-open-for-teen-summer-camp-focused-on-public-health/", "keywords": ["health", "advocate camp", "career", "district 4", "public health", "skilled and innovative workforce", "summer", "teens"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-04-18T15:27:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteA popular summer camp for local high school students who want to learn more about public health is accepting applications.\nFor the third year in a row, the County’s Health and Human Services Agency and the San Diego County Office of Education are teaming up to offer Public Health Advocate Camp. The no-cost, five-day summer camp runs from June 23 – June 27 and explores the world of public health.\nStudents will receive hands-on, project-based training from public health professionals who work with critical public health issues daily. Topics include Tuberculosis, Epidemiology and Immunization Services, HIV, and Mental Health.\nInstructors include public health professionals and doctors from the County’s Public Health Services department. The agenda is designed to expand students’ understanding of health careers beyond hospital systems, providing an excellent introduction to public health careers and a professional network.\n“This is a great opportunity for us to engage and inspire the next generation of public health professionals,” said Dr. Ankita Kadakia, County interim public health officer. “Students will leave this camp with real examples of how their work can keep the communities they live in safe and healthy.”\nEligible students must be a sophomore or junior in high school during the 2024-2025 school year. The application deadline is May 2.\nFor details and to register, visit SDCOE. View camp video Public Health Advocate Camp 2023.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250418.07.44.44"}