{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Receives $250,000 for Child Safety Seat Education Program", "description": "The County’s Health and Human Services Agency received a California Office of Traffic Safety (OTS) grant to support its efforts to educate parents and caregivers about the importance of child safety seats. The grant program runs through September 2025. ", "datePublished": "2024-11-14T10:00:23-08:00", "url": "https://www.countynewscenter.com/county-receives-250000-for-child-safety-seat-education-program/", "keywords": ["families", "barbara jimenez", "car seat", "child safety"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-11-14T10:00:23-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County’s Health and Human Services Agency received a California Office of Traffic Safety (OTS) grant to support its efforts to educate parents and caregivers about the importance of child safety seats. The grant program runs through September 2025. \n“We are thrilled to receive this funding to support our child safety seat education program,” said County Health and Human Services Agency Community Operations Officer Barbara Jiménez. “Proper use of child car seats can dramatically reduce the risk of injury or death in a crash. With this grant, we can provide hands-on training, resources, and support so that every family has the knowledge and tools to keep their children safe.” \nGrant funds will be used for a variety of community outreach events, education classes, distribution of child safety seats, and training on the installation and use of child safety seats. The car seat safety program includes:  \n\nChild safety seat inspection events and education classes. \n\n\nChild safety seats at no-cost for families in need. \n\n\nPartnering with local organizations on car seat safety community outreach efforts in underserved communities. \n\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241114.10.00.23"}