{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New, Improved Lakeside Library to Start Construction in Spring", "description": "In a few months, the County of San Diego will start a new chapter for Lakeside residents and their library, starting construction on a new library three times larger than the current branch, with a community room for events, a bookstore and large spaces for children and teens.", "datePublished": "2020-11-25T11:03:13-08:00", "url": "https://www.countynewscenter.com/new-improved-lakeside-library-to-start-construction-in-spring/", "keywords": ["library", "lakeside", "lakeside library", "libraries"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-11-25T11:27:07-08:00", "articleType": "article", "articleContent": "\nIn a few months, the County of San Diego will start a new chapter for Lakeside residents and their library, beginning construction on a new 16,400-square-foot library three times larger than the current branch, with a community room for events, a bookstore and large spaces for children and teens.\n“Libraries are not just a place for books anymore,” said County Supervisor Dianne Jacob. “They’re a place for children to do their homework, they’re gathering places. And a lot of resources will come into this community as a result of the new library, because it will be bigger and better.”\nCounty officials say construction is expected to start in spring 2021 and be completed in summer 2022.\nThe County’s Board of Supervisors voted to buy the land to build the new library in September 2017, when Jacob called it a project “near and dear to me and many folks in Lakeside.”\nThe new $19 million facility will be a be a solar-powered “zero net-energy building,” with a 2,000-square-foot community room that can seat 150 people. The community room alone is a little less than one-half the size of the current 5,000-square-foot Lakeside library that was built in 1962. The new library will be built just a few blocks away from the current branch on Woodside Road near Channel Road.\nIn addition to the community room, the new library will include five study rooms, a conference room, a patio, a Friends of the Library bookstore and public art. It will also feature the latest in library technology, including automated book returns, a laptop kiosk, an audio-visual system and digital signage.\nCounty Library Director Migell Acosta said the community room will be able to be used for numerous types of events: cultural, musical, dance, educational and lectures.\nFor more information about the County library, go to the Library’s webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201125.11.03.13"}