{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bee Safe This Spring, Don’t Get Stung", "description": "During springtime, the flowers bloom and the bees are busy. Here are some simple tips to make sure you don’t get stung. The biggest one is—do not disturb them. And if they’re already disturbed, move away to a safer location!", "datePublished": "2024-03-22T11:26:45-07:00", "url": "https://www.countynewscenter.com/bee-safe-this-spring-dont-get-stung/", "keywords": ["agriculture", "agriculture", "beekeeping", "bees"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-03-22T11:26:45-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesDuring springtime, the flowers bloom and the bees are busy. Here are some simple tips to make sure you don’t get stung. The biggest one is—do not disturb them. And if they’re already disturbed, move away to a safer location!\nThis time of year, sightings of honey bee swarms and nests are more likely as groups of bees leave their old colonies to establish new ones, according to our experts at the County’s Department of Agriculture, Weights and Measures.\nBees are an important part of the environment and agriculture. They pollinate flowers to produce many of the foods we eat. But as we all know, they can act in defense of their nests and sting us to protect their young and honey.\nThere are many types of honey bees in San Diego. Two of the most common are European honey bees and Africanized honey bees. European honey bees are the more docile domesticated bees that are traditionally kept by beekeepers. They’re used to pollinate crops and produce honey.\nAfricanized bees are not used in agriculture or honey production because they tend to react defensively to common disturbances, especially to vibrations such as lawn equipment. They’re more aggressive, attack more readily in greater numbers, and chase their target for longer distances. Both types of bees can swarm or make hives, but the Africanized species swarms more often.\nA honey bee swarm or nest will have a distinct buzzing sound. Swarms often stop to rest and send out scouts before finding a location to permanently settle. These swarm clusters are often docile as they have no food or nest to defend, but it is still recommended to practice caution around them.\nHives, on the other hand, are a stationary nest of honey bees, where they raise their young and store their food: the nectar — which is made into honey — and pollen collected from flowers. Bees are territorial around their hive and will react defensively if disturbed.\nHoney bees often nest in dark, quiet, protected places such as eaves, attics, trees, shrubbery, chimneys, gutters, abandoned vehicles, under the lid of compost piles, abandoned tires and utility boxes. If the bees are in a utility box, such as a water meter box or electrical transformer, residents should contact the utility provider for removal.\n Here are some helpful tips if you encounter a swarm or bee nest:\n\nDo not disturb them. If they are disrupted already, move to a safe location.\nKeep children and pets away.\nIf the bees are an imminent threat, aggressively swarming from a hive and attacking people or animals, people should immediately contact emergency services like their local police or fire department or 9-1-1.\nThe County CANNOT remove wild honey bees from private property, only County owned or maintained property – such as a parks, libraries, or streets.\nIf located on private property, it is up to the property owner to hire a professional to remove them.\nDo not attempt to remove bees yourself. Please contact a licensed pest control company or live bee removal company.\n\nThe County’s Apiary Program regulates managed bee colonies (apiaries). The program expands beekeeping opportunities in the unincorporated areas, promotes responsible beekeeping and investigates managed bee complaints in unincorporated areas. For more information, click here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240322.11.26.45"}