{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches COVID-19 Case Rate Map as Cases Set Record", "description": "The County is launching a COVID-19 case rate map that shows how cities and communities are being impacted by the novel coronavirus.", "datePublished": "2020-11-12T16:19:54-08:00", "url": "https://www.countynewscenter.com/county-launches-covid-19-case-rate-map-as-cases-set-record/", "keywords": ["health", "coronavirus", "covid-19 case rate map", "purple tier", "record cases"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-13T18:24:34-08:00", "articleType": "article", "articleContent": "\nThe County is launching a COVID-19 case rate map that shows how cities and communities are being impacted by the novel coronavirus.\nThe interactive map allows users to identify the case rate per 100,000 residents in cities and communities or by ZIP codes. The map also shows where each area falls under the different state tiers and whether their case rate and testing positivity are going up or down.\n“Cities had previously requested the map to determine how they are faring during the pandemic,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The map gives cities a clearer picture of how COVID-19 is impacting their residents and will help them determine whether to take more aggressive actions to enforce the public health guidance to slow the spread of the virus.”\nThe map is a new tool the County is using to monitor COVID-19 in the region which is experiencing a significant increase in cases.\nCOVID-19 Cases Set a New Record\nOn Nov. 10, a record 661 COVID-19 cases were reported in the County, surpassing the 652 cases reported Aug. 7. A total of 620 cases were reported Nov. 11, bringing the two-day total to 1,281.\n“We have not seen cases this high in months and it’s a clear indication that COVID-19 is widespread,” Wooten said. “These totals also show people are not following the public health recommendations that we know work to prevent getting and passing COVID-19. Coming in the weeks following Halloween, these results are a warning sign that we need to follow public health guidance throughout the upcoming holiday season.”\nThe daily case totals being reported now clearly show that the County, which is now in the state’s most restrictive Purple Tier, is likely to remain there for the foreseeable future.\nBecause the County’s case rate increased to 7.4, then 8.9 over the past two weeks, the region must stop indoor operations at restaurants, gyms, places of worship and movie theaters starting Sat., Nov. 14. Retailers will need to keep customers at 25% of capacity.\nThe County will remain in the Purple Tier for at least three weeks. It won’t be able to advance to the Red Tier unless it posts a case rate below 7 cases per 100,000 residents two weeks in a row.\n“San Diegans should be wearing a mask, staying away from others and avoiding gatherings,” said Wooten. “We don’t have a vaccine yet and we need to remain vigilant to prevent the spread of COVID-19.”\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Nov. 17.\nOther State Metrics:\n\nThe testing positivity percentage is 2.6%, placing it in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 6.5% and it’s in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance.\n\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed on Nov. 11: three in retail settings, two in business settings and two in food processing settings.\n16 community outbreaks were confirmed Nov. 10: six in business settings, four in retail settings, two in restaurant/bar settings, one in a restaurant setting, one in a TK-12 school setting, one in a gym and one in a health care setting.\nIn the past seven days (Nov. 5 through Nov. 11), 49 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n17,908 tests were reported to the County on Nov. 11, and the percentage of new laboratory-confirmed cases was 3%.\n13,754 tests were reported to the County on Nov. 10, and the percentage of new laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 3.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,600.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n620 new cases were confirmed among San Diego County residents on Nov. 11. The region’s total is now 62,334.\n661 cases were reported Nov. 10.\n4,130 or 6.6% of all cases have required hospitalization.\n948 or 1.5% of all cases and 23% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new deaths were reported in the County on Nov. 11. The region’s total remains 918.\nThree deaths were reported Nov. 10.\nThree men died between Nov. 7 and Nov. 10. Their ages ranged from mid-50s to mid-70s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201112.16.19.54"}