{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves Plan to Boost Youth Civic Involvement", "description": "The County Board of Supervisors recently approved a framework that will boost youth civic engagement and leadership opportunities in the County.", "datePublished": "2020-11-23T13:30:47-08:00", "url": "https://www.countynewscenter.com/board-approves-plan-to-boost-youth-civic-involvement/", "keywords": ["government", "live well san diego", "youth"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-11-23T13:42:19-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors recently approved a framework that will boost youth civic engagement and leadership opportunities in the County. The Live Well San Diego Youth Sector is designed to amplify the voices of San Diegans under the age of 25 and to encourage young people to get involved in civic activities.\nMore than half a million San Diegans between the ages of 15 and 24 call the County home.\nThe Live Well San Diego Youth Sector will provide leadership and training ​opportunities, encourage participation on boards and commissions​, and match young people with mentors who work in County government, or are community leaders.\nThe County will also hire two part-time youth advisors who will work with County staff in the Live Well San Diego Support Team to inform the strategy and development of the Youth Sector.\nMarabella de la Rea, 16, got involved in the Live Well San Diego Youth Sector during one of more than three dozen County-hosted listening sessions that were part of the planning process for the initiative. She became interested in participating because the initiative provides young people with opportunities to grow and learn from each other.\n“The Live Well San Diego Youth Sector is an extremely important addition to our society as it allows youth to gain opportunities that they didn’t have before,” said de la Rea. “I’m motivated to advocate for youth voices and the Live Well San Diego Youth Sector because I believe that stronger communities begin with young people and their perspectives.”\nNow that the framework for the Live Well San Diego Youth Sector has been approved, the next step is a youth-led session. That will take place during the Let’s Hear From You(th)! presentation at the virtual Live Well Advance on Dec. 3 at 3:30 p.m.\nCounty residents, 14 to 24 years old, are invited to register for the youth-led online workshop and share their input, which will be used to help inform critical decisions about the Live Well San Diego Youth Sector.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201123.13.30.47"}