{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "One Additional COVID-19 Death Reported; San Diegans Encouraged to Take Stay Home Pledge", "description": "A new COVID-19 death was reported in San Diego, bringing the region’s total to 18, the County Health and Human Services Agency announced today. The latest death was of a man in his 70s.", "datePublished": "2020-04-04T17:55:36-07:00", "url": "https://www.countynewscenter.com/one-additional-covid-19-death-reported-san-diegans-encouraged-to-take-stay-home-pledge/", "keywords": ["health", "18 deaths", "coronavirus", "covid-19", "pledge"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-04-05T07:41:00-07:00", "articleType": "article", "articleContent": "\nA new COVID-19 death was reported in San Diego, bringing the region’s total to 18, the County Health and Human Services Agency announced today. The latest death was of a man in his 70s.\nCounty health officials continue to strongly encourage San Diegans to stay at home as much as possible and cover their nose and mouth when out in public conducting essential activities.\n“Thank you to all of the individuals, organizations, businesses, governments and other entities for all that you are doing to help,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Stay at home, unless you are an essential worker, stop the spread and save lives.”\nTake The Online Pledge\nThe County today launched a new campaign encouraging San Diegans to take an online pledge and commit to helping stop the spread of COVID-19. The Stay Home, Save Lives pledge asks San Diegans to stay home, use a face covering and physically distance when leaving the house for essential reasons, and pledge to help stop the spread of the virus.\nThose signing up for the pledge are encouraged to download one of the campaign’s graphics and share it on their social media accounts with the hashtag #stayhomesd.\nScams Amid Ongoing Crisis\nThe District Attorney’s office today warned San Diegans about emerging scams amid the ongoing COVID-19 crisis. The DA’s office has investigated more than 240 complaints of price gouging and has served cease and desist notices to two dozen businesses.\nDistrict Attorney Summer Stephan shared several tips to help San Diegans avoid scams:\n\nVerify the validity of a charity organization by visiting its official website before making a donation.\nDon’t click on links in emails you receive from organizations claiming to be charities. Scammers often use email for phishing scams.\nLegitimate government entities will not ask for your personal information over the phone or via email. If you are in doubt about a phone call or email you receive, call the official agency to verify.\n\nThe District Attorney’s office has compiled a list of additional resources on its website.\nCOVID-19 Cases Jump to 1,209\nThrough April 3, a total of 1,209 COVID-19 cases have been reported in San Diego County, including 97 new cases in the last day.\nOf San Diego County’s cases, 52.1% (630) were men and 47.1% (570) were women. The gender of nine people is unknown. Of the known cases, 228 (18.9%) have required hospitalization and 89 (7.4%) of the total number of cases had to be placed in intensive care. With the 18th death, 1.5% of the known cases have died.\nCounty officials also talked about other measures and resources to deal with COVID-19.\nTo date:\n\nNearly 17,000 San Diegans have been tested, including 1,025 tests reported April 3.\nThe County has distributed more than 1.5 million personal protective equipment items to local health care providers, including more than 663,000 N-95 respirators, more than 271,000 surgical face masks and nearly 616,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live. Of 1,585 rooms for County Public Health Services use, 153 are occupied by 159 guests. Of the 441 rooms assigned to the Regional Task Force on the Homeless, 183 are being occupied by 336 people who are at higher risk of developing complications from COVID-19.\n\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200404.17.55.36"}