{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Confirms Commitment to Emergency Preparedness", "description": "The Board of Supervisors received an update from County safety officials on the County’s commitment to emergency preparedness and response efforts. Since 2003, the County has invested nearly $1 billion to strengthen preparedness and disaster response capabilities.", "datePublished": "2025-01-30T15:18:53-08:00", "url": "https://www.countynewscenter.com/county-confirms-commitment-to-emergency-preparedness/", "keywords": ["public safety", "cal fire", "cal fire chief tony mecham", "county fire", "disaster preparedness", "ebony shelton", "emergency services director jeff toney", "genasys evac", "office of emergency services", "san diego county sheriff s office"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2025-01-30T15:18:53-08:00", "articleType": "article", "articleContent": "\nReading Time:  4 minutesThe Board of Supervisors received an update from County safety officials on the County’s commitment to emergency preparedness and response efforts.\nSince 2003, the County has invested nearly $1 billion to strengthen preparedness and disaster response capabilities. These investments include firefighters, fire equipment, helicopters, hazardous materials management and flood control enhancements, and upgrades to alert and warning systems.\n“Every season is wildfire season in San Diego,” said County Chief Administrative Officer Ebony Shelton. “County government has a critical responsibility to prepare for the next catastrophic incident and respond when the moment strikes to save lives.”\nOfficials emphasized the importance of multi-agency collaboration, working with cities, special districts, safety agencies, and community organizations to plan, set policies, and strengthen emergency resources.\nOffice of Emergency Services\nThe County’s Office of Emergency Services takes an “all-hazards approach” to emergency planning and preparedness that considers the range of disasters that may impact the region.\n“Our office is responsible for helping communities prepare for, respond to, and recover from disasters and other emergencies,” said Emergency Services Director Jeff Toney.\nWhen a major disaster occurs, the County Emergency Operations Center activates to coordinate response efforts, bringing together fire, law enforcement, public works, and health agencies. Partner organizations like 2-1-1 San Diego, the Red Cross, school districts, and utility companies also provide support.\nDuring an emergency, providing the community with timely and accurate information is critical, especially during an evacuation. Emergency Services and the Unified Disaster Council, which includes the County and all 18 incorporated cities, have invested in multiple technologies to bolster the region’s preparedness and response capabilities.\nIn 2024, the County implemented the Genasys Protect evacuation management system to allow first responders to manage evacuation zones more effectively. So far in 2025, the technology has played a key role in safely evacuating residents from wildfires in the County and the City of San Diego.\nSan Diego County Fire/Cal Fire\nFollowing the 2003 fires, San Diego County recognized the need for a coordinated approach to wildfire protection, leading to the County’s partnership with Cal Fire in 2005 and the formation of San Diego County Fire in 2008. This partnership has significantly enhanced fire protection capabilities.\n“With 20 agencies consolidating into one and massive investments by the County, we have transformed a vision into one of the largest fire protection agencies in the state,” said County Fire/CAL FIRE San Diego Chief Tony Mecham.\nCounty Fire now operates 39 fire stations, five fire camps, and two aviation facilities, supported by over 1,100 personnel, including firefighters, emergency medical services, and community risk reduction staff. With over 100 operational vehicles, including 12 aerial firefighting resources, the County is equipped to respond rapidly to wildfires.\nInvestments in technology, such as over 150 real-time monitoring cameras, allow for efficient wildfire detection and response, especially during significant events like the Lilac and Border 2 Fires.\nAdditionally, the County’s community risk reduction program equips residents with tools to reduce wildfire risks, including vegetation management, creating defensible space, home hardening, and clearing key evacuation roads.\nThe County also ensures rapid air response through a shared helicopter fleet with the Sheriff’s Office, which has received substantial investments to enhance safety and firefighting efforts.\nSheriff’s Emergency Services Division\nThe Sheriff’s Emergency Services Division includes several units that play critical roles in disaster response: the Special Enforcement Detail, Crisis Negotiation Team, Canine Unit, Bomb Arson Unit, and ASTREA (Aerial Support to Regional Agencies). The Emergency Planning Detail (EPD) leads law enforcement’s response to wildfires and disasters and represents the Sheriff’s Office on the County’s evacuation committee.\nIn recent years, EPD has helped implement the Hi-Lo siren system, which warns communities when they need to evacuate due to immediate danger, and oversaw the switch from the grid evacuation maps to the Genasys Protect software, which has helped improve evacuation and repopulation processes.\nDuring a fire, the Sheriff’s Office plays a key role in supporting fire and emergency services partners by ensuring the evacuations of impacted areas, protecting right of ways during an evacuation and keeping properties safe from looters.\n“If you receive an evacuation order, there is an immediate threat to your life and you need to leave right now,” said Captain Ted Greenawald. “If you receive an evacuation warning, it means there is an impending danger to your life or property, and you should start packing what you need for your family and pets.”\nDeputies are trained and equipped with fire gear, participating in joint exercises with fire agencies. The decision to evacuate is made by Sheriff’s incident command based on the severity of the threat and the number of people affected.\nASTREA, the Sheriff’s aviation unit, responds to fire emergencies with aerial support, performing water drops and rescues. In 2024, ASTREA conducted over 6,400 missions, including 301 fire responses and 287 rescues. The fleet consists of eight helicopters, 13 pilots, and other support staff.\nCountywide Disaster Support\nDuring an emergency, several other County departments provide critical support including:\n\nAnimal Services: Teaches pet preparedness; performs animal evacuations; provides emergency shelter for small and large animals\nHealth and Human Services Agency: Provides behavioral health support, public health and medical resources; help register for safety net programs\nEnvironmental Health and Quality: Identifies hazardous materials and incident response; inspects emergency shelters\nPublic Works: Inspects channels, culverts and drains; clears roads of downed trees, mud and snow; conducts flood and erosion control measures\n\nCounty employees also provide support during an emergency through the Ready Disaster Service Worker Program. Employees are assigned to teams and trained to perform  roles such as a 2-1-1 phone operator, emergency operations center support, local assistance center worker or emergency shelter worker.\nHow You Can Prepare\nTo stay prepared for a disaster, County residents are encouraged to do the following:\n\nCreate your own Personal Disaster Plan\nRegister your phone for emergency alerts\nDownload the Genasys Protect App\nMake an evacuation go-kit and a shelter-in-place go-kit\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250130.15.18.53"}