{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supervisors Hear Financial Outlook for Upcoming Budget", "description": "County financial experts provided an update on the County’s financial outlook at Tuesday’s Board of Supervisors meeting and set the stage for the upcoming budget that goes into effect on July 1. ", "datePublished": "2025-03-12T14:10:28-07:00", "url": "https://www.countynewscenter.com/county-supervisors-hear-financial-outlook-for-upcoming-budget/", "keywords": ["government", "2025-26 budget", "board of supervisors meeting", "cao", "county budget", "ebony shelton", "fgg", "financial outlook", "operational plan"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-03-12T14:27:12-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesCounty financial experts provided an update on the County’s financial outlook at Tuesday’s Board of Supervisors meeting and set the stage for the upcoming budget that goes into effect on July 1. \nThe presentation gave insight into the challenges to balancing the coming fiscal year’s budget and strategies to manage them to ensure the community is supported. The Chief Administrative Officer (CAO)’s recommended budget is released to the public on May 1. \n“To release a balanced budget, we’ll have to make tough decisions now – choices that will result in changes to our level of services and cuts to existing contracts,” said CAO Ebony Shelton. “But we do not see this as just about balancing numbers – it’s about making tough choices today to ensure that the County can continue to invest in the future for our communities.” \nA December snapshot of the budget projected a $138.5 million ongoing funding gap for the 2025-26 fiscal year due in part to slowing sales tax revenue. The gap reflects escalating costs for existing programs as well as new funding requests.  \nTo address the gap, County staff members are acting now to reduce costs, find efficiencies and streamline programs and services. Funding for services that are mandated will be prioritized, while also continuing to respond to the region’s needs. The County is beginning to prepare for these impacts this fiscal year.  \nStaff is also working with the Board of Supervisors and the public to gather their input during the budget process.   \nWhat the County Does \nThe County funds many programs and services in the region, which has a large unincorporated area in addition to 18 incorporated cities and 18 federally recognized tribes. \n\nIn the unincorporated area, County government is responsible for the day-to-day things a city government would do—like law enforcement, roads, building permits, animal shelters and protection, along with parks and libraries. Some cities also contract with the County to provide these types of services. \nCounty government also works to deliver many services that support the entire region. These include emergency preparedness; criminal prosecution and detention facilities; delivery of federal and state social service assistance within the region like access to food and financial support for vulnerable people; health programs including behavioral health services; food and restaurant inspections; elections and beach water monitoring. \nWhere the Money Comes From\nFunds from other government agencies make up about half the County’s budget and must be used as directed. The other half comes mostly from property taxes, fees for services and other sources. Some of these funds must be used in specific ways. The funds that remain are known as general purpose revenue, and that’s the portion the County can decide how to invest.  \nWhile general purpose revenue is increasing, so is the cost of doing business, and there are new requests for funding to support programs and other departmental operations.  \nThe CAO wrapped up the presentation by commending staff for addressing community needs while implementing innovative solutions for the future.    \nPublic Input is Critical\nCounty residents are encouraged to take part in the budget planning process.  Visit Engage San Diego County to take a survey and to use a new tool to rank County budget priorities in order of importance to you. \nThe survey also asks how you’d like to stay informed about the budget process, by email, text or some other form of communication. The survey will be open through March 28. \nThe information from the survey will be considered along with community feedback gathered throughout the year as the County’s recommended budget is developed. \nAfter the release of the recommended budget on May 1, people can share their thoughts online by submitting comments through June 12 on Engage San Diego County. \nYou can also share in-person at upcoming open houses, a virtual meeting, or by attending or calling into the Board of Supervisors public budget hearings on June 3 and June 9. The Board’s budget deliberations and adoption take place on June 24. \nVisit the Clerk of the Board’s website or call 619-531-5434 for information on Board of Supervisors meetings and to request translation services. \nVisit the County’s budget website for additional details. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250312.14.10.28"}