{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Increasing COVID-19 Cases Reported; Public Urged to Avoid Large New Year’s Celebrations", "description": "As we approach the new year, San Diego County has continued to see a rise in cases. A total of 5,976 COVID-19 cases was reported Dec. 29, the County Health and Human Services Agency announced today.", "datePublished": "2021-12-30T16:01:07-08:00", "url": "https://www.countynewscenter.com/increasing-covid-19-cases-reported-public-urged-to-avoid-large-new-years-celebrations/", "keywords": ["health", "coronavirus", "covid-19", "new years", "record cases", "vaccination"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-30T16:09:58-08:00", "articleType": "article", "articleContent": "\nAs we approach the new year, San Diego County has continued to see a rise in cases. A total of 5,976 COVID-19 cases was reported Dec. 29, the County Health and Human Services Agency announced today.\nThat’s why County health officials are urging San Diegans to keep New Year’s celebrations small and limit them to family and close friends who are vaccinated and boosted if eligible to prevent the surge of COVID-19 cases that occurred last winter. The County is also asking the public and businesses to continue following the current state and local guidance to slow the spread.\n“We get it. People are tired of the pandemic, but given the record number of cases, the brisk emergence of Omicron and the increased risks that come with gatherings, San Diegans must continue to make decisions to protect themselves and others,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “If you have New Year’s celebrations, limit them to people who live with you and make sure everyone present uses the strategies we know work.”\nKaiser says if people gather with others outside their household, they should:\n\nWear the right kind of mask and wear it correctly\nLimit indoor activities, especially if not everyone’s vaccination status is known\nIf you have symptoms, stay home, get tested –whether you’ve been vaccinated or not– and isolate until you get a negative result and you’re feeling better\nIf you test positive, stay home, isolate in accordance with CDC guidance and seek treatment if necessary\nGet CA Notifyto receive alerts if you were in close contact with someone who tests positive for COVID-19.\n\n“We all have the power to reduce the spread of COVID-19. Let’s use it,” Kaiser said.\nTesting remains an important tool to slow the spread of COVID-19 and the County has an extensive network of no-cost testing public sites that are both walk-up and can take appointments.\nThe County recommends that people worried about COVID-19 infection and others seeking COVID-19 testing only go to a hospital to be tested if they have severe symptoms. This preserves hospital resources for patients who are critically ill. The County is closely monitoring hospitalization rates during these recent large case increases.\nThose with mild COVID-19 symptoms should contact their health care provider via phone or telehealth for guidance. Rapid antigen tests, which are available at many local pharmacies, are a good option if a testing site is unavailable.\nIn addition to the County testing sites, many neighborhood pharmacies offer same-day testing. Here’s a list of other locations where people can get COVID-19 tests. The overall testing system has the capacity to meet demand. However, testing traffic can surge and sites can be very busy.\nAlso, the region now has plenty of COVID-19 vaccines and booster doses, which remain the best long-term protection against COVID-19 hospitalizations and deaths.\nThere are more than 400 vaccination sites that include pharmacies, medical providers, clinics and County locations; the region has the capacity to meet demand. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211230.16.01.07"}