{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is Last Day to Vote in District One Special Primary Election", "description": "Tuesday, April 8, is the final day to cast your ballot in the special primary election for the County of San Diego’s First Supervisorial District. Monday, April 7 will be the last chance to vote early. Eligible voters can cast their ballots from 8 a.m. to 5 p.m.", "datePublished": "2025-04-07T09:00:36-07:00", "url": "https://www.countynewscenter.com/tuesday-is-last-day-to-vote-in-district-one-special-primary-election/", "keywords": ["elections", "2025 special primary election", "district 1", "district 1 special election", "fgg", "registrar of voters", "supervisorial district 1", "tuesday last day to vote"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-04-05T11:56:42-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesTuesday, April 8, is the final day to cast your ballot in the special primary election for the County of San Diego’s First Supervisorial District.\nMonday, April 7 will be the last chance to vote early. Eligible voters can cast their ballots from 8 a.m. to 5 p.m. at any one of seven vote centers or 29 official ballot drop boxes around the district.\nOn the final day of voting, April 8, the Registrar’s office and an additional six vote centers will be open for a total of 13 vote centers in the district. All will be open from 7 a.m. to 8 p.m.\nAny voter who is in line at a vote center or an official ballot drop box at 8 p.m. will be allowed to vote. However, no one can join the line after the 8 p.m. deadline.\nThe person elected will fill the district’s vacant seat for the remainder of the current term that ends in January 2029. If no candidate receives a majority vote at the April 8 election, the top two vote-getters will move on to the special general election on July 1. Only those who live in the district can vote in the election.\n\nDistrict 1 runs from the Pacific Ocean to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The district includes the cities of Chula Vista, Imperial Beach, National City, and some communities within the City of San Diego, including Barrio Logan, East Village, Golden Hill and more. It also includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside and La Presa.\nIf you’re not sure if you live in District 1, you can look it up at sdvote.com.\nIf you live in District 1, and you’re not currently registered to vote, you may visit any vote center or the Registrar’s office to conditionally register and vote provisionally through April 8.\nVote centers have replaced polling places and provide more services. You can:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selection on ballot marking devices. When finished, the voter will print out the official ballot, review it, place it in a secrecy sleeve, and hand it to a poll worker to insert it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate on the ballot. Additionally, an individual may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com.\nLearn more about voting in the District 1 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250407.09.00.36"}