{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Promotes New Assistant Chief", "description": "San Diego County Probation promoted a 23-year Probation veteran to the second highest ranking position.", "datePublished": "2025-02-13T15:33:04-08:00", "url": "https://www.countynewscenter.com/probation-promotes-new-assistant-chief/", "keywords": ["public safety", "county probation", "san diego county probation department"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-02-13T16:27:08-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSan Diego County Probation promoted a 23-year Probation veteran to the second highest ranking position.\nProbation Chief Tamika Nelson promoted Tabatha Wilburn to assistant chief. Wilburn most recently served as a deputy chief and will take on the position after the retirement of Denise Huffhines.\n“Tabatha Wilburn has been an inspirational, compassionate, and knowledgeable officer for the department for over 23 years,” Nelson said. “Her expertise in working around justice—both juvenile and adult—has been critical to help us move our approaches to our clients forward in our County. She will help us work to accomplish our vision of enhancing the safety of our communities through restoration and rehabilitation.”\nIn her most recent position, Wilburn’s duties were managing operations in Youth Development Community Support Services, including 150 staff and an operating budget. Additionally, she was responsible for financial planning related to Juvenile Justice Realignment and has served as a lead in several projects including Ending Girls Incarceration, Department of Juvenile Justice Realignment and the Indian Child Welfare Act MOU with the Tribal Council. Wilburn was also instrumental as a major contributor in the transition of the state closure of the Department of Juvenile Justice.\nWilburn earned her Bachelor of Science degree in Criminal Justice and a master’s in public administration with a specialization in leadership. In addition to her many roles with County Probation, Wilburn previously served in the United States Marine Corps and as a police officer in the state of Georgia.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250213.15.33.04"}