{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Hits Community Outbreaks Trigger as Masks Become Mandatory Across California", "description": "Two more COVID-19 community outbreaks were identified in the region June 17, bringing the region’s seven-day total to eight, the County Health and Human Services Agency announced today.", "datePublished": "2020-06-18T17:05:00-07:00", "url": "https://www.countynewscenter.com/county-hits-community-outbreaks-trigger-as-masks-become-mandatory-across-california/", "keywords": ["health", "coronavirus", "covid-19 face coverings"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-22T17:32:45-07:00", "articleType": "article", "articleContent": "\nTwo more COVID-19 community outbreaks were identified in the region June 17, bringing the region’s seven-day total to eight, the County Health and Human Services Agency announced today.\nThe eight outbreaks, which are not linked, surpass the County’s threshold of no more than seven outbreaks over a seven-day period.\nBecause of that, the County is pausing on the reopening of additional sectors of the economy until it is safe to do it. However, businesses that were scheduled to reopen June 19 can proceed.\nAlso, the County will be stepping up enforcement on entities that are not following the public health guidance, just like it did with the closure of a restaurant in Pacific Beach.\nCounty health officials are also urging San Diegans to adhere to the local public health guidance, or the County will be forced to take more drastic measures.\n“We can’t be doing everything like we did before COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We need your help to prevent community outbreaks and to stop the spread of COVID-19.”\nCommunity outbreaks is one of 13 triggers the County is closely monitoring to determine whether to stop or dial back the reopening of the local economy.\nCurrently, there are 15 active community outbreaks in San Diego County. An outbreak in a community setting is defined as three or more COVID-19 cases in a setting and in people of different households.\nThe eight outbreaks occurred at three businesses, three restaurants, a private home, a campground and a social club. The County is contacting anyone at those locations identified as close contacts of positive cases.\nThe County is urging San Diegans to continue taking precautions to prevent outbreaks and stop the spread of COVID-19.\nHere’s how you can help to prevent an outbreak and the spread of COVID-19.\n\nPractice good hand hygiene and sanitation\nKeep six feet apart\nWear a face covering\nAvoid crowded places\nStay home if you’re sick\n\n“People are assuming that things are back to normal and that is not the case,” Wooten said. “There should be no friends or family gatherings or dinner or cocktail parties.”\nFace Coverings Mandatory Statewide\nToday, the State issued new guidance that now requires all Californians to wear a face covering when in public and close to people outside their household. People must wear face coverings when they are in high-risk situations such as:\n\nInside of, or in line to enter, any indoor public space\nGetting services at a doctor’s office, hospital, pharmacy, dental office, veterinary clinic or blood bank\nWaiting for or riding on public transportation or while in a taxi, private car service, or ride-sharing vehicle\nInteracting with any member of the public and walking through hallways, stairways or parking facilities\n\nFace coverings are required in public and within six feet of someone who is not a household member.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\nOf 10,070 tests reported to the County June 17 and 2% were positive new cases. The total includes a batch of prior tests.\nThe 14-day rolling average percentage of positive tests, shown in the first attached chart, is 2.8%.\n\nCases:\n\n238 new cases in San Diego County residents for a total of 10,092.\n1,578 or 15.6% of cases have required hospitalization.\n437 or 4.3% of all cases and 27.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFour additional COVID-19 deaths were reported today for a countywide total of 331.\nThree men and one woman died between May 28 and June 15 and their ages ranged from mid-60s to late 90s.\nAll four had underlying health conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200618.17.05.00"}