{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Provide Multiple Services at Veterans Village of San Diego Stand Down ", "description": "An array of County of San Diego departments are on-site over the next three days at the Veterans Village of San Diego’s Stand Down 2023 to provide services. The event runs from Thursday, July 20, through Saturday, July 22, at the Pechanga (Sports) Arena. ", "datePublished": "2023-07-20T15:32:56-07:00", "url": "https://www.countynewscenter.com/county-to-provide-multiple-services-at-veterans-village-of-san-diego-stand-down/", "keywords": ["veterans", "stand down", "veterans"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-07-20T15:32:56-07:00", "articleType": "article", "articleContent": "\nAn array of County of San Diego departments are on-site over the next three days at the Veterans Village of San Diego’s Stand Down 2023 to provide services. The event runs from Thursday, July 20, through Saturday, July 22, at the Pechanga (Sports) Arena. \n“County staff are at Stand Down in full force to help veterans get healthier, safer, and on a path to thrive again,” Dr. Eric McDonald, interim director of the County Health and Human Services Agency said. “Participating in events like this is part of our commitment to reach functional zero for veteran homelessness. Every veteran we connect with gets us one step closer to the goal of our regional Leave No Veteran Homeless initiative.”    \nFunctional zero is a term to describe veteran homelessness as rare, brief, and non-reoccurring. At functional zero every veteran has the opportunity and support to gain permanent housing.  \nFollowing is a listing of participating departments and agencies. \nThe County’s Office of Military and Veterans Affairs will provide: \n\nU.S. Department of Veterans Affairs compensation assistance \nDepartment of Motor Vehicle (DMV) driver’s licenses \nDMV disability license plates \n\nThe County Public Defender’s office will provide: \n\nMore than 60 attorney and staff volunteers \nHomeless Court program to clear barriers to exiting homelessness. \nFresh Start Program to get help to reduce old charges \n\nThe County’s Department of Child Support Services will provide: \n\nChild support services \nDriver’s license releases and modification requests \nGeneral case status \nDebt relief options \nCriminal record clearance \nFine and fee clearance \nChild support legal assistance \n\nThe County’s Housing and Community Development Services will provide: \n\nVeterans Affairs Supportive Housing (VASH) voucher support to connect veterans with housing \n\nThe County Registrar of Voters \n\nHelp veterans check on their voter registration \nHelp veterans register to vote \n\nThe County Assessor/Recorder/Clerk \n\nHelp with printing San Diego County birth certificates on site \nAssistance with birth certificates from other counties \n\nThe County’s Public Health Services will provide: \n\nHepatitis A vaccines \nCOVID-19 vaccines \nMpox vaccines\n\nThe County’s Self Sufficiency Services will provide: \n\nCal-Fresh and Cash benefits support \nIncluding Electronic Benefit Transfer (EBT) cards replacement Help enrolling or renewing Medi-Cal health coverage \nCase support \n\nThe San Diego Sheriff’s Department’s Homeless Assistance Resource Team (HART) will provide: \n\nEducation for veterans on resources like food, housing, job programs, substance abuse counseling and mental health services.  \nTransportation to the event for veterans who need assistance to get to the arena \n\nThe County’s Aging and Independence Services will provide: \n\nAging resources \nCool Zone locations and resources \nSenior dining sites  \n\nThe County’s Homeless Solutions and Equitable Communities will be on-hand to: \n\nConnect veterans with housing and community resources, social services programs, and case management services.  \n\nThe Live Well on Wheels mobile office will be parked at the event, supporting County services being provided. Also in attendance are members of the County’s General Services department team who are providing technical support.  \nMore information about Veterans Village of San Diego Stand Down 2023 is available here. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230720.15.32.56"}