{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccine Boosters Available for San Diegans", "description": "COVID-19 vaccination boosters are now recommended and available for everyone who qualifies.", "datePublished": "2021-10-26T09:57:08-07:00", "url": "https://www.countynewscenter.com/covid-19-vaccine-boosters-available-for-san-diegans/", "keywords": ["health", "all three vaccines", "boosters", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-26T11:22:12-07:00", "articleType": "article", "articleContent": "\nCOVID-19 vaccination boosters are now recommended and available for everyone who qualifies.\nLast week, the Centers for Disease Control and Prevention approved booster shots for all three COVID-19 vaccines currently available. However, the time frame for when people should get a booster depends on which vaccine you received.\nFor people who were vaccinated with two doses of Pfizer or Moderna COVID-19 vaccine, the CDC indicates the following groups are eligible for a booster shot at 6 months or more after their initial series:\n\n65 years and older\nAge 18+ who live in long-term care settings\nAge 18+ who have underlying medical conditions\nAge 18+ who work or live in high-risk settings\n\nFor San Diegans who got the Johnson & Johnson COVID-19 vaccine, booster shots are also recommended for people 18 and older and who were vaccinated at least two months ago.\nWhile all three available COVID-19 vaccines have now been approved as boosters, people should stick to the vaccine they originally received. However, they may choose a different one if necessary.\n“People should go with their past vaccine, when possible,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “They all continue to be very effective at preventing severe illness, hospitalization and death, even against the Delta variant which is widely circulating.”\nVaccine supplies remain plentiful, both for those seeking initial doses and boosters for those who meet the criteria. People can get a booster through their medical provider, a retail pharmacy or a site operated by the County. Additional booster eligibility details are at coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211026.09.57.08"}