{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on East County Crisis Stabilization Unit", "description": "The County of San Diego and partner agencies broke ground on the region’s seventh Crisis Stabilization Unit Thursday. The “CSUs” are designed to give many people who are in the midst of a behavioral health crisis a calm and better place to become stable and recover than emergency rooms, hospitals or jails.", "datePublished": "2024-07-18T15:29:22-07:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-east-county-crisis-stabilization-unit/", "keywords": ["health", "behavioral health", "crisis stabilization unit", "csu", "el cajon", "equity", "hhsa"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-07-19T12:18:00-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County of San Diego and partner agencies broke ground on the region’s seventh Crisis Stabilization Unit Thursday.\nThe “CSUs” are designed to give many people who are in the midst of a behavioral health crisis a calm and better place to become stable and recover than emergency rooms, hospitals or jails.\nThe new 14,000 square foot building is being built on County-owned property in El Cajon. It is expected to open in the fall of 2025 and be first in East County. It will also mark a behavioral health milestone. For the first time, there will be crisis units in all six of the County Health and Human Agency’s (HHSA) regions.\n“This is an incredible day for East County,” said County Supervisor Joel Anderson, who represents the unincorporated El Cajon area, at Thursday’s event. “One of the focuses I had was on mental health and homelessness. And this is a big step in the right direction, meeting the needs of East County. When I read the stats and saw what these Crisis Stabilization Units can do and mean for a community, I knew that we needed one in East County.”\nCaroline Smith, HHSA’s interim deputy chief administrative officer, said the crisis units don’t just help the people who are experiencing a crisis. They also take a burden off hospital emergency rooms, where law enforcement would take many for treatment.\n“The County has experienced this effect,” Smith said, “at its psychiatric hospital, when it comes to law enforcement transfers. For example, what we’ve seen in North County where we’ve opened three CSUs is that transfers by law enforcement officers to the psych hospital are down nearly 40% since 2022. We hope to see similar results here in East County.”\nArtist’s rendering of East County Crisis Stabilization Unit.\nThe Crisis Stabilization Units are open 24 hours a day, seven days a week. They give people suffering a mental health crisis a place to get around-the-clock help for up to 24 hours. They are outfitted with recliner chairs for patients and provide intervention, assessments, help with medications, therapy, and peer support. They also connect people with other services.\nLuke Bergmann PhD., the director of the County’s behavioral health services, said the crisis units are links to ongoing care for patients and as such, are important parts of the County’s overall behavioral health “continuum of care.” That plan calls for expanding services, including adding more long-term care and inpatient psychiatric beds to help people.\n“This is one of the things that is most exciting to me about CSUs,” Bergmann said, “because they are devoted to engaging people and connecting them, after stabilization, to continued care. They represent the first step to journeys to recovery and well-being that will, over time, make San Diego County a healthier county for all of us.”\nThe East crisis unit project has a roughly $29 million budget. It will be environmentally sound, built to the U.S. Green Building Council’s LEED certifications. It will also have rooftop solar panels that will give the facility a “Zero Net Energy” footprint, meaning it will produce more energy than it uses.\nIn addition to Supervisor Anderson and County health and general services officials, Thursday’s groundbreaking event was attended by numerous other officials and agencies. They included the County District Attorney’s office; the El Cajon Police Department; Grossmont Hospital; the Grossmont Healthcare District; and Balfour Beatty Construction, the company that will build the facility.\nFor more information about behavioral health services, go to County Behavioral Health department’s webpage.  For more about the County’s Crisis Stabilization Units, visit the CSU webpage. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240718.15.29.22"}