{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Universities Could Support County Data Evaluations", "description": "County Supervisors voted this week to boost the work of the County’s Office of Evaluation, Performance and Analytics by allowing it to use future contracts with universities to support it with research and technical help.", "datePublished": "2024-04-10T13:17:31-07:00", "url": "https://www.countynewscenter.com/universities-could-support-county-data-evaluations/", "keywords": ["government", "homelessness and affordable housing", "housing for seniors", "oepa"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-04-10T13:20:02-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Supervisors voted this week to boost the work of the County’s Office of Evaluation, Performance and Analytics by allowing it to use future contracts with universities to support it with research and technical help.\nThe request to expand the office’s efforts came during the its update on its recent progress to the Board of Supervisors at its meeting Tuesday.\nThe County created the office in 2021 to use modern analytics to study the County’s vast collection of data in new ways; to look for patterns, trends and associations that can help leaders including the Board of Supervisors improve programs, services and policies.\nAt Tuesday’s meeting, County Chief Evaluation Officer Ricardo Basurto-Dávila, who leads the office, said his team has already supplied its expertise to the January storms, the County’s Wage Theft Dashboard and Housing Blueprint Survey.\nCounty Chief Data Officer Haruna Feldman, who is also part of the office, said it will use a modern technology system using artificial intelligence and the latest analytical tools to modernize how the County links its clients across services.\nBasurto-Dávila said the office plans to present evaluations and findings on numerous important projects over the next few years. He also said that the office has already trained County Land Use and Environment, and Health and Human Services employees in how to conduct good evaluation studies.\nIn July, Basurto-Dávila and the office presented the Board with its Strategic Research Plan. That plan named six County projects that the office is analyzing and identified 33 questions the office will use to guide its research and evaluation process over the next several years.\nSome of those projects included programs that:\n\nProvided one-time $4,000 payments to low-income families and $500 monthly subsidies to older adults to keep them from becoming homeless.\nAre giving $500 monthly subsidies to low-income families to reduce the need for foster services.\nWill try to match low-income seniors who need housing to landlords who have available rooms.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240410.13.17.31"}