{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Installs Free Menstrual Product Dispensers in Public Facilities", "description": "The County of San Diego has launched a pilot program to support greater access to free menstrual products, including tampons and pads.", "datePublished": "2021-05-28T11:02:20-07:00", "url": "https://www.countynewscenter.com/county-installs-free-menstrual-product-dispensers-in-public-facilities/", "keywords": ["health", "free4me", "menstrual equity", "period poverty"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-05-28T12:17:35-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego has launched a pilot program to support greater access to free menstrual products, including tampons and pads. The Free 4 Menstrual Equity, or Free4ME program, intends to address period poverty, a person’s inability to access or pay for menstrual products.\nAs part of the pilot program, the County recently partnered with Aunt Flow to install 57 free menstrual product dispensers in 23 County-owned facilities across the region. The facilities include libraries, Family Resource Centers and Community Centers.\n“As a longtime healthcare and reproductive justice advocate, I am proud the County of San Diego has not just heard this call but is the first known county government in the nation to take concrete action to support the menstrual equity movement,” said Board of Supervisors Vice Chair Nora Vargas. “Period poverty disproportionately impacts people experiencing homelessness, transgender people, youth and low-income individuals, and has only been exacerbated during the COVID-19 pandemic.”\nStudies show that nearly two-thirds of low-income people with periods in the U.S. have been unable to afford menstruation products during the previous year, and frequently must decide between purchasing food or other necessities and menstrual hygiene products.\nThe issue disproportionately affects school-aged individuals, with one recent study showing that one in five youths have missed school because they didn’t have access to menstrual products during their period.\n“It is important that people who menstruate have access to menstrual health products,” said Supervisor Terra Lawson-Remer. “They should be provided in our restrooms just as we provide toilet paper and paper towels.”\nFood stamps and WIC do not cover the purchase of menstrual products, forcing many individuals to ration sanitary products by using them for extended amounts of time, or using unsanitary items to manage their periods.\n“Menstrual equity is a public health issue because individuals who do not have access to menstrual products are at a greater risk for infections that can make them more susceptible to infertility,” said Kelly Motadel, M.D., M.P.H., County child health officer. “The fact that these issues primarily affect vulnerable communities, especially along income lines, should move and motivate progress towards achieving menstrual equity.”\nThe Free4ME initiative was sparked by local community leaders including Youth Will and Planned Parenthood. Both organizations provided critical input into the development and evaluation of the program.\nThe County’s vendor for the menstrual product dispensers, Aunt Flow, is a leader in the menstrual equity movement. The company stocks its dispensers with 100% organic cotton products, which contributes to the County’s commitment to sustainability.\nThe long-term goal of Free4ME is to install free menstrual product dispensers in all public-facing County facilities.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210528.11.02.20"}