{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Doctors Address COVID-19 Misinformation", "description": "An independent panel of local doctors participated in a virtual event Wednesday that addressed COVID-19 misinformation brought up by members of the public at the Feb. 8 County Board of Supervisors meeting.", "datePublished": "2022-02-09T17:04:11-08:00", "url": "https://www.countynewscenter.com/local-doctors-address-covid-19-misinformation-3/", "keywords": ["health", "coronavirus", "covid-19", "disinformation", "doctor panel"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-02-09T17:04:11-08:00", "articleType": "article", "articleContent": "\nAn independent panel of local doctors participated in a virtual event Wednesday that addressed COVID-19 misinformation brought up by members of the public at the Feb. 8 County Board of Supervisors meeting.\nThe virtual session was available to the public for live viewing and the two doctors who participated dispelled misleading claims about COVID-19.\nThe panel was moderated by Dr. Eric McDonald, County chief medical officer and included Dr. Jess Mandel and Dr. Mark Sawyer, both from UC San Diego Health.\nBoth panelists have worked on the front lines of the COVID-19 pandemic since the virus was first identified here in San Diego. Their discussion included the safety and efficacy of COVID-19 vaccines, unfounded claims that unvaccinated patients are treated differently in hospitals than vaccinated patients, concerns over long-term side effects of COVID-19 vaccines, the perceived ineffectiveness of wastewater monitoring, as well as other issues that came up at the Board of Supervisors meeting.\nCounty of San Diego Health and Human Services Agency staff regularly track COVID-19 misinformation shared during public comment at the Board of Supervisors meetings.\nIn August of last year, San Diego County became the first jurisdiction in the nation to declare health misinformation a public health crisis. Others have since followed.\nThe County has also launched a website to debunk common false claims about COVID-19 and educate people on where to find credible medical information sources.\nA video of today’s virtual event is available on the coronavirus-sd.com website.\nThe panel with Spanish interpretation is below.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220209.17.04.11"}