{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "The Real Huskies of Bonita May Have the Showdog of Your Dreams", "description": "County Animal Services shelters are feeling the wealth of dazzling huskies. So, San Diego County, season 2 of Real Huskies is back with this year’s cast of aspiring housedogs who have fabulous personalities, unlike some of those other shows’ casts.", "datePublished": "2023-03-22T12:42:05-07:00", "url": "https://www.countynewscenter.com/the-real-huskies-of-bonita-may-be-the-showdog-of-your-dreams/", "keywords": ["animals", "adopt pets", "das", "husky"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-03-22T12:45:06-07:00", "articleType": "article", "articleContent": "\nCounty Animal Services shelters are feeling the wealth of dazzling huskies. So, San Diego County, season 2 of Real Huskies is back with this year’s cast of aspiring housedogs who have fabulous personalities, unlike some of those other shows’ casts.\nThe hot gossip is that San Diego County Department of Animal Services has the most glamorous and dashing huskies in this part of Southern California – with the least drama, and they are ready to be adopted just like last year’s cast.\nHuskies are an active breed that are always up for fun and adventure. To avoid any outrageous behavior, they need daily exercise and activities. Without it, well, they might just find other ways to entertain themselves that could be considered scandalous. Huskies also need regular brushing to reduce shedding and keep their coats looking shiny and gorgeous.\nThey only look expensive but they’re actually very down-to-earth and, in a case where a dog has been at the shelter for more than 6 months, adoption fees are waived, even non huskies, at both the Bonita shelter and the Carlsbad shelter.\nMeet this season’s husky cast of characters all checked in at the Bonita shelter:\n\n\n\n\n\n \n\n\nAnd they also know how to mingle and get along, check out scenes at the end of article of an exclusive black-and-white party featuring the cast.\nIf you’re interested, in any of these huskies, walk-in hours are from 1 to 4 p.m. Tuesday through Friday and 10 a.m. to 4 p.m. Saturday and Sunday at the South Shelter, 5821 Sweetwater Road in Bonita.\nThere are also a bevy of beautiful huskies at the North Shelter, 2481 Palomar Airport Road in Carlsbad as well as other breeds and animals. check out some of the available pets on the Animal Services website.\nAll adoption fees include spaying or neutering, a microchip, updated vaccinations and a one-year dog license for those in the service area. The adoption fee for a dog normally costs $75. The fee for a cat is normally $65.\nFill out an application online to print or pick one up at the shelter. Applications can also be emailed but it is quicker to go in person.\nIf you cannot adopt, consider fostering animals or volunteering for the shelter. For more information, call (619) 767-2675 or visit the Animal Services main website.\n\n @sdanimalservices ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230322.12.42.05"}