{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "First Omicron Variant Case Identified in San Diego County", "description": "An Omicron COVID-19 case has been identified in San Diego, the County Health and Human Services Agency announced today.", "datePublished": "2021-12-09T13:50:41-08:00", "url": "https://www.countynewscenter.com/first-omicron-variant-case-identified-in-san-diego-county/", "keywords": ["health", "boosters", "coronavirus", "covid-19", "omicron variant", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-12-13T16:23:34-08:00", "articleType": "article", "articleContent": "\nAn Omicron COVID-19 case has been identified in San Diego, the County Health and Human Services Agency announced today.\nThe new variant was identified in a San Diego resident who had recently traveled abroad.\nThe specimen tested positive for COVID-19 Dec. 8. The San Diego Epidemiology and Research for COVID Health (SEARCH) Alliance conducted whole genome sequencing and identified the Omicron variant Thursday morning.\nThe patient, who had been vaccinated and received a booster, was not hospitalized and is under isolation.\nThe County is conducting its investigation to identify people who may have had close contact with the patient.\n“We expected that the Omicron variant would make its way to San Diego, and it has,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “We are continuing to monitor for the Omicron variant and will report any other cases to the public when they are identified.”\nThe County continues to work with the Centers for Disease Control and Prevention and the California Department of Public Health to review existing recommendations and determine if changes should be made in the region.\nDr. Wooten recommends the following measures to protect against all varieties of COVID-19, including the Omicron variant:\n\nGet vaccinated and get a booster if you qualify. The vaccine is available at health care providers, retail pharmacies and community clinics. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the My Turn website.\nWear a mask, especially in public indoor settings, regardless of vaccination status.\nGet tested if you have any symptoms, whether you’ve been vaccinated or not. You can make a free test appointment or find a walk-in test clinic at coronavirus-sd.com.\nGet CA Notify to receive alerts if you were in close contact with someone who tests positive for COVID-19.\nWash your hands frequently and stay home if you’re sick and distance yourself from others.\n\nMore information about COVID-19, testing and vaccinations can be found at coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211209.13.50.41"}