{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Dog Found Starving Now Ready for Adoption", "description": "When Flaco, a 2-year-old fawn colored pit bull mix, first came to the County Department of Animal Services, he was emaciated. But under veterinary care, he has gained 13 pounds and is now available for adoption.", "datePublished": "2020-01-06T14:44:56-08:00", "url": "https://www.countynewscenter.com/dog-found-starving-now-ready-for-adoption/", "keywords": ["animals", "das", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-01-06T14:55:04-08:00", "articleType": "article", "articleContent": "\nWhen Flaco, a 2-year-old fawn colored pit bull mix, first came to the County Department of Animal Services, he was emaciated. But under veterinary care, he has gained 13 pounds and is now available for adoption.\nHe was found running loose in Ramona in early December and was literally starving.\n“He was so severely neglected that he only weighed 33 pounds. So, our staff appropriately named him Flaco, which means skinny in Spanish,” said Dan DeSousa, director of the County Department of Animal Services.\nThis is how thin Flaco was when found in early December.\n“After receiving veterinary care, which included love and attention from the veterinary and animal care staff, Flaco is now at a healthy weight and is just looking for someone to love and feed him.”\nDespite everything he has gone through, he is very loving to people and seeks out affection from staff, DeSousa said.\n“We really think he should be an only dog. He deserves all the love and attention in the house,” DeSousa said.\nFlaco, who is neutered, is available at the Southern Region shelter, 5821 Sweetwater Road in Bonita starting at 10:30 a.m. Jan. 7 for a $75 adoption fee. His ID number is A1868841, his neck tag is S886 and his kennel number is S018. Be aware that the adoption process can take up to two hours. You can shorten that by prefilling out an adoption application at home.\nShelter staff recommend you bring your family so everyone can meet ahead of time. In some cases, people can play with a chosen pet for 15 to 30 minutes to make sure it is a good fit for the family.\nBe sure to take a look at all available animals, in case Flaco finds a home quickly, as there are many dogs and cats looking for love in the new year. If getting another dog or cat, shelter staff also recommend that you bring pets with you to meet any new potential addition and see how the animals interact.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200106.14.44.56"}