{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Symposium Addresses Dangers Faced by Youth, Diversion from Juvenile Court System", "description": "A recent Youth Symposium and Expo hosted by County Probation brought together youth, parents, teachers, people who work with youth and community partners at the Southeastern Live Well Center in San Diego.", "datePublished": "2024-07-19T16:12:30-07:00", "url": "https://www.countynewscenter.com/symposium-addresses-dangers-faced-by-youth-diversion-from-juvenile-court-system/", "keywords": ["families", "probation", "youth symposium"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-07-19T16:31:16-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesA recent Youth Symposium and Expo hosted by County Probation brought together youth, parents, teachers, people who work with youth and community partners at the Southeastern Live Well Center in San Diego.\nKey takeaways included be aware of dangers, don’t risk your future and support and resources are available if you are struggling through difficult times.\n“The work that we all do together is really informed by all of us working together to determine what works in our communities, what works to help our youth, what works to save our youth and keep our community safe,” Chief Probation Officer Tamika Nelson said addressing the room.\nNo one agency, department or organization can help youth on its own, she said.\nThe Drug Enforcement Administration and the District Attorney’s Office presented on the topic of drug smugglers and how youth are being deceived and recruited, the dangers of fentanyl, and internet safety.\nSome speaker highlights include:\nDon’t Be Deceived by Drug Smugglers \nDrug cartels employ recruiters who look like clean-cut kids to pretend to befriend other students and offer them money, sometimes $500, in exchange for driving drugs across the border, said DEA community outreach specialist Shastity Urias. Sometimes they will just post advertisements on social media like Snapchat saying “Drivers needed. Easy money,” she said.\nRecruiters tell the youth that it’s easy and they won’t get caught. And even if they do get caught, there won’t be any consequences because they are minors, Urias said. That simply is not true and those who are caught face detention or prison if they are already 18.\nBe Aware of Fentanyl’s Dangers \nJust 2 mg of fentanyl is considered a potentially lethal dose, and it is often mixed into all illicitly produced pills, said Kelly McKay, DEA public affairs specialist. There are no standards to prevent lethal dosing. McKay warned teens never to take any pills that are offered to them or are not dispensed by a legitimate pharmacy.\nUse Caution on the Internet\nDA prosecutor Cheryl Sueing-Jones talked to the group on the dangers of the internet and how predators pose as children in popular games trying to get them into chat rooms. Once they have the child in the room, they may try to get information for identity theft or expose them to sexual content and ask for explicit pictures in return. Through social media, she said children are exposed to cyberbullying and access to deadly drugs. It is important for parents to talk to their children about these issues and rehearse ways to respond to them before they occur, Sueing-Jones said.\nSeveral San Diego teenagers, who are part of the Community Wraparound program, attended to listen to the presentations and said the information resonated with them and was on point with what they experience as teens.\n“I found the information like really impactful because personally, I have little sisters so knowing they are on those social media games. It really hit me because I realize they really could be talking to anybody and we never know what their intentions are until it’s too late,” said one teen in the audience. “They have an attachment to that game, to that social media. I don’t think I could take it away from them, my parents can’t either, they’ve tried. I might just warn them, so they don’t friend anyone or talk to anyone that they don’t know in real life.”\nYouth Symposium attendees and Probation community partners posed for a photo with the DEA teddy bear.\nAfter the presentations, Nelson was joined by Lisa Weinreb, chief of the Juvenile Branch of the San Diego District Attorney’s Office; Tilisha T. Martin, assistant supervising judge of the Juvenile Court; and Frank Barone, supervising attorney of the Public Defender’s Juvenile Justice branch where each took questions.\nJudge Martin specifically reached out to the young people in attendance to tell them, “You can do what you put your mind to, but you have to have the drive and the willpower and not let anyone deter you. Because I can tell you it takes a lot of courage to not go along to get along, you have to be the odd — woman, man, boy, child, other, them, their, his, or her — out.\n“Okay so I’m just putting that out there for you because when people come into the courtroom that I sit in, I often hear, wow, I didn’t know there were judges that looked like me. And being the fifth African American woman appointed to the bench in San Diego County, I tell you it carries a lot of responsibility. But I know that the purpose of having that opportunity is to hopefully impart upon others that I come in contact with that you have the same ability to be successful just like me,” Judge Martin said. To reach out for more information on resources for youth, visit Probation’s Juveniles At-Risk for Offending page for offices and phone numbers for your area.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240719.16.12.30"}