{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Update: Shigella Outbreak in San Diego County — 11-12-2021", "description": "The County of San Diego has announced four new shigella cases associated with an ongoing outbreak, bringing the total to 35 confirmed and three probable cases among people experiencing homelessness.", "datePublished": "2021-11-12T15:27:20-08:00", "url": "https://www.countynewscenter.com/update-shigella-outbreak-in-san-diego-county-11-12-2021/", "keywords": ["health", "shigella", "shigella outbreak", "shigellosis"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-11-12T15:27:20-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego has announced four new shigella cases associated with an ongoing outbreak, bringing the total to 35 confirmed and three probable cases among people experiencing homelessness.\nThe continuing investigation shows onset of illness dates between Aug. 16 and Nov. 8, 2021, with the four new cases occurring between Oct. 28 and Nov. 8, 2021. The 38 cases in this outbreak represent 11% of the 333 total cases reported to date in San Diego County.\nThe cases are all among individuals experiencing homelessness, with the majority at multiple locations in central San Diego. No source of the outbreak has currently been identified.\nThe County is working closely with the City of San Diego to:\n\nPrevent any future potential exposure sites.\nPromote good hygienic precautions among homeless service providers and food providers.\nConnect ill individuals to treatment and housing.\n\nOther steps have included:\n\nRelocation of 32 currently deployed handwashing stations to areas frequented by homeless individuals.\nPlacement of 16 new handwashing stations, with the most recent station placed in the Sports Arena area. Evaluation of additional need is ongoing.\nIncreased cleaning of portable and permanent public bathrooms.\nEvaluated potential placements of new portable restrooms and have determined feasible sites in Downtown, Pacific Beach and Rolando Village.\nIncreased sidewalk sanitization from twice weekly to seven days per week for the time being. Frequency will be continually assessed.\nNotification by the County Department of Environmental Health and Quality about the outbreak – and precautions – to food facilities in the downtown, Mission Valley and Hillcrest areas, charitable feeding operators, the California Restaurant Association, Downtown San Diego Partnership, Regional Task Force on Homelessness and Gaslamp Quarter Association.\nPublic health nurses conducting outreach at shelters.\nHomeless Outreach Teams offering shelter resources and distributing weekly 1,000 hygiene kits with shigella information to persons experiencing homelessness.\nCreation of County Public Health shigella website with outbreak information.\n\nShigella is a contagious infection typically spread by contaminated surfaces, food or water, or person to person. Those at increased risk include young children (especially those in daycare), people who are experiencing homelessness, travelers to locations with poor sanitation and men who have sex with men. In 2020, a total of 240 shigellosis cases were reported in San Diego County residents while the 426 cases reported in 2019 was the highest since 1995.\nTypical symptoms of shigellosis include diarrhea (sometimes bloody), fever and stomach cramps. While most people will recover fully without antibiotic treatment, some individuals with poor immune systems can develop life-threatening disease and may need further treatment.  People with symptoms that resemble shigella should contact their medical care provider. The provider may order stool testing to help with the diagnosis.\nStrategies to avoid getting or spreading shigella include frequent hand washing and not preparing food while ill with diarrhea.\nMore information about shigella and precautions are available through the County, a California Health Alert Network notification and the Centers for Disease Control and Prevention.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211112.15.27.20"}