{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "A Second Federal Tijuana River Valley Health Survey Starts Today", "description": "People working and living near the polluted Tijuana River Valley and area beaches have an opportunity to share their experiences with a federal agency that monitors community health.", "datePublished": "2024-10-21T08:21:03-07:00", "url": "https://www.countynewscenter.com/a-second-federal-tijuana-river-valley-health-survey-starts-today/", "keywords": ["health", "ace", "assessment of chemical exposures", "cdc", "community survey", "sewage crisis", "survey", "tijuana river sewage"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-10-21T08:24:39-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesPeople working and living near the polluted Tijuana River Valley and area beaches have an opportunity to share their experiences with a federal agency that monitors community health.\nThe Centers for Disease Control and Prevention (CDC)/Agency for Toxic Substances and Disease Registry (ATSDR) are conducting an Assessment of Chemical Exposures (ACE) survey. This new survey follows the CDC’s Community Assessment for Public Health Emergency Response or CASPER household assessment that wrapped up Saturday.\nThe ACE survey begins today and goes through November 22. Survey administrators will collect demographic and health information from people who live in, work at, or frequent the south region and its beaches, from Imperial Beach to Coronado. The survey is similar to the CASPER survey in format but there are some notable differences.\nThe ACE will focus on individuals who work or live near the water. While the CASPER focused on households and families, both are key to identifying community needs and prioritizing solutions related to sewage pollution exposure in the area.\n“This community deserves better,” said Dr. Ankita Kadakia, County interim public health officer. “By bringing in this federal agency to help us conduct an ACE survey, individuals who live or work near the water have a chance to voice their concerns, their experiences, and the impacts to their physical and mental health.”\n\nThe County and ACE teams will walk the community and beach areas with information and QR codes linked to the survey. The teams will look for anyone who lived, worked or spent time in the areas around the Tijuana River Valley, or along the beaches, in the past 30 days for activities like surfing, shopping, walking, and fishing. People can take the ACE survey on a computer or a mobile device.\nThe survey is confidential. Questions will cover the time and location of exposure, physical and mental health impacts, health services used, and medical history. Pet health is also included in the survey.\nResults of the survey will be used to better understand the health impacts on the community, and determine the measures needed to ensure the health of all residents.\nATSDR is a federal public health agency of the U.S. Department of Health and Human Services. Its mission includes protecting communities from harmful health effects related to exposure to natural and man-made hazardous substances. ATSDR responds to environmental health emergencies, investigates emerging environmental health threats, conducts research on the health impacts of hazardous waste sites, and provides actionable guidance to state and local health partners.\nPast ATSDR responses include the 2023 East Palestine Train Derailment in Ohio and the water concerns in Flint Michigan in 2015.\nMore information about the ACE can be found on the County’s South Region Health Concerns website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241021.08.21.03"}