{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Awarded State Grants to Fund New Behavioral Health Facilities", "description": "The County’s Behavioral Health Services (BHS) has been awarded $29.1 million in state funding that will be used to create new mental health and substance use treatment services in the region.  ", "datePublished": "2025-05-21T08:21:12-07:00", "url": "https://www.countynewscenter.com/county-awarded-state-grants-to-fund-new-behavioral-health-facilities/", "keywords": ["health", "behavioral health", "funding", "mental health", "substance use", "treatment services"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-21T08:21:12-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Behavioral Health Services (BHS) has been awarded $29.1 million in state funding that will be used to create new mental health and substance use treatment services in the region.  \nThe California Department of Health Care Services announced the local awards last week. The funds come from a bond voters approved in March 2024 to expand behavioral health treatment, residential care settings and housing to support people with mental health conditions and substance use disorders. \nBefore submitting two funding applications last year, County BHS gathered community input to identify critical needs, looked at local data and conducted stakeholder outreach.  The Board of Supervisors approved the request to submit two funding applications in July 2024. Both applications have been approved for funding.\nThe larger award, $21.1 million, will be used to create the new Substance Use Residential & Treatment Services (SURTS) facility. It will include up to 73 new substance use residential treatment beds and 16 recuperative care beds for people who are eligible for Medi-Cal.  \nThe facility is located on County-owned property in National City and renovations are expected to be completed by late 2026.  \nThe second award, which totals $7.9 million, will help fund a new Children’s Crisis Residential Care facility within the County’s Polinsky Children’s Center in Kearny Mesa. The project will create 16 new children’s crisis residential beds, which will be the first of their kind locally. Crisis residential care can be an alternative to hospitalization for children and youth with serious emotional health needs.  \nConstruction is anticipated to be completed in 2027.  \n“This major investment will fill critical care gaps in our system and support the recovery and wellbeing of some of our most vulnerable clients,” said Nadia Privara, Acting Behavioral Health Services Director. “The Substance Use and Residential Treatment Services facility provides new options for adult clients needing residential treatment and the Children’s Crisis Residential facility will create a much-needed resource for youth in our behavioral health system. I want to acknowledge the County’s Department of General Services and Child and Family Well-Being for their partnership in making these projects a reality.” \nFive other behavioral health providers within San Diego County were also awarded Behavioral Health Continuum Infrastructure Program (BHCIP) grant funds, which will be bring more needed services to the area.  \nThe other awardees include: \n\nPalomar Health Foundation, $49.9 million for an acute psychiatric hospital in Escondido. \n\n\nInnerTribal Treatment, $19.9 million for an adult residential SUD treatment facility in Pauma Valley. \n\n\nMcAlister Institute for Treatment & Education, $34.5 million for an adult residential SUD treatment facility in San Diego. \n\n\nCasa de Amparo, $19.9 million for a psychiatric residential treatment facility in San Marcos. \n\n\nEpidaurus (Amity Vista Ranch), $31.5 million, for an adult residential SUD treatment facility in Vista. \n\nThanks to the BHCIP funding, these seven grants are anticipated to add approximately 375 treatment beds and 1,538 treatment slots in the region.  \nIf you or a loved one is in need of mental or behavioral health support, learn how you can get help. Call 9-8-8 or 1-888-724-7240 to speak to a trained specialist.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250521.08.21.12"}