{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Testing Sites Using Easier, Faster Process", "description": "To make it easier and faster for San Diegans to get tested for COVID-19, County-run testing sites have turned to self-swabbing – with expert instruction.", "datePublished": "2021-10-07T15:04:37-07:00", "url": "https://www.countynewscenter.com/covid-19-testing-sites-using-easier-faster-process/", "keywords": ["health", "coronavirus", "covid-19", "self-swabbing", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-07T15:10:05-07:00", "articleType": "article", "articleContent": "\nTo make it easier and faster for San Diegans to get tested for COVID-19, County-run testing sites have turned to self-swabbing – with expert instruction.\nSince early September, patients at County COVID-19 testing sites have been performing the nasal swab themselves after they get instructions from a non-clinician.\n“This helps makes the process more efficient for everyone,” said Denise Foster, R.N., the County’s chief nursing officer and COVID-19 clinical director. “People really like it. It gives them a sense of control.”\nSelf-swabbing also allows for improved social distancing between patients and County workers, Foster said. When properly done, it does not affect accuracy.\nStill, if people are not comfortable swabbing their own nose, County testing sites have clinicians who are ready to step in and conduct the test.\nA pilot effort in September at the Border View testing location worked well and proved popular with most customers. The County then started rolling it out to all its locations —including sites for County employees— since they were very well received.\n“A very high percentage of people prefer it,” Foster said. “They feel less anxious.”\nResults from a COVID-19 test at a County site are typically available within 24 to 48 hours.\nIf you are experiencing symptoms of COVID-19, you are encouraged to contact your health care provider to get tested for the virus. No-cost testing is also available at several County locations across the region. You can find testing sites by day or by location.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211007.15.04.37"}