{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Extends Rent and Utility Assistance Application Period", "description": "The County of San Diego’s Emergency Rent and Utilities Assistance Program (ERAP) application period has been extended through March 31, 2021.", "datePublished": "2021-03-16T11:06:28-07:00", "url": "https://www.countynewscenter.com/county-extends-rent-and-utility-assistance-application-period/", "keywords": ["families", "coronavirus", "covid rental assistance", "covid-19", "erap"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-03-16T11:06:28-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Emergency Rent and Utilities Assistance Program (ERAP) application period has been extended through March 31, 2021. The program prevents evictions and housing instability for low-income renters who have faced financial hardships due to the ongoing COVID-19 pandemic.\nThe County’s ERAP serves renters countywide except those residing in the cities of San Diego and Chula Vista. The program is open to renters who have experienced financial hardship directly or indirectly related to COVID-19, or have qualified for unemployment during the pandemic.\nHouseholds must earn no more than 80% area median income to qualify (e.g. a single-person household can earn up to $64,700 and a four-person household can earn up to $92,400). In addition, qualifying applicants must be at risk of losing their housing or otherwise facing housing instability. Housing instability could include being behind on rent and/or utilities.\nTo apply to the County’s ERAP visit www.SDHCD.org. The application is available in several languages. Applicants who do not have internet access or need additional language support can call (858) 694-4801.\nResidents and landlords in the cities of Chula Vista and San Diego can visit www.ERAPsandiego.org to find out more information about emergency rent and utility assistance in those cities.\nThe County’s ERAP is supported by funds awarded to the County by the U.S. Department of the Treasury.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210316.11.06.28"}