{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Officials Remind Public to Remain Vigilant", "description": "The County reinforced Gov. Gavin Newsom's executive order to shelter at home and provided new details about its response efforts at a news conference today.", "datePublished": "2020-03-21T19:30:37-07:00", "url": "https://www.countynewscenter.com/county-officials-reminds-public-to-remain-vigilant/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2020-03-25T16:49:59-07:00", "articleType": "article", "articleContent": "\nThe County reinforced Gov. Gavin Newsom’s executive order to shelter at home and provided new details about its response efforts at a news conference today.\nCounty Office of Emergency Services Director Jeff Toney said the majority of the county’s 18 cities have proclaimed local emergencies.\n“This is an all-time record for any emergency within the County,” said Toney. “This shows you that COVID-19 is affecting everyone.”\nToney said the County is leaning forward to build capacity and capability, as well as support our medical professionals, focusing on a community approach to keep San Diego residents safe and healthy. He also thanked the agencies involved in the response, many of which have representatives at the County Emergency Operations Center, including the governor’s Office of Emergency Services, U.S. Customs and Border Protection, the Sheriff’s Department, County Fire, San Diego Police Department, the American Red Cross, 2-1-1 San Diego, the County Office of Education and many community and faith-based organizations.\nPublic Health Officer Dr. Wilma Wooten emphasized the importance of the governor’s order and reminded residents that it is safer to stay at home.\n“I ask you again both personally and as the Public Health Officer that we come together in a collective manner to begin to bend the curve. Every one of us has a vital role in this goal,” said Dr. Wooten.\nSupervisor Nathan Fletcher also provided further clarification on the governor’s stay-at-home directive. He said essential services include restaurant carry out and quick service food operations, workers supporting childcare establishments, and construction workers as well as commercial retail stores that supply essential sectors such as convenience stores, pet supply stores, auto supply and repair, hardware and home improvement.  See the full list of essential critical infrastructure workers.\nCounty Public Health Orders Remain in Place\nPeople — even those in essential services — should continue to follow the public health orders:\n\nPeople are encouraged not to gather in groups of any size unless it’s necessary.\nDay care must be limited to groups of up to 10 children in the same room and must remain in the same group each day with the same staff person.\nPeople 65 years of age and older, or anyone who has a chronic underlying condition or who is immunocompromised, should stay home.\nHospitals must conserve resources and delay non-emergency surgeries and elective procedures.\n\nBusiness ordered closed include:\n\nBars and adult-entertainment establishments that serve alcohol and not food\nRestaurants must close dining-areas, but may serve food for take-out, drive-through, or delivery\nSchools\nGyms and fitness centers\nHair and nail salons\n\nSocial Distancing to Flatten the Curve \nPublic health officials are urging people to “flatten the curve” of the novel coronavirus by staying home and keeping at least six feet away from other people unless they’re family. That would keep the virus from racing through populations, making everyone sick in a huge spike that could overwhelm hospitals and healthcare systems.\nPeople can practice social distancing by staying at home — parents working remotely and students taking classes online. Businesses should also practice social distancing by keeping employees and customers at least six feet apart, if in an essential job, as well as working remotely, if possible.\nPeople can go out to get food or other essentials, assist a family member or friend, get medical attention, pick up medications, or go to work as an “essential” employee.\nLocal COVID-19 Cases \nThrough 5 p.m. Saturday, the County total number of confirmed COVID-19 cases increased to 159 — up by 28 from Friday — with no deaths.\nOf the 159 cases 135 were San Diego County residents and 13 were non-residents. Cases under federal quarantine remained the same at 11.\nOf the 159 cases, 102 were people between the ages of 20 and 49; 18 were between 50 and 59; and 36 were 60 or older. The County’s daily coronavirus in San Diego webpage now also breaks down the number of cases by city and unincorporated communities.\nWhat Everyone Can Do to Minimize Chances of Getting COVID-19\nPeople can help limit the spread of infection, by taking these steps:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nGet COVID-19 Info Via Text\nCounty residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system. The system allows County health officials to send real-time information about COVID-19 in the region. To sign up to receive the messages, text COSD COVID19 to 468-311. The system was set up to let County public health officials issue information and instructions on changes related to COVID-19 in the region.\nIf you have individual questions, please talk to your health care provider. For community resources, please call 2-1-1 San Diego or visit 211sandiego.org or the County’s Coronavirus Disease webpage.\n\n\n\n\nWe’re live at the County Operations Center with another update on the coronavirus. For updates, visit coronavirus-sd.com or text COSD COVID19 to 468-311.\nPosted by County of San Diego – Government on Saturday, March 21, 2020\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200321.19.30.37"}