{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Kicks Off Experience the Outdoors Program", "description": "A new initiative to spread the word about County parks, teach people about the outdoors, share fun, and promote equity, inclusion, accessibility and opportunity, kicks off Friday night with a Summer Movie at the Park at the Waterfront Park.", "datePublished": "2022-07-01T08:38:10-07:00", "url": "https://www.countynewscenter.com/?p=208907", "keywords": ["parks and rec", "accessibility", "county parks", "county parks and recreation", "equity"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-07-01T09:36:49-07:00", "articleType": "article", "articleContent": "\nA new initiative to spread the word about County parks, teach people about the outdoors, share fun, and promote equity, inclusion, accessibility and opportunity, kicks off Friday night with a Summer Movie at the Park at the Waterfront Park.\nThe “Experience the Outdoors Program” will be an energetic, monthly drive with up to 75 free events scheduled through June 2023 — 37 through December — to increase public awareness of County regional parks and highlight activities and services available to everyone.\nThe program will be built around three separate parks campaigns: the RAD Regional Parks Event Series, the Ride-on Mountain Biking Challenge and the Parks 101: First-Timer Series.\nThe RAD Regional Parks Event Series will include dozens of events at 12 different County parks, including Summer Movies in the Park like Friday’s Waterfront Park showing of “Free Guy,” hikes, fitness classes, ghost and historic tours, bird and raptor presentations, celebrations, festivals and family fun days.\nThe Ride-on Mountain Biking Challenge will include eight monthly meetup events, six this year, that will let riders take on eight beginner, intermediate and advanced trails at six different parks. Registrants can earn custom “Ride On” socks and a collectible sticker. Attending the meetups is not mandatory; anyone who visits a featured trail can request a sticker at the ranger station. The program was developed by County Parks with the San Diego Mountain Biking Association with the support of REI San Diego, the San Diego County Parks Society and other organizations.\nThe Parks 101: First Timer Series is starting with 13 scheduled events, six in 2022, that will teach participants outdoor essentials under the direction of County staff, including things like how to hike and bike safely, how to camp, fish, kayak and even rock climb. The program is designed specifically for people who, for various reasons, are beginners to outdoor experiences.\nSome of the promotions for the events will include waiving County day-use fees, waived camping fees (for campout events), translation services and providing participants with free equipment to use for events that require specialized equipment.\nFor more information about the Experience the Outdoors Program, the RAD Regional Parks Event Program, the Ride-on Mountain Biking Challenge, and the Parks 101: First-Timer Series, go to sdparks.org/experienceoutdoors.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220701.08.38.10"}