{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bivalent Boosters Available and Encouraged", "description": "The County of San Diego Health and Human Services Agency is encouraging San Diegans to stay current on their COVID-19 vaccine doses ahead of the upcoming winter months.", "datePublished": "2022-09-15T17:12:27-07:00", "url": "https://www.countynewscenter.com/?p=209528", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-09-15T17:12:27-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is encouraging San Diegans to stay current on their COVID-19 vaccine doses ahead of the upcoming winter months.\n“COVID-19 vaccines and boosters are our best protection against the virus and I encourage anyone who is eligible for a booster to get one,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “While COVID-19 numbers are currently trending down, the virus remains active and infectious in our community and we anticipate more cases in the coming months as people move activities indoors.”\nSo far, close to 1.45 million San Diegans have received a regular booster since they became available. The County has administered more than 400 bivalent boosters since limited supplies started arriving earlier this month, while the total from all providers has surpassed 34,000.\nThe new bivalent boosters were developed to generate an immune response from the original COVID-19 virus, as well as the BA.4 and BA.5 Omicron subvariants. The Omicron variants are still causing the majority of new COVID-19 infections in the region.\nThe Pfizer/BioNTech bivalent booster is available for individuals age 12 and older. Moderna bivalent boosters are authorized for those age 18 and older, but are currently not readily available in the region as the County is awaiting additional vaccine allocations from the state.\nThe bivalent boosters have not yet been authorized for children under the age of 12. Youths in that age group can get boosted with the previous version of the monovalent Pfizer vaccine.\nSan Diegans must be fully vaccinated with the primary series of one of the approved COVID-19 vaccines before receiving a bivalent booster, meaning they must have received the two-dose primary series of Pfizer, Moderna, or the relatively new Novavax. All of those vaccines remain widely available. Also eligible for the bivalent booster are those who received at least one shot of the Janssen vaccine, which is no longer widely available.\nAnyone who wants to get a bivalent booster must wait at least eight weeks after they received a previous COVID-19 vaccine until they are eligible. In addition, anyone who is fully vaccinated and recently tested positive for COVID-19, should wait three months after infection to get a bivalent booster.\nData Reporting Changes\nAs COVID-19 activity continues to trend down in the region, and to align with the state’s reporting frequency, the County will transition to reporting COVID-19 data once a week.\nStarting next week, local COVID-19 data will be updated on the coronavirus-sd.com page on Thursdays only, instead of twice a week on Mondays and Thursdays. The County’s regular COVID-19 news release will continue to be distributed once a week on Thursdays.\n Vaccination Progress:\n\nReceived at least one shot: More than 3.02 million or 90.4% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: More than 2.67 million or 80.0%.\nBoosters administered: 1,447,477 or 59% of 2,455,439 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nNine additional deaths were reported since the last report on Sept. 8, 2022. The region’s total is 5,483.\nOf the nine additional deaths, five were women and four were men. They died between Aug. 25, 2022 and Sept. 10, 2022; five deaths occurred in the past two weeks.\nFive of the people who died were 80 years or older, three were in their 70s and one was in their 60s.\nFive were fully vaccinated and four were not.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n1,251 COVID-19 cases were reported to the County in the past three days (Sept. 12 to Sept. 14, 2022). The region’s total is now 918,279.\n2,840 cases were reported in the past week (Sept. 8 through Sept. 14) compared to 2,797 infections identified the previous week (Sept. 1 through Sept. 7).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 17.59 for people fully vaccinated and boosted, 10.51 for fully vaccinated people and 35.77 for not fully vaccinated San Diegans.\n7,176 tests were reported to the County on Sept. 10, and the percentage of new positive cases was 4.6% (Data through Sept. 10).\nThe 14-day rolling percentage of positive cases, among tests reported through Sept. 10, is 5.7%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220915.17.12.27"}