{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar Holding Meetings for Input on County’s Election Administration Plan", "description": "The Registrar of Voters office is holding a series of consultation meetings inviting the public to have a say in creating the County’s new Election Administration Plan.", "datePublished": "2021-12-08T14:53:08-08:00", "url": "https://www.countynewscenter.com/registrar-holding-meetings-for-input-on-countys-election-administration-plan/", "keywords": ["elections", "california voter s choice act", "consultation meetings", "disability community", "election administration plan", "mail ballot drop-off locations", "registrar s office", "san diego county registrar of voters", "state and federally covered languages", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-12-08T15:14:49-08:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters office is holding a series of consultation meetings inviting the public to have a say in creating the County’s new Election Administration Plan.\nThe meetings begin Thursday and continue through January. The plan describes how the Registrar’s office will administer elections under the Voter’s Choice Act. The public can give input on where to locate vote centers and ballot drop boxes. Attendees can also give feedback on voter education and outreach plans.\nThe Registrar’s office is creating the plan because the Board of Supervisors approved the transition to the vote center model on Oct. 19.\nThe vote center model falls under the Voter’s Choice Act, and it modernizes the election process in several ways.\nActive registered voters automatically receive a ballot in the mail. In-person voting moves from traditional polling places to vote centers. And voters have the option to return their ballot by mail, a secure ballot drop box, or vote in person at any vote center. All the vote centers are open for four days and some up to 11 days, giving voters more time to return their ballot for Election Day.\nThe concept isn’t entirely new to local voters. Due to the COVID-19 pandemic, the Registrar of Voters used a similar voting model for the November 2020 presidential general and September 2021 gubernatorial recall elections.\nThe new Election Administration Plan must be in place for the June 2022 gubernatorial primary. By law, the Registrar must hold consultation meetings beforehand with the county’s disability, and state and federally covered language communities.\nThe communities include Arabic, Chinese, Filipino, Japanese, Korean, Laotian, Native American, Spanish and Vietnamese. Anyone is invited to attend. Check the Registrar’s calendar to see if they are in person, virtual or both.\nSuggestion forms for vote center and mail ballot drop-off locations are also available online.\nImportant dates include:\n\nJan. 13:\n\nThe draft Election Administration Plan will be posted on the Registrar’s website for a 14-day public review and comment.\n\n\nJan 24:\n\n5:30-7:30 p.m. virtual consultation meeting targeting the county’s disability, and state and federally covered language communities.\n\n\nJan 28:\n\n5:30-7:30 p.m. in-person and virtual public hearing targeting the county’s disability, and state and federally covered language communities.\n\n\nFeb. 21:\n\nThe amended Election Administration Plan will be posted on the Registrar’s website for a second 14-day public review and comment period.\n\n\nMarch 6:\n\nPublic comment period ends.\n\n\nMarch 8:\n\nThe Registrar posts the final adopted plan and sends it to the California Secretary of State for approval.\n\n\n\nThe Election Administrative Plan will be reviewed in the odd years prior to each scheduled election year. The next process will begin in 2023 for the 2024 election cycles. For more information about the Voter’s Choice Act, visit sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211208.14.53.08"}