{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 12-14-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 13.", "datePublished": "2020-12-14T18:12:57-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-12-14-2020/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-12-14T18:12:57-08:00", "articleType": "article", "articleContent": "\nSan Diego County today received a shipment of the first FDA-approved COVID-19 vaccine. The initial doses will be distributed to local hospitals where they will be administered to frontline healthcare workers.\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 13.\nICU Capacity and Stay Home Order:\n\nThe current ICU capacity for the Southern California region is now 2.7% and will be updated by the state daily.\nThe Regional Stay Home Order is now in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last for at least three weeks or until the region’s ICU capacity meets or exceeds 15%. The order will be assessed by the state after the three-week period.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed on Dec. 13 in a daycare/preschool/childcare setting.\nFour new community outbreaks were confirmed on Dec. 12: three in business settings and one in a distribution warehouse setting.\nThree new community outbreaks were confirmed on Dec. 11: one in a business setting, one in a daycare/preschool/childcare setting and one in a healthcare setting.\nIn the past seven days (Dec. 7 through Dec. 13), 46 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n21,302 tests were reported to the County on Dec. 13, and the percentage of new laboratory-confirmed cases was 10%.\nThe 14-day rolling average percentage of positive cases is 8.2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 24,964.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n2,206 new cases were reported to the County on Dec 13. The region’s total is now 109,578.\n5,180 or 4.7% of all cases have required hospitalization.\n1,113 or 1.0% of all cases and 21.5% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported to the County on Dec. 13. The region’s total is now 1,162.\nEleven new deaths were reported to the County on Dec. 12.\nFive women and six men died between Dec. 2 and Dec. 10, and their ages ranged from early 60s to mid-90s.\nFourteen new deaths were reported to the County on Dec. 11.\nFive women and 9 men died between Dec. 3 and Dec. 11, and their ages ranged from early 60s to late 90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201214.18.12.57"}