{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mobile Crisis Response Program Celebrates Four Years", "description": "The County’s Mobile Crisis Response Team program is celebrating four years supporting those facing behavioral health crises. ", "datePublished": "2025-01-22T09:41:23-08:00", "url": "https://www.countynewscenter.com/mobile-crisis-response-program-celebrates-four-years/", "keywords": ["health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2025-01-22T10:45:51-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Mobile Crisis Response Team program is celebrating four years supporting those facing behavioral health crises. \nThe program launched in January 2021 as a pilot. It has grown exponentially, going from 131 calls in its first year to more than 7,000 between July 2023 and June 2024. \nResponse teams are made up of trained personnel who can work directly with people, assess their needs and identify ways to de-escalate behavioral health crises without involving law enforcement.  \n“These teams are effectively meeting those in crisis where they are and stabilize more than 50% of cases in the field, reducing stress on law enforcement,” said Dr. Luke Bergmann, director of Behavioral Health Services. “These interactions are improving outcomes and connecting people with services to change their trajectory moving forward.” \nSince the program’s inception, the number of teams has grown from two to 44 while concurrently continuing to increase the ways it supports the region. For example, since November 2024, MCRT teams are able to respond to crises in students from kindergarten through 12th grade in every school district in the region.  \nTeams can respond to behavioral health crises that do not include threats of violence or medical emergencies. These teams provide assessments, leverage crisis intervention and de-escalation techniques, and connect individuals with services and resources.   \nSome common signs of a behavioral health crisis are:  \n\nChanges in mood or behaviors that cause concern \nThoughts of self-harm or suicide  \nSudden changes to hygiene and self-care practices  \nUnusual thoughts, sounds or visions that cause fear or distress  \nSudden onset or increase of substance use  \nFeeling hopeless or helpless  \nSense of loss of control over thoughts, feelings, emotions or behaviors \n\nThe MCRT anniversary coincides with observance of Mental Health Month. \nIn another advancement of behavioral health care availability, the 988-crisis line phone number is now working region-wide to connect callers directly to local specialized teams. The Federal Communications Commission required all cellphone carriers as of Jan. 13 to route 988 calls to local providers rather than a transfer center. \nThe Access and Crisis Line is available in more than 200 languages.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250122.09.41.23"}