{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on Phase One of Bradley Avenue Road Project", "description": "County officials and community partners broke ground Tuesday to celebrate the start of phase one of the Bradley Avenue Road Improvements Project in El Cajon.", "datePublished": "2024-10-01T15:45:03-07:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-phase-one-of-bradley-avenue-road-project/", "keywords": ["transportation", "district 2", "healthy and safe communities", "lueg", "public transportation", "roads", "safety"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-10-02T14:47:44-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty officials and community partners broke ground Tuesday to celebrate the start of phase one of the Bradley Avenue Road Improvements Project in El Cajon.\nThe County’s Department of Public Works (DPW) is working with the City of El Cajon and the Helix Water District to improve and beautify Bradley Avenue.\nCrews will widen the street from west of Magnolia Avenue to east of Mollison Avenue and replace the bridge over State Route 67.\nThese improvements include the following changes:\n\nOne extra travel lane in each direction.\nA new two-way left turn median to improve safety when entering and existing driveways.\nA new traffic signal to improve safety where a 4-way stop currently exists at Mollison Avenue.\nNew irrigation and landscaping in the parkways to improve the community’s look.\nNew sidewalks and bike lanes to give people more ways to get around.\nNew storm drains and culverts to prevent roadway flooding.\n\nThese Green Street features, which help to reduce pollutants in stormwater, are also included to improve water quality.\n“The County is dedicated to the continuous improvement of our public facilities and infrastructure and we are thrilled to see the project move forward,” said Chris Hanger, Project Manager, County DPW.\nThe County recognizes the need to provide more options for families to ride their bikes, take a walk, and step outside to enjoy their community.\n“The County of San Diego is invested in improving our regions infrastructure, beautifying our neighborhoods, and creating places where families can thrive,” said Supervisor Joel Anderson. “I look forward to someday enjoying this thoroughfare with my friends and family.”\nThe new construction will begin later this month and be in full swing by the end of the year.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241001.15.45.03"}