{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Media Campaign to Protect Youth from Human Trafficking", "description": "San Diegans will soon see and hear a new County media campaign designed to raise public awareness about human trafficking. The educational campaign includes radio announcements, outdoor billboards, and digital media to inform children, youth and their peers on how to protect themselves from exploitation.", "datePublished": "2024-06-05T16:30:49-07:00", "url": "https://www.countynewscenter.com/media-campaign-to-protect-youth-from-human-trafficking/", "keywords": ["health", "commercial sexual exploitation of children (csec)", "human trafficking", "protectsandiegokids.org", "sex trafficking"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-06-05T16:35:23-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diegans will soon see and hear a new County media campaign designed to raise public awareness about human trafficking. The educational campaign includes radio announcements, outdoor billboards, and digital media to inform children, youth and their peers on how to protect themselves from exploitation.\nThe new campaign was announced today at a press conference by Chairwoman Nora Vargas, Supervisor Jim Desmond, and District Attorney Summer Stephan along with other County leaders.\nHuman trafficking occurs when a person is forced into sex acts or labor services for profit through violence, threats and false promises. The FBI reports San Diego is one of the nation’s 13 hotspots for human trafficking.\n“Trafficking of children and young people happens in all neighborhoods and victims can be any age, race, gender, or nationality,” said Chairwoman Nora Vargas. “Language barriers and fear too often keep victims silent and make trafficking a hidden crime.”\nA recent study by two local universities estimates there are thousands of victims of trafficking annually here in San Diego and the average age of victims is 16 years old. Rarely is the victim kidnapped. Rather human traffickers are far more likely to lure their young victims by developing a relationship with the youth, oftentimes via social media.\n“Predators target young girls and boys, subjecting them to a life of sexual exploitation through coercion and manipulation,” said County Supervisor Jim Desmond. These victims are thrust into an abyss of despair, their dreams and aspirations shattered and replaced with unimaginable suffering.”\nLaw enforcement and prosecution efforts alone are not enough to stop these human rights violations. Prevention through education, especially at a young age, is the best defense against exploitation, especially in this era of social media.\n“Traffickers often groom, deceive and control their victims through online platforms” said San Diego County District Attorney Summer Stephan. “Our youth need to be aware of predators posing as friends.”\nThe County’s media campaign will run this summer in English and Spanish from June through August.\nTo report suspected child abuse or neglect call the Child Abuse Hotline at 858-560-2191, 24 hours a day, seven days a week. Visit the County’s Commercial Sexual Exploitation of Children webpage and the District Attorney’s Protect San Diego Kids webpage for additional resources.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240605.16.30.49"}