{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Novavax Offers More Traditional COVID-19 Vaccine Option", "description": "San Diegans now have a more traditional option when it comes to COVID-19 vaccines. The protein-based Novavax COVID-19 vaccine is widely available across the region.", "datePublished": "2022-08-18T16:01:59-07:00", "url": "https://www.countynewscenter.com/?p=209238", "keywords": ["health", "coronavirus", "covid vaccines", "covid-19", "novavax"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-08-18T16:33:01-07:00", "articleType": "article", "articleContent": "\nSan Diegans now have a more traditional option when it comes to COVID-19 vaccines. The protein-based Novavax COVID-19 vaccine is widely available across the region.\nYou can get Novavax at local healthcare providers, retail pharmacies, and community clinics, as well as County public health centers and community vaccination events. You can now make an appointment or find a walk-in clinic here.\nWhile the Novavax vaccine is not showing up as available in some online appointment systems, all County of San Diego locations have it in stock for anyone who asks, regardless of which vaccine was selected during scheduling.\nNovavax has been authorized as a two-dose primary series, given three to eight weeks apart, to people ages 18 and older. Clinical trials showed that the vaccine series is 90% effective at preventing mild, moderate and severe COVID-19.\nThe vaccine was developed using protein-based technology, which the U.S. Food and Drug Administration has been using for decades to treat diseases such as hepatitis B, shingles and human papillomavirus. The vaccine presents a specific portion of the virus which the body generates immunity against.\n“Novavax is another vaccine option we have to slowing the spread of COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “It represents a new choice for the prevention of serious complications from COVID.”\nRight now, Novavax is only available to people who have not received any of the other COVID-19 vaccines. It is not yet authorized as a booster shot for people who have previously been vaccinated with Pfizer, Moderna or Janssen.\nEveryone 6 months and older can get one of the four available COVID-19 vaccines at no cost. For those who received an mRNA vaccine, mRNA boosters are available for people 5 years and older. Parental consent is required for all eligible minors to be vaccinated.\nVaccination Progress:\n\nReceived at least one shot: More than 3.01 million or 90% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: More than 2.66 million or 79.7%.\nBoosters administered: 1,437,457 or 58.8% of 2,443,652 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n11 additional deaths were reported since the last report on Aug. 11, 2022. The region’s total is 5,448.\nOf the 11 additional deaths, one was a woman and ten were men. They died between July 28 and Aug. 12, 2022; eight deaths occurred in the past two weeks.\nEight of the people who died were 80 years or older, two were in their 70s and one was in their 40s.\nNine were fully vaccinated and two were not.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n2,134 COVID-19 cases were reported to the County in the past three days (Aug. 15 to Aug. 17, 2022). The region’s total is now 903,885.\n5,285 cases were reported in the past week (Aug. 11 through Aug. 17) compared to 7,045 infections identified the previous week (Aug. 4 through Aug. 10).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 43.35 for people fully vaccinated and boosted, 27.54 for fully vaccinated people and 85.20 for not fully vaccinated San Diegans.\n8,783 tests were reported to the County on Aug. 13, and the percentage of new positive cases was 8.9% (Data through Aug. 13).\nThe 14-day rolling percentage of positive cases, among tests reported through Aug. 13, is 11.0%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220818.16.01.59"}