{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "No Masks Required in Most Outdoor Settings for Fully Vaccinated People", "description": "Fully vaccinated people no longer need to wear masks in public unless they’re in crowded places.", "datePublished": "2021-04-28T17:25:20-07:00", "url": "https://www.countynewscenter.com/no-masks-required-in-public-for-fully-vaccinated-people/", "keywords": ["health", "coronavirus", "covid-19", "no masks for vaccinated people", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-28T18:35:11-07:00", "articleType": "article", "articleContent": "\nFully vaccinated people no longer need to wear masks outdoors in public unless they’re in crowded places.\nThis is one of many activities the Centers for Disease Control and Prevention now considers safer for people who are fully immunized.\nThe state has adopted the new CDC mask guidelines and the County is also easing the same restrictions in the region.\n“Outdoor activities are deemed the safest, especially for people who are fully vaccinated,” said Wilma Wooten, M.D., M.P.H., County public health officer. “In addition to protecting yourself and others from COVID-19, getting vaccinated allows you to be in public, dine outdoor with friends and attend small gatherings without having to wear a mask.”\nMasks are still necessary in crowded outdoor events and indoor activities, whether you’re vaccinated or not.\nVaccination Progress:\n\nAlmost 2.96 million COVID-19 vaccine doses have been delivered to the region, and nearly 2.69 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOverall, close to 1.45 million County residents have received at least one shot of the two-dose vaccine. That’s 53.8% of those eligible.\nOf those vaccinated to date, over 1 million County residents, or 37.4% of San Diegans 16 and older, are fully immunized.\nThe goal is to fully vaccinate 75% of San Diego County residents 16 and older or 2,017,011 people. To date, 71.8% of the goal population has received at least one vaccine and 49.9% are fully vaccinated.\nVeterans Affairs doses received and administered, as well as people vaccinated and fully vaccinated, are now included in the numbers and percentages above.\nThose who received the one-dose Johnson & Johnson vaccine, which was approved for emergency use by the FDA April 23, 2021 following a pause to study adverse reactions in a small number of recipients, are being added to the total of fully vaccinated San Diegans.\nThe difference between doses shipped and the number of vaccinations administered represents approximately what is expected to be used in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.2 cases per 100,000 residents (as of April 27).\nThe County remains in the Orange Tier or Tier 3 under the state’s new guidance. The California Department of Public Health indicates that unless there are extenuating circumstances, such as low rate of vaccine uptake, a county will only move to a more restrictive tier if hospitalizations are increasing significantly among vulnerable individuals, especially among vaccinated individuals, and both testing positivity and adjusted case rates show a concerning increase in transmission. This is currently not the case in the region.\nCurrently, the testing positivity percentage is 2.3%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 3.0% and is also in the Orange Tier or Tier 3.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, May 4.\n\nCommunity Setting Outbreaks:\n\nFive new community outbreaks were confirmed April 27: two in TK-12th grade school settings, one in a faith-based setting, one in a government setting and one in grocery/retail setting.\nIn the past seven days (April 21 through April 27), 23 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n23,051 tests were reported to the County on April 27, and the percentage of new positive cases was 1%.\nThe 14-day rolling average percentage of positive cases is 1.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 13,751.\n\nCases, Hospitalizations and ICU Admissions:\n\n136 COVID-19 cases were reported to the County on April 27. The region’s total is now 275,820.\n15,187 or 5.5% of all cases have required hospitalization.\n1,673 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSix new COVID-19 deaths were reported April 27. The region’s total is 3,698.\nFour men and two women died between April 22 and April 27.\nOf the people who died, one was 80 years or older, one was in their 70s and four were in their 60s.\nFive had underlying medical conditions and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210428.17.25.20"}