{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Thanks for the Sandbags, Now What Can We Do with Them After the Storm?", "description": "Thousands of San Diegans fortified their homes and property with sandbags before the arrival of Tropical Cyclone Hilary. More than 100,000 bags were gathered and used across the county.  But now the storm has passed and clear skies have returned.  That has led many to ask, “What should I do with the sandbags now?”", "datePublished": "2023-08-23T14:46:27-07:00", "url": "https://www.countynewscenter.com/thanks-for-the-sandbags-now-what-can-we-do-with-them-after-the-storm/", "keywords": ["government", "alertsandiego.org", "department of public works", "hilary", "landfills", "sandbags", "sdemergency app", "stormwater", "tropical cyclone hilary"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-08-23T15:07:08-07:00", "articleType": "article", "articleContent": "\nThousands of San Diegans fortified their homes and property with sandbags before the arrival of Tropical Cyclone Hilary. More than 100,000 bags were gathered and used across the county.  But now the storm has passed and clear skies have returned.  That has led many to ask, “What should I do with the sandbags now?”\nThe experts at the County’s Department of Public Works offer some answers to the sandbags question:\n\nWith rainy season approaching, consider keeping your sandbags for reuse. You could store them filled, or empty out the clean sand and store the bags away from sunlight in a covered, above-ground location.\nIf the used sandbags are not contaminated with foul water, chemicals, or petroleum products, rake the sand into soil, add it to planters, or use it for flowerbeds as a soil amendment.\nPlace the empty bags in trash cans if you choose not to reuse them. Do not place the empty sandbags in the recycle bin.\nIf you cannot reuse the sand or sandbags at home, take them directly to the landfill. Local landfills (Miramar, Sycamore, Otay, and Borrego Springs) can accept sandbags used for stormwater control during the recent storm. Do not put full sandbags in your trash cart, bins, or dumpsters, they are too heavy for disposal companies to collect.\nIf you see or suspect your sandbags are contaminated with sewage, chemicals, or petroleum products, handle them with protective gear, including gloves and protective eyewear. Dispose of them at select landfills or through a hazardous waste contractor.  Please contact the landfill facility in advance as additional handling and paperwork will be required.\nResidents of cities or tribal lands should also check with their jurisdiction or trash contractor for any additional guidance.\n\nFor questions not covered here, unincorporated county residents can contact 1-877-R-1-EARTH or 1-877-713-2784.\nThanks for preparing for the storm. For the latest emergency updates in English and Spanish, visit AlertSanDiego.org and download the SD Emergency app. There you will find more preparedness tips to keep you and your family safe.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230823.14.46.27"}