{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "More than 300 County Employees Take Part in Point in Time Count", "description": "The annual Point in Time Count is coordinated by the Regional Task Force on Homelessness and provides a one-day count of the number of people experiencing homelessness in San Diego County, including those in emergency shelters and safe parking lots.", "datePublished": "2025-01-30T15:50:09-08:00", "url": "https://www.countynewscenter.com/more-than-300-county-employees-take-part-in-point-in-time-count/", "keywords": ["housing", "homelessness", "housing", "point in time count", "san diego", "taskforce of homelessness"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-01-30T16:29:59-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty homeless outreach workers Darren Hessler and Mayra Fernandez Garcia walk San Diego County talking with people experiencing homeless often but today things are different.\nIt is four in the morning, and they are joined by more than 300 other County employees and hundreds of community volunteers as part of the annual We All Count, Point in Time Count.\nDarren Hessler speaks with a person experiencing homelessness while doing the Point in Time Count in Downtown San Diego.\nThe annual event is coordinated by the Regional Task Force on Homelessness and provides a one-day count of the number of people experiencing homelessness in San Diego County, including those in emergency shelters and safe parking lots.\nThe information from the Point in Time surveys is used to apply for federal and state funding to help people experiencing homelessness and implement solutions on how to best serve them.\nThe count is held in the early morning hours. Dozens of teams spread out in all parts of the County before people are up and moving.\nMayra Fernandez Garcia engages with a man waking up on the sidewalk who agrees to be surveyed for the Point in Time Count.\nHessler and Fernandez Garcia with the County Office of Homeless Solutions and Mercedes Irazoqui, a Human Services Specialist with County Self-Sufficiency Services make up a Downtown San Diego team today. Equipped with a printed map, the survey on a phone app form, and gift cards, the team first walks up to a man in a sleeping bag laid on a rug outside an office building.\n“Some of the people we talked to today have been homeless for more than five, eight, 10 years,” said Hessler. “We hear a lot of their stories for what caused their homelessness. Sometimes it can be that they lost a loved one, they lost their home or they lost their job. Just simple things that can happen to anybody, it is not necessarily that they have substance abuse or mental health issues.”\nBy sunrise, after engaging with about 30 people, the team has made their way to the Embarcadero area. People are packing up their sleeping mats and blankets. One man is interviewed as he gets ready to mount his bicycle and head to his next location.\nPeople who were not interested in taking the survey are still counted in the app and their location is noted.\nThe County has multiple programs in place to help connect people to the services they need, including finding a stable place to live. People can find more information online from the Office of Homeless Solutions or by calling 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250130.15.50.09"}