{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Reach 45; #StayHomeSD Campaign Kicks Off", "description": "One additional COVID-19 death was reported in San Diego, bringing the region’s total to 45, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-11T17:40:39-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-reach-45-san-diegans-encouraged-to-join-awareness-campaign/", "keywords": ["health", "45 deaths", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-04-15T13:43:08-07:00", "articleType": "article", "articleContent": "\nOne additional COVID-19 death was reported in San Diego, bringing the region’s total to 45, the County Health and Human Services Agency announced today. The latest death was of a man in his 80s with underlying medical conditions.\n“Our sincere sympathies and condolences go out to the family and friends of the death that we have reported today and continuously go out to those who have also lost loved ones due this epidemic,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nNew Public Awareness Campaign\nBoard Chairman Greg Cox holds a picture of his father-in-law as part of the #StayHomeSD campaign.\nThe County also launched a new awareness campaign today, encouraging San Diegans to stay at home, maintain social distancing and wear facial coverings.\nCounty residents are invited to submit a picture of themselves in which they hold a sign that shows who they are staying home for. Submissions could be featured as one of the faces of our community in the campaign as we work together to flatten the curve and slow the spread of the coronavirus.\nThose submitting a photo are encouraged to share it on their social media pages with the hashtags #StayHomeSD and #InThisTogetherSD.\nCounty COVID-19 Cases Now at 1,761\nSixty-eight new COVID-19 cases were announced today, bringing San Diego County’s total to 1,761.\nOf San Diego County’s cases, 902 (51.2%) were men and 853 (48.4%) were women. The gender of six people is unknown. Of the reported cases, 396 (22.5%) have required hospitalization and 144 (8.2%) of the total number of cases had to be placed in intensive care. Forty-five (2.6%) have died.\nThe age, gender and race and ethnic breakdown of the 45 COVID-19 deaths reported is:\nAge:\n\n80 and older: 22\n70 to 79: 13\n60 to 69: 4\n50 to 59: 4\n20 to 29: 2\n\nGender:\n\n26 Men\n19 Women\n\nRace and Ethnicity:\n\n21 White\n12 Hispanic\n2 Asian\n1 Multiple races\n9 Unknown\n\nOther measures and resources to deal with COVID-19 include:\n\nMore than 24,000 tests have been administered to San Diegans.\nThe County has distributed nearly 1.96 million personal protective equipment items to local health care providers, including nearly 800,000 N-95 respirators, nearly 380,000 surgical face masks and over 719,000 gloves.\nA total of 2,029 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,582 rooms for County Public Health Services use, 210 are occupied by 216 guests.\nOf the 447 rooms assigned to the Regional Task Force on the Homeless, 194 are being occupied by 321 people who are at higher risk of developing complications from COVID-19.\n\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data is also broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200411.17.40.39"}