{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tips to Stay Safe While Cleaning Up After a Flood", "description": "If your home or business was flooded during the Jan. 22 storm, it is important to keep yourself and your family safe when cleaning up.", "datePublished": "2024-01-26T12:11:46-08:00", "url": "https://www.countynewscenter.com/tips-to-stay-safe-while-cleaning-up-after-a-flood/", "keywords": ["government", "clean up", "flooding", "lueg", "mold", "rain", "safety", "storm", "tips"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-01-26T12:24:16-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIf your home or business was flooded during the Jan. 22 storm, it is important to keep yourself and your family safe when cleaning up.\nBefore attempting to clean up after the storm, visit the recovery page at AlertSanDiego.org for safety tips, information on how to properly document damages and other available resources.\nResidents should only enter a flood-damaged building after local authorities have said it is safe to do so. You should not enter if there are floodwaters in or around the building or if you smell gas.\nAccording to FEMA, you should follow these important tips when cleaning up following a flood:\nWear protective clothing\nIf you have been cleared to return to your home, wear long clothing, work gloves and heavy or rubber boots if you have them. FEMA also recommends wearing goggles and a mask if possible.\nAvoid possible hazards\nDo not wade in floodwater, which could have dangerous debris in it. The water could also be contaminated or electrically charged from a downed or underground power line.\nUse a flashlight instead of matches, lighters or any other open flames for lighting, since gas may be trapped inside the building.\nDo not use electrical equipment if it is wet or if you are standing in water. If it is safe to do so, turn off your electricity to prevent electric shock.\nThrow away any food or drinks that may have come in contact with floodwater. You should only drink clean, safe water. Wash your hands with soap and clean water or use an alcohol-based hand sanitizer before eating.\nWatch for mold\nDry out your home as soon as possible to prevent mold. If you suspect there is mold present, wear a respirator or N95 mask when entering the building, in addition to other protective gear.\nPeople with asthma, other respiratory conditions or suppressed immune systems should not be around mold.\nTo make cleaner, mix one cup of household bleach with one gallon of water. Never mix bleach with ammonia.\nIf you do attempt to clean the building yourself, open the doors and windows for at least 30 minutes after to air it out before staying for a length of time.\nDocument your property damage\nBefore any clean up, you should take photos and/or videos of any property damage. You should then conduct inventory and contact your insurance company for assistance.\nThe County is working to assess flood damages throughout the region. The public can help through a voluntary online survey. The survey will only be used to gather information to determine if the County is eligible for state and/or federal assistance.\nCompleting the form does not guarantee that you will be eligible to receive any disaster relief assistance. Filling out the survey is not a substitution for filing a claim with your insurance. You should check with your own insurance first to check for coverage.\nThe County urges all county residents to be prepared for emergencies. Register for AlertSanDiego.org and download the SD Emergency mobile app to receive emergency notifications, updates, and preparedness information, like a personal disaster plan and go-kit in case of evacuation.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240126.12.11.46"}