{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supervisors Advance Alternative to Incarceration Hub", "description": "The San Diego County Board of Supervisors approved two actions Wednesday to help people move forward after arrest and incarceration.", "datePublished": "2024-03-13T17:46:19-07:00", "url": "https://www.countynewscenter.com/county-supervisors-advance-alternative-to-incarceration-hub/", "keywords": ["government", "alternatives to incarceration", "hhsa", "public safety group"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-03-14T12:27:19-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIn Summary:\n• Board of Supervisors approve Alternatives to Incarceration actions.\n• Actions advance a support services hub to support people leaving jail or referral’s.\n• County staff to return with ordinance to protect jobseekers.\nThe San Diego County Board of Supervisors approved two actions Wednesday to help people move forward after arrest and incarceration.\nThe Board’s vote advanced plans to open a new San Diego Resource and Reentry Hub in the central region of San Diego County. The hub will bring numerous services together in one place to support the needs of people who are leaving jail or who are referred by law enforcement.\nThe Board’s vote also directed County staff to return within 120 days with a proposed ordinance for supervisors to consider which will allow the County to respond when jobseekers say they are facing illegal discrimination based on their criminal history.\nBoth actions came as part of an update on the County’s “Alternatives to Incarceration Initiative.” The initiative brings public health, justice, and equity departments together to work with community members to develop supportive services and actions to address the underlying drivers of crime and reduce the number of people who go to jail and return to it.\nCounty staff told the Board of Supervisors that the resource and reentry hub would be based on similar successful models in other counties.\nThe hub would combine services to remove barriers that people who are involved in the justice system often experience, barriers that keep them from getting the things they need to move forward. Some of those barriers include not having documents, such as identification and birth certificates, or not having health insurance, job and educational opportunities, housing, or having access to behavioral health services.\nThe Board’s vote authorized the County to seek bids or amend current contracts to establish the new hub and its services. County staff said the next step is conducting extensive community outreach to inform where the resource hub should be located, what partners should help people there, and what elements would make the hub successful.\nThe County plans to hold two public listening sessions in April to get input. Details will be added soon to the County’s Alternatives to Incarceration website.\nOfficials from the County’s Office of Labor Standards and Enforcement (OLSE) told the Board Tuesday that a local ordinance will support its existing work to educate local employers and jobseekers on the state’s Fair Chance Act. The law prohibits most employers from asking job applicants questions related to their criminal history until after the employer has offered them a job.\nOLSE staff said that the County does hear of employers who aren’t following the law, and a local ordinance will empower them to immediately help people who report violations.\nNumerous County departments and groups work with community members and other local governments on the Alternatives to Incarceration Initiative as part of an advisory group.\nThose County departments include Behavioral Health Services; Homeless Solutions and Equitable Communities; Medical Care Services Division; the Probation Department; the Sheriff’s Department; the San Diego County District Attorney’s office; the Office of the Public Defender; the Office of Equity and Racial Justice; the Office of Labor Standards and Enforcement; and the Office of Evaluation, Performance and Analytics.\nCommunity members represent justice system advocates, people with lived experience in the justice system and service providers.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240313.17.46.19"}