{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Evening COVID-19 Vaccination Clinics Coming to North, East, South County", "description": "Starting May 6, three County COVID-19 vaccination sites in North, East and South County will start offering evening hours for San Diegans.", "datePublished": "2021-05-03T17:23:52-07:00", "url": "https://www.countynewscenter.com/evening-covid-19-vaccination-clinics-coming-to-north-east-south-county/", "keywords": ["health", "coronavirus", "covid-19", "evening clinics", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-05-03T17:23:52-07:00", "articleType": "article", "articleContent": "\nStarting, Thurs., May 6, three County COVID-19 vaccination sites in North, East and South County will start offering evening hours for San Diegans.\nThe three clinics will be administering Pfizer and Moderna vaccines to people with and without appointments. People are welcome to drop-in whether for a first dose or a second dose that is a follow up to a dose received elsewhere.\nThe sites will be offering doses from 1 p.m. to 8 p.m. in:\nOceanside\nSun. to Thurs.\nNorth Coastal Live Well Health Center\n1701 Mission Avenue\nChula Vista\nSun. to Thurs.\nSouth Region Live Well Center at Chula Vista\n690 Oxford Street\nEl Cajon\nTues. to Sat.\nEast Public Health Center\n367 North Magnolia Avenue\n“With 1.5 million San Diegan now having received at least one dose of vaccine, and with vaccination sites more widespread, we are able to improve convenience,” said Wilma Wooten, M.D., M.P.H., County public health officer. “By offering evening hours,  the County is providing the public even more options to help get us to herd immunity and back to the things we love.”\nAnyone 16 and up who lives, works or goes to school in San Diego County can now receive a COVID-19 vaccine at no cost. See more locations at coronavirus-sd.com/vaccine.\nVaccination Progress:\n\nDoses delivered: Almost 3.04 million.\nDoses administered: More than 2.83 million.\nReceived at least one shot: Over 1.5 million or 55.9% of San Diegans 16 and older.\nFully vaccinated: About 1.09 million or 40.4%.\nThe goal: fully vaccinate 75% of San Diego County residents 16 and older or 2,017,011 people.\nTo date, 74.6% of the goal population has received at least one vaccine and 53.9% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.2 cases per 100,000 residents.\nThe testing positivity percentage is 2.3%.\nThe health equity metric is 3.0%.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, May 4.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed May 2.\nTwo community outbreaks were reported May 1 in business settings.\nThree community outbreaks were reported April 30: one in a restaurant/bar setting, one in a retail setting and in a business setting.\nIn the past seven days (April 26 through May 2), 18 community outbreaks were confirmed.\nThe community outbreaks trigger is seven or more in seven days.\n\nTesting:\n\n6,672 tests were reported to the County on May 2, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 1.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 13,370.\n\nCases, Hospitalizations and ICU Admissions:\n\n172 COVID-19 cases were reported to the County on May 2. The region’s total is now 276,692.\n15,257 or 5.5% of all cases have required hospitalization.\n1,683 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported May 2. The region’s total is 3,712.\nSix new COVID-19 deaths were reported May 1. Four men and two women died between Nov. 11, 2020 and April 29, 2021.\nOf the people who died, two were 80 years of age or older, one was in their 70s and three were in their 60s.\nAll had underlying medical conditions.\nFour new COVID-19 deaths were reported April 30. Three men and one woman died between April 7 and April 29, 2021.\nOf the people who died, two were 80 years of age or older, one was in their 60s and one was in their 50s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210503.17.23.52"}