{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Holding Zoom Community Sessions Related to Housing Blueprint", "description": "The County of San Diego is holding two virtual community sessions for the public, May 1 and May 2, related to the County’s Housing Blueprint, live on Zoom.", "datePublished": "2024-04-24T12:56:30-07:00", "url": "https://www.countynewscenter.com/county-holding-zoom-community-sessions-related-to-housing-blueprint/", "keywords": ["housing", "affordable housing", "community engagement", "engage san diego county", "housing", "housing blueprint", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-04-24T13:06:42-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County of San Diego is holding two virtual community sessions for the public, May 1 and May 2, related to the County’s Housing Blueprint plan, live on Zoom.\nThe Housing Blueprint plan is expected to be considered by County supervisors this summer. Among other things, the plan wants to find ways to build more housing for everyone, create and preserve affordable housing, protect tenants, keep more people in the homes they love and promote climate-friendly communities.\nThe two upcoming virtual community sessions will present the same information for the public. One will be held in the afternoon and one in the evening to make it as easy as possible for people to attend. People can learn about the Housing Blueprint process; share feedback on recommendations to improve the Blueprint; and discover more ways to share their input.\nTo take part in the meeting, people can register for community sessions on the County’s Engage San Diego County Housing Blueprint webpage.\nCounty officials want to seek and include as much input and ideas from the public as they can get. The County previously held a Board of Supervisors workshop in 2022, and a virtual community meeting and two informational webinars for the public in 2023.\nThe new Zoom meetings are scheduled to be held:\nMay 1, 6 p.m. to 7:30 p.m. \n\nZoom Link: https://us02web.zoom.us/j/89757692737 (copy and paste URL into browser when ready to join the meeting)\n+1 669 444 9171\nWebinar ID: 897 5769 2737\n\nMay 2, 12 p.m. to 1:30 p.m. \nZoom Link: https://us02web.zoom.us/j/81088067507 (copy and paste URL into browser when ready to join the meeting)\n\n+1 669 444 9171\nWebinar ID: 810 8806 7507\n\nFor more information about the plan go to Engage San Diego County webpage and click on the Housing Blueprint icon. Review and give your feedback on other County projects at Engage San Diego County.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240424.12.56.30"}