{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "$12 Million in Federal Funding Goes to Housing Programs", "description": "The County spent nearly $12 million in federal entitlement funds last fiscal year on affordable housing, homelessness issues, community infrastructure, and housing or services for people living with HIV/AIDS.", "datePublished": "2021-09-15T12:37:03-07:00", "url": "https://www.countynewscenter.com/12-million-in-federal-funding-goes-to-housing-programs/", "keywords": ["housing", "affordable housing", "cdbg", "federal entitlement funds", "homelessness"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-17T11:48:18-07:00", "articleType": "article", "articleContent": "\nThe County spent nearly $12 million in federal entitlement funds last fiscal year on affordable housing, homelessness issues, community infrastructure, and housing or services for people living with HIV/AIDS.\nThe figure was part of the 2020-21 Consolidated Annual Performance and Evaluation Report (CAPER), which summarizes accomplishments on housing programs during that fiscal year and went today before the County Board of Supervisors.\nMore than $11.74 million was spent of four federal entitlement programs funded by the U.S. Department of Housing and Urban Development and administered by Housing and Community Development Services (HCDS) at the County Health and Human Services Agency.\nLast fiscal year, the County exceeded annual outcome projections in each of the four core funding areas: Community Development Block Grant, Home Investment Partnerships, Emergency Solutions Grant and Housing Opportunities for Persons with AIDS.\nThe County also administers funding provided by the state through the State Emergency Solutions Grant program. The activities, as described in the CAPER, predominately benefited lower-income residents. The investments included:\n\nApproximately $5.3 million was spent on affordable housing, which included the construction of The Grove, an 80-unit affordable housing development in Vista—140% of the goal.\nNearly $5 million on housing for people with HIV/AIDS or 325% of the projection.\nMore than $800,000 was expended on homelessness, primarily on homeless prevention, rapid rehousing, emergency shelters and street outreach. In the area, the County accomplished 127% of the goal.\nMore than $750,000 on new infrastructure, including park improvements, street and sidewalk construction or repairs and public services—133% of the goal.\n\nThrough these efforts, the County served a total of more than 125,000 people and 5,000 households during the 2020-21 fiscal year.\nThe CAPER requires public comment and a public hearing before it is submitted to the federal government.\nDon Dussault County Park was renovated using Community Development Block Grant funds.\nIn addition to accepting the report, the Board also voted to allow the County to apply for $500,000 from the state through the State Emergency Solutions Grant program to be used during the current fiscal year.\nLike the federal Emergency Solutions Grant, the state funds are used to serve people who are homeless and those at risk of homelessness throughout the region.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210915.12.37.03"}