{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registered with a Political Party? Make Sure Ballot Offers the Presidential Candidate You Want", "description": "If you’re registered with a political party, then that party’s presidential candidates will appear on your March 2024 presidential primary ballot. If you want to vote for a presidential candidate from another political party, you’ll need to re-register with that party.", "datePublished": "2024-01-11T11:40:51-08:00", "url": "https://www.countynewscenter.com/registered-with-a-political-party-make-sure-ballot-offers-the-presidential-candidate-you-want/", "keywords": ["elections", "county registrar of voters", "crossover party ballots", "crossover voting", "fgg", "march 5 presidential primary", "nonpartisan voters", "voting for president"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-01-11T12:35:29-08:00", "articleType": "article", "articleContent": "\nIf you’re registered with a political party, then that party’s presidential candidates will appear on your March 2024 presidential primary ballot.\nIf you want to vote for a presidential candidate from another political party, you’ll need to re-register with that party.\nFor that reason, the Registrar’s office encourages you to verify your political party preference and your home and mailing address. Ballots start going out to registered voters the week of Feb. 4.\nPolitical parties decide who can vote for their presidential primary candidates. All registered voters fall under two categories:\n\nRegistered with a Political Party Preference\n\nIf you are registered with one of the six qualified political parties in California, your ballot will list only that party’s presidential primary candidates. You can vote only for that party’s presidential candidates.\nCalifornia’s qualified political parties are:\n\nAmerican Independent Party\nDemocratic Party\nGreen Party\nLibertarian Party\nPeace and Freedom Party\nRepublican Party\n\nIf your party registration differs from the party of the presidential candidate you want to vote for, you will need to register to vote with that party. If you want to change your party registration, the Registrar’s office advises you to do so before Feb. 20.\n\nRegistered as Nonpartisan (Also Known as Independent or No Party Preference)\n\nIf you are registered as nonpartisan, you will automatically receive a nonpartisan ballot for the March 5 election. Your nonpartisan ballot will not list the presidential primary contest or candidates.\nNearly 490,000 voters in San Diego County are registered as nonpartisan. If you are one of them, you can take steps now to vote for a presidential candidate in the primary. As a nonpartisan voter, you can select one of three different crossover ballot types.\nPolitical Parties Allowing Nonpartisan Voters to Crossover:\nThis year the American Independent Party, Democratic Party and Libertarian Party are allowing nonpartisan voters to take part in their presidential primary elections.\nNonpartisan voters must request one of these three parties’ ballots to vote for that party’s presidential primary candidate. Selecting one of these three political party ballots will not register you with that party. You will remain a nonpartisan voter.\nYou can complete the Registrar’s nonpartisan crossover party ballot request form found at sdvote.com or visit the Registrar’s office in Kearny Mesa from 8 a.m. to 5 p.m. Monday through Friday.\nAlso note that the Democratic Party is allowing nonpartisan voters to vote in its presidential contest, but not its Central Committee contest. If requested, you will receive the nonpartisan version of the Democratic ballot.\nPolitical Parties NOT Allowing Nonpartisan Voters to Crossover\nThis year, the Green Party, Peace and Freedom Party and Republican Party have closed their presidential primary to nonpartisan voters.\nNonpartisan voters will not be able to select one of these ballots. Nonpartisan voters who want one of these parties’ ballots will need to re-register with that party.\nYou can fill out a new voter registration form online at sdvote.com.\nNo matter what your party preference, all registered voters will be allowed to vote on nonpartisan contests and voter-nominated offices, such as U.S. congressional offices and state legislative offices.\nThe top two vote getters in voter-nominated contests will advance to the Nov. 5 general election.\nNot sure which political party you’re registered with or if you’re registered to vote? \nYou can check your registration, re-register, and register to vote at sdvote.com.\nThe Registrar’s office encourages you to do so well before Feb. 20 to avoid delays and long lines at vote centers.\nLearn more about voting in the March 5 presidential primary at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240111.11.40.51"}