{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Health Officials Renew Call For Vaccinations Against COVID-19", "description": "County public health officials are renewing their call for San Diegans to get vaccinated and boosted against COVID-19 as the colder months are upon us. Respiratory illnesses historically increase during fall and winter as many people move activities and gatherings indoors.", "datePublished": "2022-10-13T17:00:04-07:00", "url": "https://www.countynewscenter.com/county-public-health-officials-renew-calls-for-vaccinations-against-covid-19/", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19", "kids covid boosters"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-10-13T17:03:32-07:00", "articleType": "article", "articleContent": "\nCounty public health officials are renewing their call for San Diegans to get vaccinated and boosted against COVID-19 as the colder months are upon us. Respiratory illnesses historically increase during fall and winter as many people move activities and gatherings indoors.\nRecent local data shows the value of the COVID-19 vaccines, highlighting that those who are vaccinated and boosted are substantially less likely to die of complications from COVID-19.\nIn the first seven months of this year, from Jan. 1 to July 31, 912 San Diegans died of COVID-19. Of those 912, 498 individuals did not complete the primary series of any of the available COVID-19 vaccines. A total of 42 people had received only a single dose of either the Pfizer or Moderna vaccine and the other 456 individuals had received no vaccine doses of any kind. Individuals considered not vaccinated represented 54 percent of total deaths.\nOf the remaining deaths, 281 completed the primary series and 133 also had an additional booster dose. 80 percent of the 3.3 million San Diegans six months of age or older have completed the primary series. Two shots of these vaccines are needed to complete the primary series and be considered fully vaccinated.\nFor the period between Aug. 14 and Sept. 10 of this year, the most recent period for which complete statistics are available, the death rate for San Diegans who did not complete the primary vaccine series was 0.94 per one million residents. This death rate is five times higher than those who completed the primary series and received a booster (0.18 per one million county residents).\n“Vaccination remains the best way to prevent severe outcomes and death from COVID-19,” said Dr. Cameron Kaiser, County deputy public health officer. “We are especially encouraging those eligible to get the new bivalent booster, as it is specifically designed to protect individuals from the virus variants currently circulating in our community. These variants and their relatives are expected to be with us into the holidays.”\nIn addition to vaccination, there are a number of precautions San Diegans can take to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often;\nStaying away from sick people;\nStaying home and avoiding contact with others when sick;\nWearing a well-fitting face covering when around others, especially in crowded indoor settings; and\nRegularly cleaning commonly touched surfaces.\n\nBivalent Boosters Coming For Children 5 And Older\nThe California Department of Public Health has updated its emergency use authorization of the updated COVID-19 boosters in California to include younger children. Eligibility for the Moderna bivalent booster now extends to individuals 6 years of age and older and eligibility for the Pfizer-BioNTech bivalent booster now extends to individuals 5 years of age and older.\nBoosters will be available through healthcare providers and at participating pharmacies. Parents should visit the state’s My Turn website to schedule an appointment.\nCounty of San Diego Public Health Services expects to receive the boosters for children in the coming days and anticipates being able to start administering them as soon as Saturday at select locations. Booster dose availability will be listed on the County’s COVID-19 website.\nThe updated boosters were designed to protect individuals from the worst outcomes of COVID-19, including hospitalization and death. Everyone 5 years of age and older who has had their primary series vaccinations is eligible to get the updated booster two months following any COVID vaccine or booster dose.\nVaccination Progress:\n\nClose to 2.69 million or 80.4% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBoosters administered: 1,473,096 or 59.8% of 2,465,357 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nNine additional deaths were reported since the last report on Oct. 6, 2022. The region’s total is 5,507.\nOf the nine additional deaths, four were women and five were men. They died between Sept. 25, 2022 and Oct. 2, 2022.\nFive of the people who died were 80 years or older, three were in their 70s and one was in their 60s.\nSix were fully vaccinated and three were unvaccinated.\nEight had underlying medical conditions and one had medical conditions pending.\n\nCases, Case Rates and Testing:\n\n1,855 COVID-19 cases were reported to the County in the past seven days (Oct. 4 to Oct. 10, 2022). The region’s total is now 926,364.\nThe 1,855 cases reported in the past week were slightly lower compared to the 2,284 infections identified the previous week (Sept. 27 to Oct. 3, 2022).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 11.01 for people fully vaccinated and boosted, 6.08 for fully vaccinated people and 22.65 for San Diegans who are not fully vaccinated.\n5,003 tests were reported to the County on Oct. 8, and the percentage of new positive cases was 4.1% (Data through Oct. 8).\nThe 14-day rolling percentage of positive cases, among tests reported through Oct. 8, is 4.2%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221013.17.00.04"}