{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego Restaurants to Close Nightly at 10 PM", "description": "San Diego restaurants must close nightly at 10 p.m. starting Wednesday, July 1 until further notice, the County Health and Human Services Agency announced Tuesday.", "datePublished": "2020-06-30T18:35:07-07:00", "url": "https://www.countynewscenter.com/san-diego-restaurants-to-close-nightly-at-10-pm/", "keywords": ["health", "bars", "breweries", "coronovirus", "covid-19", "distilleries", "public health order", "restaurants"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-07-01T11:00:05-07:00", "articleType": "article", "articleContent": "\nSan Diego restaurants must close nightly at 10 p.m. starting Wednesday, July 1 until further notice, the County Health and Human Services Agency announced Tuesday.\nBars, wineries, distilleries and breweries that are allowed to serve food must also close nightly at 10 p.m. until 5 a.m.\nThe County is taking the action to prevent additional community outbreaks and the spread of COVID-19.\n“In light of the high numbers of positive cases in recent days and reports today of 10 current community outbreaks throughout the County, a decision was made to close these establishments at 10 p.m.,” said Wilma Wooten, M.D., M.P.H., County public health officer. “As the night wears on, restaurants have a tendency to become bars and people are more likely to let their guard down when it comes to social distancing.”\nDr. Wooten emphasized the need to protect the public’s health as San Diego, the state and nation continue to see a jump in COVID-19 cases.\nLocally, the number of positive cases climbed by 317 for a total of 14,149. The increase was not as steep as the previous day’s record high of 498. Current COVID-19-related cases in ICUs was at a record high of 182. Four new deaths were reported for a total of 365.\nThe largest contributors to the number of community outbreaks are bars and restaurants, and private residences. The following 10 outbreaks in community settings were confirmed during the last seven days.\n\nWith the increase of businesses and activities opened, people in the 20 to 29 age group are going out more and contributing to the higher number of cases.\nWith the Fourth of July holiday weekend coming up, San Diegans may want to celebrate with friends and family at backyard gatherings. However, the County is asking residents to continue to use caution and, if they must gather, stay with immediate family only for house parties and take all precautions.\nIf you do go out to dinner, wear a facial covering, maintain social distancing and frequently wash your hands.\nThe County is not closing beaches, but cities will have the final say. And County officials say those who go the beach should also take the same precautions.\nRegional hospitals support the latest public health orders.\n“It’s important to remember that the goal is to protect the health of the region and our community throughout the pandemic as well as preserve hospital capacity,” said Demetrios Alexiou, president and CEO of the Hospital Association of San Diego and Imperial Counties. “The recent trends that we’re seeing is putting that second item at risk. In the past week, we’ve seen hospitalizations go up from 300 or so to well over 400 now and there is no end in sight as those trends continue to go up.”\nCOVID-19 Tests, Cases and Deaths\nCommunity Outbreaks:\n\nIn the past seven days, 10 community outbreaks were identified; four new outbreaks were identified June 29, one each at a grocery store, a restaurant, an animal clinic and a private residence.\nThe number of community outbreaks rises above the trigger of seven in seven days.\n\nTesting:\n\n7,382 tests were reported to the County June 29 and 4% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 4.2%. \n\nCases:\n\n317 new cases were reported in San Diego County for a total of 14,149.\n1,770 or 12.5% of cases have required hospitalization.\n485 or 3.4% of all cases and 27.4% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFour new COVID-19 deaths were reported bringing the region’s total to 365. Two males and two females died between June 13 and June 28. Their ages ranged from early 80s to early 90s and all four had underlying conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200630.18.35.07"}