{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Responding to Children about Violent Incidents", "description": "A County mental health expert offers parents advice on responding to children after school shootings and other violent incidents.", "datePublished": "2022-05-25T09:41:09-07:00", "url": "https://www.countynewscenter.com/?p=208606", "keywords": ["families", "child mental health", "mental health"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-05-26T16:57:17-07:00", "articleType": "article", "articleContent": "\nRead this article in Spanish: Respondiendo a los niños sobre incidentes violentos\nChildren who learn of violent incidents like the school shooting in Uvalde, Texas can experience a great deal of anxiety and fear. Those emotions can last for days or weeks.\nFor many, the feelings could be compounded by anxiety suffered following earlier mass shootings, including those at a grocery store in Buffalo, New York and a church in Orange County.\nThe County of San Diego’s deputy director for Behavioral Health Services, Dr. Piedad Garcia, said it’s important for parents to be aware of their children’s responses. They should be ready to talk openly but without providing too many details.\n“Each child exhibits distress differently,” Garcia said. “It has to do with their age, their maturity, their individual experiences.”\nParents should monitor how their children are doing and acknowledge that their children’s feelings are OK. Their sleep routines and appetite may be disrupted. These are all normal reactions, Garcia said. Provide emotional support. It may take minutes, hours or even days for the incident to affect children. When it does, provide nurturance (hugs, empathy, kindness, calm support) and ask about their thoughts and feelings.\nShe advises parents to limit children’s exposure to information on the tragedy. Media reports often repeat distressing images and ongoing coverage can exaggerate the event in children’s minds.\n“Sometimes what happens is they are overly stimulated by the information and that can create even further anxiety,” Garcia said.\nParents can emphasize to children that the event has ended and reassure them that they are safe, Garcia said.\nShe said to answer children’s questions simply, without dramatizing the incident. And provide perspective, explaining that these incidents are not a common occurrence.\nGarcia said children’s caregivers need to be aware of their own stress levels and try to stay calm. Children look to parents for a sense of security and safety. Adults should talk to another adult about what they’re feeling, too.\nThe County also operates the Access and Crisis Line seven days a week, 24 hours a day, where people can get help for issues such as depression, anxiety, anger or other mental health challenges. The number is 888-724-7240.\nMental health experts also offered these behavioral signs that may show your child is reacting to the incident:\n\nInfants up to two years old may react to their parents’ anxiety or other responses. The infants may be irritable, they may cry more than usual and want to be cuddled.\nPreschool-aged children are not able to fully understand the tragedy, but they may know enough to feel helpless and overwhelmed. They may feel fear and insecurity about being separated from caregivers. They may try to re-enact the incident through play activities.\nElementary school-age children have a better ability to understand the tragedy. They may become intensely preoccupied with the details of the event and want to discuss it. Other reactions may include sadness, generalized or specific fears about the event happening again, as well as feelings of guilt, overreaction or inaction. They may feel angry that the event was not prevented or have fantasies of rescuing others.\nMiddle school and high school-age children could become involved in dangerous, risk-taking behaviors such as reckless driving or alcohol and drug use. Others may be fearful of leaving home. A teenager may have intense feelings but not want to discuss them. They may not want to attend school or participate in school-based activities. School performance may decline. Teens may become argumentative and/or withdrawn.\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220525.09.41.09"}