{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Works to Close Digital Divide for Schools in Unincorporated Area", "description": "In San Diego County’s unincorporated areas, there are many schools where high-speed internet is unavailable or unaffordable. The County is working to reduce the digital gap and has awarded $600,000 to the San Diego County Office of Education.", "datePublished": "2025-02-05T12:24:18-08:00", "url": "https://www.countynewscenter.com/county-works-to-close-digital-divide-for-schools-in-unincorporated-area/", "keywords": ["government", "comprehensive broadband plan", "equity and access", "high-speed internet", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2025-02-05T12:24:18-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteIn San Diego County’s unincorporated areas, there are many schools where high-speed internet is unavailable or unaffordable. The County is working to reduce the digital gap and has awarded $600,000 to the San Diego County Office of Education.\nThis funding will bring high-speed broadband service to 900 students in the Warner, San Pasqual and Vallecitos school districts in the unincorporated areas:\n\n$479,000 awarded to Warner Unified School District to provide fiber at three school sites.\n$73,000 awarded to San Pasqual Union School District to provide fiber to K-8 students.\n$48,000 awarded to Vallecitos Elementary School District to provide fiber to students.\n\nThis funding came from County funds designated for broadband in 2021. San Diego County Office of Education selected the schools to distribute awards to build high-speed internet capacity. Prioritizing the most in-need areas is in line with the County’s Comprehensive Broadband Plan.\nAccess to high-speed internet is crucial for children’s education. This initiative aims to bridge the digital divide and provide equal access to educational resources. This access enables students to take part in tech-driven learning environments for future success.\n“Ensuring students have access to reliable internet is a key step in supporting their academic achievement and fostering opportunities for growth within the community,” said Dahvia Lynch, general manager of the County’s Land Use and Environment Group leading broadband efforts for the County.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250205.12.24.18"}