{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Purple Tier Restrictions in Effect at Midnight Saturday", "description": "Beginning tomorrow, Tier 1, or Purple Tier restrictions will be in effect in San Diego County.", "datePublished": "2020-11-13T18:00:04-08:00", "url": "https://www.countynewscenter.com/purple-tier-restrictions-in-effect-at-midnight-saturday/", "keywords": ["health", "coronavirus", "covid-19", "purple tier", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-11-13T18:23:49-08:00", "articleType": "article", "articleContent": "\n\nBeginning tomorrow, Tier 1, or Purple Tier restrictions will be in effect in San Diego County.\nThe Purple Tier is the most restrictive level of the State’s system that limits activities based on risk of spreading COVID-19.\nThis means that indoor operations at restaurants, gyms, places of worship and movie theaters must end.\nThe County will remain in the Purple Tier for at least three weeks and will not be able to go back to the Red Tier, and fewer restrictions, until it posts a case rate below 7 cases per 100,000 residents for two weeks in a row.\nA new COVID-19 case rate map shows how local cities and communities are being impacted by the virus.\n\nCommunity Setting Outbreaks:\n\nFour new community outbreaks were confirmed on Nov. 12: in a grocery setting, a distribution warehouse, a business and a retail setting.\nIn the past seven days (Nov. 6 through Nov. 12), 48 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n14,663 tests were reported to the County on Nov. 12, and the percentage of new laboratory-confirmed cases was 4%.\nThe 14-day rolling average percentage of positive cases is 3.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,826.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n611 new cases were confirmed among San Diego County residents on Nov. 12. The region’s total is now 62,945.\n4,154 or 6.6% of all cases have required hospitalization.\n947 or 1.5% of all cases and 22.8% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nThree new deaths were reported in the County on Nov. 12. The region’s total is now 921.\nOne woman and two men died between Nov. 8 and Nov. 10. Their ages ranged from mid-50s to early 90s.\nTwo had underlying medical conditions. It is unknown at this time if the third had underlying conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201113.18.00.04"}