{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pop-up Resource Fair For Unsheltered Harbor Area Neighbors", "description": "Thursday morning the County of San Diego and partners set up a pop-up fair for unsheltered neighbors in downtown’s Harbor View neighborhood. Services available included providing EBT cards to qualified people so they can buy food and necessities. People also could see if they were eligible for CalWorks or Medi-Cal, and check in for case management.", "datePublished": "2023-10-13T10:37:44-07:00", "url": "https://www.countynewscenter.com/pop-up-resource-fair-for-unsheltered-harbor-area-neighbors/", "keywords": ["housing", "hhsa", "homeless", "hsec", "resource fair", "unsheltered"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-10-16T16:02:21-07:00", "articleType": "article", "articleContent": "\nThursday morning the County of San Diego and partners set up a pop-up fair for unsheltered neighbors in downtown’s Harbor View neighborhood. Services available included providing EBT cards to qualified people so they can buy food and necessities. People also could see if they were eligible for CalWorks or Medi-Cal and check in for case management.\nPop-ups like these are overseen by the County’s Homeless Solutions and Equitable Communities team. The goal is to connect people with services that will assist them in securing permanent housing in the future.\nParticipating partners included People Assisting the Homeless (PATH), San Diego County Sheriff’s Homeless Assistance Resource Team (HART), Harbor Police, San Diego Police, and County Public Health Nurses.\nWorking together, the partners canvassed the area to bring people in need to the resource fair, which was set up at Waterfront Park. More information on the County’s Health and Human Services Agency and available services and resources can be found online.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231013.10.37.44"}