{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegan Tests Positive for COVID-19 Variant First Identified in Brazil", "description": "A San Diego woman in her late 40s is the first local case of the COVID-19 variant first identified in Brazil, the County Health and Human Services Agency announced today.", "datePublished": "2021-03-24T17:01:37-07:00", "url": "https://www.countynewscenter.com/san-diego-woman-tests-positive-for-brazilian-covid-19-variant/", "keywords": ["health", "brazilian variant", "coronavirus", "covid-19", "p.1"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-03-29T08:59:21-07:00", "articleType": "article", "articleContent": "\nA San Diego woman in her late 40s is the first local case of the COVID-19 variant first identified in Brazil, the County Health and Human Services Agency announced today.\nThe woman’s sample was collected on March 5 and went through genome sequencing, which is not available until 2-4 weeks after testing.\nThe woman had not been vaccinated, was not hospitalized and, since she had no known travel history, is believed to have been exposed to someone in the community. The case investigation identified six close contacts outside the woman’s household.\nA second case of the P.1 or Brazilian variant was detected locally, but the person, who also had not been vaccinated, is not a San Diego County resident.  Four cases of the P.1 coronavirus variant have been reported in California through March 19.\nThere is some evidence that the P.1 and other new variants are more easily spread, but the P.1 variant is not believed to cause more severe illness or increase the risk of death.\n“San Diegans should not be alarmed. The COVID-19 vaccines currently available do offer some protection against most of the variants,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should continue taking the preventive measures that work against all variants of the novel coronavirus.”\nSan Diegans should do the following now more than ever:\n\nWear a mask\nWatch your distance from others\nWash your hands\nWhen it’s your turn, get vaccinated\n\nThrough March 23, a total of 336 cases of the B.1.1.7, known as the UK variant, had been identified in the region. No cases of the variant first identified in South Africa have been reported in the region.\nA report on the COVID-19 variants is published every Wednesday at www.coronavirus-sd.com.\nVaccination Progress:\n\nNearly 1.6 million COVID-19 vaccine doses have been delivered to the region, and more than 1.5 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, more than 510,000 County residents, or 19% of San Diegans 16 and older, are fully immunized.\nOverall, almost 840,000 County residents have received at least one shot of the two-dose vaccines. That’s 31.2% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 5.5 cases per 100,000 residents. The County is in the Red Tier.\nCurrently, the testing positivity percentage is 2.4%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 3.4% and is also in the Orange Tier or Tier 3.\nWhile two of the three metrics qualify the County for the Orange Tier or Tier 3, the state assigns counties to the more restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, March 30.\n\nCommunity Setting Outbreaks:\n\nFive new community outbreaks were confirmed March 23. Two in business settings, one in a faith-based setting, one in a restaurant/bar setting and one in a retail setting.\nIn the past seven days (March 15 through March 21), 15 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n11,282 tests were reported to the County on March 23, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 2.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,203.\n\nCases, Hospitalizations and ICU Admissions:\n\n257 COVID-19 cases were reported to the County on March 23. The region’s total is now 268,417.\n14,017 or 5.2% of all cases have required hospitalization.\n1,630 or 0.6% of all cases and 11.6% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n11 new COVID-19 deaths were reported March 23. The region’s total is 3,509.\nSix women and five men died between Jan. 23 and March 22.  new COVID-19 deaths were reported March 20.\nOf the people who died, five were 80 years of age or older, four were in their 70s, one was in their 60s and one was in their 50s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210324.17.01.37"}