{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Finds Interactive Way to Help Clients", "description": "To help clients reenter the community, the County’s Probation Department held its first interactive resource fair for those in the East County.", "datePublished": "2024-04-19T14:51:34-07:00", "url": "https://www.countynewscenter.com/probation-finds-interactive-way-to-help-clients/", "keywords": ["public safety", "county probation", "reentry", "resource fair"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-04-19T17:13:13-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesTo help clients reenter the community, the County’s Probation Department held its first interactive resource fair for those in the East County.\nPotential employers were among 60 organizations at the resource fair. Housing, employment, medical, mental health and substance abuse resources were also available.\nThe free event was held outside the East County Court House in El Cajon on Wednesday. The Live Well Mobile Office offered health services. The Salvation Army, Feeding San Diego, Goodwill, Legal Aid Society and others also provided needed resources.\nClients not only had access to employment and medical services, but they were also able to get a free haircut and shave with Empire Barber & Shave Co. to help them get ready for that next job interview.\nAs part of the Resource Fair, Probation officers held a type of scavenger hunt. Clients were given a card to stop by certain booths and once completed, received a gift card to a restaurant. Probation officers could talk and walk with their clients as they were connected to real time, available quality services.\n\nSupervising Probation Officer Ana Diaz organized the event. She said she saw a great need to let people in the East County know about all the resources available to them.\n“We decided to provide a space for organizations within the community to come together and provide services to clients during their probation appointments to help with reentry services,” Diaz said. “This Resource Fair is to assure clients that Probation is part of their rehabilitation.”\nJason Rodriguez, who is a justice-involved client, shared what he went through to get back on his feet and how he achieved success.\n“If you’re struggling with that lifestyle or you just got to that age where you’ve had enough, don’t feel weak to reach out for help,” said Rodriguez. “Anybody can give you a helping hand, but what are you going to be able to do with that help.”\nAlcohol and Drug Program Specialist Claudia Fallow said “We just wanted to change the face of Probation. We’re here for our clients to show them that there are other opportunities out there. Whatever their needs are, we’re here to meet them.”\nTo learn more, visit the Probation Department’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240419.14.51.34"}