{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: New Multi-Use Sports Court Unveiled at Lincoln Acres County Park", "description": "County Board of Supervisors Chairwoman Nora Vargas joined the County of San Diego Department of Parks and Recreation and its partners Thursday to celebrate the arrival of a set of retractable goal posts at Lincoln Acres County Park.", "datePublished": "2023-03-17T10:05:46-07:00", "url": "https://www.countynewscenter.com/new-multi-use-sports-court-unveiled-at-lincoln-acres-county-park/", "keywords": [], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2023-03-17T10:05:46-07:00", "articleType": "video.other", "articleContent": "\nCounty Board of Supervisors Chairwoman Nora Vargas joined the County of San Diego Department of Parks and Recreation and its partners Thursday to celebrate the arrival of a set of retractable goal posts at Lincoln Acres County Park. The innovative amenity transitions a single-use basketball court into a multi-sport court.\nSoccer players can pull up the goal posts to practice their dribbling and goal scoring skills and take the goal posts off the field when they are done so the court can be used for other activities.\nThe new moveable goal posts expand the recreation opportunities for children and their families in a densely populated urban area.\nThe addition of this new amenity aligns with Live Well San Diego, the County’s vision for healthy, safe and thriving residents and communities.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230317.10.05.46"}