{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Proactive Efforts Help as Mosquito Season Kicks Off!", "description": "In April, San Diego County began ramping up its proactive treatment of mosquito breeding sites in waterways around the county. The goal is to reduce these pests and their risk for spreading diseases, such as West Nile virus.", "datePublished": "2024-05-31T14:46:13-07:00", "url": "https://www.countynewscenter.com/proactive-efforts-help-as-mosquito-season-kicks-off/", "keywords": ["health", "health", "mosquito-borne illness", "mosquitoes", "vector control", "west nile virus"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-06-03T10:28:44-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIn April, San Diego County began ramping up its proactive treatment of mosquito breeding sites in waterways around the county. The goal is to reduce these pests and their risk for spreading diseases, such as West Nile virus.\nEvery year in spring, the County’s Vector Control Program applies a safe, eco-friendly larvicide by helicopter to treat nearly 1,400 acres of hard-to-reach areas where mosquitoes breed. This year, locations in the Tijuana River Valley with stagnant water are also being treated to protect people living or visiting in that area.\nThe larvicide does not hurt people or pets, but kills mosquito larvae before they can grow into adult biting mosquitoes.\nLarvicide drops, during the mosquito season (usually April-October), are just one part of Vector Control’s Integrated Vector Management Strategy. County Vector Control monitors over 1,600 potential mosquito-breeding areas each year and applies larvicide through a variety of techniques—aerial drops, boats, trucks, and hand-crews. It also gives out free mosquito-eating fish to the public, tracks down and treats neglected swimming pools, tests dead birds for West Nile virus, and monitors mosquito populations for potential mosquito-borne illnesses.\n You Can Make a Difference Too\nWant to protect yourself from mosquitoes? Follow our “Prevent, Protect, Report” guidelines.\nPrevent Mosquito Breeding\nDump out or remove any items inside and outside of homes that can hold water, such as plant saucers, rain gutters, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquito fish, available for free at locations throughout the county, may be used to control mosquito breeding in backyard standing water sources, such as unmaintained swimming pools, ponds, fountains, and horse troughs.\nProtect Yourself from Mosquito Bites\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nReport Increased Mosquito Activity and Dead Birds\nReport increased mosquito activity, or stagnant, unmaintained swimming pools, and other mosquito-breeding sources, as well as dead birds — dead crows, ravens, jays, hawks and owls — to the County Department of Environmental Health and Quality’s Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov. \nIf you have checked around your home for standing water and are still experiencing mosquito issues, you can request an educational mosquito inspection by contacting the Vector Control Program at (858) 694-2888.\nFor more information about mosquito-borne illnesses go to San Diego County’s “Fight the Bite” website. Here are some tips to help you keep your yard from becoming a mosquito breeding ground.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240531.14.46.13"}