{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voter Information Pamphlets Go Out for June Primary Election", "description": "Voter information pamphlets are on the way to San Diego County’s 1.9 million registered voters for the June 7 Gubernatorial Primary Election.", "datePublished": "2022-05-05T13:43:53-07:00", "url": "https://www.countynewscenter.com/voter-information-pamphlets-go-out-for-june-primary-election/", "keywords": ["elections", "fgg", "june 7 gubernatorial primary election", "registrar of voters", "sample ballot", "san diego registrar of voters", "voter information pamphlets"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-05-05T14:01:00-07:00", "articleType": "article", "articleContent": "\nVoter information pamphlets are on the way to San Diego County’s 1.9 million registered voters for the June 7 Gubernatorial Primary Election. If your voter registration is up to date, the Registrar of Voters office says you should receive the pamphlet by May 9.\nThe pamphlet contains important election information such as voting options, election deadlines, candidate statements and more. It also includes a sample of what your official ballot will look like. You may use the sample ballot to practice making your selections before marking your official ballot.\nBallots will start going out in the mail to all active registered voters the week of May 9. Voters can find a list of ballot drop box and vote center locations inside their voter information pamphlet. Voters can also see their pamphlet online.\nIf you signed up to get your voter information pamphlet electronically, you should have an email giving you the same information and a link to your pamphlet.\nVoters who want to be among the first to see their pamphlet every election can sign up to receive all future pamphlets electronically. Voters who take this option will no longer receive a paper copy in the mail but will get an email notification when the pamphlet becomes available online.\nLearn more about voting in the June Primary Election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220505.13.43.53"}