{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Paves Way for Legalization of Small Home Kitchens", "description": "The County moved a step closer to legalizing microenterprise home kitchen operations, known as MEHKOs.", "datePublished": "2021-09-15T17:22:42-07:00", "url": "https://www.countynewscenter.com/board-paves-way-for-legalization-of-small-home-kitchens/", "keywords": ["consumer", "home kitchen", "mehko"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-09-15T17:22:42-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted today to move forward with plans to legalize microenterprise home kitchen operations, or MEHKOs. MEHKOs are defined by California law as a small retail food facility, operated from a private home.\nThe state allowed local jurisdictions to begin authorizing MEHKOs in 2018. So far, seven California cities and counties, including Santa Barbara and Riverside, have legalized these home-based food operations.\nThe ordinance would legalize local home kitchens that prepare, sell and serve up to 30 meals per day, or 60 meals per week. MEHKO operators would be allowed to earn a maximum annual revenue of $50,000.\nMEHKO menus would be restricted to items that can be prepared and sold the same day and would exclude items that contain raw milk or raw shellfish. Meals could be served in the home, picked up by the customer, or delivered by the MEHKO operator.\nMEHKO operators would be required to obtain a valid health permit from the County and submit to an initial inspection and annual inspections afterwards. MEHKO operators would also be required to obtain a Food Manager Certificate and any of their employees would be required to get a Food Handler’s card.\nThe ordinance would create economic opportunities for small-scale, home-cooking operations, which are primarily operated by women, immigrants, and people of color. It would also legalize food businesses that have been making and selling food from home illegally.\nThe item was brought to the board by Vice Chair Nora Vargas and Supervisor Joel Anderson. County staff now have 120 days to return to the board with a draft of the ordinance.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210915.17.22.42"}