{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mosquito in Black Mountain Ranch Area Tests Positive for West Nile Virus", "description": "A mosquito caught in routine trapping in the Black Mountain Ranch area has tested positive for West Nile virus, the first appearance of the virus in San Diego County in 2020.", "datePublished": "2020-06-05T09:03:45-07:00", "url": "https://www.countynewscenter.com/mosquito-in-black-mountain-ranch-area-tests-positive-for-west-nile-virus/", "keywords": ["health", "mosquitoes", "west nile virus"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-06-05T09:18:43-07:00", "articleType": "article", "articleContent": "\nA mosquito caught in routine trapping in the Black Mountain Ranch area has tested positive for West Nile virus, the first appearance of the virus in San Diego County in 2020.\nCounty environmental health officials reminded people to protect themselves from mosquitoes that can potentially transmit disease by following the County’s “Prevent, Protect, Report” guidelines — including finding and dumping out standing water in yards and around homes to keep mosquitoes from breeding.\nIncidences of West Nile virus were mild in San Diego County in 2019. Three people tested positive, but there were no fatalities and all three people were suspected of having contracted the virus while outside of the county.\nHowever, West Nile virus remains a potentially deadly threat in San Diego County and the state. In 2015, 44 San Diego County residents tested positive for West Nile virus and six of them died. In 2019, 225 California residents became sick from West Nile virus and six died, according to the California Department of Public Health.\nWest Nile virus is mainly a bird disease, but it can be transmitted to humans by a number of species of mosquitoes — including Culex mosquitoes native to San Diego and, less effectively, by invasive Aedes aegypti mosquitoes also found in San Diego County — if they feed off an infected animal, mainly birds, and then bite people.\nEight out of 10 people who get infected never suffer any symptoms. The 20% who do generally suffer mild symptoms including headache, fever, nausea, fatigue, skin rash or swollen glands. But in rare cases, West Nile virus can make people extremely ill and even kill them.\nAdditional Mosquito-Borne Illness Worries\nProtecting against mosquitoes has become even more important for San Diego County residents in recent years. Since 2014, three types of day-biting, invasive Aedes mosquitoes have been found in San Diego County. All of these mosquitoes like to live and breed near people, in yards and even inside homes. Two of these species can potentially transmit diseases not naturally found here. Those include chikungunya, dengue and Zika — but only if mosquitoes first bite an infected person. In general, that means local invasive Aedes mosquitoes could only transmit those diseases if they found and bit San Diego County residents who picked up the virus while traveling and returned home still infected.\nCounty officials reiterated that people should help protect themselves from mosquitoes and potential illnesses by following the County’s “Prevent, Protect, Report” guidelines.\nPrevent mosquito breeding\nSan Diego County residents may be more vulnerable to being bitten by mosquitoes around their homes now because many have been spending more time at home because of the coronavirus pandemic. So remember to dump out or remove any item inside or outside of homes that can hold water, such as plant saucers, rain gutters, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquito fish, available for free by contacting the Vector Control Program, may be used to control mosquito breeding in backyard water sources such as stagnant swimming pools, ponds, fountains and horse troughs.\nProtect yourself from mosquito bites\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nReport possible mosquito activity and dead birds\nReport increased mosquito activity, or stagnant, green swimming pools and other mosquito-breeding sources, as well as dead birds — dead crows, ravens, jays, hawks and owls — to environmental health’s Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov. Also report if you are being bitten by mosquitoes during daylight hours, or if you find mosquitoes that look like invasive Aedes mosquitoes — small, black with white stripes on legs and backs — by contacting the Vector Control Program at (858) 694-2888.\nFor more information about mosquito-borne illnesses, go to San Diego County’s “Fight the Bite” website.\nHere are some tips to help keep your yard from becoming a mosquito breeding ground.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200605.09.03.45"}