{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Keep It Up San Diego – Vote Early", "description": "With less than two weeks left to vote in the Sept. 14 California Gubernatorial Recall Election, the Registrar’s office reports 553,776 San Diego County voters have already cast their ballots. ", "datePublished": "2021-09-02T12:41:53-07:00", "url": "https://www.countynewscenter.com/keep-it-up-san-diego-vote-early/", "keywords": ["elections", "elections", "gubernatorial recall election", "registrar of voters", "rov"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-09-02T12:41:53-07:00", "articleType": "article", "articleContent": "\nWith less than two weeks left to vote in the Sept. 14 California Gubernatorial Recall Election, the Registrar’s office reports 553,776 San Diego County voters have already cast their ballots.\nIf you are voting using the mail ballot you have received, remember to sign and date your envelope, seal your completed ballot inside and return it to a trusted source. You can return it by mail, no postage needed, or to one of the Registrar’s official 131 mail ballot drop-off locations around the county.\nCheck each location’s hours of operation at sdvote.com before heading out. Mail ballot drop-off locations and the Registrar’s office will be closed Monday, Sept. 6 in observance of Labor Day.\n“If you know how you want to vote, mark your ballot and return it to a trusted source right away,” said Interim Registrar Cynthia Paes. “The sooner we get your mail ballot back, the sooner we can start processing it. Your ballot can be in the first release of election night results if you act early.”\nIf you want to vote in person that option is available too. Avoid long lines and take advantage of early voting:\n\nAt the Registrar’s office, 8 a.m. to 5 p.m., Monday through Friday (closed Sept. 6)\nAt any one of 221 voting locations or the Registrar’s office that are open from 8 a.m. to 5 p.m. Saturday, Sept. 11, Sunday, Sept. 12 and Monday, Sept. 13.\n\nAll voting locations will again be open from 7 a.m. to 8 p.m. on Election Day, Tuesday, Sept.14.\nIf you plan to drop off your mail ballot or vote in person, we encourage you to wear a face covering, maintain a comfortable distance and avoid gathering in groups.\nTo learn more about voting in the upcoming recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210902.12.41.53"}