{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Department Welcomes New Canine Narcotic Detection Team", "description": "Meet Officer Brianne Penny and Romi, the San Diego County Probation Department's new Canine (K-9) Narcotic Detection Team.", "datePublished": "2023-10-06T10:13:19-07:00", "url": "https://www.countynewscenter.com/probation-department-welcomes-new-canine-narcotic-detection-team/", "keywords": ["public safety", "canine officer", "dog", "dogs", "east mesa juvenile detention facility", "probation", "public safety", "youth transition campus", "ytc"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2023-10-06T10:13:19-07:00", "articleType": "article", "articleContent": "\nMeet Officer Brianne Penny and Romi, the San Diego County Probation Department’s new Canine (K-9) Narcotic Detection Team.\nOn Sept. 21, 2023, Officer Penny and Romi completed an intensive 10-week Basic Scent Detection Academy and will be primarily assigned to Institutional Services moving forward.\nThe pair will routinely conduct random searches at the East Mesa Juvenile Detention Facility and the Youth Transition Campus.\nRomi, a two-year-old Labrador retriever, is trained to detect cocaine, fentanyl, heroin and methamphetamine.\n“He’s super happy and easygoing, but when it’s go time, he can focus,” said Officer Penny. “He’s definitely good at letting me know when he detects something.”\nRomi’s indication he has detected something is a point, so he will stop and freeze to let his partner know what he has found.\nAfter successfully detecting a drug, Officer Penny will mark the success with a clicker and then reward her K-9 partner with a treat. Romi’s favorite toy is a classic tennis ball.\nOfficer Penny and Romi will work to provide more safety and security at the facilities and potentially save a life.\n“It’s been a big learning experience and challenging at times, but overall it’s been amazing,” Officer Penny said.\nThe K-9 team will also attend special events and provide presentations and demonstrations of the canine’s capabilities throughout the community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231006.10.13.19"}