{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Let’s Go Gramping", "description": "The County recently hosted one of its most popular events for Grandparents Raising Grandchildren called Gramping. Not only was it exciting, it was also in tents.", "datePublished": "2023-11-30T15:30:51-08:00", "url": "https://www.countynewscenter.com/lets-go-gramping/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-11-30T15:30:51-08:00", "articleType": "video.other", "articleContent": "\nRetirement, relaxation and leisurely travel are a distant dream for the more than 24,000 San Diego families where grandparents are raising grandchildren. Thrust into the role as primary caregiver, these grandparents often have little preparation time and face a huge learning curve in today’s tech driven world.\nGrandparents face other challenges too, including finances on a fixed income, physical limitations, housing insecurity, legal support and health coverage. The most common reasons grandparents become primary care givers is due to illness, incarceration, addiction, or death of a biological parent. These difficulties are why 19% of grand families live in poverty.\nPrograms and Resources are available to help ease some of the hardships grandparents raising grandchildren face including affordable, recreational opportunities where grandfamilies can connect. One of county’s more popular organized events is called “Gramping.” The County’s Department of Homeless Solutions and Equitable Communities coordinates an adventure-filled campout at Dos Picos Park in Ramona, where fun, laughter and bonding have become second nature.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231130.15.30.51"}