{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "‘Tis the Season for Scams", "description": "The holiday season is prime time for scammers, with thousands of older adults scammed each year in San Diego County.  ", "datePublished": "2024-12-17T09:41:32-08:00", "url": "https://www.countynewscenter.com/tis-the-season-for-scams/", "keywords": ["families", "ais", "community", "da", "elder justice task force", "equity", "older adult", "scam"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-12-17T09:41:32-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe holiday season is prime time for scammers, with thousands of older adults scammed each year in San Diego County.  \nSan Diegans over the age of 60 often become victims of scams, on average losing over $30,000, according to the FBI’s 2023 Elder Fraud Report. Older adults are often retired with no way to recover their life savings, whereas younger adults have more time to remedy their financial situation. \nFor years, local law enforcement lacked the tools and resources to investigate these cases and there was less connection between the FBI and the County’s Adult Protective Services (APS), which was receiving thousands of suspicious reports a year. In 2021 the law changed, allowing the agencies to share that vital information. \nThat same year, County Aging & Independence Services (AIS), the District Attorney’s Office and law enforcement representing jurisdictions throughout the region teamed up with the FBI to create the Elder Justice Task Force to investigate older adult scam cases and bring criminals to justice. To date, the task force has helped recover $3.3 million and both the District Attorney and U.S. Attorney’s office have successfully prosecuted the criminals involved. \nExperts say scammers use layered schemes and fool people in different ways. Phone calls, texts, email and pop ups that appear to be legitimate communications from a bank, family member or government agency are ultimately tricks to steal money. They also note that no government agency will urge anyone to pay something immediately, especially with a wire transfer, gold, bitcoin or gift cards. \nIf you feel like you’re falling for a scam, follow these guidelines: \n\nStop engaging \nHang up, or close the device window \nLook up the business online and call that number \nIf it’s a friend or family member, call them directly using a number you have used before. \n\n“No one should be embarrassed if they fall victim to a scam, it can happen to anyone,” said Jessica Salazar, supervisor for the financial abuse unit at the County’s Adult Protective Services. “It’s important as soon as you realize something is wrong to call your financial institution and let them know in detail what happened. That is the best way to try and get your money back.” \nSalazar is part of a team focused on investigating older adult scam cases. Her team is busy with a steady flow of cases and collaborates with other teams in APS to manage the heavy caseload. \nThe County provided 33 Don’t Get Hooked trainings for more than 700 San Diegans across the region between July 2023 and June 2024. Older adults, caregivers, family and friends of those most at risk learned about common scams, protection strategies, what to do if scammed, and signs to watch for to determine if a loved one is being scammed. \n“Every day in San Diego more than a dozen seniors are likely walking into their banks after being traumatized by scammers and are trying to withdraw their life savings, convinced that their financial accounts have been compromised,” said Scott Pirrello, deputy district attorney.  \nIf you or a loved one has been scammed, report your case to local law enforcement and file a report with the FBI at www.IC3.gov.  To report any type of suspected financial elder abuse, please contact the APS Hotline at 800-339-4661. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241217.09.41.32"}