{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "988 Suicide and Crisis Lifeline Adds to County’s Resources", "description": "People experiencing a suicide, mental health or substance use crisis will now be able to call or text to a three-digit 988 dialing code to get help for themselves or a loved one.", "datePublished": "2022-07-14T09:57:50-07:00", "url": "https://www.countynewscenter.com/?p=208960", "keywords": ["health", "988", "access and crisis line", "suicide"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-07-14T10:25:13-07:00", "articleType": "article", "articleContent": "\nPeople experiencing a suicide, mental health or substance use crisis will now be able to call or text to a three-digit 988 dialing code to get help for themselves or a loved one.\nStarting July 16, San Diegans will be able to call 988 and be connected to a trained counselor who can help them and connect them to services in the area where they live. This new service is in addition to the County’s Access and Crisis Line (ACL) at (888) 724-7240.\nWith its launch, 988 will serve as the new nationwide phone number for connecting people to the National Suicide Prevention Lifeline, a national network of local crisis centers that provides free and confidential emotional support to people in a suicidal, mental health and/or substance use crisis, 24 hours a day, 7 days a week in the United States. People can still call or text the National Suicide Prevention Lifeline at 1-800-273-8255.\nDuring the initial rollout, calls and texts made to 988 will be connected to a local crisis call center based on the phone number the call is made from and the capabilities of the call center. For example:\n\nCalls made from San Diego County area codes, which include 619, 858, 760, and 442, will be routed directly to the Access and Crisis Line.\nCalls made from other area codes will be routed to the local crisis call center based on the caller’s area code. Texts to 988 will be transferred to a call center equipped for text and chat. In these cases, call center staff will work to deescalate the situation and reroute the client to the crisis call center closest to their current location for local services if needed.\n\nThe 988-dialing code does not replace the Access and Crisis Line, which is already a partner of the National Suicide Prevention Lifeline.\n“Anyone struggling with a substance use or mental health issue, such as depression, anxiety, suicide, loss, or anger, can call the Access and Crisis Line to speak to a representative,” said Dr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency. “ACL clinicians are trained to respond to behavioral health-related questions and crisis situations and can provide compassionate and knowledgeable support to callers.”\nConfidential and free of charge, the Access and Crisis Line offers support and resources countywide in over 200 languages from experienced counselors on all behavioral health, mental health and substance use topics, including but not limited to:\n\nAlcohol and substance use support services\nCrisis intervention\nMobile crisis response services\nMental health referrals\nSuicide prevention\n\nIn 2020, suicide claimed the lives of more than 44,000 Americans, and evidence suggests that the COVID-19 pandemic has exacerbated suicidal thoughts and actions. Locally, 419 suicides were reported that same year.\nHelp is always available by calling the County’s Access and Crisis Line at 888-724-7240 or by visiting www.Up2SD.org. Individuals in need of immediate medical attention should call 9-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220714.09.57.50"}