{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Some Indoor Restrictions Lifted, Businesses Must Follow Guidelines", "description": "The County is asking businesses and organizations allowed to reopen indoor operations under new state guidance to review and redo their safe reopening plans to ensure they stay in compliance.", "datePublished": "2020-08-31T18:16:05-07:00", "url": "https://www.countynewscenter.com/some-indoor-restrictions-lifted-businesses-must-follow-guidelines/", "keywords": ["health", "business reopenings", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-08-31T18:16:05-07:00", "articleType": "article", "articleContent": "\nThe County is asking businesses and organizations allowed to reopen indoor operations under new state guidance to review and redo their safe reopening plans to ensure they stay in compliance.\nThe state introduced a new tiered system Friday that allows certain indoor activities to resume in San Diego County as early as today. However, businesses must adhere to industry-specific guidelines and follow hygiene, social distancing and face covering requirements.\nWhile many sectors can reopen, not all can operate at full capacity. Gyms and fitness centers can operate indoors but must limit attendance to 10% capacity or less.\nRestaurants can open indoor dining but must limit indoor operations to 25% capacity or 100 people, whichever is lower. Places of worship and movie theaters can operate indoors under those same capacity limits. Museums can open at 25% capacity.\nHair salons, barber shops and nail salons can operate indoors at full capacity but must follow safety precautions outlined by the state and county.\n“Under the latest health order, businesses will be required to implement a sign-in procedure, collecting contact information for patrons served indoors,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “This process will assist disease investigators in case an outbreak is traced to a particular business.”\nBusinesses can find the guidelines that apply to their industry on the state’s COVID-19 website. Business owners can also email the county with specific questions about reopening guidance for their sector.\nNew State Metrics\nUnder the new state monitoring metrics, San Diego County is currently in Tier 2, also referred to as the Red Tier. That’s the second-most-restrictive of four total tiers outlined by the state, indicating that transmission of the virus is substantial.\nTiers are based on two metrics, case rate and the percentage of positive tests. To remain in the Red Tier, or Tier 2, the county will have to report between four to seven COVID-19 cases per 100,000 residents per day and a positivity rate between 5%-8%.\nSan Diego’s state-calculated case rate is currently 5.8 and the testing positivity percentage is 3.8%.\nTo move to the next lower-risk tier, the County will have to report between 1-3.9 new COVID-19 cases per 100,000 residents per day and a positivity rate between 2-4.9% for at least two consecutive weeks.\nThe state will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 8. Counties can only move one tier at a time and must wait at least 21 days between moves.\n“To maintain our current status or to move to a less restrictive tier, we need continued support from the community,” Wooten said. “We must build on our success and continue to focus on protecting one another.”\nCommunity Setting Outbreaks:\n\nTwo new outbreaks were identified on Aug. 30, one in a restaurant/bar and one in a business setting.\nIn the past seven days, 16 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n5,731 tests were reported to the County on Aug. 30 and the number of laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 3.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 6,543.\n\nCases:\n\n304 new cases were reported in San Diego County on Aug. 30 for a total of 38,604.\n3,111 or 8.1% of cases have required hospitalization.\n750 or 1.9% of all cases and 24.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported in San Diego County on Aug. 30. The region’s total remains at 682.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200831.18.16.05"}