{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voter Information Pamphlets Go Out to Registered Voters  for District One Special Primary Election", "description": "Voter information pamphlets are on their way to over 376,000 registered voters in the County of San Diego’s First Supervisorial District for the April 8 special primary election.", "datePublished": "2025-02-28T12:07:45-08:00", "url": "https://www.countynewscenter.com/voter-information-pamphlets-go-out-to-registered-voters-for-district-one-special-primary-election/", "keywords": ["elections", "2024 special primary election", "april 8", "april 8 special primary election", "d1 special primary election", "fgg", "registrar of voters", "voter information pamphlets"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-02-28T12:07:45-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesVoter information pamphlets are on their way to over 376,000 registered voters in the County of San Diego’s First Supervisorial District for the April 8 special primary election.\nThe Registrar’s pamphlets contain information on voting options, election deadlines, candidate statements and more. It also includes a sample of what your official ballot will look like. Additionally, voters can find a list of official ballot drop boxes and vote centers inside their voter information pamphlet or online at sdvote.com.\nVoters may also look up their pamphlets online with the View Voter Information Pamphlet (Sample Ballot) tool at sdvote.com.\nIf you signed up to get your voter information pamphlet electronically, you should have received an email giving you the same information and a link to your pamphlet.\nVoters who want to be among the first to see their pamphlet every election can sign up to receive all future pamphlets electronically. Voters who take this option will no longer receive a paper copy in the mail but will get an email when the pamphlet becomes available online.\nRegistered voters in District 1 will receive a ballot in the mail the week of March 10. The official ballot packet will include an “I Voted” sticker, voting instructions and other important election information.\nThe person elected will fill the district’s vacant seat for the remainder of the current term that ends in January 2029. If no candidate receives a majority vote at the April 8 election, the top two vote-getters will move on to the special general election on July 1. Only those who live in the district can vote in the election.\n\nDistrict 1 runs from the Pacific Ocean to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The district includes the cities of Chula Vista, Imperial Beach, National City and some communities within the City of San Diego, including Barrio Logan, East Village, Golden Hill and more. It also includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside and La Presa.\nIf you’re not sure if you reside in District 1, you can look it up at sdvote.com.\nLearn more about voting in the District 1 special primary election at sdvote.com or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250228.12.07.45"}