{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Updates Plan for Sustainable Housing Options in Unincorporated Area", "description": "As part of its focus on climate action and equitable housing opportunities, the County is taking a closer look at where it makes the most sense to support future housing development in the unincorporated area.", "datePublished": "2023-12-06T13:44:57-08:00", "url": "https://www.countynewscenter.com/county-updates-plan-for-sustainable-housing-options-in-unincorporated-area/", "keywords": ["housing", "affordable housing", "equity and access", "lueg", "sustainability and addressing climate change"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2023-12-06T13:44:57-08:00", "articleType": "article", "articleContent": "\nAs part of its focus on climate action and equitable housing opportunities, the County is taking a closer look at where it makes the most sense to support future housing development in the unincorporated area.\nCalled the Development Feasibility Analysis, the Board of Supervisors received an update on the effort Wednesday.\nThe analysis includes several different studies that will ultimately let the County know what it will take to build different housing types, including affordable and workforce options, in four initial key areas: Buena Creek, Casa De Oro, Spring Valley, and North El Cajon/Lakeside.\nThese areas fall into categories the County has defined as infill or land located closer to services and transportation options, in support of Vehicle-Miles-Traveled guidelines for new development in unincorporated communities that will fight climate change while allowing homes to be built faster and without expensive traffic studies.\nThis is just one of many housing-related actions taken by the Board this past year including its Removing Barriers to Housing efforts aimed at creating more opportunities for affordable and workforce housing.\nThe analysis will identify barriers and constraints that have resulted in limited development on these parcels as well as strategies, actions, and costs that could remove the identified constraints to increase housing production as soon as feasibly possible.\nDuring the first phase of the initiative, County staff refined the study boundaries, informed and engaged community stakeholders, identified infrastructure gaps and created a scope of work for a consultant.\nSome things possibly preventing development in these areas include infrastructure deficiencies, small parcel sizes, and insufficient density or zoning allowances.\nResults of the detailed analyses, which will be brought back to the Board for consideration, are expected in fall of 2024.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231206.13.44.57"}