{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Put a Healthy Holiday on Your List this Season", "description": "The holidays are here, and County Health and Human Services is asking San Diegans to add a few things to their list to promote a healthy holiday season. ", "datePublished": "2023-12-21T12:44:46-08:00", "url": "https://www.countynewscenter.com/put-a-healthy-holiday-on-your-list-this-season/", "keywords": ["health", "covid-19", "flu", "rsv", "vaccinations"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-12-21T14:04:41-08:00", "articleType": "article", "articleContent": "\nThe holidays are here, and County Health and Human Services is asking San Diegans to add a few things to their list to promote a healthy holiday season.  \nThe County reports rapidly rising cases of COVID-19, flu and RSV along with associated hospitalizations.  Wastewater surveillance, which measures the amount of COVID-19 virus in sewage, is also showing sharp increases, particularly in the South Bay and north coastal areas of the County. These measurements are a good indicator of cases to come. \nAs always, vaccinations are the best protection and COVID-19 and flu vaccines are widely available at local pharmacies or medical providers. \nTesting for COVID-19 and flu is also recommended. Doctors can prescribe medications to help people from getting severely sick, especially older adults or people with underlying medical conditions. \nEveryone ages six months and older is eligible for the updated COVID-19 vaccine regardless of prior vaccination history as long as it has been two months since the last dose of any COVID-19 vaccine.  \nThe flu vaccine is recommended yearly for everyone six months and older, especially people at higher risk for getting seriously sick like young children, older adults, pregnant people and people with certain health conditions.  \nRSV or Respiratory Syncytial Virus is a common respiratory virus that can cause grave illness in young children and older adults with underlying illnesses. Pregnant people and people 60 years or older should talk with their doctor about whether the RSV vaccine is right for them.   \n“Staying current on your vaccines is the best way to protect yourself and your loved ones from getting sick,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “It’s not too late to go get your COVID-19 and flu vaccines as these viruses have not yet peaked this season.”  \nIn addition to pharmacies and other locations, vaccines are also available at County public health clinics. Check online for the days and hours sites will be open.  \nPreventative Measures \nBeyond vaccination and staying home when sick, San Diegans can take other precautions to protect themselves and others against COVID-19, the flu and RSV with these measures:  \n\nCleaning hands thoroughly and often.  \nStaying away from people who are sick.  \nCovering your cough and sneezes. \nWearing a facial covering, especially in crowded indoor settings.  \nRegularly cleaning commonly touched surfaces. \nDoing at-home tests when exposed to COVID-19 or when ill. The federal government is currently providing free at-home COVID-19 tests. Households can order a pack of four free tests through the U.S. Postal Service.  \n\nThe County Health and Human Services Agency publishes the Respiratory Virus Surveillance Report weekly.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231221.12.44.46"}