{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Second Chance Job Fair for People Seeking Reentry Employment", "description": "More than 150 people attended an employer seminar and job fair this week for National Second Chance Month. The job fair is designed to help justice-involved individuals reenter the workforce through committed fair chance employers.", "datePublished": "2024-04-19T11:14:40-07:00", "url": "https://www.countynewscenter.com/second-chance-job-fair-for-people-seeking-reentry-employment/", "keywords": ["public safety", "county probation", "olse", "reentry", "sheriff"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-04-19T11:14:40-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesMore than 150 people attended an employer seminar and job fair this week for National Second Chance Month. The job fair is designed to help justice-involved individuals reenter the workforce through committed fair chance employers.\nFair chance employers are businesses that evaluate a person’s skills before considering an applicant’s criminal history.\nThe free event, hosted by the Center for Employment Opportunities (CEO) and the San Diego County Office of Labor Standards and Enforcement (OLSE), was held Tuesday and included a job fair with companies like Allied Universal, Goodwill, UC San Diego, and many other businesses who encourage sustainable practices.\nOLSE provides employers and job seekers training regarding the California’s Fair Chance Act, which was designed to reduce barriers to employment for individuals formerly incarcerated.\n“We’re excited to have so many employers here give community members an opportunity to not only find employment, but also learn about their rights and not be judged on their past but on who they really are as they seek employment,” said Branden Butler, Director of Office of Ethics Compliance and Labor Standards, which includes OLSE.\n\nReuben Davis is a participant of the Center for Employment Opportunities program which provides employment services for justice-involved job seekers who have spent time in jails, youth correctional facilities or prisons.\n“I had nothing, and CEO gave me a second chance. I learned how to operate computers and I got a job. Then, I asked CEO if I could come back and be an employer so I could pay it forward to the next person that wanted a second chance,” Davis said. “If you really want it, you’ll get it.”\nThe seminar portion included information for job seekers and encouragement from San Diego Sheriff Department Reentry Services and San Diego County Probation. Employers could also learn about California labor laws, employer rights and ways to prepare job applicants who are trying to successfully transition into the community.\nPatricia Ceballos, who manages Sheriff Reentry Services, spoke to job-seekers saying, “Our department is committed to providing reentry services and partnering with agencies like CEO and many other agencies to uplift reentry work.”\nIn 2023, the Probation Department’s adult teams referred more than 800 individuals to CEO.\n“This collaboration demonstrates our shared commitment to improve the lives of our justice-involved clients to create positive change and provide meaningful support to those who need it most,” said Probation Deputy Chief, Abigail Torres.\nFor more information on how you can ask questions and provide feedback on the proposed Fair Chance Act Ordinance for unincorporated areas of San Diego, visit OLSE’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240419.11.14.40"}