{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens New Vaccine Site at Tubman Chavez Community Center", "description": "The County’s expanding COVID-19 vaccination efforts now include the opening of a site at Tubman Chavez Community Center.", "datePublished": "2021-01-29T17:41:55-08:00", "url": "https://www.countynewscenter.com/county-opens-new-vaccine-site-at-tubman-chavez-community-center/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-01-29T20:17:27-08:00", "articleType": "article", "articleContent": "\nThe County’s expanding COVID-19 vaccination efforts now include the opening of a site at Tubman Chavez Community Center. Starting today, the site will offer COVID-19 vaccinations from 9:30 a.m. to 3:30 p.m. every Friday and Saturday.\nThe site at Tubman Chavez Community Center, 415 Euclid Ave, 92114, is one of more than a dozen sites operated by the County and its partners. All County clinics are vaccinating people in Phase 1A and people 65 years and older in Phase 1B and appointments are required.\nA new interactive map shows all of the County-operated vaccination sites now offering appointments. The map can be accessed via a link on the vaccinationsuperstationsd.com website. People 75 and older who don’t have access to a computer or the internet can call 2-1-1 for assistance in scheduling an appointment.\n“We are making a continuous effort to expand vaccination sites across the County, especially in communities that have been hit hard by COVID-19,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “When it is your turn to get vaccinated, please take advantage of this no-cost service, as the vaccine is the best tool we have to end this pandemic.”\nAn additional vaccination site will come online at the California State University San Marcos campus on Sunday, Jan. 31. The new pedestrian site will be vaccinating people, with appointments, from 9:30 a.m. to 5:30 p.m. Sunday through Thursday and appointments for that site will become available tomorrow afternoon.\nCounty, UC San Diego Health Seeking Volunteer Vaccinators\nThe County and UC San Diego Health are looking for doctors, nurses and other medical professional staff to be COVID-19 vaccinators at the Vaccination Super Station at Petco Park. The site offers appointments between 7:00 a.m. and 7:00 p.m. seven days a week and the greatest need for volunteers is between 12:30 p.m. and 8:00 p.m. on weekdays.\nVolunteers are eligible to receive the COVID-19 vaccine. Those interested in volunteering can learn more or sign up here.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 49.6 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 12.6%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 16.7% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 2.\n\nCommunity Setting Outbreaks:\n\n11 community outbreaks were confirmed Jan. 28: three in business settings, two in TK-12 school settings, one in a community-based organization, one in a daycare/preschool/childcare setting, one in a distribution warehouse setting, one in a government setting, one in a healthcare setting and one in a retail setting.\nIn the past seven days (Jan. 22 through Jan. 28), 59 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n28,595 tests were reported to the County on Jan. 28, and the percentage of new positive cases was 6%.\nThe 14-day rolling average percentage of positive cases is 9.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 21,407.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases:\n\n1,670 cases were reported to the County on Jan. 28. The region’s total is now 234,640.\n9,785 or 4.2% of all cases have required hospitalization.\n1,401 or 0.6% of all cases and 14.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n37 new COVID-19 deaths were reported Jan. 28. The region’s total is 2,571.\n18 women and 19 men died between Dec. 29 and Jan. 27.\nOf the 37 deaths reported today, 19 people who passed away were 80 years or older, 10 people were in their 70s, five people were in their 60s, two people were in their 50s and one person was in their 40s.\n36 had underlying medical conditions and one did not have any medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210129.17.41.55"}