{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Expanding Opportunities for Boys and Men of Color", "description": "An event was held Thursday at the Southeastern Live Well Center focused on expanding opportunities for boys and men of color in San Diego County. ", "datePublished": "2024-05-24T14:20:06-07:00", "url": "https://www.countynewscenter.com/expanding-opportunities-for-boys-and-men-of-color/", "keywords": ["government", "andrew strong", "monica montgomery steppe", "oerj", "office of equity and racial justice"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-05-24T14:20:06-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteAn event was held Thursday at the Southeastern Live Well Center focused on expanding opportunities for boys and men of color in San Diego County. \nThe County’s Office of Equity and Racial Justice (OERJ) partnered with California Funder’s for Boys and Men of Color (CFBMoC) and Catalyst of San Diego and Imperial Counties to put on the event. \nThe organizations brought grant makers, policymakers, community-based organizations and local leaders together to strengthen the network of leaders committed to the health and well-being of San Diego County’s boys and men of color. \nThe event opened with an introduction and welcome remarks from: \n\nChris Cooper, Program Officer, Sierra Health Foundation & The Center \nAndrew Strong, Director, San Diego County OERJ \nSupervisor Monica Montgomery Steppe, San Diego County District Four \nChet P. Hewitt, CEO, Sierra Health Foundation & The Center \nMegan Thomas, President and CEO, Catalyst of San Diego & Imperial Counties \n\nThe agenda for the event included presentations on the Forward Change Life Course Framework and investing in narrative change and storytelling in San Diego.  \nFollowing the presentations, representatives with local community-based organizations participated in a fireside chat and community discussion. The discussion focused on exploring opportunities and addressing barriers for boys and men of color in San Diego. \nCFBMoC, which has primarily focused on Los Angeles County, partnered with OERJ to expand their efforts in the San Diego region.  \nTheir goal is to work with local philanthropic organizations to show the needs for uplifting boys and men of color. They also aim to find grant opportunities for San Diego-based community organizations. \nThe County’s 2024-25 Recommended Budget includes $500,000 to implement the Uplift Boys & Men of Color initiative. The initiative would help connect at-risk youth to wrap-around services, trauma support systems and workforce development opportunities. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240524.14.20.06"}