{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Recognizes Staff for Commitment to Changing Lives", "description": "San Diego County Probation is celebrating National Pretrial, Probation and Parole Supervision Week and California Probation Supervision Week, both of which take place July 21-27.", "datePublished": "2024-07-26T09:47:38-07:00", "url": "https://www.countynewscenter.com/probation-recognizes-staff-for-commitment-to-changing-lives/", "keywords": ["public safety", "parole", "pretrial", "probation", "staff"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-07-26T10:32:58-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSan Diego County Probation is celebrating National Pretrial, Probation and Parole Supervision Week and California Probation Supervision Week, both of which take place July 21-27.\nThe department held a staff luncheon for employees on Wednesday in recognition of all the meaningful work they do in the course of their Probation careers.\n“Thank you for your service, your perseverance, and your commitment to making a difference and changing lives,” said Chief Probation Officer Tamika Nelson to her department.\n“This is an opportunity to recognize that we are part of over 100,000 community corrections professionals around the country who work hard to keep our communities safe. This is a time to reflect on the important work we do and the role we play in our justice system.”\nThe theme this year is Wellness Unveiled: Navigating the Journey, so Probation built out the week with themed days and special events including therapy dog visits, a webinar on strategies for thriving, and more.\nThe San Diego County Board of Supervisors also proclaimed the week of July 21-27 to be Pretrial, Probation and Parole Supervision Week “for their continued commitment to positively impacting thousands of families” in San Diego County.\nIn a state proclamation, Gov. Gavin Newsom said, “Probation professionals play a unique and essential role in our justice system and our state, fostering a safer environment for all Californians by providing justice-involved individuals with the supports, services and tools necessary to transition out of the system permanently and onto a healthier and safer life path.”\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240726.09.47.38"}