{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Parks Honors Region’s Champion Volunteers", "description": "Volunteers who go above and beyond when donating their free time were recognized for their efforts recently during the County Parks and Recreation Department’s fifth Champion Awards ceremony at Heritage Park.", "datePublished": "2021-11-15T11:50:54-08:00", "url": "https://www.countynewscenter.com/county-parks-honors-regions-champion-volunteers/", "keywords": ["parks and rec", "building community award", "champion awards", "county parks and recreation department", "environmental education award", "park ambassadorship award", "parks and recreation champion"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-11-15T14:03:45-08:00", "articleType": "article", "articleContent": "\nVolunteers who go above and beyond when donating their free time were recognized for their efforts recently during the County Parks and Recreation Department’s fifth Champion Awards ceremony at Heritage Park.\nNominations are made by the public. To qualify, the nominees must volunteer their time without pay, and the work must take place in San Diego. Honorees are acknowledged for their work in parks or recreation, and for making a positive impact on their community.\nA panel of judges determines winners in three categories: Environmental Education, Park Ambassadorship and Building Community. They also select the Parks and Recreation Champion.\nHere are this year’s winners including a tie for the Building Community Award:\nParks and Recreation Champion-Lesley Handa\nAs a scientist, teacher and advocate, Handa has devoted thousands of hours to leading habitat restoration projects and interpretive programs, and hundreds more reviewing development projects to make sure they are environmentally friendly. Handa created a training program in both English and Spanish for arborists on how to protect nesting birds when trimming trees, set up her own ornithology lab to research bird population trends and serves on the board for the San Diego Audubon Society and the Friends of Famosa Slough. Handa also takes part in the Greater San Diego Science and Engineering Fair and leads volunteers during Love-Your-Wetlands events.\nEnvironmental Education Award-Greg Schuett\nSchuett helped establish Santa Ysabel’s east and west preserves, protecting more than 2,100 acres of land. He is the longest serving president and volunteer of Volcan Mountain Foundation and remains an active board member. As principal of California’s largest and longest-running 6th Grade Camp, Schuett has introduced tens of thousands of children to science and nature, and to STEM careers.\nPark Ambassadorship Award- Marisa Paige Butler\nButler works with the Friends of Rose Creek, Seal Society of San Diego and I Love a Clean San Diego to help remove thousands of pounds of garbage from trails, beaches and riverbeds. She even provides gloves, buckets, grabbers and bags. Butler takes part in Saturday morning cleanup events every week and has recruited even more volunteers to help through a Facebook group she set up called We Clean Trails San Diego.\nBuilding Community Award – Karen Ogden\nOgden took early retirement to start a non-profit organization called SOLE Effects, a program designed to help meet the social and emotional needs of young people. Influential mentors and an adventure program both help youth develop mental and emotional strength. To date, more than 56,000 mentoring hours have helped 5,132 youth move toward healthier lifestyles, acquire leadership skills and prepare for the workforce.\nBuilding Community Award – Mark DeGraffenreid\nDeGraffenreid has served for more than two decades as the head of the San Diego Floor Hockey League, a volunteer league established in the 1990s at UCSD. Seven days a week with games on Sundays, he helps both male and female players with a wide range of abilities stay active, meet new people and have fun. Over the years, DeGraffenreid has provided a much-needed outlet for hundreds of adults at risk of insufficient physical activity, loneliness and depression.\nCounty Parks also gave its Parks and Recreation Advocacy awards to Steve Goble and Frank Carson for their innovative techniques to make recreation more accessible, equitable and inclusive in the City of El Cajon.\nTo cap off the ceremony, wildlife ambassador Mike McCoy received a proclamation honoring his 50 years as a public servant. McCoy served on numerous boards involving parks, fish and wildlife. He founded the Southwest Wetlands Interpretive Association which saved the largest coastal wetland and estuary in Southern California.\nHe also shaped public policy and resource allocation to establish the Tijuana Slough National Wildlife Refuge in 1980, the Tijuana River National Estuarine Research Reserve in 1981, the San Diego Bay National Wildlife Refuge in 1999, and the designation of the Tijuana Estuary as a wetland of international importance in 2005.\nFor more information on the Parks Champion Awards, visit sdparks.org.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211115.11.50.54"}