{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Votes to Oversee Grant Program to Harden Homes in Rural Communities", "description": "The County Board of Supervisors voted unanimously Tuesday to establish a Home Hardening Program as part of a state pilot program to encourage homeowners to create fire-resistant homes.", "datePublished": "2022-06-14T16:42:57-07:00", "url": "https://www.countynewscenter.com/board-votes-to-oversee-grant-program-to-harden-homes-in-rural-communities/", "keywords": ["public safety", "county fire", "home hardening"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-06-15T08:41:48-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors voted unanimously Tuesday to establish a Home Hardening Program as part of a state pilot program to encourage homeowners to create fire-resistant homes.\nSan Diego County is one of three counties selected to take part in the California Wildfire Mitigation Program which will fund the County initiative. In December, the Board accepted a $250,000 CAL FIRE/CAL OES grant for the development of the program. CAL FIRE/CAL OES has since approved the County’s nearly $25 million grant request to implement the 3-year program. The funding is expected in the fall which will allow the project to officially kick off.\n“I am proud to serve on a Board that prioritizes fire prevention and preparedness, especially in the rural areas of my district that we know are most prone to wildfires,” said County Supervisor Joel Anderson. “Hardening homes and creating defensible spaces is crucial to saving lives, and I am grateful that three backcountry communities in District 2 will be given this opportunity for financial assistance.”\nTwo of the most effective measures that homeowners can take to protect themselves and their home from wildfire is maintaining defensible space and updating their home using fire resistant materials, also called “home hardening,” San Diego County Fire Chief Tony Mecham said.\nThe program will provide direct financial assistance, up to $40,000 dollars per home, to complete defensible space and home hardening retrofit measures. The program will help some 500 homeowners in the three-year pilot, he said.\n“Homes that lack defensible space or were built long before the modernization of the fire code are far more vulnerable during a wildfire,” San Diego County Fire Director Jeff Collins said. “The initial phase takes place in one of our highest at-risk communities, where we intend to better safeguard a number of homes with fire resistant materials and critical vegetation clearing.”\nBased on a detailed analysis of wildfire risk and vulnerability in the county, the program will assist the communities of Dulzura, Potrero and Campo, which are the highest areas of need, Mecham said.\nCounty Fire has already started outreach in the community of Dulzura and is accepting applications for those in the 91917 ZIP Code. The goal is to help harden 25 homes by year’s end. In 2023, the program will expand to Potrero with a goal for another 100 homes in both communities. By 2024, they will add Campo and set a goal to harden 375 more homes in all three communities.\nDefensible space, which includes trimming, cutting and clearing vegetation within 100 feet of a home or accessory unit, will be the first thing that the program will recommend for funding, if the home needs it.\nAfter those measures, they will look at home modifications prioritized by vulnerability to embers, radiant heat, and flame. These retrofits may include replacing roofing with a noncombustible material, installing metal gutters, and upgrading to dual-paned windows with one pane of tempered glass.\nConstruction costs will be fully covered for households under 120% of the Area Median Income. As fire has no economic barriers, homeowners who earn above the 120% Area Median Income for household will still be able to participate in the program with a cost share of between 10% to 25% of the total project cost.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220614.16.42.57"}