{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 4-12-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through April 11.", "datePublished": "2021-04-12T19:13:54-07:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-4-12-2021/", "keywords": ["health", "coronavirus", "covid-19", "update", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-12T19:13:54-07:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through April 11.\nVaccination Progress:\n\nAlmost 2.23 million COVID-19 vaccine doses have been delivered to the region, and about 2.1 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, nearly 720,000 County residents, or 26.8% of San Diegans 16 and older, are fully immunized.\nOverall, nearly 1.2 million County residents have received at least one shot of the two-dose vaccine. That’s 44% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 5.8 cases per 100,000 residents (as of April 6) and the region is in Orange Tier or Tier 3.\nCurrently, the testing positivity percentage is 2.3%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 2.6% and is also in the Orange Tier or Tier 3.\nAll three metrics place the County in the Orange Tier or Tier 3 for activities.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 13.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed April 11 in a restaurant setting.\nOne new community outbreak was confirmed April 10 in a daycare/preschool/childcare setting.\nOne new community outbreak was confirmed April 9 in a government setting.\nIn the past seven days (April 5 through April 11), 17 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n7,367 tests were reported to the County on April 11, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,344.\n\nCases, Hospitalizations and ICU Admissions:\n\n144 COVID-19 cases were reported to the County on April 11. The region’s total is now 273,430.\n14,995 or 5.5% of all cases have required hospitalization.\n1,664 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported April 11. The region’s total is 3,621. Two previously reported deaths were determined to not be San Diego County residents and were removed from the list.\nNine new COVID-19 deaths were reported April 10.\nFive men and four women died between Jan. 28 and April 9.\nOf the people who died, four were 80 years of age or older, two were in their 70s, one was in their 60s and two were in their 50s.\nEight had underlying medical conditions and one did not.\n14 new COVID-19 deaths were reported April 9.\n12 men and two women died between Jan. 1 and April 8.\nOf the people who died, seven were 80 years of age or older, two were in their 70s, two in their 60s, two were in their 50s and one was in their 30s.\n12 had underlying medical conditions and two had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210412.19.13.54"}