{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pet Adoption Fees Waived for Clear the Shelters through August", "description": "Your new best friend is waiting for you in one of our two County animal shelters in Bonita or Carlsbad.", "datePublished": "2022-08-04T16:33:14-07:00", "url": "https://www.countynewscenter.com/pet-adoption-fees-waived-for-clear-the-shelters-through-august/", "keywords": ["animals", "clear the shelters", "das", "free pet adoptions"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-08-04T16:33:14-07:00", "articleType": "article", "articleContent": "\nYour new best friend is waiting for you in one of our two County animal shelters in Bonita or Carlsbad.\nThe County Department of Animal Services currently has hundreds of dogs, cats, rabbits and other companion animals waiting to be adopted at no fee this month. County Animal Services is part of Clear the Shelters, a monthlong national effort to find caring homes for animals in shelters.\n“We will be waiving adoption fees for all animals in our care for the entire month of August to celebrate Clear the Shelters and, hopefully, clear the shelters,” said Animal Services Director Kelly Campbell. “Animal shelters across the County are at, or near, capacity, including our County shelters. Moreover, shelters in general across the country are seeing more animals coming in than going out, so we really need the public’s assistance to adopt, foster or volunteer with our County shelters to support our region’s homeless pets.”\nAll animals will be spayed or neutered, have vaccinations, a microchip and a one-year license for dogs in the service area.\nYou can start by going to our Adoptions page and browsing the beautiful and lovable animals from cats to dogs to roosters and guinea pigs available now. Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already chosen by another person. Walk-in hours are from 1 to 4 p.m. Tuesday through Friday and from from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad. Fill out an application online to print or pick one up at the shelter. Applications can also be emailed but it is quicker to go in person.\nIf you do adopt this month from the Bonita or Carlsbad shelter, Animal Services would like to add your adoption picture to our Clear the Shelter photo gallery on the Animal Services Facebook page and possibly share photos on the County Twitter and Animal Services and County Instagram pages. Send your picture to Communications.FGG@sdcounty.ca.gov.\nIf you cannot adopt, consider fostering or volunteering.\nLast year, 135 animals from our County shelters found homes as part of the virtual Clear the Shelters event. Clear the Shelters is part of a campaign by NBC-owned television stations and Telemundo to find loving homes for the millions of pets who end up in the nation’s shelters each year. Cities across the country take part in the event.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220804.16.33.14"}