{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Federal, State and Local Leaders Urge Protection Against Virus Trio", "description": "The County, with local and federal partners, hosted a joint press conference today to remind San Diegans they can take charge of protecting themselves and their families against a trio of respiratory illnesses that are circulating in the community this season.", "datePublished": "2022-11-03T17:28:45-07:00", "url": "https://www.countynewscenter.com/federal-state-and-local-leaders-urge-protection-against-virus-trio/", "keywords": ["health", "coronavirus", "covid-19", "flu", "flu shot", "influenza", "respiratory syncytial virus", "rsv", "vaccinations"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-11-03T17:28:45-07:00", "articleType": "article", "articleContent": "\nThe County, with local and federal partners, hosted a joint press conference today to remind San Diegans they can take charge of protecting themselves and their families against a trio of respiratory illnesses that are circulating in the community this season.\nIn addition to the ongoing COVID-19 pandemic, the County is seeing an early spike of flu and respiratory syncytial virus (RSV) cases. Flu cases rose by 1,198 last week and have now hit 3,735 to date, compared to 265 cases at this time last year.\nFlu cases typically do not peak until December at which time RSV begins to increase. While not an officially reportable disease, regional RSV cases reached 1,020 through October, compared with 407 for the same period last year.\nThe County is applying some of the strategies developed during the COVID-19 pandemic to keep San Diegans safe.\n“We know and have witnessed how diseases can have a disproportionate impact, especially in communities of color,” said Vice Chair Nora Vargas, County Board of Supervisors. “Our county has greatly expanded outreach and implemented innovative strategies during the COVID-19 pandemic, and I’m committed to ensuring our communities have equitable access to resources such as vaccinations, treatment, and accurate information to protect their health and safety.”\nResponding to these three viruses is not unique to San Diego. Many other areas around the nation are currently also experiencing a spike in flu and RSV cases.\n“Here’s the good news. We know everything it takes to keep us safe during the triple threat, and we also have the tools the medicines, the know-how to address that triple threat,” said U.S. Health and Human Services Secretary Xavier Becerra. “Here’s the challenging news. Will everyone listen?”\nSupporting Local Providers\nLocal public health officials, with strong support from the state and federal government, are fully engaged in supporting the already overburdened medical system to ensure everyone has access to the necessary resources.\n“We are fortunate in San Diego County to be able to draw upon the strength of a collaborative network of healthcare providers and long-standing relationships with state and federal leaders who understand our unique region and ensure we have the resources to provide equitable care and support,” said Nick Macchione, director of County Health and Human Services Agency.\nCounty health officials are collaborating with regional medical providers to support their response to the recent influx in illnesses.\n“Healthcare providers are experiencing the effects of these viruses right now in regional medical centers and clinics across our bi-national region,” said UC San Diego Chancellor Pradeep K. Khosla. “UC San Diego Health was an early leader nationally in COVID response due to its medical expertise and innovative partnerships with researchers, business and community leaders and government agencies. Leveraging the valuable lessons learned from the pandemic, I am confident San Diego will continue to be a model city for public health response through cooperation, transparency and the willingness to share resources.”\nGet Vaccinated\nVaccinations are a proven strategy for protecting community health and preparing for a potentially challenging flu season.\n“Seeing a large number of flu cases this early in the flu season typically means flu activity is going to be sustained and possibly more severe,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “If more viruses are circulating in the community, healthy people are at a higher risk of getting infected, so this year more than ever, it is critical to get vaccinated.”\nBoth the flu and COVID vaccine take two weeks to become fully effective, so people should get both shots as soon as possible.\n\nIn addition to getting vaccinated, San Diegans can also take a number of other preventative measures to avoid getting sick. These actions include:\n\nConsider a well-fitting, good-quality mask, especially indoors or in crowded spaces;\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nHigh-Risk Populations\nThe viruses currently in circulation are hitting seniors and children particularly hard. Flu and RSV patients are currently inundating local pediatric care providers, with wait times at Rady Children’s Hospital exceeding several hours last week.\n“RSV is a common virus in children that usually appears during winter months. The difference this year is that we are seeing it earlier and at unprecedented levels, which has impacted emergency department wait times and hospital capacity,” said Patrick Frias, MD, President and CEO of Rady Children’s Hospital-San Diego. “You can make a difference by getting the entire family vaccinated against flu and COVID, staying home when sick, and seeking the right level of care to ensure the sickest patients are able to access medical services in the most appropriate setting.”\nCounty schools are on the front lines of seeing the effect of the viruses effect their students and staff.\n“Schools have learned many lessons from the height of the pandemic that can support our collective efforts to care for staff, students and their families,” said San Diego County Superintendent of Schools Dr. Paul Gothold, citing increased collaboration with public health, improved air filtration systems and implementation of health practices to mitigate viruses. “As a parent myself, I want to reassure our community that we have the resources and collective experience to get through this, but it’s going to take everyone doing their part.”\nThis includes the region’s strong network of federally qualified health clinics like San Ysidro Health.\n“As a federally qualified clinic, we are extremely sensitive to the health of the communities we serve and are seeing firsthand the growth in flu and RSV cases,” said Ana Melgoza, Vice President of External Affairs at San Ysidro Health. “Like with COVID-19, we are leaning into serving our communities, delivering both treatments and promoting the prevention measures we know work, including no-cost vaccinations.”\nWhich Illness is it?\nThe flu and COVID-19 are both spread from person-to-person, especially indoors and in crowded places. Symptoms for both viruses include fever, headache, and muscle and joint pain, as well as a sore throat and coughing.\nRSV is a respiratory virus that has been detected in previous cold and flu seasons. Symptoms of RSV include cough, runny nose and fever. Treatment consists of managing symptoms and, in severe cases, hospitalization.\nSince symptoms for both the flu and COVID are similar, but treatment varies, it is recommended that San Diegans who develop flu-like symptoms get tested to determine the best treatment options. This is especially important if you have an underlying condition that puts you at an increased risk of severe outcomes from getting sick with a respiratory illness.\n(Full press conference video is available here.)\nMore Information\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221103.17.28.45"}