{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Officials Laud Local Icon Williams for Historic Contributions to San Diego County", "description": "Local elected officials and community leaders honored longtime political and equal rights leader Leon L. Williams with special awards Saturday to help celebrate his 100th birthday. Williams was awarded a Life Achievement Award by the County.", "datePublished": "2022-08-01T15:40:24-07:00", "url": "https://www.countynewscenter.com/?p=209094", "keywords": ["government", "hrc", "leon l. williams", "office of ethics and racial justice"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2022-08-01T16:07:34-07:00", "articleType": "article", "articleContent": "\nLocal elected officials and community leaders honored longtime political and equal rights leader Leon L. Williams with special awards Saturday to help celebrate his 100th birthday. Williams was awarded a Life Achievement Award by the County.\nWilliams was elected San Diego’s first Black city councilman in 1969 and first Black county supervisor in 1982. And is the namesake of the County’s Leon L. Williams Human Relations Commission.\nCommunity leaders and officials who know and worked with Williams wanted to honor his continued commitment and historic contributions to our County.\nBoard of Supervisors Chairman Nathan Fletcher thanked Williams for his years of service.\n“We know it wasn’t easy and we also know the path was made easier for others because of what you went through,” said Fletcher.\nWhile receiving the award, Williams thanked the community that he served for so many years.\n“I didn’t know that people appreciated the struggles that we all had to make, not just me, I wasn’t the only one struggling in those days to create more fairness amongst human beings,” said Williams.\nListen to Williams at 48:00. \nMany local officials participated in the program included City Mayor Todd Gloria, Rep. Sarah Jacobs, California Senate President pro Temp Toni Atkins, Jamul Indian Village of California Chairwoman Erica M. Pinto and Leon L. Williams San Diego County Human Relations Commission Chair Ellen Nash.\nThe award celebration was held at the San Diego County Administration Center and was accompanied by a resource fair featuring numerous County services and programs.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220801.15.40.24"}