{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Raises Awareness Ahead of World Tuberculosis Day", "description": "County Public Health Services is raising awareness about tuberculosis—a preventable and curable disease—ahead of World Tuberculosis Day on Monday, March 24.  ", "datePublished": "2025-03-21T14:26:44-07:00", "url": "https://www.countynewscenter.com/county-raises-awareness-ahead-of-world-tuberculosis-day/", "keywords": ["health", "latent tb", "lungs", "san diego", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-03-23T09:01:12-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Public Health Services is raising awareness about tuberculosis—a preventable and curable disease—ahead of World Tuberculosis Day on Monday, March 24.  \nTuberculosis (TB) is a communicable disease that affects one out of four people on the planet and is the leading infectious cause of death worldwide. TB most often affects the lungs and is passed through the air from person-to-person when someone who is sick with TB coughs, speaks, sings or breathes. People can also get infected with a form of TB from M. bovis bacteria when they eat unpasteurized dairy.    \nWorld TB Day marks the discovery of the TB germ by Dr. Robert Koch in 1882. The campaign aims to educate people about the impact of TB around the world and efforts to prevent people from getting sick with the disease. \nThe TB rate in San Diego County last year was 7.5 cases per 100,000 people. That is higher than California (5.4 per 100,000) and the nation (3 per 100,000).   \nIn 2024 San Diego County reported 247 active TB cases. This represents a fourth consecutive year of increasing TB incidence, starting in 2021. Globally, the World Health Organization reported that 2023 had the highest number of new TB diagnoses since global monitoring began in 1995. \nSymptoms of active TB disease can include lasting cough, fever, night sweats and unexplained weight loss. However, most people infected with TB do not get symptoms right away but instead harbor the germs in their body, which is called Latent TB infection (LTBI). Latent TB infection is asymptomatic and not contagious, but people diagnosed with latent TB infection can become sick with active TB disease at any time in the future if they do not take treatment.  \nIt is estimated that more than 175,000 San Diegans have latent TB infection and can become sick with active TB disease during their lifetimes if they do not get treated. Resources are available through the County TB Control program so you can learn whether you may be at risk for TB. \nThe San Diego County TB Elimination Initiative is a public-private partnership to end TB in the region. The County TB Control program is partnering with community organizations, healthcare providers, schools and others to teach people to know their TB risk, get tested for TB, and take treatment if they test positive. The initiative also helps to teach people that they can still get sick with TB even if they have had the BCG (TB) vaccine as a child. \nCalifornia has new legislation (AB 2132) effective Jan. 1, 2025, requiring adults seeking primary care be offered TB screening, and if they test positive, follow up care. \nThe County operates a TB and LTBI Clinic at the North Central Public Health Center, 5055 Ruffin Road for people who do not have health insurance. Public Health Services also offers testing at regional public health centers throughout the County.   \nOn March 24, the County Administration Center will be lit red in honor of World TB Day, joining other similar lighting around the country and globe including as far away as Canada and Australia. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250321.14.26.44"}