{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Recommends Vaccines including HPV Shots Ahead of the School Year", "description": "County health officials are reminding parents and guardians to put vaccines on their child’s back-to-school list.  ", "datePublished": "2024-07-25T08:42:28-07:00", "url": "https://www.countynewscenter.com/county-recommends-vaccines-including-hpv-shots-ahead-of-the-school-year/", "keywords": ["health", "back to school", "dtap", "hep b", "hpv", "mmr", "school vaccines"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-07-25T14:36:17-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty health officials are reminding parents and guardians to put vaccines on their child’s back-to-school list.  \nAs kids across the County head back to the classroom, now is a great time to revisit immunization records.  \nCalifornia requires some vaccines for children to attend school from TK through 12th grade.  \nThey include DTaP (diphtheria, tetanus and pertussis/whooping cough), Hepatitis B, MMR (measles, mumps, and rubella vaccine), chickenpox, polio and more. \n“This exciting time for families is a good opportunity to get the kids up to date on their vaccines,” said Kelly Motadel, M.D., M.P.H, County Child Health Officer. “Parents are encouraged to schedule well-child checkups with a healthcare provider to make sure their children are on track with milestones and ready for a healthy and fun school year.”  \nThe first week of August is California HPV Vaccine Week\nWhile the HPV vaccine is not one that is required for schools, it is an important vaccination for boys and girls ages 9 to 13 that helps prevent six types of cancers in adulthood. \n“The HPV vaccine is safe, effective and will protect your kids later in their lives,” Dr. Motadel explained. “I really encourage parents and caregivers to ask their child’s doctor about getting them the HPV vaccine. Doing it now can prevent 90% of future cancers caused by HPV.” \nAugust also is a good time for everyone to revisit vaccine records because it is National Immunization Awareness Month. This annual observance highlights the importance of getting recommended vaccines throughout your life. \nMore information about school vaccines and where to get them is available on the County website or by calling 211. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240725.08.42.28"}