{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Prevent Your Dog from Blasting Off Like a Rocket During Fireworks", "description": "To most people, Fourth of July fireworks are a brilliant, sparkly and celebratory treat, but for dogs and some other pets, the shrieking, booming and explosive display is terrifying and may cause them to panic and flee.", "datePublished": "2024-07-01T15:43:30-07:00", "url": "https://www.countynewscenter.com/prevent-your-dog-from-blasting-off-like-a-rocket-during-fireworks/", "keywords": ["animals", "adopt pets", "fireworks", "microchipping"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-07-01T15:43:30-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesTo most people, Fourth of July fireworks are a brilliant, sparkly and celebratory treat, but for dogs and some other pets, the shrieking, booming and explosive display is terrifying and may cause them to panic and flee.\nUnless you are certain that your pet does not react negatively to fireworks, it is not a good idea to bring a dog or other pet to a fireworks show. Panicky pets might run into traffic, get lost, or even be attacked by other animals. Last year, the County Department of Animal Services collected 165 strays, 83 dogs and 82 cats, in the week leading up to the holiday.\nPeople can prevent pets from escaping yards, homes and even their owner’s arms by taking steps to make sure dogs and pets are secured and soothed inside away from the earsplitting noise outside.\nSome other steps to keep your pet safe or reunite you quickly with your pet this Independence Day include:\n\nMake sure they are wearing their collars with identifying information on them.\nPets that are microchipped and licensed are reunited with their owners more quickly than those that are not. Microchip your pet and ensure contact information is updated. Currently and through July 7, the County shelters are offering free pet microchipping for residents of unincorporated areas of San Diego County.\nBring your pets inside your home before the fireworks start. Don’t rely on a fenced yard because fear can cause them to dig under, break through or jump over a fence. Please don’t leave them in a car either.\nProvide a quiet, calm space inside. White noise machines, sleep machines, music or a television could help provide a distraction.\nOptimally, you can reassure your pets by staying with them, but if you can’t then have someone they like and trust stay with them.\nIf you know your pet becomes seriously distressed by loud noises like thunder, consult your veterinarian to see if anxiety-relieving medication is appropriate.\n\nIf you find a lost pet in the unincorporated area of the County after the fireworks, try to secure the animal and check for a tag to notify the owner. Check social media sites and lost and found websites to see if someone is looking for their pet.\nIf you are unable to reach the owner, call County Animal Services’ 24-hour emergency dispatch number at (619) 236-2341 so the animal can be cared for at the shelter.\nIf you lost your cat or dog, you can check with neighbors, local veterinarians and pet hospitals, social media and lost and found websites such as Pawboost.com.\nYou can also check County Animal Services’ lost and found page online. And if you see your dog or cat is at County Animal Services, the County’s two shelters in Carlsbad and Bonita are open from 1o a.m. to 4 p.m. on Tuesday, July 2 through Wednesday, July 3 reclaiming animals. If your pet is lost after Wednesday or Thursday, you can pick up your pet starting at 10 a.m. Friday, July 5.\nAnimal Services is waiving the normal reclaim fees from July 3-10.\nCounty shelters are also waiving adoption and microchip fees through July 7. The Department of Animal Services’ Stars, Stripes and Snuggles promotion began June 16 in anticipation of the Fourth of July holiday when shelters traditionally see an influx of animals due to fireworks which cause some pets to run away.\nFind your new best friend by browsing the County shelters’ online animal listings. You will find loveable cats, dogs, bunnies, a tortoise, a guinea pig, fowl and pigs available on the Adoptions page.  Due to the popularity of this adoption special, Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already adopted.\nAdoption fees are always waived for senior adopters, senior pets and pets that have been waiting for their forever home for 30 days or more.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday, closed July 4 this week, at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad. Please note that the shelter will be closed June 19 for the Juneteenth holiday.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240701.15.43.30"}