{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Houdini the Husky’s Final Disappearing Act – A Forever Home!", "description": "Ladies and gentlemen, Houdini the Husky has performed his best trick yet with the help of a professional magician. The dog who needed a home after being adopted and returned seven times has vanished from the San Diego County Animal Shelter and is now in the loving and capable hands of his new best friend, a Las Vegas headlining magician.", "datePublished": "2021-01-14T15:36:21-08:00", "url": "https://www.countynewscenter.com/houdini-the-huskys-final-disappearing-act-a-forever-home/", "keywords": [], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-01-14T15:36:21-08:00", "articleType": "video.other", "articleContent": "\nLadies and gentlemen, Houdini the Husky has performed his best trick yet with the help of a professional magician. The dog who needed a home after being adopted and returned seven times has vanished from the San Diego County Animal Shelter and is now in the loving and capable hands of his new best friend, a Las Vegas headlining magician.\nAnimal Services staff sorted through more than a hundred interested applicants for Houdini, a 3-year-old Husky who earned his name for being an escape artist at some of his previous adopter homes, before making a magical decision.\n“I am happy that we have found an adopter for Houdini. We talked at length about the seven adoption returns and what Houdini would need to prevent any further such things from happening. He was incredibly understanding, and I feel that he is willing to put in the work required and has researched what will be needed,” said Donald Davis, supervising animal care attendant for the shelter.\nNew owner, Steve Wyrick, is thrilled to find a new best friend. He said he had been looking at animal shelters to find a dog but had not yet settled on one. Then he came upon an article online about Houdini, and it just clicked with him.\n“We sometimes forget that our imperfections are the very things that make us special,” said Wyrick. “In Houdini’s case, the seven different families that returned him to the shelter had various reasons why he wasn’t a perfect fit. Animal Services of San Diego shared with me a list of those reasons. What I discovered were the traits that made him challenging to some, in fact, made him so special to me.”\n“Apparently, he likes to escape from things, and I’ve been escaping from handcuffs and hanging boxes for years. Maybe he can teach me a few new tricks!” he said.\nWhile Wyrick is certainly a showman by nature and is up for having some fun with the fact that a magician was selected to adopt Houdini, he knows it will take patience and love. He doesn’t have any plans to put Houdini in his show, he is looking simply for a personal companion. Since there are no shows going on in Las Vegas during the pandemic, he plans to drive Houdini to his lakeside home in the Midwest. He has already hired a dog trainer to help him work out some of Houdini’s behavioral issues and has plans to run along the lake with him to keep him active.\nHoudini the Husky is off to live a magical life with Las Vegas headlining magician Steve Wyrick. Photo courtesy of Steve Wyrick.\nHe feels in his heart that he will be Houdini’s eighth and forever home.\n“The number eight is associated with infinity and infinite love. Now he’s going to have a magical life,” Wyrick said.\n“I hope this inspires everyone to visit their local shelter and consider adopting a best friend. There are some amazing animals that need to be rescued and given a second chance, and a third, fourth, fifth, sixth, seventh and an eighth chance,” Wyrick said with a smile.\nWhile Houdini has disappeared, people interested in adopting dogs or cats— or any of Animal Services other pets on their website — can complete an adoption application, available here, and submit it by email to DASInfo@sdcounty.ca.gov, or call Animal Services to set an appointment at (619) 767-2675.\nDue to COVID-19 precautions, DAS is offering touchless adoptions. Animal Services staff will contact people in the order their application was received and conduct the adoption process over the phone.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210114.15.36.21"}