{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "How to Stay Safe in Rainy Conditions", "description": "With rainy weather in the forecast, including the chance of flooding in some low-lying areas, emergency officials offer seven safety tips.", "datePublished": "2025-02-11T10:09:52-08:00", "url": "https://www.countynewscenter.com/how-to-stay-safe-in-rainy-conditions/", "keywords": ["public safety", "drive safely", "emergency", "emergency preparedness", "genasys evac", "rain"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-02-11T13:42:31-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteWith rainy weather in the forecast, including the chance of flooding in some low-lying areas, emergency officials offer seven safety tips.\n\nIf you must drive during heavy squalls, allow yourself extra time, turn on headlights even in the day, and give plenty of space between your vehicle and the one in front of you.\nWhen approaching a flooded roadway with moving water, do not attempt to drive through it. It only takes a few inches of water to get a vehicle to float away, and there’s no guarantee the roadway below hasn’t been washed out. You can report flooded roadways or other unsafe road issues in the unincorporated area by calling (877) 684-8000.\nThe same caution is true for pedestrians, if moving water can sweep a car away, it can easily do the same to people. Do not try to wade through a flooded roadway.\nIf your home gets an evacuation warning, or if you feel unsafe, evacuate.\nStay informed on adverse weather conditions, with official information from the National Weather Service or news outlets.\nVisit AlertSanDiego.org for disaster preparedness tips including flooding.\nTo receive emergency alerts for your area, download the Genasys Protect app or in the App Store or Google Play.\n\nFor information on how to use sandbags to divert water from your homes or businesses or where to get them, and additional driving tips, see First Big Rains on the Way, Sandbags Available.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250211.10.09.52"}