{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Youth Transitioning out of Foster Care to See Increased Support", "description": "The San Diego County Board of Supervisors voted unanimously today to accept recommendations from Child Welfare Services (CWS) to increase funding to support foster youth for up to three years as they transition out of care. ", "datePublished": "2023-01-24T13:11:49-08:00", "url": "https://www.countynewscenter.com/youth-transitioning-out-of-foster-care-to-see-increased-support/", "keywords": ["housing", "child welfare services", "cws", "foster youth", "housing funding", "san diego county board of supervisors", "transitional housing program"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-01-24T15:40:43-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors voted unanimously Tuesday to accept recommendations from Child Welfare Services (CWS) to increase funding to support foster youth for up to three years as they transition out of care. \nThe vote provided $2.7 million in state funding over the next three fiscal years for housing and wraparound services for young adults 18 to 25 years old.  \nThe region’s high cost of living was one of the major factors behind the increase. The additional program funding was only made available to 11 California counties with the highest rent.  \nGoing forward, each participating youth will receive $3,710 a month, a $900 increase compared to the current rate.  \nIn 2001, the state established the Transitional Housing Program– Plus, which provides affordable housing and wraparound services for foster youth 18 to 21 years old for up to two years. \nOther bills extended the opportunity for foster youth to stay in the foster care system until age 21 and added housing assistance services. The Transitional Housing Program provides up to three cumulative years of support for foster youth from 18 to 25 years old.  \nData shows the difference this kind of investment can make.  \n“In fiscal year 2021 to 2022, more than 400 youth were served by the Transitional Housing Program and 93 percent maintained stable housing over the course of the fiscal year,” said Kim Giardina, director of Child Welfare Services. “This program keeps vulnerable young adults off the streets, in an environment where they can pursue higher education and become successful members of society.” \nNearly all youth enrolled in the program accessed needed medical, dental and mental healthcare, while 97 percent enrolled in an educational or vocational training program and successfully completed the term.  \nEach year about 100 youth leave foster care in San Diego and rely on this program to provide a safe place to sleep, eat and study. CWS partners with nonprofits to ensure the inclusion of youth in underserved communities and those with increased barriers to safe and affordable housing. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230124.13.11.49"}