{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: New Supportive Housing Community for Seniors Experiencing Homelessness Opens in Clairemont", "description": "County, city and state officials celebrated the grand opening today of a new supportive housing community for older adults who have experienced homelessness. Ivy Senior Apartments, located on Mt. Alifan Drive in Clairemont, opened 53 units for low-income, chronically ill seniors who have experienced homelessness.", "datePublished": "2022-03-21T10:10:45-07:00", "url": "https://www.countynewscenter.com/new-supportive-housing-community-for-seniors-experiencing-homelessness-opens-in-clairemont/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2022-03-21T10:10:45-07:00", "articleType": "video.other", "articleContent": "\nCounty, city and state officials celebrated the grand opening today of a new supportive housing community for older adults who have experienced homelessness. Ivy Senior Apartments, located on Mt. Alifan Drive in Clairemont, opened 53 units for low-income, chronically ill seniors who have experienced homelessness. This permanent, supportive housing offers a stable environment with on- and off-site medical and essential services through PATH, St. Paul’s PACE and Alpha Project.\nThe Ivy building was intentionally designed with senior-friendly features, including wide hallways that comfortably accommodate two wheelchairs passing each other, distinct color palettes on each floor for wayfinding, valet service for trash, roll-in/walk-in showers, and grab bars in all bathrooms.\nMany older adults find themselves struggling to stay sheltered due to the high cost of living, major illness or even the loss of a spouse. They are alone and vulnerable. One in every four people who experiences homelessness in San Diego is 55 years or older and that number is expected to rise at the Baby Boomer generation ages.\nIvy Senior Apartments is the 20th completed development HHSA has helped fund through the Mental Health Services Act. Altogether, the Board of Supervisors has dedicated more than $53 million to create supportive housing for persons with a serious mental illness who are experiencing or at risk of homelessness. Currently, 12 additional projects are under construction that will add another 880 affordable housing units to our local communities.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220321.10.10.45"}