{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Asst. DA Honored with Prestigious ABA Award", "description": "The American Bar Association (ABA) awarded its prestigious Curtin-Maleng Award to Assistant District Attorney Dwain Woodley for his work as a prosecutor in seeking justice for his clients.", "datePublished": "2025-03-12T12:03:56-07:00", "url": "https://www.countynewscenter.com/asst-da-honored-with-prestigious-aba-award/", "keywords": ["public safety", "award", "district attorney summer stephan"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2025-03-12T15:12:08-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe American Bar Association (ABA) awarded its prestigious Curtin-Maleng Award to Assistant District Attorney Dwain Woodley for his work as a prosecutor in seeking justice for his clients.\nWoodley recently accepted the award at ceremony during an ABA spring meeting in Miami, Fla. The Curtin-Maleng Award is given to prosecutors who embody the principles in the ABA Standards for Criminal Justice, Prosecution Function, particularly “to seek justice, not merely to convict.”\n“Assistant District Attorney Dwain Woodley epitomizes the principles of integrity that every prosecutor should aspire to,” District Attorney Summer Stephan said. “He treats everyone with dignity and respect, leads with the clarity of purpose that justice demands and gives voice to the people of San Diego County. He has worked tirelessly to deliver fair and equal justice for all, protect victims of crime, build trust with the public and develop direct access to our office for all the communities we serve.”\n“I am proud to work alongside ADA Woodley to lead the fifth largest District Attorney’s Office in the nation and continue to build a model prosecutor’s office that balances the rights of victims, the rights of the accused and the right of the community to be safe,” Stephan said.\nThe assistant district attorney’s work exemplifies the three important prosecutor obligations: to protect the innocent as well as to convict the guilty; to guard the rights of the accused as well as enforce the rights of the public; and to commit to unwavering legal and ethical standards.\nWoodley served honorably as a public defender and prosecutor in the U.S. Navy’s Judge Advocate General’s Corps from 1989 to 1995. He joined the County’s Public Defender’s Office first, then the DA’s Office as a deputy district attorney in 2001. In 2021, he was selected as the Assistant District Attorney. Woodley helped develop and lead the DA’s Community Partnership Prosecutors program that has very successfully connected the public with much needed services around domestic violence, child abuse, and hate crime. He also works the advocacy organization, For the People, on reviewing cases that might qualify for prosecutor-initiated resentencings.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250312.12.03.56"}