{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adds Night Vaccination Hours, Mobile Sites", "description": "Continuing to make it as easy as possible for people to get COVID-19 vaccinations, the County of San Diego Thursday started night hours at three vaccination sites, extended appointment windows for all sites and announced it plans to set up more pop-up, drop-in clinics.", "datePublished": "2021-05-06T17:19:12-07:00", "url": "https://www.countynewscenter.com/county-adds-night-vaccination-hours-mobile-sites/", "keywords": ["health", "coronavirus", "covid-19", "evening clinics", "mobile clinics", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-05-07T14:13:37-07:00", "articleType": "article", "articleContent": "\nContinuing to look to make it as easy as possible for people to get COVID-19 vaccinations, the County of San Diego Thursday started night hours at three vaccination sites, extended appointment windows for all sites and announced it plans to set up more pop-up, drop-in clinics.\nThe County started night hours until 8 p.m. at three vaccination sites, in Oceanside, Chula Vista and El Cajon, to give people places to get shots after work, by appointment or just by walking in.\nThe three vaccination sites are offering both Pfizer and Moderna vaccines, with or without appointments, where people can get first or second doses, even if they received first doses at a different site.\nThe sites are offering shots from 1 p.m. to 8 p.m. at:\n\nOceanside\nSun. to Thurs.\nNorth Coastal Live Well Health Center\n1701 Mission Avenue\nChula Vista\nSun. to Thurs.\nSouth Region Live Well Center at Chula Vista\n690 Oxford Street\nEl Cajon\nTues. to Sat.\nEast Public Health Center\n367 North Magnolia Avenue\n\nThe County also announced it was extending appointment windows for its sites, from two-to-three days to seven days, to give people a wider time to set vaccination appointments. County officials also said they’re working with the Metropolitan Transit System, senior centers and community organizations to set up more mobile, pop-up, drop-in vaccination sites to make it even easier for people to get shots.\nHere is a list of current mobile vaccination sites, which are generally open from 9:30 a.m. to 3:30 a.m. on their respective dates:\n\nMay 7: Southwestern College Otay Lakes, 900 Otay Lakes Rd, Chula Vista, CA 91910\nMay 8: Palomar Family YMCA, 1050 N Broadway, Escondido, CA 92026\nMay 11: Elks Lodge El Cajon, 1400 Washington Ave, El Cajon, CA 92019\nMay 13: Northgate Market: City Heights, 5403 University Ave, San Diego, CA 92105\nMay 14: Mira Mesa Senior Center, 8460 Mira Mesa Blvd, San Diego, CA 92126\nMay 15: St. Francis of Assisi Catholic Church, 525 W. Vista Way, Vista, CA 92083\nMay 18: Sherman Heights Community Center, 2258 Island Ave, San Diego, CA 92102\nMay 20: Mission San Luis Rey, 4050 Mission Ave, Oceanside, CA 92057\n\n“We’re always looking to make the process of getting a vaccination as easy as possible and the public has responded,” said County Public Health Officer Dr. Wilma Wooten, M.D., M.P.H. “Almost 63 percent of all San Diegans 16 and older have now received at least one shot. Introducing night hours, extending appointment windows and bringing mobile clinics to the public will help everyone get vaccinated and end this pandemic.”\nAnyone 16 and up in San Diego County can receive a COVID-19 vaccine at no cost. See more locations at coronavirus-sd.com/vaccine.\nVaccination Progress:\n\nDoses delivered: More than 3.44 million.\nDoses administered: More than 3.07 million.\nReceived at least one shot: More than 1.69 million or 62.9% of San Diegans 16 and older.\nFully vaccinated: More than 1.19 million or 44.4%.\nThe goal: fully vaccinate 75% of San Diego County residents 16 and older or 2,017,011 people.\nTo date, 83.9% of the goal population has received at least one vaccine and 59.2% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 5.0 cases per 100,000 residents.\nThe testing positivity percentage is 2.2%.\nThe health equity metric is 2.7%.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, May 11.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was reported May 5, in a business setting.\nIn the past seven days (April 29 through May 5), 18 community outbreaks were confirmed.\nThe community outbreaks trigger is seven or more in seven days.\n\nTesting:\n\n15,412 tests were reported to the County on May 5, and the percentage of new positive cases was 1%.\nThe 14-day rolling average percentage of positive cases is 1.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,254.\n\nCases, Hospitalizations and ICU Admissions:\n\n226 COVID-19 cases were reported to the County on May 5. The region’s total is now 277,323.\n15,283 or 5.5% of all cases have required hospitalization.\n1,685 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported May 5. The region’s total is 3,716.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210506.17.19.12"}