{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New COVID-19 Boosters That Target Multiple Strains Expected To Be Available Next Week", "description": "The County of San Diego anticipates receiving the new COVID-19 bivalent boosters early next week and beginning vaccinations shortly thereafter.", "datePublished": "2022-09-01T18:44:55-07:00", "url": "https://www.countynewscenter.com/?p=209387", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19", "covid-19 boosters", "moderna vaccine", "pfizer/biontech"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-09-01T19:13:29-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego anticipates receiving the new COVID-19 bivalent boosters early next week and beginning vaccinations shortly thereafter.\nThe new bivalent boosters were developed to generate an immune response from the original COVID-19 virus and BA.4 and BA.5 Omicron subvariants. The Pfizer/BioNTech is for those age 12 and over, while the Moderna bivalent booster is for those age 18 and older.\n“These new boosters are a welcome resource to our ongoing COVID-19 prevention efforts,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The virus remains very prevalent in our community. With this bivalent vaccine, we have an updated booster that more directly addresses the most common circulating variant, and a chance to better protect our community. I encourage everyone eligible to get boosted.”\nIndividuals may contact their healthcare provider or other vaccine provider, such as a pharmacy, for other local availability. Availability at County vaccine events will be updated on coronavirus-sd.com and appointments can be made through the state’s My Turn system. Initial supplies are expected to be limited.\nSimilar to last year, the boosters will be offered along with the flu vaccine. Vaccinations with the former booster have ended as it is no longer authorized. The new booster will serve as the replacement.\nVaccination Progress:\n\nReceived at least one shot: More than 3.01 million or 90.2% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: More than 2.66 million or 79.8%.\nBoosters administered: 1,445,743 or 59% of 2,450,225 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nEight additional deaths were reported since the last report on Aug. 25, 2022. The region’s total is 5,464.\nOf the eight additional deaths, four were women and four were men. They died between July 22, 2022 and Aug. 26, 2022; five deaths occurred in the past two weeks.\nFive of the people who died were 80 years or older, two were in their 70s and one was in their 60s.\nFive were fully vaccinated and three were not.\nSeven had underlying medical conditions and one case is pending.\n\nCases, Case Rates and Testing:\n\n1,935 COVID-19 cases were reported to the County in the past three days (Aug. 29 to Aug. 31, 2022). The region’s total is now 912,653.\n3,978 cases were reported in the past week (Aug. 25 through Aug. 31) compared to 4,744 infections identified the previous week (Aug. 18 through Aug. 24).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 25.46 for people fully vaccinated and boosted, 17.20 for fully vaccinated people and 50.51 for not fully vaccinated San Diegans.\n6,528 tests were reported to the County on Aug. 27, and the percentage of new positive cases was 7.4% (Data through Aug. 27).\nThe 14-day rolling percentage of positive cases, among tests reported through Aug. 27, is 7.8%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220901.18.44.55"}