{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Works with SDSU to Address Rising Cases on Campus", "description": "The County is working with San Diego State University to respond to a spike in COVID-19 cases in students who are enrolled in classes at the university. Since the beginning of the fall semester on Aug.", "datePublished": "2020-09-02T19:07:26-07:00", "url": "https://www.countynewscenter.com/county-works-with-sdsu-to-address-rising-cases-on-campus/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-09-08T15:37:43-07:00", "articleType": "article", "articleContent": "\nThe County is working with San Diego State University to respond to a spike in COVID-19 cases in students who are enrolled in classes at the university. Since the beginning of the fall semester on Aug. 24, the university has reported 64 confirmed and probable cases in students who live on and off campus.\nThe County is collaborating with university officials to mitigate the situation.\n“We do expect more cases so what’s important is how we respond,” said Eric McDonald, M.D., M.P.H., medical director of the County Epidemiology and Immunization Services branch. “I’m very pleased with the working relationship we have with SDSU. The information our disease investigators are gathering, in addition to what campus officials are providing, really allows us to paint a complete picture and I am particularly impressed with the cooperation of the students.”\n\n\nMcDonald said the 64 cases among the student population do not constitute a single large outbreak. Ten of the 64 reported cases live in the same location, an off-campus housing facility. Other cases may be linked epidemiologically, but these groups of cases are not directly related to each other, and some cases are known to be related to exposures outside the county.\n\n\nStudents who have tested positive for the virus are isolating away from their peers, either in on-campus housing units set aside for this purpose or in County public health rooms.\nExpanded Testing On Campus\nThe County is currently assisting with testing on campus and will partner with the university to expand testing capacity in the coming days. The university houses one of the County’s busiest drive-up test sites and starting today, capacity at that site will expand to 350 tests a day.\nThe testing site is located at 6200 Alvarado Road and beginning Sept. 8, the site will become a walk-up site with no appointments required to get tested for COVID-19.\nCOVID-19 and Young People\nThe rise in cases at SDSU is in line with a trend the County has been reporting on throughout the summer. The number of young people who test positive for COVID-19 has been steadily increasing, especially since businesses started to reopen in July.\nOf the more than 39,000 COVID-19 cases reported in the region, San Diegans between 20 and 39 years of age represent more than 44% of all cases.\nSince the state uses the county’s case rate and testing positivity numbers to determine which sectors of the economy can reopen and to what extent, it is important that San Diegans follow public health orders which are designed to minimize the spread of the virus.\n“The actions we take now will have an impact on our numbers in the coming weeks,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “We don’t want to slip back into a more restrictive tier, so we urge the public to stay the course, avoid social gatherings and practice good hygiene.”\nNew State Metrics:\n\nUnder the new state monitoring metrics, San Diego County is currently in Tier 2, also referred to as the Red Tier.\nSan Diego County’s state-calculated case rate is 5.8 and the testing positivity percentage is 3.8%.\nThe state will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 8.\n\nCommunity Setting Outbreaks:\n\nThree new outbreaks were confirmed on Sept. 1, two in restaurant/bars and one in a residence.\nIn the past seven days, 18 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\n Testing:\n\n7,606 tests were reported to the County on Sept. 1 and the percentage of laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 6,648.\n\nCases:\n\n250 new cases were confirmed among San Diego County residents on Sept. 1 for a total of 39,121.\n3,142 or 8.0% of cases have required hospitalization.\n760 or 1.9% of all cases and 24.2% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSeven new COVID-19 deaths were reported in San Diego County on Sept. 1. The region’s total is now 695.\nThree women and four men died. Their ages ranged from late 40s to early 90s.\nFive of them had underlying medical conditions, two did not.\n\nMore Information:\nMore detailed data summaries can be found on the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200902.19.07.26"}