{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Helps Students Get Ready for School", "description": "San Diego County Probation officers partnered with STAR/PAL, a nonprofit youth organization at its Back-to-School event passing out 450 backpacks and supplies to help students start the school year off right.", "datePublished": "2023-08-24T15:52:23-07:00", "url": "https://www.countynewscenter.com/probation-helps-students-get-ready-for-school/", "keywords": ["families", "back to school", "backpacks", "live well", "probation", "star/pal"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-08-24T15:52:23-07:00", "articleType": "article", "articleContent": "\nSan Diego County Probation officers partnered with STAR/PAL, a nonprofit youth organization at its Back-to-School event passing out 450 backpacks and supplies to help students start the school year off right.\n“We know how a child’s first day at school is a big deal, no matter what grade.  What better way to support and encourage a positive experience for them, than to show our excitement and support to them and their families as they prepare for the first day of school,” said Chief Probation Officer Tamika Nelson.\nThe family event took place in the afternoon on Aug. 19 at Colina del Sol Park with a barbecue lunch, free physicals, dental and eye examinations, and fun activities including face painting and a rock-climbing wall.Students from kindergarten through high school could register to attend and receive the free services and school supplies.\nTop leadership and members of County Probation, California Department of Corrections, San Diego Police, and San Diego Unified School Police Departments were present and assisting families during the event, said STAR/PAL CEO Claire LeBeau. The officers connect with families and students using open and honest dialogue which fosters better community understanding and relationships, she said.\nMembers of the San Diego Kiwanis Club and Old Mission Rotary assisted with distributing books and groceries from Feeding San Diego. Employees from Target volunteered to handle the grill and BBQed over 500 hot dogs for students and their families to enjoy. Additionally, youth could receive free dental exams and services from La Maestra, physicals from the County of San Diego LiveWell WOW bus, and eye exams thanks to the UCSD Eye Mobile Clinic.\nSTAR/PAL received additional funding and sponsorships from Target, BluPeak Credit Union, Richard J. Donovan and Old Mission Rotary to help put on the community event.  The San Diego Bike Coalition and the San Diego County Department of Parks and Recreation were also event community partners.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230824.15.52.23"}