{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Pilot Program for Seniors Approved by County Board of Supervisors", "description": "The San Diego County Board of Supervisors approved today a pilot program to create housemate matches between lower-income older adults and locals with a spare bedroom. ", "datePublished": "2024-01-09T15:19:45-08:00", "url": "https://www.countynewscenter.com/new-pilot-program-for-seniors-approved-by-county-board-of-supervisors/", "keywords": ["housing", "board letter", "housing", "older adult", "senior"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-01-09T15:19:45-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors approved today a pilot program to create housemate matches between lower-income older adults and locals with a spare bedroom.  \nThe two-year pilot program was created to address growing homelessness among older adults. The 2023 Point-in-Time Count revealed the number of older adults aged 55 and older experiencing homelessness increased by 29% from the previous year. \nThe program will match a minimum of 50 older adults – people 55 years or older – with appropriate households who sign up and offer to rent out a spare bedroom. Participants also will be offered services to help them stay housed. \n“Older adults living on a fixed income are more vulnerable to losing their home,” said David Estrella, director of County Housing and Community Development Services. “This program is a way to catch a senior before they fall through the cracks in this challenging housing market.” \nOlder adults earning no more than 120% of the area median income would be eligible for the program and would pay no more than 30% of total monthly income towards rent. In some cases, a service exchange could be allowed (but not required), where the older adult provides services such as gardening or cleaning to pay a reduced rent. \nThe home must be in San Diego County and in good standing with utility, taxes and rent or mortgage payments. \nProgram participants will be matched with households based on goals, preferences and lifestyles. Included in the program is outreach, screening, assessments, matching and check-ins. It will be evaluated for outcomes and cost about $311,000. \nThe program will be promoted through outreach in the senior services and homeless community and is expected to launch in early summer 2024. \nMore information on this program, including how to apply, will be available online in the coming weeks. \nCounty Housing and Community Development Services provides affordable housing opportunities to more than 40,000 people each year through various housing programs and affordable housing efforts.     \nSince 2017, the County has invested more than $279 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund, and almost 1,800 units have opened. There are an additional 3,265 units on the way.     \nWhen all the developments in the pipeline are complete, the total number of affordable units supported by the County will reach over 9,500. This is expected to provide homes to nearly 21,000 people.      \nThe development plans align with the County’s Housing Blueprint, the County’s guide and ongoing response to the regional housing crisis. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240109.15.19.45"}