{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Happy Holidays! Don’t Pack a Pest", "description": "The holiday season means shipping gifts and not just through retailers. It’s a time when we personally mail packages to faraway friends and family. Or maybe even travel to deliver them in person and bring back gifts in return. Remember this―don’t pack a pest!", "datePublished": "2023-11-20T15:10:13-08:00", "url": "https://www.countynewscenter.com/happy-holidays-dont-pack-a-pest/", "keywords": ["consumer", "ag weights and measures", "agriculture", "invasive pests", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-11-20T15:10:13-08:00", "articleType": "article", "articleContent": "\nThe holiday season means shipping gifts―and not just through retailers.\nIt’s also a time when we personally mail packages to faraway friends and family. Or maybe even travel like Santa to deliver them in person and bring back gifts in return.\nJust remember. Don’t pack a pest!\nIt can happen. The gifts you send or receive could be carrying hitchhiking pests or plant diseases that could potentially damage the County’s $1.78 billion agricultural industry and our environment.\nFor example, that homemade wreath you brought home from grandma’s could be carrying spongy moth eggs. That citrus you picked from your backyard to send to a friend could be carrying huanglongbing—a destructive citrus disease. Or that beautiful fruit basket you made from scratch to send to a friend could be hiding mealybugs.\nEvery year San Diego County’s Department of Agriculture, Weights and Measures inspectors—human and detector dogs—work hard to stop the spread of invasive pests. From exotic fruit flies to the emerald ash borer, glassy-winged sharpshooter, and South American palm weevil.\nHow can you help? Follow these simple guidelines:\nDon’t Pack a Pest\n\nIf you’re traveling—whether it’s out of state or out of the country—leave what you find behind. Don’t bring home a keepsake clipping from Aunt Kathy’s holiday wreath, or those bulbs you found in Florida. And don’t bring home any citrus branches, leaves or stems from anywhere, or avocado leaves from Mexico.\nDon’t transport any fresh, raw, uncooked and untreated foodstuffs. That goes for seeds, beans, nuts, rice, dried fruit, decorative greenery, untreated wood items, animal products or soil from almost any foreign country.\nIf you are traveling and think you may have accidentally packed some plant or animal item away? Declare them when an agricultural inspector asks you if you have anything in your luggage.\n\nFor more information about harmful insects, plant diseases, Agriculture, Weights and Measures and everybody’s role in protecting our local environment and agriculture, visit the department’s Insect and Plant Disease Information webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231120.15.10.13"}