{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Influenza Sickening More San Diegans This Season", "description": "The number of influenza cases being reported in the region this season is higher than the average for this same time in recent years, the County Health and Human Services Agency announced today.", "datePublished": "2021-10-13T10:40:47-07:00", "url": "https://www.countynewscenter.com/influenza-sickening-more-san-diegans-this-season/", "keywords": ["health", "flu", "flu shot", "flu vaccination", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-15T09:26:05-07:00", "articleType": "article", "articleContent": "\nThe number of influenza cases being reported in the region this season is higher than the average for this same time in recent years, the County Health and Human Services Agency announced today.\nA total of 195 lab-confirmed influenza cases have been reported so far this season. That compared to six at the same time last year, but that extremely low number came while many COVID-19 restrictions were still in place. The prior five-year average was 128 cases to date.\nGiven this season’s pace, County health officials are urging San Diegans to get their flu vaccination before influenza activity increases in the region.\n“San Diegans should get vaccinated as soon as possible to protect themselves and their families,” says Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Getting a flu shot is especially important given that COVID-19 is still negatively impacting our communities. Influenza and COVID-19 can both be significant respiratory illnesses and we have safe and effective vaccines for both. You can even get a flu and COVID shot at the same time.”\nThe County Health and Human Services Agency has begun publishing the weekly Influenza Watch  report, which tracks key influenza indicators and summarizes influenza surveillance in the region. The report is released every Wednesday during the flu season.\nYour Best Shot Against the Flu\nThe Centers for Disease Control and Prevention recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop.\n“Flu vaccination is especially important for people who are at high risk of developing serious complications from influenza,” Kaiser said.\nThe following groups are more likely get seriously sick from the flu:\n\nPeople with chronic medical conditions like asthma, diabetes and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe influenza vaccine is now available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nTips to Prevent the Flu\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nLast season, a total of 848 influenza cases were reported in San Diego, including two deaths. In 2019, a total of 108 San Diegans died from influenza and more than 20,700 flu cases were reported.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211013.10.40.47"}