{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Poll Workers Still Needed for Presidential General Election", "description": "The Registrar of Voters is seeking additional poll workers for the November Presidential General Election. Poll workers play an essential role in elections and can serve their community while earning a stipend.", "datePublished": "2024-09-11T11:59:10-07:00", "url": "https://www.countynewscenter.com/poll-workers-still-needed-for-presidential-general-election/", "keywords": ["elections", "bilingual poll workers", "county registrar of voters", "fgg", "nov. 5 presidential general election", "poll workers still needed", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-09-11T15:01:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe Registrar of Voters is seeking additional poll workers for the November Presidential General Election. Poll workers play an essential role in elections and can serve their community while earning a stipend.\nThere is a particular need for poll workers who are bilingual in English and Chinese, Vietnamese or Filipino to work at vote centers located throughout the county.\nIn addition, the Registrar’s office needs poll workers at select vote centers in the region who are bilingual in English and Laotian.\nFederal law requires the Registrar’s office to provide bilingual speakers and voting materials to voters who speak Spanish, Filipino, Vietnamese and Chinese.\nState and County requirements mean there is a need for Arabic, Japanese, Korean, Laotian, Somali and Persian (Farsi and Dari) speakers at select vote centers across the county. With those requirements in mind, the Registrar’s office is also recruiting poll workers who are bilingual in English and at least one of these languages.\nUnder the Voter’s Choice Act, vote centers have replaced traditional polling places. Vote centers open for an extended period before Election Day. Rather than a single day of service, poll workers are now needed to staff vote centers for up to 11 days in the two weeks before Election Day.\nPoll workers who work at a vote center between Oct. 26 and Nov. 4 will receive a stipend of $145 for each day of service. On Election Day, Nov. 5, poll workers will receive a stipend of $240 due to the extended hours. Those who are designated as bilingual poll workers will receive an additional $5 for each day of service at the vote center with an increase to $10 on Election Day.\nResponsibilities include:\n\nProviding excellent customer service\nAssisting a diverse population of voters\nAttending a two-day, paid poll worker training ($95 daily stipend)\nOpening/closing a vote center\nRemaining politically neutral at all times\nAnswering voter questions\n\nApplicants must be 18 years old, a U.S citizen and registered to vote in California, or lawfully admitted for permanent residence in the United States. Applicants must also provide their own transportation to their assigned vote center.\nThe Registrar is seeking people who are team players, exhibit strong leadership and customer service skills, and display flexibility, patience and the highest level of integrity at all times. Poll workers must represent the Registrar of Voters in a professional, nonpartisan manner.\nApplications are available at sdvote.com. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240911.11.59.10"}