{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Agriculture Detector Dog Honored at His Retirement", "description": "After four years of service protecting the region’s agriculture industry, Podder is going to be sniffing out the life of leisure.", "datePublished": "2022-03-23T15:23:11-07:00", "url": "https://www.countynewscenter.com/county-agriculture-detector-dog-honored-at-his-retirement/", "keywords": ["agriculture", "ag weights and measures", "agriculture detector dog", "awm"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-03-25T12:27:01-07:00", "articleType": "article", "articleContent": "\nAfter four years of service protecting the region’s agriculture industry, Podder is going to be sniffing out the life of leisure.\nThe detector dog has retired from his work with the County’s Agriculture, Weights & Measures Department. On Wednesday, County staff organized a small ceremony at the Waterfront Park to acknowledge Podder’s work. His former colleague, Yeti, the County’s other detector dog, and Venus, a retired detector dog, and other officials attended to give him a pat on the back, a scratch on the head, and lots of treats and toys.\n“In honor of Podder’s service, I’d like to present this Service Award for four years of County service,” said Ha Dang, commissioner/sealer for Agriculture, Weights and Measures.\nPodder the agricultural detector dog is retired. Photo courtesy of Justin Aquino.\nThe Labrador and beagle mix has worked with his handler Kyle Moranton to intercept unmarked agricultural parcels that are shipped in violation of agricultural quarantine, or contain unwanted plant pests including insects, diseases, and other harmful organisms to agriculture.\n“He has a great nose,” Moranton said. “I’m going to miss him.”\nOnly 6 years old, Podder is retiring due to a medical condition. He has since been adopted and is happy, Moranton said.\nThe California Department of Food and Agriculture Detector Dog Team program began in 2009. The dogs sniff and identify unmarked parcels, which are a high-risk pathway for significant pests to enter the states. Dog teams conduct inspections at parcel facilities such as UPS, FedEx, and the U.S. Postal Service. Dogs are trained to alert on packages that contain agricultural material such as plants, cuttings, fruits, vegetables, seeds, and soil. Those packages are then opened and checked for insects, diseases, or quarantines.\nPodder made 426 visits to parcel facilities, where he found 728 plants in unmarked parcels, including 137 rated insect pests capable of causing serious harm to agriculture or were questionable, Moranton said.\nAnother San Diego County agriculture inspector is now training to become a dog handler and will join the department in the summer with a new detector dog.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220323.15.23.11"}