{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Boosts Ability to Staff Emergency Shelters", "description": "The San Diego County Office of Emergency Services (OES) has significantly improved the ability to open and maintain emergency shelters and local assistance centers in the county by increasing their number of qualified shelter workers and managers by 67% as of Dec. 1.", "datePublished": "2020-12-21T16:17:51-08:00", "url": "https://www.countynewscenter.com/county-boosts-ability-to-staff-emergency-shelters/", "keywords": ["public safety", "emergency", "living safely", "public safety"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2020-12-21T16:34:35-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Office of Emergency Services (OES) has significantly improved the ability to open and maintain emergency shelters and local assistance centers in the county by increasing their number of qualified shelter workers and managers by 67% as of Dec. 1.\nDespite the constant threat of wildfires and additional COVID-19 social distancing requirements creating an increased demand for shelters and thus shelter workers, OES has managed to increase the number of County employees who are qualified to work at and manage emergency shelters from 420 to 702 personnel in 2020.\n“While the American Red Cross serves as our primary source for providing emergency shelter during an emergency, this increase in qualified personnel to our County Shelter Team program helps to improve our rapid response capabilities,” said Jeff Toney, San Diego County OES director. “This large increase in qualified personnel will allow us to be better prepared to open and operate additional facilities when the demand exceeds the resources provided by the Red Cross.”\nToney said that all County workers are classified as disaster service workers, but the qualification process to become a shelter worker or shelter manager is in place to ensure that County residents are living safely and receive timely crisis response and recovery services. The training and qualification process to become a shelter worker, which now includes a specific pandemic section, is constantly being updated to ensure the highest quality of service for County residents.\nToney also said most of the county’s qualified shelter workers and managers come from departments outside of OES. The training teaches them how to recognize needs, take action, and ensure county residents are living safely with increased preparedness and response capabilities provided by OES.\n“I became involved with the shelter team program during the 2003 wildfires in San Diego and have assisted with several County-established local assistance centers since then,” said Luis Ochoa, a supervising child support officer with the county’s Department of Child Support Services. “I don’t like to see anyone suffer, especially those stricken by disaster and I feel a strong desire to assist in any way I can.”\nOchoa said he has previously worked in several roles as part of the program, including as an intake coordinator, interpreter and runner. In 2018 he was trained as an assistant local assistance center manager, and in the recent Valley Fire in September he was asked to take on the lead role as center manager.\nOES encourages all families in the county to have an emergency plan and practice it so it is familiar in a high-stress situation. Additionally, all County residents are encouraged to register their cellphones on AlertSanDiego, the County’s emergency notification system and download the SD Emergency App at no cost. An emergency family plan template is available in English, Spanish, Tagalog, Vietnamese, Japanese, Arabic, traditional and simplified Chinese, Farsi, French, Korean, Somali and in an audio version.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201221.16.17.51"}