{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisor Greg Cox Named County Board Chairman for 2020", "description": "Supervisor Greg Cox was unanimously voted chairman of the County Board of Supervisors for 2020 in the Board’s first meeting of the new year Tuesday.", "datePublished": "2020-01-14T11:39:22-08:00", "url": "https://www.countynewscenter.com/supervisor-greg-cox-named-county-board-chairman-for-2020/", "keywords": ["government", "board of supervisors", "chair", "gavel pass"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-01-14T11:39:22-08:00", "articleType": "article", "articleContent": "\nSupervisor Greg Cox was unanimously voted chairman of the County Board of Supervisors for 2020 in the Board’s first meeting of the new year Tuesday.\nCox officially accepted the chairmanship and the gavel from Supervisor Dianne Jacob, who served as chairwoman for a record seventh time in her 28-year career as a County supervisor in 2019. The Board traditionally rotates the chair position each year among the five supervisors.\nThe Board also voted unanimously to name Supervisor Jim Desmond vice-chairman and Supervisor Nathan Fletcher chairman pro tem.\nJacob thanked her fellow Board members and County staff, saying the County made “real headway” on several important public issues in 2019, including housing affordability, behavioral health, community choice energy and fire protection.\nNoting that 2020 will be her final year as a County supervisor, Jacob thanked “the people in District 2 for having their faith in me all these years.”\nCox, in accepting the chairman’s position for 2020, praised Jacob for her leadership over the course of her County career.\nCox will outline his own goals for the County in 2020 when he gives the annual State of the County address at 6:30 p.m., Feb. 19 on the USS Midway in downtown San Diego.\nIn addition to outlining the County’s goals for the coming year, the Board’s chair becomes the official voice of the Board. They also preside over Board meetings, appoint other supervisors to various committees and field requests from the other supervisors to place items on the Board’s agenda.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200114.11.39.22"}