{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County First in Nation to Use Rapid DNA-Based Beach Water Testing to Protect Public", "description": "San Diego County became the first coastal county in the nation to start using a rapid, DNA-based ocean-water testing technology this week that will yield faster results and earlier warnings to protect beachgoers when bacteria levels reach unhealthy levels in ocean water.", "datePublished": "2022-05-04T15:48:15-07:00", "url": "https://www.countynewscenter.com/?p=208350", "keywords": ["government"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-05-04T15:48:15-07:00", "articleType": "article", "articleContent": "\nSan Diego County became the first coastal county in the nation this week to start using a rapid, DNA-based ocean-water testing technology that will produce faster results and earlier warnings to protect beachgoers when bacteria levels reach unhealthy levels in ocean water.\nCounty Board of Supervisors Vice Chair Nora Vargas, County Public Health Officer Dr. Wilma J. Wooten, officials from the County’s public health lab, its Department of Environmental Health and Quality, and others gathered Wednesday morning near the Imperial Beach Pier for the announcement.\nVargas said the County plans to expand its use Thursday of the DNA-based droplet-digital polymerase chain reaction testing technology — ddPCR — to more than 70 miles of shoreline the County regularly samples and tests to protect the public.\nThe new system will let the County sample beach water in the morning, get results and warn the public by the afternoon instead of the next day.\nOfficials said the DNA-based system is also more sensitive to bacteria levels than the older method, which required growing bacterial cultures from water samples in petri dishes.\n“I’m happy to announce with today’s sampling, San Diego becomes the first coastal county in the nation to implement the ddPCR method for beach water sampling,” Vargas said Wednesday to applause.\n“Faster results,” she said, “are going to allow the County to issue or lift beach advisories on the same day samples were collected. And it reduces the time the public could unknowingly be at risk and … when the water is contaminated.”\nThe County’s Public Health laboratory and the state conducted a side-by-side study of how the DNA testing compared to the petri-dish system in 2019.\nThe California Department of Public Health gave the new system its final laboratory approval in February, clearing the way for the County to expand its use of the process.\nFor more information about the County’s beach water quality testing program and check local conditions, visit the County’s “Check In Before You Get In” website at sdbeachinfo.com. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220504.15.48.15"}