{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID Cases on Rise as Summer Activities Get Underway", "description": "Cases of COVID-19 continue to increase in the region, the County Health and Human Services Agency reported today.", "datePublished": "2022-06-02T16:06:58-07:00", "url": "https://www.countynewscenter.com/?p=208692", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-06-02T16:27:58-07:00", "articleType": "article", "articleContent": "\nCases of COVID-19 continue to increase in the region, the County Health and Human Services Agency reported today.\nWeekly average coronavirus cases have more than tripled in the past 30 days. Hospitalizations and ICU admissions are also up.\nThe growing case counts are prompting the County, consistent with the state’s SMARTER Plan, to remind San Diegans to continue using established protective measures. This includes the state’s strongly recommended guidance of voluntary masking when out in public.\nMasking is particularly important when traveling or moving through crowded indoor spaces, as is avoiding large gatherings, especially if you are immunocompromised.\n“Getting vaccinated against COVID-19 and staying up to date on all recommended boosters is the best protection San Diegans can take amid the current surge of new cases,” said Ankita Kadakia, Deputy Public Health Officer. “Get-togethers with friends and family are popular during summer months, but take precautions to keep your loved ones safe, including staying home if you are sick, getting vaccinated or boosted, and cleaning your hands frequently.”\nBoosters are available for everyone age five and older. Those 50 and older, and those who are severely immunocompromised, are encouraged to get a second booster four months after their initial booster.\nVaccination Progress:\n\nReceived at least one shot: Close to 2.97 million or 94.3% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Nearly 2.63 million or 83.5%.\nBoosters administered: 1,336,530 or 58.6% of 2,280,870 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n15 additional deaths were reported since the last report on May 26. The region’s total is 5,303.\nOf those 15 additional deaths, nine were men and six were women. They died between Jan. 26, 2022 and May 25, 2022; two of the deaths occurred in the past two weeks.\nSeven of the people who died were 80 years or older, two were in their 70s, two were in their 60s, three were in their 50s and one was in their 30s.\n10 of the people who died were fully vaccinated and five were not fully vaccinated.\n14 had underlying medical conditions and one has medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n2,331 COVID-19 cases were reported to the County in the past two days (May 31 – June 1, 2022). The region’s total is now 792,777.\n8,563 cases were reported in the past week (May 26-June 1) compared to 8,850 infections identified the previous week (May 19-May 25).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 29.67 for people fully vaccinated and boosted, 15.50 for fully vaccinated people and 43.53 for not fully vaccinated San Diegans.\n12,226 tests were reported to the County on May 28, and the percentage of new positive cases was 10.2% (Data through May 28).\nThe 14-day rolling percentage of positive cases, among tests reported through May 28, is 8.6%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220602.16.06.58"}