{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Flu and COVID-19 Cases Up as Holiday Gatherings Continue", "description": "While signs of any potential Thanksgiving surge of COVID-19 and the flu won’t show up until next week’s data is released, cases for both illnesses are continuing to trend up.", "datePublished": "2022-12-01T16:18:41-08:00", "url": "https://www.countynewscenter.com/flu-and-covid-19-cases-up-as-holiday-gatherings-continue/", "keywords": ["health", "coronavirus", "covid-19", "flu", "influenza"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-12-02T10:14:13-08:00", "articleType": "article", "articleContent": "\nWhile signs of any potential Thanksgiving surge of COVID-19 and the flu won’t show up until next week’s data is released, cases for both illnesses are continuing to trend up. COVID-19 cases will surpass 10,000 for the month of November, far exceeding the 7,482 cases recorded in October.\nFlu cases are also continuing to increase, reaching 2,694 last week, up from 2,375 the previous week. For the season to date, San Diego County has recorded 12,946 cases of the flu compared to 424 at this time last year.\nSan Diegans are urged to get their flu and COVID vaccines before the peak holiday period. It takes two weeks until the body reaches full immunity.\n“The time to act is now,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Get your flu and COVID vaccines as soon as you can and keep yourself and your loved ones safe this holiday season. And remember that masks help reduce spreading both the flu and COVID-19.”\nCOVID-19 and flu vaccines are widely available across the region at pharmacies, medical centers and clinics. The two vaccines can be administered during the same visit. It is important to note that the COVID-19 primary vaccine series or booster does not protect against the flu and the flu vaccine does not protect people against COVID-19. Therefore, it is recommended that eligible San Diegans get vaccinated against both viruses.\nTreatment Options\nSymptomatic patients with a positive COVID-19 test result, including pregnant persons and children, should be evaluated to see if they are eligible for treatment with one of the National Institutes of Health recommended treatment options, which currently for those not hospitalized are nirmatrelvir/ritonavir (Paxlovid), molnupiravir (Lagevrio) and remdesivir (Veklury).\nEarly COVID-19 treatment in multi-generational families, especially families of color, protects vulnerable individuals like older family members and those with underlying medical conditions.\nTesting and treatment are available at no cost by calling 1-888-634-1123 to schedule an appointment at an OptumServe site. Appointments can also be made online. Call SesameCare at 1-888-897-1244 to schedule a no-cost telehealth visit, which includes a prescription for treatment. Appointments can also be made online.\nCOVID-19 Vaccination Progress:\n\nClose to 2.69 million or 80.4% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 422,594 or 17% of 2,492,144 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nCOVID-19 Deaths:\n\nSeven additional deaths were reported since the last report on Nov. 23, 2022. The region’s total is 5,569.\nOf the seven additional deaths, one was a woman and six were men. They died between March 21, 2022 and Nov. 22, 2022. Three of the newly reported deaths occurred in the last two weeks.\nTwo of the people who died were 80 years or older, two were in their 70s, one was in their 60s, one was in their 50s and one was in their 40s.\nNone of these individuals had been vaccinated.\nFive had underlying medical conditions and two have medical conditions pending.\n\nCOVID-19 Cases, Case Rates and Testing:\n\n3,455 COVID-19 cases were reported to the County in the past seven days (Nov. 22 to Nov. 28, 2022). The region’s total is now 942,177.\nThe 3,455 cases reported in the past week were higher compared to the 3,084 infections identified the previous week (Nov. 15 to Nov. 21, 2022).\n5,071 tests were reported to the County on Nov. 26, and the percentage of new positive cases was 9.5 (Data through Nov. 26).\nThe 14-day rolling percentage of positive cases, among tests reported through Nov. 26, is 6.7%.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Nov. 26, 2022, the report shows the following:\n\nThree additional flu deaths; the season’s total is now eight.\nAll three of the additional flu deaths were women. They died between Nov. 9, 2022 and Nov. 21, 2022.\nNone of them had received a flu shot this season.\nAll had underlying medical conditions and none of the newly-reported deaths were coinfected with COVID-19.\nEmergency department visits for influenza-like illness: 11% of all visits (compared with 10% the previous week).\nLab-confirmed influenza cases for the week: 2,694 (compared to 2,375 the previous week).\nTotal lab-confirmed cases to date: 12,946 (compared to 424 at the same time last season and a 475 prior 5-year average during the same week).\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221201.16.18.41"}