{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "TB Exposure Reported at San Diego Sheriff’s Vista Detention Facility", "description": "The County of San Diego’s Health and Human Services Agency and San Diego Sheriff’s Office are working in close collaboration to notify individuals potentially exposed to tuberculosis at the Vista Detention Facility. The County of San Diego’s Public Health Services stated the date of potential exposure is from February 2, 2023 to February 21, 2023.", "datePublished": "2023-05-17T15:51:13-07:00", "url": "https://www.countynewscenter.com/tb-exposure-reported-at-san-diego-sheriffs-vista-detention-facility/", "keywords": ["health", "jail", "tb", "tuberculosis", "vista detention facility"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-05-17T16:11:36-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Health and Human Services Agency and San Diego Sheriff’s Office are working in close collaboration to notify individuals potentially exposed to tuberculosis at the Vista Detention Facility. The County of San Diego’s Public Health Services stated the date of potential exposure is from February 2, 2023 to February 21, 2023. \nTuberculosis is an airborne disease that is transmitted from person to person through inhalation of the bacteria from the air. The bacteria are spread when someone sick with TB coughs, speaks, sings, or breathes. People with frequent and prolonged indoor exposure to a person who is sick with TB should get tested.\nPeople living in congregate settings, including homeless shelters, correctional facilities and skilled nursing facilities are at increased risk of becoming infected with TB bacteria due to shared airspaces. People with certain medical conditions may place them at higher risk of infection or of severe illness. Employees who work in such areas also face an increased risk for TB exposure and infection.\nDue to the increased potential for infectious spread in the event of an exposure, the Sheriff’s Department screens incarcerated persons for TB upon entry into detention facilities. The Sheriff’s Department also makes TB screenings available to its staff upon request.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with tuberculosis will become ill in the future, sometimes even years later, if their latent TB infection is not treated. Blood tests and skin tests are effective to determine whether someone has been infected.”\nEffective treatments are available to cure people who are sick from active TB. It is especially important for individuals with symptoms of active TB and those who are immune compromised to see medical provider to rule out active tuberculosis and to discuss treatment.\nPeople who test positive for TB but who don’t have symptoms of active TB should get a chest x-ray and talk to a medical provider, as they most likely have a latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from getting sick.\nIndividuals who may have been exposed at the Vista Detention Facility who need testing and have no medical provider, and those seeking more information on this potential exposure, may call the County TB Control Program at (619) 692-8621.\nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 in 2020 and 201 people reported with active disease in 2021. Preliminary data shows 208 people were reported to have active TB disease in 2022.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230517.15.51.13"}