{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Continued FEMA Rental Assistance May be Available for Valley Fire Survivors", "description": "Survivors of the September Valley Fire who are currently receiving Federal Emergency Management Agency (FEMA) rental assistance for temporary housing as part of the Individuals and Households Program may be able to extend their current benefits into the new year.", "datePublished": "2020-12-21T11:21:16-08:00", "url": "https://www.countynewscenter.com/continued-fema-rental-assistance-may-be-available-for-valley-fire-survivors/", "keywords": ["public safety", "emergency", "fema", "valley fire"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2020-12-21T12:53:09-08:00", "articleType": "article", "articleContent": "\nSurvivors of the September Valley Fire who are currently receiving Federal Emergency Management Agency (FEMA) rental assistance for temporary housing as part of the Individuals and Households Program may be able to extend their current benefits into the new year.\nSome San Diego County residents may qualify for continued assistance if they can demonstrate a fire-related financial need and show that they have developed and/or are making progress toward a long-term housing plan.\nAccording to FEMA, a long-term housing plan is one that would put the survivor back into permanent safe, sanitary, and functional housing within a reasonable timeframe. Individuals requesting a continuation of their current benefits must show progress toward obtaining permanent housing, and a contractor estimate of repairs can point to progress.\nIndividuals who are currently receiving FEMA rental assistance and have an ongoing need should follow the steps below:\n\nContact FEMA.\nProvide proof that previous assistance funding was spent on rent.\nProvide an updated status on a permanent housing plan.\n\nExtensions on rental assistance may be granted for three-month periods, up to a maximum of 18 months from the date of the presidential declaration, which was October 16, 2020, for the Valley Fire.\nThe application must be accompanied by these supporting documents:\n\nPre-disaster and current household income status.\nCopies of pre-disaster mortgage or lease, utility bills, and insurance information.\nCopy of current lease or rental agreement signed by you and the landlord.\nCopies of rental receipts, canceled checks or money orders showing the rental assistance was used to pay for housing expenses.\n\nCounty residents requesting an extension should submit the documents by using their existing DisasterAssistance.gov account or by uploading the information via the FEMA app on a smartphone or tablet.\nHomeowners whose FEMA verified loss exceeds the amount of the initial rental assistance award they received will receive the continuation application in the mail after the initial rental assistance award has been granted. Homeowners whose verified loss does not exceed the initial rental award must call the FEMA Helpline at 800-621-3362 (TTY: 800-462-7585) and ask for an application for continued temporary rental assistance.\nRenters will also need to call the helpline to ask for an application for continued temporary rental assistance. Requests will be evaluated to determine eligibility for the extension, but there is no guarantee of rental assistance past the first two months.\nFor more information on San Diego County recovery efforts for the Valley Fire visit https://www.sdcountyrecovery.com\nFor the latest FEMA information on the Valley Fire wildfire recovery, visit\nhttps://www.fema.gov/disaster/4569 and follow the FEMA Region 9 Twitter account at https://twitter.com/femaregion9.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201221.11.21.16"}