{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Everyone Has a Role in a Disaster", "description": "First responders make up less than 1 percent of people who call San Diego County home and if a major disaster occurs, they will respond to the highest priority calls.", "datePublished": "2025-04-15T17:17:45-07:00", "url": "https://www.countynewscenter.com/everyone-has-a-role-in-a-disaster/", "keywords": ["public safety", "cert", "county fire", "das", "disaster training", "emergency", "sheriff"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-04-17T10:12:02-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesFirst responders make up less than 1 percent of people who call San Diego County home and if a major disaster occurs, they will respond to the highest priority calls.\nThose priority calls could be related to residential responses or include threats to a critical service like regional water supply or an area hospital.\nThat is why it’s a great idea to have some basic first aid skills and have a preestablished plan for various disaster scenarios.  To help you gain the knowledge you need to prepare for these types of disasters, County Fire, Emergency Services, Animal Services and the Sherriff’s Office are partnering with Deaf Community Services, Red Cross, and the San Diego Regional Center to offer a free presentation from 9 a.m. to 1 p.m. April 19 at the Alpine Library, 1752 Alpine Blvd.\nThe presentation will cover the four phases of a disaster and what residents can do to prevent, prepare, respond, and recover from one. The training is funded by a grant from LISTOS California. ASL interpreters will be at the event.\nThe four-hour presentation highlights preparedness for pets and people, mitigation such as wildfire prevention and home hardening, evacuation planning, the new Genasys Evac map, what local assistance centers are, and an outline of the recovery process. All attendees will receive a personal disaster plan book to start their own emergency plan.\nThe course helps people through various prevention and preparation steps to  prepare people for  what might happen and how they can help themselves and their families or neighbors.\nFor those who want to learn more disaster skills, the Community Emergency Response Team is a group of trained community members who learn from emergency responders how to manage some emergency situations such as small fires, search and rescue and providing medical aid until emergency responders can arrive and take over.\nTo register, call or text Teresa Greenhalgh at (619) 857-8050 or email at Teresa.Greenhalgh@sdcounty.ca.gov.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250415.17.17.45"}