{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "March 22 Deadline to Register to Vote in 79th Assembly District Election", "description": "If you live in the 79th Assembly District and want to vote in the April 6 Special Primary Election, you must register by Monday, March 22 to receive a mail ballot. Otherwise, you will need to make a trip in person to the Registrar’s office in Kearny Mesa or your polling place to register conditionally and vote provisionally.", "datePublished": "2021-03-19T08:02:53-07:00", "url": "https://www.countynewscenter.com/march-22-deadline-to-register-to-vote-in-79th-assembly-district-election/", "keywords": ["elections", "79th assembly district", "election", "mail ballot", "provisional voting", "registration deadline", "voter registration"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-03-22T14:54:14-07:00", "articleType": "article", "articleContent": "\nIf you live in the 79th Assembly District and want to vote in the April 6 Special Primary Election, you must register by Monday, March 22 to receive a mail ballot. Otherwise, you will need to make a trip in person to the Registrar’s office in Kearny Mesa or your polling place to register conditionally and vote provisionally.\nThe April 6 election is open only to those who live in the 79th Assembly District. The area encompasses southeastern San Diego, the cities of La Mesa and Lemon Grove, and parts of Chula Vista, Bonita, and National City. Not sure if you live in the 79th Assembly District? You can find out here.\nRegistering to vote is quick and easy and can be done online at sdvote.com. You will need to register to vote if you:\n\nare not registered in San Diego County\nrecently moved\nchanged your name\n\nIf your signature is confirmed through records at the Department of Motor Vehicles, your registration will automatically be sent to the Registrar’s office. If your signature is not confirmed, you can print the form, sign it and return it to the Registrar’s office by 5 p.m. on March 22.\nRegistration forms must be postmarked or delivered to the Registrar by March 22.  Voters may also register online until midnight.\nNot sure if you’re registered to vote? Check your registration status online at sdvote.com. If you don’t have access to a computer, you may request a registration form. Call (858) 565-5800 or email rovmail@sdcounty.ca.gov.\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nIf you miss the deadline, you may still conditionally register and vote provisionally through Election Day.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday with the exception of Wednesday, March 31, when the Registrar’s office will be closed in observance of Cesar Chavez Day.\nOn Election Day, April 6, both your assigned polling place and the Registrar’s office will be open from 7 a.m. to 8 p.m. Your poll may have changed. You can find your assigned polling place in your mail ballot packet or at sdvote.com.\nTo learn about Vote Safer San Diego and voting in the 79th State Assembly District Special Election, visit sdvote.com or call (858) 565-5800.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210319.08.02.53"}