{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Ballots Go Out to Registered Voters for District Four Special Primary Election", "description": "Nearly 400,000 ballots are on their way to registered voters in the Fourth Supervisorial District for the Aug. 15 special primary election.", "datePublished": "2023-07-14T09:15:45-07:00", "url": "https://www.countynewscenter.com/ballots-go-out-to-registered-voters-for-district-four-special-primary-election/", "keywords": ["government", "aug. 15 special primary election", "ballots go out", "district 4", "fourth supervisorial district", "supervisorial district 4"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-07-14T10:10:18-07:00", "articleType": "article", "articleContent": "\nNearly 400,000 ballots are on their way to registered voters in the Fourth Supervisorial District for the Aug. 15 special primary election.\nVoters should receive their ballots the week of Monday, July 17. You will also find your “I Voted” sticker inside your official ballot packet.\nThe person elected will fill District 4’s vacant seat for the remainder of the current term ending in January 2027. If no candidate receives a majority vote at the Aug. 15 election, then a special general election will be held on Nov. 7. Only those who live in the district can vote in the election.\nDistrict 4 includes the following areas: Alta Vista, Azalea Park, Balboa Park, Bankers Hill, Bay Park, Bay Terraces, Birdland, Broadway Heights, Casa de Oro – Mount Helix, Chollas Creek, Chollas View, City Heights, City of La Mesa, City of Lemon Grove, Civita, Clairemont Mesa, College Area, El Cerrito, Emerald Hills, Encanto, Hillcrest, Kensington-Talmadge, Lincoln Park, Linda Vista, Lomita Village, Mid-City, Middletown, Mission Hills, Mission Valley, Montezuma Mesa-SDSU, Morena, Normal Heights, North Bay Terraces, North Clairemont, North Park, Oak Park, Old Town, Paradise Hills, Portions of Grantville, Portions of Kearny Mesa, Portions of Spring Valley, Rancho San Diego, Rolando, Serra Mesa, Skyline, University Heights, Valencia Park, and Webster.\nIf you’re not sure whether you reside in District 4, you can look it up at sdvote.com.\nEarly voting begins Monday, July 17 at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nYou can vote from home and return your ballot through the mail – no postage needed – or to any of the Registrar’s official ballot drop boxes around the district starting Tuesday, July 18 through Election Day.\nRemember to sign and date your return ballot envelope. You must sign the return ballot envelope for your vote to count.\nVoters who return their ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nMore options to vote in person start Saturday, Aug. 5. In addition to the Registrar’s Office, you can vote at any one of seven vote centers. They will be open daily from 8 a.m. to 5 p.m. until the final day of voting, Tuesday, Aug. 15, when 14 vote centers will be open from 7 a.m. to 8 p.m. Avoid long lines by taking advantage of early voting.\nYou can find an official ballot drop box or vote center location near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nLearn more about voting in the District 4 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\nGet mobile updates by texting COSD D4Election to 468311.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230714.09.15.45"}