{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Masks Not Required Indoors for Vaccinated; COVID-19 Vaccinations Encouraged", "description": "The County of San Diego continues to follow California Department of Public Health guidelines which require indoor masking of unvaccinated individuals and masking of everyone in certain settings", "datePublished": "2021-07-26T17:11:16-07:00", "url": "https://www.countynewscenter.com/masks-not-required-indoors-for-vaccinated-covid-19-vaccinations-encouraged/", "keywords": ["health", "cdph guidance", "coronavirus", "covid-19", "no masks", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-07-26T17:11:16-07:00", "articleType": "article", "articleContent": "\nWhile some counties in the state are requiring masks indoors regardless of COVID-19 vaccination status, the County of San Diego continues to follow California Department of Public Health guidelines which require indoor masking of unvaccinated individuals and masking of everyone in certain settings.\nCounty health officials say getting vaccinated is the most important step to prevent the spread of COVID-19, move the economy forward, reduce risk to the vulnerable and get back to our pre-pandemic way of life.\n“COVID-19 is now the pandemic of the unvaccinated,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Get vaccinated now especially since cases and hospitalizations have been going up.”\nState guidelines permit business to require masks for anyone indoors whether people are vaccinated or not. County health officials say San Diegans who feel uncomfortable around others should wear a mask if they want to.\n“Even though I am fully vaccinated, I still wear a mask in public,” said Eric McDonald, M.D., M.P.H., County chief medical officer. “People should take whatever precautions they want to prevent getting and spreading COVID-19, especially if they live with someone who is not able to get vaccinated or is immunocompromised.”\nNinety-eight percent of hospitalizations in the last 30 days are in people who are not vaccinated or have not completed the full series of the two-dose vaccine.\nAdditionally, about 150,000 San Diegans are only partially vaccinated and overdue for their second shot.\n“One dose of the vaccine does not give you enough immunity to prevent getting COVID-19, especially the Delta variant,” Wooten said. “Getting both doses of the Pfizer or Moderna vaccine gives you the best protection against all COVID-19 variants that are currently circulating.”\nAnother 2,044 COVID-19 cases and 55 hospitalizations were reported from Friday to Sunday (July 23-25). The number of community outbreaks is now at 27 after 12 more were confirmed over the past three days.\nThe County is working with medical providers to help them remind patients and is also using the San Diego Immunization Registry to develop follow-up reminders for those who are behind schedule with their second dose.\nTo facilitate access to COVID-19 vaccines, the County is now operating the Great Eight, a collection of geographically distributed no-cost vaccination sites that allow people to choose any one of the three vaccines available in the United States, Moderna, Pfizer and Johnson & Johnson. For a list of locations and more information, visit www.coronavirus-sd.com/vaccine.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210726.17.11.16"}