{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Love and Friendship of Shelter Pets Worth More Than a Pot of Gold", "description": "No matter if they’re a Siberian Husky, a German Shepherd, a Chihuahua, a Russian Blue or a Siamese cat, during March, everyone’s Irish at the San Diego County Animal Shelters. Let's help change their luck, shamrock style, by adopting or fostering an animal. Together, we can make a pot of gold difference in the lives of these deserving pets.", "datePublished": "2024-03-05T12:00:30-08:00", "url": "https://www.countynewscenter.com/help-shelter-pets-follow-the-rainbow-all-the-way-home/", "keywords": ["animals", "adopt pets", "das", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-03-05T16:13:54-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIn Summary: \n\nCounty Animal Shelters trying to find homes for homeless pets.\nCounty Animal Shelters waiving fees for some pets and for some adopters. \nPets offer positive health benefits for people, more than a pot of gold.\n\nNo matter if they’re a Siberian Husky, a German Shepherd, a Chihuahua, a Russian Blue or a Siamese cat, during March, everyone’s Irish at the San Diego County Animal Shelters.\nOf the pets in shelter care, over 40% of dogs and cats have been waiting for their furever home for over 30 days. Let’s help change their luck, shamrock style, by adopting or fostering an animal. Together, we can make a pot of gold difference in the lives of these deserving pets.\nThe adoption special spreads the luck of the Irish all month long. Adoption fees are always waived for:\n\nPets who have been at the shelter for 30+ days\nPets aged 8 years and older\nAdopters 60 years and older\n\nCheck out some of the available pets on the Animal Services website.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at the South Shelter, 5821 Sweetwater Road in Bonita and the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nAll adoption fees include spaying or neutering, a microchip, updated vaccinations and a one-year dog license for those in the service area.\nTo adopt, you just need a photo identification card. Adoptions are on a first-come, first-served basis. If you’re not sure, considering fostering a pet to see if it is a good fit, or just to give him or her a break from the shelter environment. Pets benefit tremendously from being in a home environment and learning how to be part of a family. All basic care supplies such as food, leash, and bedding, are included as part of the program.\nFor more information on fostering animals, making pet food donations, or volunteering for the shelter, call (619) 767-2675 or visit the Animal Services main website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240305.12.00.30"}