{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, Solana Center Offering Discounted Rain Barrels", "description": "It’s been a dry winter, but there’s still going to be rain as we head toward spring. And you still have time to make sure you catch every drop, cut your water costs and protect our beaches by ordering a discounted $90, top-of-the-line rain barrel.", "datePublished": "2020-02-06T14:34:28-08:00", "url": "https://www.countynewscenter.com/county-solana-center-offering-discounted-rain-barrels-2/", "keywords": ["environment", "stormwater", "sustainability", "water pollution", "water quality"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-02-06T14:34:28-08:00", "articleType": "article", "articleContent": "\nIt’s been pretty dry so far this winter, but the national weather service says there’s still going to be rain as we head toward spring.\nAnd you still have time to make sure you catch every drop, cut your water costs and protect our beaches by ordering a discounted $90, top-of-the-line rain barrel, thanks to the County’s Watershed Protection Program, the nonprofit Solana Center and Rain Water Solutions.\nAnd your final cost could be as low as $25 with the help of a couple of rebates.\nJust order an Ivy rain barrel online at the Solana Center’s website and choose to pick it up at the Solana Center’s offices in Encinitas or at one of two special events — Saturday, Feb. 22 in Spring Valley, or Saturday Feb. 29 in Ramona.\nThe rain barrels will not be shipped. Order your rain barrel by Feb. 16 to pick it up from 9 a.m. to 1 p.m. Saturday, Feb 22, at Spring Valley’s Mount Miguel High School at 8585 Blossom Lane. Order by Feb. 22 to pick your barrel up from 9 a.m. to 1 p.m. Saturday, Feb. 29 at the Ramona Community Center at 434 Aqua Lane.\nIf you can’t make either event, you can also pick up your barrel at the Solana Center’s Encinitas offices at 137 N. El Camino Real from 8:30 a.m. to 4 p.m. Tuesday’s through Thursdays, or from 9 a.m. to 1 p.m. Saturdays.\nCounty residents can apply for a $35 rebate that can shrink their rain barrel’s cost from $90 to $55 if they get their water from the Metropolitan Water District of Southern California — either through the San Diego County Water Authority or its participating member agencies in San Diego County.\nIn addition, the County of San Diego is giving out its own $30 discount to residents living in unincorporated areas on the first 200 rain barrels ordered, which can shrink your final cost to just $25.\nHaving a rain barrel can let you “harvest” rain right off your roof and use it to keep your gardens or lawns green the old-fashioned way. That can cut your water costs and even help protect our local beaches by preventing excess rain from washing pollution off our roofs and yards, and down our streets to the ocean.\nThe Ivy Rain Barrels have a locking, child-proof lid, are made of 100% recycled material, have overflow ports, protective screening to keep mosquitoes out, a ¾-inch ball valve to connect to your garden hose or to another barrel, and they don’t need pumps because they use gravity to dispense their collected rainwater.\nGetting your discounted rain barrel is as easy as one, two, three.\nOne, order your barrel. Two, apply for your rebate(s). Three, go pick up your barrel.\nOrder and buy your barrel\nGo to the County/Solana Center’s events website. Scroll halfway down the page and choose one of the three locations to pick up your rain barrel — at Spring Valley’s Mount Miguel High School, the Ramona Community Center, or the Solana Center in Encinitas. Once you choose a location, you can order and pay for your rain barrel with a credit card.\nIf you live in an unincorporated community or area and not in a city, remember to check the “unincorporated” box to make sure you are given the County’s $30 discount. The discount will be automatically applied to your purchase price when you’re buying your rain barrel. Solana Center officials will double-check after your purchase to make sure you’re eligible for the discount. You can check here to see a list of eligible, ineligible and potentially eligible ZIP codes.\nYou may buy as many rain barrels as you’d like, but the Metropolitan rebate and County discount are limited to two per household.\nFinally, remember that your rain barrel will not be delivered. You can pick it up at any of the three pickup locations.\nApply for your rebate(s)\n$35 rebates from the Metropolitan Water District are available within 90 days of ordering/buying your rain barrel, so as soon as you order your rain barrel go to Metropolitan’s SoCalWaterSmart rain barrel rebates webpage. Rebates are available on a first-come, first-served basis. You can check out the Metropolitan Water District rebates’ frequently asked questions and conditions for help.\nPick up your rain barrel!\nWhen you buy your barrel(s), Rain Water Solutions will email you a confirmation of your purchase (look for the email with the subject line “Order#… confirmed”). Remember to bring your confirmation email with you when you go to your chosen location to pick up your barrel. And remember to leave room in your car! Solana Center officials say that barrels fit easily in any four-door sedan or SUV and even into some two-door cars.\nFor more information, go to the Solana Center’s Rain Water Solutions webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200206.14.34.28"}