{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting Saturday, Seven Vote Centers Open for District Four Special Primary Election", "description": "If you live in District Four and would like to vote for a new County supervisor in person, you can do so before Election Day. In addition to voting at the Registrar’s office, you can cast your ballot at any one of seven vote centers starting Saturday, Aug. 5.", "datePublished": "2023-08-04T09:31:01-07:00", "url": "https://www.countynewscenter.com/starting-saturday-seven-vote-centers-open-for-district-four-special-primary-election/", "keywords": ["elections", "d4 special primary election", "district four", "registrar of voters", "vote centers", "vote centers open"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-08-04T09:56:09-07:00", "articleType": "article", "articleContent": "\nIf you live in District Four and would like to vote for a new County supervisor in person, you can do so before Election Day. In addition to voting at the Registrar’s office, you can cast your ballot at any one of seven vote centers starting Saturday, Aug. 5.\nThe vote centers will be open daily from 8 a.m. to 5 p.m. through Monday, Aug. 14 at the locations below:\n\nCuyamaca College\n\nPerforming Arts Center\n900 Rancho San Diego Pkwy., Lot 1\nEl Cajon, 92019\n\n\nEncanto VFW Post #1512\n\n6873 Federal Blvd.\nLemon Grove, 91945\n\n\nNorth Park Recreation Center\n\nMeeting Room\n4044 Idaho St.\nSan Diego, 92104\n\n\nColumbus Club of San Diego\n\nAssembly Hall\n4425 Home Ave.\nSan Diego, 92105\n\n\nFather Junipero Serra Hall\n\n2540 San Diego Ave.\nSan Diego, 92110\n\n\nNorth Clairemont Recreation Center\n\nMeeting Room 2\n4421 Bannock Ave.\nSan Diego, 92117\n\n\nSkyline Hills Branch Library\n\nMultipurpose Room\n7900 Paradise Valley Rd.\nSan Diego, 92139\n\n\n\nOn the final day of voting, Aug. 15, seven more vote centers will open for a total of 14 locations and the hours will change to 7 a.m. to 8 p.m. You can find a vote center or ballot drop box near you inside your voter information pamphlet. Or you can look up your pamphlet online at sdvote.com.\nVote centers have replaced polling places and provide more services. You can:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters will use a touch screen to make their selections on ballot marking devices. When finished, the voter will print out the official ballot, review it and hand it to a poll worker to insert it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate on the ballot. Additionally, an individual may not circulate any petitions, including for initiatives, referenda, recall or candidate nominations.\nVoters can still mark their ballot from home. Be sure to sign and date the return envelope, seal your completed ballot inside and return it to one of the Registrar’s official ballot drop boxes or vote centers. Or return your ballot through the U.S. Postal Service as long as it’s postmarked by Aug. 15.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com.\nLearn more about voting in the District 4 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\nGet mobile updates by texting COSD D4Election to 468311.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230804.09.31.01"}