{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Fatigue Causing Cases to Skyrocket", "description": "Over the last seven days, the number of COVID-19 cases skyrocketed, reaching a record 1,087 cases Nov. 14 and followed by 833 cases Nov. 15.", "datePublished": "2020-11-16T17:52:46-08:00", "url": "https://www.countynewscenter.com/covid-19-fatigue-causing-cases-to-skyrocket/", "keywords": ["health", "cease and desist", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-16T17:52:46-08:00", "articleType": "article", "articleContent": "\nToo many San Diegans are failing to take sufficient measures to protect themselves from getting or passing COVID-19.\nThat’s the explanation County health officials gave today for the record number of COVID-19 cases that have been reported recently.\nOver the last seven days, the number of COVID-19 cases skyrocketed, reaching a record 1,087 cases Nov. 14 and followed by 833 cases Nov. 15. More than 600 cases have been reported every single day in the past week. In the last seven days, 5,031 cases were reported, compared to 3,161 the previous week.\n“Exactly a month ago, we sounded the alarm about the possibility of entering the purple tier and last Tuesday we confirmed that we had moved to the most restrictive tier. I had hoped those warnings would lead to a new trend our personal and collective behavior,” said Wilma Wooten, M.D., M.P.H., County public health officer “Over the last weeks, we have seen the results of what can happen when we relax our personal behaviors and let down our guard.”\nCOVID-19 cases have been drastically increasing across the region, the state and the nation. California is now a sea of purple with 41 counties being in the most restrictive Purple Tier.\n\nThat’s why County health officials are strongly urging San Diegans to follow the public health guidance. That includes:\n\nWearing a face covering\nStaying six feet apart from others outside your household\nWashing your hands frequently\nAvoiding crowds, gatherings or groups\nStaying home if you are sick\n\n“Understand that you are taking action not because I ask you, but because the different entities that comprise the vital fabric of our community need you to take action. It’s that simple,” Wooten pleaded. “COVID-19 stops with you. Please do your part to ensure we slow the spread of COVID-19. We cannot afford to waste another minute.”\nReport Businesses Not Following Health Order\nThe County is stepping up its enforcement efforts to make sure businesses and other entities are following the local health order.\nThe County will be issuing more cease and desist orders to local businesses for failure to comply. If businesses continue to ignore the public health order, the County will issue closure orders. A list of cease and desist orders now available at www.coronavirus-sd.com.\nAdditionally, letters were issued to all local law enforcement agencies asking them to help enforce the local health order to prevent the spread of COVID-19 and drive the number of cases down.\nSan Diegans may report, anonymously, businesses or entities that are not following the local health order.\nYou can do it by calling (858) 694-2900 or emailing at SafeReopeningComplianceTeam@sdcounty.ca.gov\nThanksgiving Guidance\nThe County has issued COVID-19 guidance for Thanksgiving and other upcoming holidays.\nFor Thanksgiving, the following is recommended:\n\nRemote events with family and friends, such as a virtual dinner, sharing recipes, a virtual turkey trot or online game\nTelevised or live streaming events at home with members of your own household\nOutdoor orchards, food markets, and seasonal craft fairs where state guidance is followed\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 10.7 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nIndoor operations at restaurants, gyms, places of worship and movie theaters are not allowed.\nThe testing positivity percentage is 4.2%, placing it in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 6.5% and it’s in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Nov. 24.\n\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed on Nov. 15: five in restaurant/bar settings, one in a restaurant setting and one in a business setting.\nEight community outbreaks were confirmed Nov. 14: two in restaurant/bar settings, two in business settings, one in a restaurant setting, one in a daycare/preschool/childcare setting, one in a healthcare setting and one in a government setting.\nTwo community outbreaks were confirmed Nov. 13: one in a food processing setting and one in an emergency services setting.\nIn the past seven days (Nov. 9 through Nov. 15), 49 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n14,998 tests were reported to the County on Nov. 15, and the percentage of new laboratory-confirmed cases was 6%.\nThe 14-day rolling average percentage of positive cases is 4.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 14,685.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n833 new cases were confirmed among San Diego County residents on Nov. 15. The region’s total is now 65,601.\n4,212 or 6.4% of all cases have required hospitalization.\n960 or 1.5% of all cases and 22.8% of hospitalized cases had to be admitted to an intensive care unit.\nA new COVID-19 case rate mapshows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nNo new deaths were reported in the County on Nov. 14 or Nov. 15. The region’s total remains at 926.\nFive deaths were reported Nov. 13.\nFour women and one man died between Nov. 1 and Nov. 11. Their ages ranged from late 40s to late 80s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201116.17.52.46"}