{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Second Locally Acquired Dengue Case   ", "description": "The County is investigating a second case of locally acquired dengue. This second case is not related to the first case of locally acquired dengue that occurred earlier this month in Escondido.  ", "datePublished": "2024-10-25T08:45:51-07:00", "url": "https://www.countynewscenter.com/county-reports-second-locally-acquired-dengue-case/", "keywords": ["health", "dengue", "mosquitos", "public health", "san diego", "vista"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-10-25T08:47:50-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County is investigating a second case of locally acquired dengue. This second case is not related to the first case of locally acquired dengue that occurred earlier this month in Escondido.  \nThe Vista resident who became sick and hospitalized with dengue had not recently traveled to an area where the mosquito transmitted illness is common.   \n“As always, the County is closely monitoring these recent cases of locally acquired dengue and quickly responding to prevent the spread of illness,” said Dr. Seema Shah, County interim deputy public health officer. “While the risk of getting dengue continues to remain low, we are paying attention to increases in cases of dengue in California and across the U.S.”  \nCounty Vector Control is in Vista today through Oct. 29 treating the area around about 60 homes to keep mosquitoes from potentially spreading the dengue virus and protect the public’s health.  \nDengue is a tropical viral disease that is not commonly found in the United States. Since the invasive Aedes mosquitoes were first detected in San Diego County in 2014, there has been only one other locally acquired case of dengue in San Diego County.  \nPeople who travel to countries where dengue is common can get infected with dengue through mosquito bites. So far this year, there have been 53 cases of travel-related dengue in San Diego County.   \nInformation on Dengue  \nDengue is spread by mosquitoes, when a mosquito bites an infected person and then feeds on another person.  \nIt can take four to seven days for someone who is bitten by a mosquito infected with dengue to start feeling symptoms. Dengue can be determined by a blood test that can be discussed with a healthcare provider.  \nThe most common symptoms are fever, chills and any of the following: aches and pains (eye pain, muscle, joint or bone pain), nausea, vomiting, and rash.   \nSymptoms can be moderate and last two to seven days. Most people recover after about a week. However, symptoms can also become severe, including shock and respiratory distress. Some cases may require hospitalization and, while less common, can lead to death. There are no specific medicines to treat dengue.   \n“Fight the Bite” – How to Prevent and Protect Yourself from Mosquitos  \n\nDay-biting Aedes aegypti mosquitoes, also known as “ankle-biters,” are the primary transmitter of dengue. These mosquitoes like to live and breed around people, often in yards and in small amounts of water.  \n\n\nDump out, drain, or remove any items inside and outside of the home that can hold water, such as plant saucers, rain barrels, buckets, garbage cans, toys, old tires and wheelbarrows. Mosquitofish, available for free at locations throughout the county, may be used to control mosquito breeding in backyard standing water sources, such as unmaintained swimming pools, ponds, fountains and horse troughs.  \n\n\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors.   \n\n\nUse insect repellent that contains EPA-approved ingredients like DEET, picaridin, oil of lemon eucalyptus or IR3535.   \n\n\nMake sure screens on windows and doors are in good condition and secured to keep insects out.  \n\nThese methods are effective at reducing mosquito bites at home but are even more important when residents are traveling abroad to prevent dengue infection.  \nCounty Mosquito Control Efforts Underway  \nTrained County technicians are working to reduce the number of adult mosquitoes that can spread dengue by applying AquaDuet, a pesticide approved for use by the Environmental Protection Agency, using ultra-low-volume backpack sprayers in focused areas with trucks applying the product to a wider part of the area.  \nThe County began informing neighbors and leaving door hangers at homes in the treatment area Wednesday, Oct. 23. Treatment boundaries along with additional information can be found on Vector Control’s adult mosquito control webpage. The treatment product is low risk to people and pets and dissipates in roughly 20 to 30 minutes. People in the area can avoid or minimize their exposure to the pesticide by taking simple steps:  \n\nStay inside and bring pets indoors if possible  \n\n\nClose doors and windows, and turn off fans that bring outdoor air inside the home  \n\n\nWash any pet food and water bowls that were left outside during the treatment  \n\n\nCover fishponds to avoid direct exposure  \n\n\nRinse fruits and vegetables from your garden with water as you normally would before cooking or eating  \n\n\nWipe down or cover outdoor items such as toys and barbecue grills  \n\n\nBeekeepers and those with insects kept outdoors are encouraged to shelter hives and habitats during treatments. Beekeepers registered with the County’s Department of Agriculture, Weights and Measures can request to receive advance notice when a pesticide that may affect bees is applied to blossoming plants in their areas.  \n\n\nYou may resume normal activities 30 minutes after the treatment  \n\nFor more information about mosquitoes go to San Diego County’s “Fight the Bite”  website.   \nFor people in the affected area, County public health staff will be on site in Vista on Oct. 26 and Oct. 28 to answer questions and provide information about dengue.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241025.08.45.51"}