{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Volunteers Fan Out in Sewage Impacted South County Neighborhoods", "description": "Teams of volunteers hit the streets in South County this week to hand out information about an upcoming community health assessment related to the sewage pollution in the Tijuana River Valley.  ", "datePublished": "2024-10-04T15:29:44-07:00", "url": "https://www.countynewscenter.com/volunteers-fan-out-in-sewage-impacted-south-county-neighborhoods/", "keywords": ["health", "casper", "cdc", "health concerns", "sewage", "south bay", "south region", "tijuana river valley"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-10-07T09:17:44-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteTeams of volunteers hit the streets in South County this week to hand out information about an upcoming community health assessment related to the sewage pollution in the Tijuana River Valley.  \nThe volunteers stopped by about 6,000 households living near the polluted river valley to drop off information explaining the survey process that will be led by the Centers for Disease Control and Prevention (CDC) at the end of October. \nThis type of information gathering is known as a Community Assessment for Public Health Emergency Response or CAS0PER. It is designed to provide a front-line perspective of the health concerns and lifestyle impacts the sewage spills and odors are having on the community.  \nThe information collected will help local leaders better understand the health concerns and needs of the community and plan next steps in the ongoing response. \nLearn more about South Region Health Concerns.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241004.15.29.44"}