{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Infant Immunizations Dropped During COVID-19 Pandemic", "description": "The ongoing COVID-19 pandemic has yielded a troubling result: a drop in routine childhood vaccinations.", "datePublished": "2021-04-23T11:15:48-07:00", "url": "https://www.countynewscenter.com/infant-immunizations-dropped-during-covid-19-pandemic/", "keywords": ["health", "delayed vaccines", "national infant immunization week"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-23T11:20:21-07:00", "articleType": "article", "articleContent": "\nThe ongoing COVID-19 pandemic has yielded another troubling result: a drop in routine childhood vaccinations.\nA Centers for Disease Control and Prevention report published nearly a year ago revealed the number of children receiving routine vaccines dropped immediately after the United States declared a national emergency due to the coronavirus. The trend continued during the pandemic because of families staying at home.\nApril 24-May 1 is National Infant Immunization Week, and the County Health and Human Services Agency is urging parents to make sure their children are vaccinated against all vaccine-preventable diseases.\n“Vaccines help to prevent disease outbreaks,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Parents should make sure their children have all the recommended vaccines to protect them.”\nVaccines reduce disease, disability and death from a variety of infectious diseases.\nThe CDC recommends that children get vaccinated against 16 diseases.\nVaccine-preventable diseases are not that common in the United States thanks to vaccinations. However, these diseases continue to sicken people around the world, and cases of diseases like mumps, measles and pertussis, also called whooping cough, can and do happen in San Diego County.\nSeasonal influenza is more common and requires a new vaccine each year and is recommended for all children 6 months and older.\nAccording to the CDC, when children get vaccinated, an estimated 381 million illnesses, 24.5 million hospitalizations, and 855,000 deaths are prevented.\n“Vaccinations and doctor visits are essential to keep children healthy,” Wooten said.\nIn addition to infant immunizations, children need the following:\n\nChildren 4 to 6 years of age are due for boosters of DTaP (diphtheria, tetanus and pertussis), chickenpox, MMR (measles, mumps and rubella) and polio\nPreteens and teens need a Tdap booster shot to protect against tetanus, diphtheria and whooping cough\n\nParents can obtain the vaccines for their children through their regular medical provider. People with no medical insurance can get vaccinated at a County Public Health Center at no cost. Local retail pharmacies also offer some vaccinations for a fee.\nFor more information about vaccines, National Infant Immunization Week, or back-to-school vaccine requirements, visit the Health and Human Services Agency Immunization Unit  website at www.sandiegocounty.gov/iz or call (866) 358-2966. To find the nearest County Public Health Center or community clinic, call 2-1-1.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210423.11.15.48"}