{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Rental Assistance Available to Additional 10,000 Households", "description": "San Diego County residents who are economically impacted by COVID-19 could qualify for assistance of up to $3,000 to pay for past-due or upcoming rent.", "datePublished": "2020-11-24T10:14:08-08:00", "url": "https://www.countynewscenter.com/county-rental-assistance-available-to-additional-10000-households/", "keywords": ["health", "coronavirus", "covid-19", "rental assistance"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-24T10:14:08-08:00", "articleType": "article", "articleContent": "\nSan Diego County residents who are economically impacted by COVID-19 could qualify for assistance of up to $3,000 to pay for past-due or upcoming rent.\nThe County will be accepting new applications for the Emergency Rental Assistance Program starting December 1, 2020. Interested people can find more information about the program and apply starting at www.SDHCD.org.\nBecause of the economic downturn caused by the COVID-19 pandemic, many residents have been unable to pay rent, which can cause them to be evicted and lead to an increase in homelessness.\nUnderstanding the financial burden for both tenants and landlords, the County of San Diego Board of Supervisors allocated $27 million in funding for an Emergency Rental Assistance Program to ease that burden for thousands of county residents.\nThe County is anticipating awarding over $10 million in assistance to residents that applied during the first round of applications at the beginning of October.\nFor the new round of funding, the County will review applications as they are received and will continue to take applications until funds are depleted. Those who apply will be able to check their application status online at any point in the process.\nTo be eligible, households must be renting and have experienced a financial hardship directly related to COVID-19. This includes a loss or reduction of income due to COVID-19, or an increase in medical expenses incurred as a direct result of COVID-19.\nHouseholds must also fall under 60% Area Median Income to qualify. For example, to be eligible, a single-person household can earn up to $48,540 and a four-person household can earn up to $69,300. The program will be able to assist about 10,000 households.\nResidents who live in cities with their own COVID-19 rental relief program would not be eligible for the County program unless their cities’ funds have already been depleted.\nAlso, applicants must not receive any other forms of housing subsidy, such as Section 8, or other rental assistance programs, rapid rehousing assistance or rental assistance from nonprofit agencies.\nOnly one application per household will be accepted and the applicant’s landlord must agree to participate in the program for the County of San Diego to process the emergency rental assistance grant.\nFor more program information, including how to apply and detailed eligibility criteria, visit www.SDHCD.org.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201124.10.14.08"}