{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands Support for People Leaving Jail and Returning to Their Communities", "description": "The County of San Diego was awarded $6 million in Proposition 47 grant funding that will be used to help people returning to their communities after serving time in County jails.", "datePublished": "2022-08-01T09:04:44-07:00", "url": "https://www.countynewscenter.com/?p=209088", "keywords": ["public safety", "alternatives to incarceration", "andrea pella", "behavioral health", "community care coordination", "director of prevention", "diversion and re-entry", "lived experience", "prop 47 grant"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-08-01T09:04:44-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego was awarded $6 million in Proposition 47 grant funding that will be used to help people returning to their communities after serving time in County jails. The financial support is earmarked for those leaving custody who have a history of behavioral health needs and are homeless or at risk of homelessness. The County will also leverage an additional $4 million for a total program of $10 million.\n“The goal of this grant and the work of the Community Care Coordination team is to help people leaving jail to gain independence, reduce criminal behavior and future returns to jail, and therefore improve public safety,” said Andrea Pella, director of Prevention, Diversion and Re-Entry for San Diego County. “This program will provide connections to care and housing resources for those who may have otherwise been homeless upon their release from jail.”\nThe proposed program is modeled after San Diego County’s Community Care Coordination program that connects people to the services they need in the community.  Prior to their release from jail, an adult in custody is referred to a team of clinicians and peer support specialists with lived experience.  The team meets with the client, assesses their needs and helps connect them to community support like behavioral health services, housing, and employment opportunities.  When released, the person will be transported by someone from the Community Care Coordination team directly to temporary housing.  Soon after, the team connects the individual to behavioral health services for ongoing treatment.  Additionally, the team will introduce clients to job opportunities, benefit assistance, reconnect them with family, and develop longer term housing plans.\n“It is a wonderful opportunity to expand the framework of an existing successful program and advance the goals of the Board-driven Alternatives to Incarceration work that City and County health and justice partners are working tirelessly on,” Pella continues. “I appreciate the local advisory committee and county health partners’ commitment and collaboration to assist in the successful re-entry of our justice–involved population into the community.”\nThe program begins in September 2022 with a goal of serving 300 to 400 people before the grant period ends in June 2026.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220801.09.04.44"}