{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Election Results – When to Expect Them", "description": "On election night, we all want to know the results right away. But counting ballots takes time, and the November 3 Presidential General Election is more complicated than past elections due to the many changes related to the pandemic. Here are some reasons why:", "datePublished": "2020-11-03T12:07:15-08:00", "url": "https://www.countynewscenter.com/election-results-when-to-expect-them-6/", "keywords": ["elections", "ballots", "election day", "election results", "fgg", "nov. 3 election", "nov. 3 presidential general election", "provisional ballots", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-11-03T15:47:30-08:00", "articleType": "article", "articleContent": "\nOn election night, we all want to know the results right away. But counting ballots takes time, and the November 3 Presidential General Election is more complicated than past elections due to the many changes related to the pandemic. Here are some reasons why:\n\nRecord high number of 1.95 million registered voters.\nMore mail ballots than ever before because every active registered voter received a ballot in the mail.\nMail ballots can be counted if postmarked on or before Election Day and received up to Nov. 20.\nPolling places opened for a four-day period, Oct. 31 – Nov. 3.\n\nSo what can you expect on election night?\nThe first set of results comes in shortly after 8 p.m. Unlike past elections, where the first election night results encompass only mail ballots, the first report for the upcoming election will also contain polling place precinct ballots that returned to the Registrar’s office from Oct. 31 through Nov. 2.\nThe Election Day precinct ballots come in after the polls close at 8 p.m. and must be driven in from 235 polling places across the county.\nUpon arrival, the ballots are scanned and results will be periodically updated throughout the night until most of the precinct ballots have been counted.\nIt may be midnight, however, before all polling place ballots arrive at the Registrar’s. The final unofficial election night results may not come in until after 3 a.m. and will only cover the ballots that can be counted immediately. You can follow the Registrar’s office on Twitter for updates.\nThe record-breaking number of mail ballots that have been returned early shows how the pandemic has possibly changed voter behavior. The Registrar anticipates that only 20 to 30% will remain and be reported after the Election Night count.\nSome races may be considered easy to predict, but tight races will be up in the air.\nHere’s what remains to be counted.\nMail ballots. The Registrar’s office mailed over 1.95 million ballots for this election and anticipates between 250,000 to 300,000 mail ballots could be dropped off at the polls or picked up at the U.S. Postal Service on Election Day. Plus, mail ballots sent right before or on Election Day have 17 days to arrive if postmarked by Election Day.\nThen there are provisional ballots. People who missed the Oct. 19 registration deadline may conditionally register and vote provisionally up to and on Election Day.\nMore than 250,000 county residents who are not registered but otherwise eligible can take advantage of this, but for every provisional ballot, election workers must make sure the voter was eligible to vote – and eligible to vote on the races they marked on the ballot.\n“Between mail ballots and provisional ballots, a close race always comes to the very end,” said Vu. “We must do our due diligence to make sure everything is right.”\nSome races may not be decided for several weeks.\nHowever, the results must be certified 30 days after Election Day, on Dec. 3, and the Registrar expects to use every minute of the certification period to make sure the results are accurate.\nFor more information, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201103.12.07.15"}