{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves New Playground Makeover in Lakeside", "description": "The County Board of Supervisors approved the replacement of a playground at Cactus County Park in Lakeside this week, clearing the way toward hiring a contractor to begin construction.", "datePublished": "2024-10-24T15:48:10-07:00", "url": "https://www.countynewscenter.com/board-approves-new-playground-makeover-in-lakeside/", "keywords": ["parks and rec", "county parks and recreation", "lueg", "playground", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-10-25T08:48:35-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County Board of Supervisors approved the replacement of a playground at Cactus County Park in Lakeside this week, clearing the way toward hiring a contractor to begin construction.\nThe Department of Parks and Recreation operates more than 100 playground facilities throughout the county that promote health and wellness for youth across the region.\nThe County reviews its inventory and looks for playgrounds that have reached the end of their useful life.  Some playgrounds are more than 40 years old. The County prioritizes the oldest and most used playgrounds and replaces them.\nCactus County Park is a 59-acre park located in Lakeside that offers a trail for hikers and equestrians, softball fields, baseball Pony field for youth ages 12-16, an airstrip for radio-controlled airplanes and a BMX track.\nThe project will replace the existing 15-year-old preschool playground with new playground equipment, shade structure and add a new playground for children ages 2-5.\n\nThe new baseball-themed playground will provide a new play area for preschool children that exceed ADA requirements, increasing access for children of all abilities.\nOther improvements include new fencing for the ballfields, restoration of the dugouts and converting the boardroom to a snack bar.\nThis project is community-driven and was requested by the Lakeside Community Planning Group last month with a vote in favor of this project 11 to 1 (with 1 abstention).\nConstruction costs for playground equipment are estimated at $580,000. The remaining $1.17 million in project funding will be used for design and construction management.\nThe project construction is expected to begin in Summer 2025 and be completed in Fall 2025.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241024.15.48.10"}