{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Shake Out, Secure Your Space and Enable ShakeReadySD to Prepare for Earthquakes", "description": "Some natural disasters like earthquakes are unpredictable and can result in serious injury or worse. Join the 7.1 million Californians who have registered the Great California ShakeOut earthquake drill at 10:21 a.m.  on 10/21/21 and protect yourself and your family by practicing your response and securing items in your home and workspace. ", "datePublished": "2021-10-20T15:13:42-07:00", "url": "https://www.countynewscenter.com/shake-out-secure-your-space-and-enable-shakereadysd-to-prepare-for-earthquakes/", "keywords": ["public safety", "earthquake", "earthquake early warning", "emergency", "sd emergency", "shakeout", "shakereadysd"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-10-21T16:35:19-07:00", "articleType": "article", "articleContent": "\nSome natural disasters like earthquakes are unpredictable and can result in serious injury or worse. Join the 7.1 million Californians who have registered the Great California ShakeOut earthquake drill at 10:21 a.m.  on 10/21/21 and protect yourself and your family by practicing your response and securing items in your home and workspace.\nIt only takes a minute to Drop, Cover and Hold On for an earthquake drill, but if the time and Thursday are not convenient, you can schedule a better time and day for your family or workplace. Register here as an individual or a business to be counted as a participant.\n“Southern California is a seismically active region and the best thing we can do about that is be prepared and know what to do,” said Jeff Toney, director of the San Diego County Office of Emergency Services. “Secure items to minimize or avoid injuries. And download the County’s SD Emergency app to enable ShakeReadySD, which could give you a few seconds warning to seek cover during significant shaking.”\n\nDownload the SD Emergency app and learn about ShakeReadySD, Early Earthquake Warning, Powered by ShakeAlert®, a product of the U.S. Geological Survey.\nWhen you’re considering your Drop, Cover and Hold On response, remember you could be anywhere: at work, at home, outdoors or on a road. Learn about and discuss the safest response with your family or coworkers for various situations.\nYour surroundings are another important consideration since two-thirds of earthquake injuries occur from items that fall or break.  Learn how to check and secure your home or workplace for items that could become a hazard during extreme shaking.\nInformation on earthquakes and other hazards is also available at www.readysandiego.org in English and Spanish and includes a personal disaster plan template including one for people who may need assistance. The plan templates are available in 11 languages besides English. The SD Emergency App includes a version of the plan in English and Spanish.\nFor ideas on planning a drill at home or your place of business or promoting preparedness with friends or employees, visit the ShakeOut resources page with videos, fliers and an audio and video countdown for the drill. If conducting an indoor drill, please follow health and safety guidelines for COVID-19.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211020.15.13.42"}