{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Moves to Medium Risk in CDC’s COVID-19 Community Level", "description": "Due to high levels of virus spread in the community, the Centers for Disease Control and Prevention has moved the County of San Diego to its medium-risk level for COVID-19.", "datePublished": "2022-05-26T17:42:40-07:00", "url": "https://www.countynewscenter.com/county-moves-to-medium-risk-in-cdcs-covid-19-community-level/", "keywords": ["health", "community spread", "coronavirus", "covid-19", "monoclonal antibody treatment"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-05-27T13:41:39-07:00", "articleType": "article", "articleContent": "\nDue to high levels of virus spread in the community, the Centers for Disease Control and Prevention has moved San Diego County to its medium-risk level for COVID-19.\nThe CDC tracks community levels of the virus based on geographic regions to determine the impact of COVID-19 in communities, and to allow individual jurisdictions to implement preventive strategies based on the latest local data.\nThe CDC’s risk levels are low, medium, or high and a region’s level is determined by looking at hospital bed capacity, hospital admissions, and the total number of new COVID-19 cases in an area.\nWhat Actions You Can Take\nThe medium-risk level means that San Diegans who are immunocompromised should consider resuming higher levels of protective measures to prevent illness and speak to their doctor about other steps they can take to stay well.\nEveryone, regardless of individual risk level, should stay up to date with their vaccines and booster doses and get tested if they develop symptoms of COVID-19.\n“While facial coverings are no longer mandatory in most places, the County, along with the California Department of Public Health, strongly recommends masking, especially indoors and around those who may be vulnerable to COVID-19,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Spread of the virus has increased in recent weeks and we should step up individual efforts to keep our community safe.”\nCOVID-19 Treatment Available in San Diego\nIf you do get COVID-19, County health officials say treatment is available. Treatment can help prevent high-risk individuals from getting sick enough to need hospital services and even from dying from COVID.\nOral medications, in the form of pills, and monoclonal antibodies, in the form of an intravenous infusion, are available at multiple locations and community pharmacies across San Diego. Antiviral medications require a doctor’s prescription and should be started within five days of developing symptoms of COVID-19. Monoclonal antibodies should be given no more than seven days after the onset of symptoms.\nTo determine which treatment is best for you, talk to your doctor or health care provider, or call 2-1-1 to find a provider. Monoclonal Antibody Regional Centers (MARCs) offer treatment with the anti-viral pill Paxlovid and with monoclonal antibody Bebtelovimab, which are both effective against the Omicron variant. You can call (619) 685-2500, seven days a week, to schedule a no-cost appointment, regardless of health insurance or immigration status. A referral or prescription is not required.\nVaccination Progress:\n\nReceived at least one shot: More than 2.96 million or 94.1% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.62 million or 83.4%.\nBoosters administered: 1,330,530 or 58.5% of 2,273,207 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nSix additional deaths were reported since the last report on May 19. The region’s total is 5,288.\nOf those six additional deaths, three were men and three were women. They died between Jan. 21, 2022 and May 15, 2022; two of the deaths occurred in the past two weeks.\nFive of the people who died were 80 years or older and one was in their 70s.\nThree of the people who died were fully vaccinated and three were not fully vaccinated.\nAll had underlying medical conditions.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n3,857 COVID-19 cases were reported to the County in the past three days (May 23-25, 2022). The region’s total is now 784,203.\n8,850 cases were reported in the past week (May 19-May 25) compared to 7,007 infections identified the previous week (May 12-May 18).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 21.82 for people fully vaccinated and boosted, 12.59 for fully vaccinated people and 40.70 for not fully vaccinated San Diegans.\n13,982 tests were reported to the County on May 21, and the percentage of new positive cases was 8.6% (Data through May 21).\nThe 14-day rolling percentage of positive cases, among tests reported through May 21, is 7.3%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220526.17.42.40"}