{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Six Newly Elected County Officials Ceremonially Sworn into Office Monday", "description": "Six County officials took their oaths of office during a ceremonial swearing-in ceremony at the County Administration Center on Monday. Four were incumbents and two are new to their offices.", "datePublished": "2023-01-09T13:51:49-08:00", "url": "https://www.countynewscenter.com/?p=210453", "keywords": ["government", "2023 swearing-in ceremony", "assessor/recorder/county clerk", "ceremonial swearing-in ceremony", "dan mcallister", "district attorney", "jordan marks", "kelly martinez", "sheriff kelly a. martinez", "summer stephan", "supervisor jim desmond", "supervisor nathan fletcher", "treasurer/tax collector s office"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-01-09T13:51:49-08:00", "articleType": "article", "articleContent": "\nSix County officials took their oaths of office during a ceremonial swearing-in ceremony at the County Administration Center on Monday. Four were incumbents and two are new to their offices.\nSupervisor Nathan Fletcher was re-elected to a second four-year term. He represents the Fourth District, which includes the cities of Lemon Grove and La Mesa, parts of the City of San Diego, and unincorporated communities including Casa De Oro-Mount Helix, Rancho San Diego and Spring Valley. He was sworn in by Patrick Casao, Jr.\nDuring his remarks, Supervisor Fletcher highlighted the many ways the County has moved forward in issues important to the County. He also quoted Dr. Martin Luther King.\n“We cannot walk alone, and as we walk; we must make the pledge that we will march ahead. We cannot turn back,” said Supervisor Fletcher. “Our County government has turned in a stronger direction in the last four years and we cannot turn back. We have to continue those efforts moving forward on a path to a more perfect union and I’m honored to continue to serve.”\nSupervisor Jim Desmond was also re-elected to a second four-year term. He represents the Fifth District which spans the North County from Oceanside, Vista and San Marcos to Palomar Mountain, Borrego Springs and Ocotillo Wells. Rincon Band of Luiseño Indians Chairman Bo Mazzetti administered the oath of office.\nSupervisor Desmond told the audience he looks forward to working with the board to get things done and solve any issues. He said he works by the same principles as he did during his career as a commercial airline pilot.\n“Safety is number one, number two is proper management of the available resources, and quality of life with common sense and practical solutions. That is what I am going to continue in the future,” said Supervisor Desmond. “I look forward to working with this board and solving many of the issues that we still face in San Diego County and make it a better place for all. It is an honor to serve.”\nThe first woman to be elected sheriff in San Diego County was ceremonially sworn into office. Sheriff Kelly A. Martinez takes over for interim Sheriff Anthony Ray. He was appointed last March after Sheriff Bill Gore resigned. Sheriff Martinez was sworn in by San Diego Superior Court Judge Michael S. Groch.\nCounty District Attorney Summer Stephan won a second term of office. She was sworn in by San Diego Superior Court Presiding Judge Michael T. Smyth.\nBoth Sheriff Martinez and D.A. Stephan will serve a six-year term. A new state law extended the four-year term to six for sheriffs and district attorneys elected in 2022. The six-year term will put future law enforcement elections on track with presidential elections.\nJordan Marks was elected to his first term in office as Assessor/Recorder/County Clerk. The oath of office was administered by three-term former Assessor/Recorder/Clerk Ernest Dronenburg, Jr.\nTreasurer-Tax Collector Dan McAllister was re-elected to his sixth term of office. He was sworn in by Deborah Szekely.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230109.13.51.49"}