{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County on Pace to Meet 2030 Climate Action Goals", "description": "The County is making climate action progress by providing clean air and water, green jobs and improving public health, according to the 2022 climate action report.", "datePublished": "2023-08-07T12:19:11-07:00", "url": "https://www.countynewscenter.com/county-on-pace-to-meet-2030-climate-action-goals/", "keywords": ["environment", "climate action plan", "lueg", "sustainability and fighting climate change"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-08-07T12:19:11-07:00", "articleType": "article", "articleContent": "\nThe County is making climate action progress by providing clean air and water, green jobs and improving public health, according to the 2022 climate action report.\nThe County is helping the community thrive by protecting the region’s diverse natural resources. In 2022, County teleworking and alternate schedules avoided 36.5 million miles of commuting.\nThe County also reduced electricity consumption at its buildings by 46%, planted 3,913 trees and conserved more than 1,000 acres of open space. These accomplishments account for more than 25% of the 2030 emission reduction goals.\n\nHere are some of the County’s climate action measures:\n\nThe acquisition of open space and agricultural easements.\nTree planting initiatives and rain barrel programs.\nThe reduction of emissions associated with fuel consumed by County fleet vehicles.\nThe use of solar photovoltaic energy which is a renewable source of energy generated at County facilities.\n\n2022 County GHG reductions were equivalent to reducing the emissions from 25,679,419 gallons of gasoline! – U.S. EPA, Greenhouse Gas Equivalencies Calculator, 2023\nSince 2018 when the County officially began tracking climate action measures, it has:\n\nConserved 8,766 acres of open space.\nPermanently set aside 2,135 acres of farmland.\nPlanted more than 30,000 trees.\nCreated 369 miles of bike lanes.\nAdded 56 public electric vehicle charging stations.\nDistributed 10,493 rain barrels.\nContinued to support the use of clean energy by waiving solar permit fees.\n\nYou can find updates on all County greenhouse gas reduction measures here.\nThe County also continued to involve the community on other sustainability-related efforts. The County implemented the Electric Vehicle Roadmap and updated the Climate Action Plan (CAP).\nThe County is also developing the Regional Decarbonization Framework to plan for a zero-carbon future for the region.\nTo learn more about the CAP Update and get involved, visit our project website and follow along on Facebook, Instagram and Twitter.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230807.12.19.11"}