{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Get Vaccinated Ahead of Holiday Gatherings", "description": "With the holidays right around the corner, San Diegans are reminded to schedule their COVID-19 booster and flu vaccines as soon as possible to prevent the spread of illness during upcoming seasonal gatherings.", "datePublished": "2022-10-06T18:34:12-07:00", "url": "https://www.countynewscenter.com/get-vaccinated-ahead-of-holiday-gatherings/", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-10-06T18:34:12-07:00", "articleType": "article", "articleContent": "\nWith the holidays right around the corner, San Diegans are reminded to schedule their COVID-19 booster and flu vaccines as soon as possible to prevent the spread of illness during upcoming seasonal gatherings.\nIt is safe to get both the COVID-19 vaccine and flu shot during the same visit and the Centers for Disease Control and Prevention recommends that everyone 6 months or older get vaccinated against both viruses. COVID-19 primary series vaccines and bivalent boosters, as well as flu shots are widely available across the region.\n“Vaccines are safe and effective at preventing severe outcomes from disease, but it takes some time for them to take full effect after vaccination,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “It takes most people about two weeks to develop antibodies after vaccination, so I recommend scheduling your vaccination appointments as soon as possible to develop protection ahead of the holidays.”\nBooster Eligibility\nThe Pfizer/BioNTech and Moderna bivalent COVID boosters are readily available in the region. The Pfizer bivalent booster is available for anyone age 12 and older. The Moderna bivalent booster is available for anyone age 18 and older.\nBivalent boosters have not yet been authorized for children under the age of 12. Youths in that age group can get boosted with the previous version of the monovalent Pfizer vaccine.\nSan Diegans must be fully vaccinated with the primary series of one of the approved COVID-19 vaccines before receiving a bivalent booster, meaning they must have received the two-dose primary series of Pfizer, Moderna, or the relatively new Novavax. All of those vaccines remain widely available.\nAlso eligible for the bivalent booster are those who received at least one shot of the Janssen vaccine, which is no longer widely available.\nAnyone who wants to get a bivalent booster must wait at least eight weeks after they received a previous COVID-19 vaccine until they are eligible. In addition, anyone who is fully vaccinated or up-to-date and recently tested positive for COVID-19, should wait three months after infection to get a bivalent booster.\nVaccination Progress:\n\nClose to 2.69 million or 80.3% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBoosters administered: 1,467,090 or 59.6% of 2,462,965 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nSeven additional deaths were reported since the last report on Sept. 29, 2022. The region’s total is 5,498.\nOf the seven additional deaths, four were women and three were men. They died between Aug. 31, 2022 and Sept. 25, 2022.\nTwo of the people who died were 80 years or older, two were in their 70s, two were in their 60s, and one was in their 50s.\nFive were fully vaccinated and two were unvaccinated.\nFive had underlying medical conditions and two had medical conditions pending.\n\nCases, Case Rates and Testing:\n\n2,284 COVID-19 cases were reported to the County in the past seven days (Sept. 27 to Oct. 3, 2022). The region’s total is now 924,478.\nThe 2,284 cases reported in the past week were slightly lower compared to the 2,402 infections identified the previous week (Sept. 20 to Sept. 26, 2022).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 11.90 for people fully vaccinated and boosted, 6.98 for fully vaccinated people and 23.85 for San Diegans who are not fully vaccinated.\n5,524 tests were reported to the County on Oct. 1, and the percentage of new positive cases was 4.3% (Data through Oct. 1).\nThe 14-day rolling percentage of positive cases, among tests reported through Oct. 1, is 4.2%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221006.18.34.12"}