{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves Tobacco Retail Licensing Program", "description": "The County Board of Supervisors approved an ordinance Tuesday that will place additional restrictions on the sale of tobacco products in the unincorporated area of the county and facilitate enforcement of the new rules once they go into effect.", "datePublished": "2020-12-09T10:30:04-08:00", "url": "https://www.countynewscenter.com/board-approves-tobacco-retail-licensing-program/", "keywords": ["health", "tobacco", "tobacco retail licensing", "trl"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-12-09T10:30:04-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors approved an ordinance Tuesday that will place additional restrictions on the sale of tobacco products in the unincorporated area of the county and facilitate enforcement of the new rules once they go into effect.\nTuesday’s actions establish a tobacco retail licensing program, or TRL, that will allow the Board to regulate the operation of businesses that sell tobacco products. The TRL will require business owners to obtain a permit and stay in compliance with federal, state, and local tobacco control and youth tobacco access laws, or risk the suspension of their license.\nThe TRL will also cap the number of establishments that can sell tobacco products in the unincorporated area to 330 businesses.\nIn addition to prohibiting the in-person sale of tobacco and flavored tobacco products to those 21 or younger, the ordinance will ban the placement of tobacco vending machines in the unincorporated area of the county. Businesses that have onsite pharmacies will no longer be allowed to sell tobacco products.\nThe TRL will be transferable among immediate family members, as long as the business location does not change. The new owner will also have to meet the age requirement for selling tobacco products, meaning a TRL will not be transferable to anyone under the age of 21.\nThe Board action also establishes an age requirement for clerks who sell tobacco products. Salesclerks who are under the age of 18 will be allowed to sell tobacco products to those of legal age, as long as the clerk is under continuous supervision by someone 21 or older.\nThe new regulations will go into effect in July of next year.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201209.10.30.04"}