{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Emergency Preparedness Resource Fair and Discussion Set for Ramona", "description": "Community members can learn ways to prepare for an emergency like a fire or earthquake at a resource fair and panel discussion Saturday, August 19, 12:30 p.m. at the Ramona Library (1275 Main Street).   ", "datePublished": "2023-08-14T08:43:27-07:00", "url": "https://www.countynewscenter.com/emergency-resource-fair-and-discussion-set-for-ramona/", "keywords": ["health", "emergency", "fair", "preparedness", "wildfires"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-08-14T13:05:46-07:00", "articleType": "article", "articleContent": "\nCommunity members can learn ways to prepare for an emergency like a fire or earthquake at a resource fair and panel discussion Saturday, August 19 at 12:30 p.m. at the Ramona Library (1275 Main Street).   \nThe free event is hosted by the County’s Live Well San Diego Rural Communities Sector. It will bring together County emergency preparedness experts from the Sheriff’s Department, County Fire and Public Health Services. \nThe panel discussion will begin at 1 p.m. with information about how to prepare now before an emergency hits, and the types of disasters to prepare for, especially in the county’s rural areas.  \nOther topics will include how to stay safe and healthy during an evacuation, the importance of an evacuation route, how to make an emergency preparedness kit and ways to stay connected to up-to-date information from the County during an emergency.  \nSpanish interpretation will be available at the event. People who cannot attend the panel discussion in person can register to join via Zoom.  \nFamilies also can pick up free emergency gift bags, while supplies last by visiting at least 10 booths.  \nThe fair will feature a visit by the County’s Live Well on Wheels mobile office, offering services and resources such as CalFresh signup, immunization information, healthcare handouts, giveaways and kids’ activities.  \nParticipants can also take tours of emergency vehicles and see a fire extinguisher demonstration provided by the County’s Community Emergency Response Team. \nPlanning for emergencies is often top of mind for communities in rural parts of the County who have been affected most in the past, and this resource can help people get up to date on the latest information.  \nThe Live Well San Diego Rural Communities Sector was created during the COVID-19 pandemic to provide rural communities with regular, live, teleconferences and up to date information. Post emergency, it has continued to offer opportunities for community-based organizations, stakeholders and individuals to collaborate and share best practices to promote healthy, safe and thriving communities.  \nFor more information about the emergency preparedness event and about the Rural Communities Sector, visit them on the Live Well San Diego website. For additional information about emergency preparedness, visit ReadySanDiego.org.    \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230814.08.43.27"}