{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Input Sought for Display Honoring Tubman Chavez Community Center at New Southeastern Live Well Center", "description": "A community input tour to help select between two concepts to honor the Tubman Chavez Community Center is planned from January 14 through February 4. During tour stops, community members are invited to share their thoughts on a planned new display that will spotlight the rich history of the Tubman C...", "datePublished": "2023-01-13T12:45:09-08:00", "url": "https://www.countynewscenter.com/?p=210500", "keywords": ["health"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-01-13T13:13:56-08:00", "articleType": "article", "articleContent": "\nA community input tour to help select between two concepts to honor the Tubman-Chavez Community Center is planned from January 14 through February 4. During tour stops, community members are invited to share their thoughts on a planned new display that will spotlight the rich history of Tubman-Chavez.\n“Tubman Chavez Stories: A Community Cultural Display,” will honor the legacy and tell the stories of the community center which opened in 1995 and served the Southeastern San Diego community as a unifying gathering place.\nThe selected exhibit will be housed inside the main lobby corridor of the County of San Diego’s new Southeastern Live Well Center. Set to open this summer, the new center includes the former Tubman-Chavez Community Center property at the corner of Market Street and Euclid Avenue.\n“It’s important to highlight and celebrate the diverse history of this area by telling the vibrant stories of the Tubman-Chavez Community Center,” said Barbara Jiménez, County Community Operations Officer, Department of Homeless Solutions & Equitable Communities. “This historical display will support the vision to embrace the heart, spirit and legacy of that space, which continues today.”\nOrganized by Leah Goodwin of Leah Goodwin Creations, the project’s art consultant, the cultural display will feature artifacts, historic photos, audio recordings and videos that tell the story of the Tubman Chavez Community Center.\nThe Community Input Tour will bring the two design concepts to the public at a number of upcoming events (see below). A full list of locations, and the option to provide feedback online, will be available online at livewellsd.org/SELWC.\n“The voice of our community members has been so important in the creation of the Southeastern Live Well Center and this cultural display honoring the history of the Tubman-Chavez Community Center is a vital piece,” Goodwin explained. “We are looking forward to receiving the community’s feedback and implementing it in this new space.”\nTubman-Chavez Stories Display Concept A\nTubman-Chavez Stories Display Concept B\nThe Southeastern Live Well Center will house self-sufficiency and family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans’ services as well as space for community-based organizations and community meetings.\n \nCommunity Input Tour\n41st Annual Martin Luther King Jr. Day Parade\nLocation: Downtown, Harbor Drive – Embarcadero\nDate: Sunday, Jan. 15, 2 to 5 p.m.\nMarket Creek Plaza\nLocation: Market Creek Plaza\nDate: Friday, Jan. 20, 2 to 5 p.m.\nLunar New Year Festival in City Heights\nLocation: Henwood Memorial Park, 4455 Wightman St.\nDate: Friday, Jan. 20, 2023, 5 to 10 p.m. \nSaturday, Jan. 21, 10 a.m. to 10 p.m.\nSunday, Jan. 22, 10 a.m. to 5 p.m.\n13th Annual Dr. MLK Jr. Recreation Center Community Celebration\nLocation: MLK Jr. Recreation Center – 6401 Skyline Dr.\nDate: Saturday, Jan. 21, 7 a.m. to 4 p.m.\nSDHS Wellness Resource Fair\nLocation: SDHS Courtyard – 1405 Park Blvd\nDate: Wednesday, Jan. 25, 11:30 a.m. to 12:30 p.m.\nMonthly Community Health/Resource Fair\nLocation: Jackie Robinson YMCA – 151 YMCA Way\nDate: Wednesday, Feb. 1, 10 a.m. to 3 p.m.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230113.12.45.09"}