{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves New Master Plan for McClellan Palomar Airport Master", "description": "County Supervisors voted unanimously Wednesday to adopt a new 20-year master plan for McClellan-Palomar Airport designed to make the airport safer and quieter and which could entice small commercial air service back to the airport.", "datePublished": "2021-12-08T16:15:34-08:00", "url": "https://www.countynewscenter.com/board-approves-new-master-plan-for-mcclellan-palomar-airport-master/", "keywords": ["government", "county airports", "lueg", "mcclellan-palomar airport", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-12-08T16:58:09-08:00", "articleType": "article", "articleContent": "\nCounty Supervisors voted unanimously Wednesday to adopt a new 20-year master plan for McClellan-Palomar Airport designed to make the airport safer and quieter and which could potentially entice small commercial air service back to the airport.\nThe Board also approved the master plan’s environmental studies and directed County staff to create an Airport System Sustainability Plan for all eight County airports. That plan would make County airports meet overall carbon reduction regulations in both the Climate Action Plan that the County is working on and the County’s proposed Regional Decarbonization Framework.\nSupervisors said they were excited about the possibility of McClellan-Palomar becoming a leader in the air industry’s future transition to electric and alternative fuel aircraft. County staff said United Airlines recently ordered a fleet of 19-seat electric aircraft that could be flying by 2030 that would eliminate carbon emissions and reduce noise by nearly 70%.\nThe new master plan will not expand the airport’s existing boundaries or serve large commercial aircraft. However, it will add 200 feet to the east end of its runway, which will improve safety and reduce noise. Safety improvements will also add an arresting system to the west end of the runway designed to help stop aircraft in emergencies.\nThe 200-foot runway extension will make the airport safer by giving aircraft more room to land and take off. And County officials said it would decrease noise by giving aircraft more room to accelerate and fly higher, faster, which would help to minimize noise over nearby neighborhoods. Addressing the noise issue, supervisors also voted to lobby the Federal Aviation Administration to relax its “quiet hours” moratorium and allow the County to establish non-flying hours at the airport.\nCounty officials said the runway extension could also improve McClellan-Palomar’s prospects to lure back regional commercial air service, using smaller aircraft carrying 30 to 70 passengers.\nThe County worked extensively with the public and local jurisdictions including the City of Carlsbad as it created the master plan, including holding several public workshops, creating an informational website and conducting surveys.\nThe County met with Carlsbad staff more than a dozen times and met quarterly with Carlsbad and the cities of Oceanside, San Marcos and Vista. The Palomar Airport Advisory Committee unanimously voted to recommend approval of the master plan and environmental studies in October.\nThe master plan improvements are expected to increase McClellan-Palomar’s already large economic impact. The airport currently provides more than 2,500 jobs, over $460 million in local economic activity and generates more than $72 million in tax revenue.\nThe master plan will make McClellan-Palomar Airport eligible for FAA funding, which traditionally covers up to 90% of capital for safety improvements.\nThe estimated cost of the master plan’s safety improvements is roughly $42 million.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211208.16.15.34"}