{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "80th Assembly District Election Results – When to Expect Them", "description": "On election night, we all want to know the results right away, but counting ballots takes time, even for a special election such as the 80th Assembly District Primary Election.", "datePublished": "2022-04-05T13:02:07-07:00", "url": "https://www.countynewscenter.com/80th-assembly-district-election-results-when-to-expect-them/", "keywords": ["elections", "80th assembly district special primary election", "april 5 special primary election", "election results", "fgg", "mail ballot drop-off locations", "registrar of voters", "voting centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-04-05T13:02:07-07:00", "articleType": "article", "articleContent": "\nOn election night, we all want to know the results right away, but counting ballots takes time, even for a special election such as the 80th Assembly District Primary Election.\nSo, what can you expect on election night?\nThe first set of results comes in shortly after 8 p.m. They include ballots that were mailed in, returned to ballot drop box locations, or cast during early voting at the Registrar’s office and vote centers prior to Election Day.\nThe Election Day vote center ballots come in after the vote centers close at 8 p.m. and must be driven in from nine locations across the 80th Assembly District.\nUpon arrival, the ballots are scanned and results will be periodically updated until all of the vote center ballots have been counted. For the latest results on election night, you can visit sdvote.com or follow the Registrar’s office on Twitter.\nThe final unofficial election night results may not come in until midnight and will only cover the ballots that could be counted immediately.\nA number of outstanding mail ballots will still need to be counted. The Registrar’s office mailed nearly 250,000 ballots for this election and a portion of those were dropped off at vote centers or picked up by the U.S. Postal Service on Election Day. Mail ballots sent right before or on April 5 have seven days to arrive if postmarked by Election Day.\nThen there are provisional ballots. People who missed the March 21 registration deadline may conditionally register and vote provisionally up to and on Election Day.\nFor those who register on Election Day, they can do so at any vote center. We don’t know how many people might do so, but it adds to the number of provisional ballots.\nFor each provisional ballot, election workers must make sure the voter didn’t already cast a ballot or was otherwise ineligible to vote.\nElection workers must review and process every provisional and mail-in ballot envelope. It’s a labor-intensive, time-consuming process.\nHowever, the results must be certified on April 14, and the Registrar expects to use every minute of the certification period to make sure the results are accurate.\nIf a candidate receives a majority vote, then they are elected for the remainder of the current term, ending December 2022. If no candidate receives a majority vote, then the top two vote-getters will move on to the special general election on June 7.\nFor more information, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220405.13.02.07"}