{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Hires Basurto-Dávila to Lead Office of Evaluation, Performance and Analytics", "description": "The County of San Diego has hired Ricardo Basurto-Dávila to be its new Chief Evaluation Officer and lead one of the County’s newest offices, the Office of Evaluation, Performance and Analytics.", "datePublished": "2022-05-20T10:20:18-07:00", "url": "https://www.countynewscenter.com/?p=208566", "keywords": ["government", "fgg"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-05-20T10:22:31-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego has hired Ricardo Basurto-Dávila to be its new Chief Evaluation Officer and lead one of the County’s newest offices, the Office of Evaluation, Performance and Analytics.\nThe office’s job will be to increase the County’s ability to collect, share and analyze data to help County leaders create and improve policies and programs to address top priorities including mental health, homelessness, equity, racial justice, and climate change.\nCounty supervisors voted to create the office in May 2021, and it is still being developed.\nChief Administrative Officer Helen Robbins-Meyer said Basurto-Dávila will be a valuable addition to the County.\n“We conducted a nationwide search to find Ricardo and he brings a wealth of academic, research and data science experience to our County,” Robbins-Meyer said. “His experience in leading evaluation teams for the County of Los Angeles in the areas of health, justice, housing and social services will serve our Board perfectly as they look to create and improve policies. I’m excited that he will lead our efforts to become a national leader in the field of data-driven, evidence-based policy making.”\n“I am beyond excited!” Basurto-Dávila said. “I have a passion for finding the most effective ways to use data to help government leaders make their best decisions and San Diego County’s Office of Evaluation, Performance and Analytics creates the perfect opportunity to do that.”\nThe County hired a national search firm that talked with over 40 County and community leaders to help build a comprehensive pool of local and national candidates over a period of six months. Basurto-Dávila was selected from a group of six finalists from more than 200 candidates. He started his new position May 16.\nBasurto-Dávila most recently was a principal analyst at the County of Los Angeles Chief Information Office, where he led a data-science team with the county’s Analytics Center of Excellence. Before that he served as a health economist with the County of Los Angeles’ Department of Public Health, helping build and lead a team that conducted economic evaluations and health impact assessments of public policies. He also served as a Prevention Effectiveness Fellow with the national Centers for Disease Control and Prevention, where he helped use data analytics to evaluate U.S. and international responses to the 2009 H1N1 swine flu pandemic.\nBasurto-Dávila earned a doctorate in policy analysis from the Pardee RAND Graduate School in Santa Monica, California; a Master of Science in economics from the University of Texas at Austin; and a Bachelor of Arts from ITESM, the Tecnológico de Monterrey, in Monterrey, Mexico.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220520.10.20.18"}