{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports First Pediatric COVID-19 Death", "description": "The County Health and Human Services Agency is marking another sad milestone in the COVID-19 pandemic, reporting the first local pediatric death.", "datePublished": "2021-02-05T17:37:02-08:00", "url": "https://www.countynewscenter.com/county-reports-first-pediatric-covid-19-death/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-02-05T17:37:02-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is marking another sad milestone in the COVID-19 pandemic, reporting the first local pediatric death. The deceased was a 10-year-old boy with underlying medical conditions.\n“Our deepest condolences go out to the family and friends of this child,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “This boy’s death is a somber reminder that this pandemic impacts everyone in our community, regardless of their age, and we must do everything we can to protect each other and slow the spread of the virus.”\nWooten continues to urge San Diegans to do the following:\n\nWash your hands\nWatch your distance around others\nWear a mask\nWhen sick, stay home and get tested\nGet vaccinated when it is your turn\n\nSouth Bay Vaccination Clinic Moves\nThis coming Tuesday, Feb. 9, the County’s Imperial Beach walk-thru vaccination clinic is moving from its current location at Imperial Beach City Hall to the gym at Mar Vista High School, located at 505 Elm Avenue. The hours will remain the same, Sunday through Thursday, 9:30 a.m. to 3:30 p.m. and appointments are required.\nSo far, the County has opened four vaccination super stations and 15 smaller community points of dispensing, or PODs. Combined, they have the capacity to vaccinate 20,000 people daily, though vaccine supplies remain limited and not everyone who is currently eligible to be vaccinated may be able to get an appointment right away.\n“We’re asking San Diegans to be patient and to get vaccinated as soon as they are eligible and doses are available,” Wooten said.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 42.5 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 10.5%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 14% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 9.\n\nCommunity Setting Outbreaks:\n\n16 community outbreaks were confirmed Feb. 4: eight in business settings, two in daycare/preschool/childcare settings, two in TK-12 school settings, one in a construction setting, one in a faith-based setting, one in a healthcare setting and one in a hotel/resort/spa setting.\nIn the past seven days (Jan. 29 through Feb. 4), 68 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n23,259 tests were reported to the County on Feb. 4, and the percentage of new positive cases was 6%.\nThe 14-day rolling average percentage of positive cases is 7.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,354.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n1,453 cases were reported to the County on Feb. 4. The region’s total is now 244,069.\n10,517 or 4.3% of all cases have required hospitalization.\n1,488 or 0.6% of all cases and 14.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n39 new COVID-19 deaths were reported on Feb. 4. The region’s total is 2,777.\n15 women and 24 men died between Jan. 18 and Feb. 3.\nOf the 39 new deaths reported today, 21 people who died were 80 years or older, nine people were in their 70s, five people were in their 60s, two were in their 50s, one person was in their 40s and one person was a child.\n37 had underlying medical conditions, one did not have any underlying conditions and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210205.17.37.02"}