{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Monkeypox Health Emergency Is Expiring ", "description": "San Diego County’s local health emergency for monkeypox (MPOX) is expiring today, Thursday, Nov. 10.  ", "datePublished": "2022-11-10T16:11:56-08:00", "url": "https://www.countynewscenter.com/local-monkeypox-health-emergency-is-expiring/", "keywords": ["health", "monkeypox", "mpox"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-11-14T12:33:07-08:00", "articleType": "article", "articleContent": "\nSan Diego County’s local health emergency for monkeypox (MPOX) is expiring today, Thursday, Nov. 10.\nCounty Public Health officials are taking this step following a significant decrease in new MPOX cases, with five or fewer new cases per week since mid-October. This decline is a result of successful outbreak response measures including contact tracing and vaccinations.\nThe County declared the health emergency for MPOX on Aug. 2, 2022, to effectively respond to the virus and stay ahead of its spread, seek available resources, and ensure the most effective distribution of vaccine and treatment.\n“We have reached a point in our MPOX response where a local health emergency is no longer necessary, now that ample testing, treatment, and vaccines are available.” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “Although the virus remains in the region and there is still work to be done in stopping its spread, I am very proud of how the community and our healthcare partners collaborated in responding to the outbreak and am confident that will continue into the future.”\nWhile the emergency declaration has ended, the County will continue to provide the JYNNEOS vaccine, which helps protect people from getting MPOX, at vaccination events and County Public Health clinics. First and second dose vaccinations remain available at Public Health Centers. Those being vaccinated now have the option of an intradermal shot into the skin of the forearm, or a more traditional shot into the upper arm. Outreach and education efforts will also continue.\nNearly 13,000 people in San Diego County have received at least one dose of the JYNNEOS vaccine.\nEligible San Diegans who have not received their first or second dose of the JYNNEOS vaccine should do so to ensure maximum protection against the virus.\nThe County has had a total of 448 MPOX cases since the first case was reported on June 15.\nFor more information about where to get the vaccine and who is eligible for it, visit the County’s MPOX website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221110.16.11.56"}