{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mail Ballots to Arrive Soon for 79th Assembly District Election", "description": "Over 300,000 mail ballots will soon be on their way to registered voters eligible to vote in the 79th State Assembly District Primary Election on April 6.", "datePublished": "2021-03-04T14:59:55-08:00", "url": "https://www.countynewscenter.com/mail-ballots-to-arrive-soon-for-79th-assembly-district-election/", "keywords": ["elections", "2021", "79th assembly district", "april 6", "mail ballots", "special election", "vote safer san diego"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-03-04T15:12:02-08:00", "articleType": "article", "articleContent": "\nOver 300,000 mail ballots will soon be on their way to registered voters eligible to vote in the 79th State Assembly District Special Primary Election on April 6. You may find yours in your mailbox as early as Monday, March 8. You will also find your Sample Ballot & Voter Information Pamphlet and your “I Voted” sticker inside your official mail ballot packet.\nOnly those who live in the 79th District can vote in the election. The area encompasses southeastern San Diego, the cities of La Mesa and Lemon Grove, and parts of Chula Vista, Bonita, and National City. Not sure if you live in the 79th Assembly District? You can find out here.\nThe Registrar of Voters encourages voters in the 79th District to vote from home through its Vote Safer San Diego campaign. You can return your marked ballot in the pre-paid postage envelope to any U.S. Postal Service office or collection box. Voters who return their mail ballot through U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nStarting Monday, March 29, you’ll also have the option to drop off your ballot at one of many mail ballot drop-off locations around the district.\nYou can vote in person starting March 8. The Registrar’s office will be open for early voting from 8 a.m. to 5 p.m., Monday through Friday at 5600 Overland Ave. in Kearny Mesa.\nThe Registrar’s office and your assigned polling place will be open 7 a.m. to 8 p.m. on Election Day, April 6. You can find your assigned polling place inside your mail ballot packet or you can look it up online.\nBring your face mask and plan to maintain social distance. The Registrar of Voters is adhering to the County’s public health orders and will make reasonable accommodations when needed to ensure the health and safety of all election workers, voters and observers to our office and polling places.\nLearn more about voting in the 79th State Assembly District Special Primary Election at sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210304.14.59.55"}