{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Library First in California to be Certified Sustainable", "description": "With 33 branches and more than 300 library staff, San Diego County Library has become the first in California to be designated a “Certified Sustainable Library” through the Sustainable Libraries Initiative’s award-winning Sustainable Library Certification Program.", "datePublished": "2024-06-10T13:49:06-07:00", "url": "https://www.countynewscenter.com/county-library-first-in-california-to-be-certified-sustainable/", "keywords": ["library", "certified", "education", "environment", "equity", "libraries", "lueg", "san diego county library", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-06-10T15:12:59-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesWith 33 branches and more than 300 library staff, San Diego County Library has become the first in California to be designated a “Certified Sustainable Library” through the Sustainable Libraries Initiative’s award-winning Sustainable Library Certification Program.\nThis program demonstrates the County’s commitment to environmentally friendly practices by providing the public with resources that will help communities transition to a green, carbon-free economy.\n“We are incredibly proud to receive the Sustainable Library Certification, a clear reflection of our dedication to environmental stewardship. This achievement would not have been possible without the unwavering support of San Diego County and its Board of Supervisors, as well as the collaborative efforts of various County departments,” said Migell Acosta, Director of San Diego County Library.\nThe County works across the enterprise to support and enhance sustainable goals to address climate change. Several of the library buildings operate on net-zero energy or solar powered panels and six of its branches are LEED certified.\nThe library has also adopted several other eco-friendly methods to work toward a greener environment that include: planting more trees, adding bottle filling stations for water and purchasing 4 new all-electric outreach vehicles.\nCounty Library’s Sustainable Libraries Initiative Presentation\nEleven County branch libraries also offer starter seeds through the County’s Seeds and Sustainability program to promote community gardening and access to home-grown food!\nTo meet the needs of the County’s diverse population, the library provides training for employees from diverse backgrounds and encourages them to get involved with the community and share their ideas.\n“We also recognize our dedicated staff, whose hard work and commitment have been instrumental in reaching this milestone. Together, we are creating a more sustainable future for our community,” Acosta added.\nThe library focuses on bringing together San Diego’s diverse community through a variety of programs and services that are accessible to all. With programs celebrating international holidays, citizenship classes for immigrants and voter registration events to help keep people informed.\nThe library prioritizes social equity by providing access to more than 200,000 electronic books, magazines, newspapers and audiobooks. And the Libby app also allows readers to read their material in any one of 15 languages.\nLast year, the library won the Little Free Library Outstanding Achievement award. There are 53 library-sponsored Little Free Libraries constructed all around San Diego County where people in need can freely borrow or leave books for others to read. The library is hoping to expand to 100 Little Free Libraries by the end of 2025.\nIf you’re one of those who didn’t get to finish high school, you can also earn your diploma online through the County Library! Library High School offers adults the opportunity to earn an accredited high school diploma for free. The library has awarded over 150 diplomas to students to help build their careers.\nAs a steward for public health, the County has designated all library staff as disaster workers. The libraries are used as alternative sites for emergency services when other departments need help. County libraries are also listed as Cool Zone sites for people to go to if they need respite from extra-high temperatures.\nLooking toward the future, the library plans to transition more branches with greener materials and environmentally friendly practices. For more information about the County Library, go to its website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240610.13.49.06"}