{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 11-18-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Nov. 17.", "datePublished": "2020-11-18T15:52:48-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-11-18-2020/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-11-18T15:52:48-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Nov. 17.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 10.7 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nIndoor operations at restaurants, gyms, places of worship and movie theaters are not allowed.\nThe testing positivity percentage is 4.3%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.2% and it’s in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Nov. 24.\n\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed on Nov. 17: one in an emergency services setting, one in a restaurant/bar setting, two in daycare settings, two in business settings, and one in a grocery setting.\nIn the past seven days (Nov. 11 through Nov. 17), 38 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n14,306 tests were reported to the County on Nov. 17, and the percentage of new laboratory-confirmed cases was 6%.\nThe 14-day rolling average percentage of positive cases is 4.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 15,648.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n922 new cases were confirmed among San Diego County residents on Nov. 17. The region’s total is now 67,241.\n4,274 or 6.4% of all cases have required hospitalization.\n971 or 1.4% of all cases and 22.7% of hospitalized cases had to be admitted to an intensive care unit.\nA new COVID-19 case rate map shows how local cities and communities are being severely impacted by the virus.\n\nDeaths:\n\nTwelve new deaths were reported in the County on Nov. 17. The region’s total is now 945.\nSeven women and five men died between Nov. 5 and Nov. 17. Their ages ranged from late 50s to mid-90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website is updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201118.15.52.48"}