{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Next Steps for County Emergency Temporary Lodging Program", "description": "On March 12, the San Diego County Board of Supervisors voted to extend the Emergency Temporary Lodging Program.  The program, which was launched on Feb. 10, has provided emergency temporary lodging to nearly 900 families who were displaced by flooding from the Jan. 22 storm. ", "datePublished": "2024-03-22T11:46:40-07:00", "url": "https://www.countynewscenter.com/next-steps-for-county-emergency-temporary-lodging-program/", "keywords": ["government", "cal oes", "emergency temporary lodging program", "fema", "jan. 22 severe storm", "uber eats"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-03-22T12:00:07-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesOn March 12, the San Diego County Board of Supervisors voted to extend the Emergency Temporary Lodging Program. \nThe program, which was launched on Feb. 10, has provided emergency temporary lodging to nearly 900 families who were displaced by flooding from the Jan. 22 storm. \nCounty Emergency Temporary Lodging Program participants will have their eligibility reviewed on a routine basis. Depending on their eligibility and other factors, households in the program may be extended up to May 11. Program participants will be contacted before April 15 to determine their long-term housing plan. \nThe County, the California Governor’s Office of Emergency Services (Cal OES), and the Federal Emergency Management Agency (FEMA) are working together to help families displaced by the flooding. \nSome residents may be eligible for FEMA Rental Assistance, which may provide residents with financial assistance to pay for up to 18 months of rent. \nFamilies who receive funds through FEMA Rental Assistance can only use those funds on rent, deposits for rent, and/or to pay for utilities for newly rented properties. Any other use of FEMA Rental Assistance funds may make them ineligible for future FEMA Rental Assistance. \nThe County requires all eligible residents in the Emergency Temporary Lodging Program to apply for FEMA assistance. \nFEMA has opened two Disaster Recovery Centers to help residents impacted by the storm apply for federal assistance in person. The centers also offer information from the SBA, state agencies and the County of San Diego.  \nThe County is partnering with Uber Eats to help provide food for residents in the Emergency Temporary Lodging Program. \nEligible residents in the program will be provided with a digital voucher to purchase food through Uber Eats for themselves and their families.\nEach eligible household will receive a voucher via email and/or text. \nThe digital voucher’s amount will be determined by several factors: \n\nThe number of people in the household. \nIf their hotel is providing breakfast to program participants. \nIf the participants are receiving food from other organizations. \n\nThe voucher will be valid for seven days and cannot be used to buy alcohol or tobacco products. \nVisit AlertSanDiego.org/recovery for more information on available resources to residents and businesses impacted by the Jan. 22 storm and flooding.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240322.11.46.40"}