{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Record COVID Cases, Urges San Diegans to Take Precautions", "description": "The County of San Diego Health and Human Services Agency is reporting record numbers of new COVID-19 cases, even when factoring in that more than a third of the results from the previous three days are due to reporting delays from last week.", "datePublished": "2022-01-10T18:52:54-08:00", "url": "https://www.countynewscenter.com/county-reports-record-covid-cases-urges-san-diegans-to-take-precautions/", "keywords": ["health", "coronavirus", "covid-19", "omicron variant"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-01-10T19:18:05-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is reporting record numbers of new COVID-19 cases, even when factoring in that more than a third of the results from the previous three days are due to reporting delays from last week.\nThe record cases include 12,563 new cases reported for Sunday, 17,507 for Saturday and 19,009 for Friday. The previous daily high in cases was 8,313 reported for Jan. 2, 2022.\nThe surge in new COVID infections comes as local hospitals are struggling with staffing amid hundreds of their employees contracting the virus and being unable to report to their shifts.\n“We expected to see a surge after the holidays, especially with the arrival of the more transmissible Omicron variant, but these numbers are unprecedented in this pandemic,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The virus is everywhere in our community. We must all step up now and re-dedicate ourselves to the precautions that we know work.”\nThis includes:\n\nGetting vaccinated\nGetting a booster when eligible. Boosters are now available and recommended for everyone 12 years and older.\nWearing a tight-fitting mask indoors when in public places. The state currently requires masks in indoor public places.\nGetting tested only if you have symptoms.\nStaying home if you’re sick.\nIf you test positive at home, isolate for at least five days. A PCR test is not needed to confirm a positive rapid antigen test.\nSeeking treatment from your doctor if you have moderate to severe symptoms.\nEmployers should be flexible and if the job allows, let employees work remotely for their safety and the wellbeing of those around them.\n\nWooten also said that there is a misconception about the Omicron variant being far less dangerous or deadly than prior strains of COVID-19.\n“Hospitalizations are increasing amid this current surge and it’s important to understand that hospital admissions are a lagging indicator,” Wooten said. “We expect hospital admissions to increase even further in the coming weeks as people who are currently ill develop more severe symptoms.”\nTo help alleviate the strain on local hospitals and prepare them for the expected surge in admissions, County health officials recommend that only people with symptoms needing emergency care should go to a hospital emergency department.\nAt this time, COVID-19 testing should be reserved for those at higher risk of serious illness and people who need it the most. People should not go to an emergency department for testing with no or mild COVID symptoms.\nThe region’s health care providers offer testing to members who meet each systems’ criteria. Many neighborhood pharmacies offer same-day testing as do other locations. The County, which has about 10% of the region’s testing capacity, has a network of no-cost testing public sites that are both walk-up and can take appointments.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220110.18.52.54"}