{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "TB Exposure Reported at San Diego College of Continuing Education", "description": "The County’s Tuberculosis Program is working closely with San Diego College of Continuing Education to notify those who were potentially exposed to tuberculosis (TB).", "datePublished": "2024-05-29T16:40:15-07:00", "url": "https://www.countynewscenter.com/tb-exposure-reported-at-san-diego-college-of-continuing-education/", "keywords": ["health", "sdcce", "tb", "tb exposure", "tuberculosis"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-05-29T16:40:15-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Tuberculosis Program is working closely with San Diego College of Continuing Education to notify those who were potentially exposed to tuberculosis (TB). \nStudents, employees and staff were potentially exposed to TB at the Cesar E. Chavez campus from Nov. 27, 2023, to Feb. 29, 2024 on weekdays from 12:30 p.m. to 2:30 p.m., primarily in the Computer Lab in room 307.  Because TB can linger in the air for several hours, people who used the computer lab later in the afternoons may also be at risk. \nThe Tuberculosis Program is in the Public Health Services department of the County’s Health and Human Services Agency. TB is an airborne disease that is transmitted from person-to-person through inhalation of the bacteria from the air. The bacteria are spread when someone sick with TB coughs, speaks, sings, or breathes, often without being initially aware for weeks or months they have the disease. People with frequent and prolonged indoor exposure to a person who is sick with TB should get tested.  \n“Symptoms of active TB include persistent cough, fever, night sweats, and unexplained weight loss,” said Wilma Wooten, M.D., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with tuberculosis will become ill in the future, sometimes even years later, if their latent TB infection is not treated. Blood tests and skin tests are an effective way to determine an infection.”  \nPeople who test positive for TB, but who don’t have symptoms of active tuberculosis should get a chest x-ray and talk to a medical provider, as they likely have latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from ever getting sick. \nIt is important for individuals with symptoms of active TB and those who are immunocompromised to see a medical provider to rule out active tuberculosis and to discuss treatment. \nTB cases in San Diego County are on the rise in the past few years after decades of decline. In the early 1990s, more than 400 cases were reported annually. \nIn 2020, there were 193 TB cases, 201 in 2021 and 208 in 2022. In 2023, a total of 243 people were reported with active TB disease in San Diego County.   \nAn estimated 175,000 people in San Diego County have latent TB infection. Of these, 5% to 10% are at risk for developing active TB disease if they go without preventive treatment. While you may not have been exposed to TB from these exposures, if you would like to learn if you may have increased risk for TB for other reasons, you can assess your own risk for TB infection using the County TB Control Program’s risk assessment screening tool. \nPeople who would like more information on this potential exposure should call the County Tuberculosis Control Program at (619) 692-8621. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240529.16.40.15"}