{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "28K COVID-19 Vaccine Doses Arriving in San Diego", "description": "The first deliveries of vaccine for the novel coronavirus have started to arrive in San Diego.", "datePublished": "2020-12-14T14:48:23-08:00", "url": "https://www.countynewscenter.com/28k-covid-19-vaccine-doses-arriving-in-san-diego/", "keywords": ["health", "coronavirus", "covid-19", "vaccine"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-14T16:12:18-08:00", "articleType": "article", "articleContent": "\nThe first deliveries of vaccine for the novel coronavirus have started to arrive in San Diego.\nOver the next few days, the region will get about 28,000 of the 327,000 doses of the recently authorized Pfizer vaccine coming to California.\n“The arrival of the vaccine is great news and will give us the best tool to slow the spread of the pandemic,” said Wilma Wooten, M.D., M.P.H., County public health officer. “However, this does not mean people should not continue taking the necessary precautions to avoid getting COVID-19.”\nThe initial doses will go to acute health care personnel. Those doses are about 72% of what is needed to administer the first dose of all identified heath care recipients in the first tier.\nEach health care system will decide how to prioritize and administer the vaccines to its employees in the Phase 1A – Tier 1 guidelines. All 28,000 recipients will get their second dose when more Pfizer vaccine arrives in the region.\nThe initial shipments of the 28,000 vaccine doses are being delivered to the County, UC San Diego Health and Rady Children’s Hospital. The County is storing about 12,000 doses of vaccine in subzero freezers and will redistribute it to regional acute health care hospitals.\nCounty employees unpack more than 12,000 doses of COVID-19 vaccine to be stored in subzero freezers. They will go to regional acute health care hospitals.\nResidents and employees of skilled nursing facilities also have the highest priority to receive the new vaccine, but distribution to these recipients is being handled separately by the state.\nThose doses will go to local CVS and Walgreens pharmacies which will administer the vaccine to skilled nursing facility residents and staff.\nAs other pharmaceutical companies receive emergency use authorization from the U.S. Food and Drug Administration, more vaccines will arrive in the region.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201214.14.48.23"}