{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "A County First – Affordable Housing Opens on Excess Land", "description": "The County reached a milestone in efforts to address the region’s housing crisis. Officials celebrated the grand opening of the Levant Senior Cottages in Linda Vista on Thursday. The development is the first of 11 affordable housing projects to complete construction on County excess land. ", "datePublished": "2024-05-30T17:05:52-07:00", "url": "https://www.countynewscenter.com/a-county-first-affordable-housing-opens-on-excess-land/", "keywords": ["housing", "affordable housing", "dr. eric mcdonald", "excess land", "hhsa", "levant street cottages", "seniors", "supervisor monica montgomery steppe", "surplus land"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-05-30T17:05:52-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County reached a milestone in efforts to address the region’s housing crisis. \nOfficials celebrated the grand opening of the Levant Senior Cottages in Linda Vista on Thursday. The development is the first of 11 affordable housing projects to complete construction on County excess land.  \nThe Levant Street site was once home to an old child welfare center. The property now boasts 127 affordable units for low-income seniors. \nThe 4.5-acre site includes a combination of bungalows and studio apartments, a community building with a kitchen and computer lab, a small pet park and courtyard gardens.  \n“We know that we must do more to alleviate the housing burdens for all the people in our region,” said County Supervisor Monica Montgomery Steppe.  “Affordable housing for seniors is a moral obligation, and these Levant Senior Cottages provide a safe, stable environment without the constant fear of displacement.” \nThirty-two of the units are designated for seniors who qualify for PACE, Program of all Inclusive Care for the Elderly.   \n“St. Paul’s PACE program will provide wraparound medical care and social services,” said Health and Human Services Agency Interim Director Dr. Eric McDonald. “Our most vulnerable elderly residents can get the care they need right here onsite.” \nThe Levant Street development was a combined effort. \nThe County worked with Wakeland Housing and Development, and San Diego Kind Corporation to develop the property. The developers will lease the land for $1 a year and pay an annual $10,000 administrative payment to the County. The housing units will remain affordable for 70 years. \nThe San Diego Housing Commission provided 70 project-based vouchers. The state provided $19 million through the Multifamily Housing Program and over $20 million in federal tax credits.  \nSeniors who earned between 25 and 50% of the area median income qualified for the units. About 30% of their income will go toward rent. The monthly cost will range from $603 to $1,206.  \nOfficials broke ground at the Levant Street site in June 2022. The project is now complete, fully leased, and residents will move in next month. \nThe County and Wakeland are currently working on two of the 10 other affordable housing developments planned for excess County property. One will provide 334 affordable homes for families and seniors in Grantville, the second will house seniors in Ramona.   \nAffordable housing is a budget priority for the County. Since 2017, the County has invested $310 million into affordable housing, using excess land, its Innovative Housing Trust Fund and other state, federal and local funding sources administered by the County. The recommended budget calls for an additional $10 million toward the trust fund next fiscal year.  \nIn all, the County will contribute toward over 10,000 affordable housing units in the region providing homes to nearly 21,000 people.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240530.17.05.52"}