{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Leader Wins Prestigious Baldrige Foundation Leadership Award", "description": "The Foundation for the Malcolm Baldrige National Quality Award has recognized Barbara Jiménez, Community Operations Officer for the County’s Health and Human Services Agency, with a community leadership award. ", "datePublished": "2024-01-16T15:49:17-08:00", "url": "https://www.countynewscenter.com/county-leader-wins-prestigious-baldrige-foundation-leadership-award/", "keywords": ["government", "award", "baldrige", "barbara jimenez", "community"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-01-16T19:19:37-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe Foundation for the Malcolm Baldrige National Quality Award has recognized Barbara Jiménez, Community Operations Officer for the County’s Health and Human Services Agency, with a community leadership award. \nJiménez, who oversees the County’s Department of Homeless Solutions and Equitable Communities (HSEC), was among the national awardees representing large and small businesses, health care, education, nonprofit, cybersecurity, communities and government. \nThe Baldridge Foundation said today this is the first time ‘Community’ has been a category, and “the inaugural group embodies the type of role model leadership our communities and our country need.” \nAl Faber, president and CEO of the Foundation for the Malcolm Baldrige National Quality Award, Inc., said the leadership awards “recognize outstanding individuals, leaders, and supporters who embody Baldrige leadership and management values and principles, and who have provided outstanding service to the Baldrige community and beyond.” \nFor more than 30 years Jiménez has provided, promoted and overseen social and human services throughout San Diego County. Before being named HHSA Community Operations Officer in July 2021 and being tasked with creating HSEC, much of her career was focused on communities in South and Central San Diego.  \nShe is known for her binational and bilingual work and extensive community listening sessions, including steering Southeastern Live Well Center planning for nearly a decade. During the heart of the COVID-19 emergency, her responsibilities included coordinating with nonprofits the expansion of outreach and resources into neighborhoods where they were already embedded and trusted. \n“Barbara has a real passion for working side by side with the community, so this award is a perfect match,” said Dr. Eric McDonald, interim HHSA director. “We are thrilled for her, but frankly not surprised because we see the good work she does every day.” \nJiménez said she was both honored and surprised to learn of the award. \n“Having the opportunity to make a positive difference in people’s lives drives me and is something I couldn’t accomplish without the  support and dedication of countless coworkers,” said Jiménez. “This award is a tribute to all of our efforts, and I’m humbled to be the recipient.” \nThe Baldrige Foundation was created as the private partner to the Baldrige Performance Excellence Program in 1988. Its mission is to ensure the long-term financial viability of the Baldrige Performance Excellence Program and to support organizational performance excellence throughout the United States and the world. The Leadership Awards will be presented during the Foundation Awards Ceremony held as part of the annual Quest for Excellence conference near Washington, D.C. on April 9, 2024.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240116.15.49.17"}