{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Annual Report: New Challenges, Essential Services", "description": "The County of San Diego’s newly released 2020-21 Annual Report shows the County responding to new challenges while continuing to deliver its essential services.", "datePublished": "2021-10-05T17:04:33-07:00", "url": "https://www.countynewscenter.com/countys-annual-report-new-challenges-essential-services/", "keywords": ["government", "affordable housing", "annual report", "climate action", "climate justice", "community engagement", "covid-19", "government transparency", "racial equity", "reform", "social justice", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-10-05T17:04:33-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s newly released 2020-21 Annual Report shows the County responding to new challenges while continuing to deliver its essential services.\nThose challenges include acting to increase social justice, equity, reform, community engagement, transparency and sustainability across the breadth of County programs, to build a framework for the future and create a County that works for all people.\n“We hope this Annual Report gives our residents a snapshot of all the things their County government is doing,” said County Chief Administrative Officer Helen Robbins-Meyer. “Our top priority has always been, and remains, serving the residents of San Diego County.”  \nThe Annual Report breaks down County accomplishments over the past fiscal year into 10 categories: Behavioral Health, Climate Action and Sustainability, Community Investments, COVID-19 Response and Economic Recovery, Government Transparency, Health Equity, Homelessness, Housing Accessibility and Affordability, Public Safety and Justice Reform, and Racial Justice, Equity, Diversity & Inclusion.\nThe report notes that the County has created several new offices and departments to help it meet its new challenges. Some of those include the Office of Equity and Racial Justice; a Homeless Solutions and Equitable Communities department; the Office of Environmental and Climate Justice; and a data-driven Office of Evaluation, Performance and Analytics to help improve how the County evaluates programs and creates policy.\nSome of the highlights of the Annual Report include:\n\nThe County continued to invest money to improve behavioral health issues, from introducing Mobile Crisis Response Teams designed to help people experiencing mental health crises by dispatching behavioral health experts to emergency calls instead of law enforcement when appropriate — to the opening last week of new crisis stabilization unit in Vista.\nThe County put more than $134 million into an Emergency Rental Assistance Program to help thousands of renters hurt by the pandemic remain in their homes.\nThe County set up an Innovative Housing Trust Fund that has spent more than $50 million to create 1,397 new affordable housing units in 15 communities, and which has leveraged another $567 million in funds to be used to house low-income families, homeless veterans, people with disabilities and seniors.\nThe County is transforming the juvenile justice system to give young people the support they need to succeed. A key to that has included building a new Youth Transition Campus to create rehabilitative and therapeutic spaces on a campus-like setting.\nThe County is working to create a new Climate Action Plan and to lead a regional decarbonization effort that hopes to reduce carbon emissions to zero by 2035.\n\nThe County of San Diego provides services and programs that touch the lives of nearly every person who lives in the region.\nJust a few of those include providing public health services, which has gained prominence in response to the COVID-19 pandemic; law enforcement through the Sheriff’s Department; health and social services; land use in the unincorporated areas; running elections; operating County parks and the County’s 33 public libraries; investigating suspicious deaths through the County Medical Examiner’s office; monitoring beach water quality and overseeing disaster preparedness.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211005.17.04.33"}