{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Acts to Expand Open Space Near Mount Olympus County Preserve", "description": "The County took steps Wednesday to buy more land within the Pala-Pauma and Rainbow community areas for open space and species protection. The Board of Supervisors approved the purchase of 425 acres of land located near Mount Olympus County Preserve. ", "datePublished": "2023-06-14T12:36:16-07:00", "url": "https://www.countynewscenter.com/board-acts-to-expand-open-space-near-mount-olympus-county-preserve/", "keywords": ["parks and rec", "county parks", "lueg", "open space", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-06-14T12:55:30-07:00", "articleType": "article", "articleContent": "\nThe County took steps Wednesday to buy more land within the Pala-Pauma and Rainbow community areas for open space and species protection. The Board of Supervisors approved the purchase of 425 acres of land located near Mount Olympus County Preserve.\nCounty parks department officials said the land fits into the County’s North County Multiple Species Conservation Plan area and this purchase will permanently protect its chaparral, wetland and riparian habitats.\nThe additional acres expand the Mount Olympus County Preserve to more than 1,200 acres, providing a large shrubland habitat for deer, mountain lion and other sensitive species.\nThe appraised value of the additional land is $2,128,000, and the County will be able to use a $200,000 grant received from the California Habitat Conservation Fund toward the purchase.\nAcquiring this land will support multiple County sustainability goals under the Multiple Species Conservation Program (MSCP), set by federal and state requirements for special status species conservation.\nThe open space will:\n\nReduce greenhouse gas emissions by approximately 540 metric tons of carbon dioxide equivalent per year through preservation of open space—that’s equivalent to the amount of emissions produced by 120 gasoline-powered passenger vehicles per year.\nExpand opportunities for community members to access outdoor recreation and nature.\nExpand open space adjacent to native ecosystems and habitats.\n\nThe Department of Parks and Recreation evaluates multiple factors when considering open space land for potential acquisition and inclusion into County Preserves, including biology, connectivity, accessibility and value.\nA core aspect of the parks department’s conservation program is to have a positive impact on public health and provide open space lands to improve water and air quality for future generations.\nPlease visit the MSCP webpage for more information.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230614.12.36.16"}