{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Ag Pass Offers Help During Disaster", "description": "Disasters and wildfires threaten lives and businesses in San Diego County each year.  Often people are forced to gather up their most important possessions and evacuate to safety. But commercial livestock operations may be too large to evacuate all their animals immediately and need to return as quickly as possible to care for animals. Farmers also must abandon their operation, leaving crops and critical infrastructure unattended for extended periods. Now, operators can apply for an Agricultural and Livestock Pass (Ag Pass) program to return to an evacuated area to help when the threat diminishes.", "datePublished": "2023-04-05T17:09:51-07:00", "url": "https://www.countynewscenter.com/ag-pass-offers-help-during-disaster/", "keywords": ["agriculture", "ag pass", "county fire"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-04-06T09:25:42-07:00", "articleType": "article", "articleContent": "\nDisasters and wildfires threaten lives and businesses in San Diego County each year.  Often people are forced to gather up their most important possessions and evacuate to safety. But commercial livestock operations may be too large to evacuate all their animals immediately and need to return as quickly as possible to care for animals. Farmers also must abandon their operation, leaving crops and critical infrastructure unattended for extended periods. Now, operators can apply for an Agricultural and Livestock Pass (Ag Pass) program to return to an evacuated area to help when the threat diminishes.\nWhen a mandatory evacuation order is given, all people, including Ag Pass holders, must evacuate. When fire and law enforcement leaders allow, Ag Pass holders will be able to return to the area to move, feed and provide veterinary care of livestock, or work on irrigation systems, farm equipment and other essential infrastructure.\nAg Pass access is limited to daylight hours and doesn’t guarantee entry to an evacuated area.  Fire and law enforcement officials make the decision for entry based on fire behavior and public safety.\nTo take advantage of the program, commercial operators and managerial employees must attend a four-hour fire safety training and take annual refresher training. To date, 76 Ag Pass identification cards have been issued to individuals at 28 companies in the unincorporated areas of the County.\nThe pilot program started last year was limited to cattle and equine operations. Tuesday, Supervisors approved the immediate rollout of full implementation of the Ag Pass program, offering access to more than four thousand commercial agriculture and livestock operators in the unincorporated area.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230405.17.09.51"}