{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Crisis Stabilization Units Here for You", "description": "The County wants behavioral healthcare to be more accessible to everyone. Help for people needing crisis services is being offered at Crisis Stabilization Units (CSU) throughout the region so people can connect to care quickly and right in their own communities.", "datePublished": "2024-07-17T13:58:22-07:00", "url": "https://www.countynewscenter.com/county-crisis-stabilization-units-here-for-you/", "keywords": ["health", "access and crisis line", "behavioral health services", "crisis care", "crisis stabilization unit", "up2sd"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-07-17T13:58:22-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County wants behavioral healthcare to be more accessible to everyone. Help for people needing crisis services is being offered throughout the region so people can connect to care quickly and right in their own communities.\nCrisis Stabilization Units (CSUs) are available today in six locations across the county. Each one operates 24 hours a day, seven days a week, providing immediate mental health support and treatment services to people facing a behavioral health crisis. CSUs can help lower a person’s level of distress, prevent or treat a behavioral health crisis, and manage acute symptoms of a mental health condition for up to 23 hours.\nTomorrow, a groundbreaking celebration will be held in El Cajon where the County’s seventh crisis stabilization unit will begin construction to directly serve East County communities. It is expected to open fall 2025.\nAnyone in need of immediate behavioral health support should call 9-1-1. Help is also available by calling the County’s Access and Crisis Line at (888) 724-7240 or visiting www.Up2SD.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240717.13.58.22"}