{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Microbusinesses Get More Time to Apply for $2,500 County Grants", "description": "The smallest of San Diego County’s small businesses ― from dog walkers to tutors, sidewalk vendors and everything in between ― now have more time to apply for a $2,500 County grant.", "datePublished": "2022-06-23T08:43:04-07:00", "url": "https://www.countynewscenter.com/?p=208805", "keywords": ["government", "covid-19", "grant program", "microbusinesses", "small business"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-06-23T08:43:04-07:00", "articleType": "article", "articleContent": "\nThe smallest of San Diego County’s small businesses ― from dog walkers to tutors, sidewalk vendors and everything in between ― now have more time to apply for a free $2,500 County grant.\nThe deadline for “microbusinesses” hurt by COVID-19 to apply for the second round of $2,500 grants has been extended from June 24 to July 15.\nThe grants are partly funded by the California Office of the Small Business Advocate. A first round of grant applications closed in March.\nCounty supervisors unanimously approved in February giving out 1,550 of the $2,500 grants, totaling $3.8 million, to COVID-19-affected businesses earning less than $50,000 a year with fewer than five full-time employees.\nThe grants are being given out with a special emphasis on helping businesses run by people and groups that have historically faced barriers to obtaining capital, including women, minorities, veterans, limited English speakers, businesses in low- to mid-income rural areas and people without documentation.\nMicrobusinesses may be eligible for a $2,500 grant if their business:\n\nWas started before Dec. 31, 2019, is the owner’s primary source of revenue, and is currently operating or has a plan to reopen\nGenerated less than $50,000 in revenue in the 2019 tax year\nCurrently has five or fewer full-time employees and had five or fewer employees in 2019, 2020 and 2021\nWas significantly impacted by COVID-19\nHas not previously received any grant money from the California Small Business COVID-19 Relief Grant Program\n\nThe grants are available in all five County supervisorial districts and outreach is occurring in all districts.\nBusinesses that could benefit include home operations like pet sitters, shoppers, cleaners and home health care workers, and sidewalk vendors like food cart operators.\nThe grant application page can be reached either through the County’s Microbusiness COVID-19 Relief Grant Program webpage or directly at the Small Business Development Center’s website.\nThe County has contracted with Southwestern College’s Small Business Development Center to collect and process online applications and to conduct outreach along with the Asian Business Association of San Diego, the Logan Heights Community Development Corporation, the South County Economic Development Council and the San Diego East County Economic Development Council.\nThe County’s grants must be distributed in 2022. If there is grant money left after the first and second round, additional application periods will be held.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220623.08.43.04"}