{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tips to Have a Happy and Sustainable Holiday Season!", "description": "Gifts! Giving them, receiving them―they help put the happy in the holiday season. But all that gift-giving—from wrapping paper, packages and new items that may never be used—can take a toll on sustainability. So here are some tips to find ways to have happy holiday season while still preserving our environment and natural resources for our children and grandchildren.", "datePublished": "2022-12-08T08:54:58-08:00", "url": "https://www.countynewscenter.com/tips-to-have-a-happy-and-sustainable-holiday-season/", "keywords": ["environment", "climate action", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-12-08T08:54:58-08:00", "articleType": "article", "articleContent": "\nGifts! Giving them, receiving them―they help put the happy in the holiday season.\nBut all that gift-giving—from wrapping paper, packages and new items that may never be used—can take a toll on sustainability.\nWhat’s sustainability? It’s finding ways to meet our needs today while still preserving our environment and natural resources for our children and grandchildren by using fewer single-use items and consuming less stuff we may never use. And it’s important.\nThe County of San Diego thinks a lot about sustainability. For example, to address climate change and protect our environment, the County is working on an ambitious plan called the Regional Decarbonization Framework that would move our entire region toward zero-carbon emissions by 2045.\nBut we’re not just thinking about the big ways to address sustainability. Many County employees think about the little ways they, and all of us, can live in more sustainable ways. With that in mind, here are a few tips from County employees for having a more sustainable holiday season!\nGifts\nGive Experiences Instead of Things: One thing you can do to cut down on the accumulation of unnecessary stuff is to give gifts of “experiences” rather than items that will eventually be tossed out. For example, give someone tickets to a show, free lessons in something they’d enjoy, or a gift card to a local restaurant! For a list of experiences, you can go to WasteFreeSD’s “resources” page, do a word search for “experiences” and click on their “Gift Ideas—Experiences Instead of Things” webpage.\nDonations: Another thing you can give, or receive, instead of more physical stuff (do you really need another tie or blouse?) is to ask family and friends to donate to an animal rescue or a cause you’re interested in! Many animal organizations allow you to “sponsor” or “adopt” an animal virtually to rescue it and ensure it’s loved and cared for.\nLike the Kitchen? Bake a Gift! Everyone loves food at the holidays. And you don’t need to be a world-renowned chef to put a smile on someone’s face. You know, banana bread is really easy to make. Cookies, cakes, quick breads—you got this!\nGreen Thumbs? If you have any friends or family who like to garden or grow their own herbs, you can re-use portions of the empty cardboard tubes from paper towels to create planting “pots” for seedlings!\nShopping \nShop Local: Shopping locally, especially at businesses that feature sustainable and handcrafted gifts, can cut back on a lot of the carbon emissions that you’ll emit driving hither and yon to shop, or that are emitted shipping items to the stores you’re visiting.\nShop Online, give Yourself Time: If you do shop online, plan ahead and order early so items can be shipped by ground—truck, trains and ships—rather than having to be rush-shipped by air, which leaves a much larger carbon footprint.\nLook for Gifts Without a Lot of Packaging: Items like candles, soaps, coffee mugs, water bottles, cooking utensils, oils and sauces attractive enough to be given with just a homemade bow or come in containers that can be reused again and again.\nGive Gift Certificates to Zero Waste stores: There’s a movement in retail to create “zero-waste” stores—retailers that sell mostly in bulk or using compostable packaging, to customers carrying their own reusable containers.\nWrapping\nDitch the Fancy Wrapping Paper: There are a lot of ways you can wrap holiday gifts without getting the fancy paper wrapping. In fact, a lot of fancy paper wrapping can’t be recycled. Here are some alternatives. If you’re into crafts, you can sew your own bags to wrap gifts in, then reuse them every year! Not into sewing? You can use fabric scraps to wrap gifts. And remember to reuse ribbons and bags again in the future.\nAnother option is to use holiday decorative kitchen towels: Tie them up with a ribbon. They’re reusable and “who doesn’t want a new kitchen towel?\nRecycled Wrapping Paper: If you do use wrapping paper, choose wrapping paper that is made from recycled materials and can be recycled again.\nHoliday Cards\nGo Digital: Instead of buying and sending paper cards, send ecards, or post on social media like Instagram and Facebook to send holiday greetings to friends and family.\nDisplay the Cards You Receive for Year-round Artwork: If you receive paper holiday cards from friends and family, you can display them around your home to keep the holidays and your loved ones in your heart all year around!\n Food and Gatherings\nInviting Friends Over for Food? Plan ahead, shop smart and serve just enough to make everyone happy without wasting food. Of course, figuring out how much food to make can be difficult. However, SaveTheFood.com has a “Guest-imator” that can help you calculate just how much food you need to prepare, based on how many people you’re serving and how much they typically eat, even during holiday feasts.\nInvite Your Guests to BOYRFCs (Bring Your Own Reusable Food Container): Yeah, that abbreviation is unlikely to catch on. However, asking guests bring their own reusable “to go” containers is an idea that should catch on. That way if there are leftovers, it’s easy as pie for your guests to bring some home! No waste and no one-time-only food containers.\nRemember to Compost: And don’t forget to compost leftovers if you do have them. If you don’t have your own compost pile or bin, you can place any remaining food scraps and organic waste into your curbside green bin! (Note: If you have your own compost bin at home, don’t compost meats and bones; they can attract pests.)\nThe Tree!\nOrnaments: A lot of us are familiar with stringing popcorn and cranberry garlands to hang on the Christmas tree, but there are other alternatives as well. For example, you can cut slices of oranges, let them dry out and hang them from your tree!\nCraft Ornaments: You can also make your own craft ornaments from paper, pinecones, seashells and other items.\nLED lights: Of course, using LED tree lights instead of the older traditional bulbs not only uses less energy, but they are more environmentally friendly.\nRecycle the tree and wreaths: If you’re using a real tree and natural wreaths, remember to recycle them instead of tossing them out where they can end up in landfills to decompose and generate climate-changing methane.\nRecycled trees and wreaths can be turned into mulch to improve soils at parks, farms, home gardens and landscapes. Check with your waste hauler to find out if they offer curbside pickup. Or go to the County’s recycling and hazardous waste database, WastefreeSD.org, to find Christmas tree drop-off sites near you. It’s easy.\nSo, remember, sustainability is a gift for the earth, your children and their children. And have a Happy Sustainable Holiday Season!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221208.08.54.58"}