{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Participate in Interviews for Citizen Law Enforcement Review Board’s Next Executive Officer ", "description": "County residents will have the chance to join the interview process for the Citizens’ Law Enforcement Review Board (CLERB) Executive Officer opening. ", "datePublished": "2024-05-02T11:56:09-07:00", "url": "https://www.countynewscenter.com/participate-in-interviews-for-citizen-law-enforcement-review-boards-next-executive-officer/", "keywords": ["government", "citizens law enforcement review board", "clerb"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-05-02T12:00:09-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty residents will have the chance to join the interview process for the Citizens’ Law Enforcement Review Board (CLERB) Executive Officer opening. \nOne member of the public and one alternate will be randomly selected to represent each district at the May 28 CLERB meeting. The selected names will participate in the interview panel for the top two or three candidates.  \nIf you are interested in participating, email your name, address and the district you live in to clerb@sdcounty.ca.gov by 5 p.m. on May 23. \nIf you have any questions, contact the CLERB office at 619-238-6776. \nThe Executive Officer is responsible for managing and directing the department to ensure that the CLERB mission and vision are achieved through the investigative efforts for hearing and the resolution of complaints from members of the community relating to the law enforcement policies or practices of peace or custodial officers in the Sheriff’s and Probation Departments.  \nThey will also investigate in-custody deaths and serious bodily injuries relating to actions of law enforcement officers.  \nSee the job posting for more information about the position.  \nCLERB was established in 1990 to investigate citizen complaints against San Diego County Sheriff’s deputies and probation officers. The board is comprised of eleven volunteers who are supported by five County employees.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240502.11.56.09"}