{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "SD Emergency App Users Now Can Have Earthquake Early Warning", "description": "The County of San Diego’s SD Emergency app is now equipped with ShakeReadySD, an earthquake early warning system. This will let users know if an earthquake has occurred nearby that is likely to cause shaking within seconds and it will urge them to take protective action such as drop, cover and hold on or another appropriate safety measure.", "datePublished": "2021-08-25T14:11:47-07:00", "url": "https://www.countynewscenter.com/sd-emergency-app-users-now-can-have-earthquake-early-warning/", "keywords": ["public safety", "earthquake early warning", "emergency", "office of emergency services", "readysandiego", "sd emergency", "shakealert", "shakereadysd"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2021-08-25T14:57:40-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s SD Emergency app is now equipped with ShakeReadySD, an earthquake early warning system. This will let users know if an earthquake has occurred nearby that is likely to cause shaking within seconds and it will urge them to take protective action such as drop, cover and hold on or another appropriate safety measure.\nCounty officials were joined by a United States Geological Survey scientist Wednesday to roll out the improved mobile app at the County’s Emergency Operations Center in Kearny Mesa.\n“ShakeReadySD is a new feature of our SD Emergency app,” said County Board of Supervisors Chairman Nathan Fletcher. “This is an early warning system that has the potential to give users a few seconds warning or a heads up that an earthquake is coming. And that advance warning could make all the difference. It could give you a number of seconds to be able to move your family, your friends into a safe place and help avoid serious injury.\n“We really want to encourage people to download the application today, allow the notifications and put yourself in the best possible situation to be able to respond in the event of an earthquake.”\nThe County Office of Emergency Services has been working with the U.S. Geological Survey on the alert for more than a year. USGS has a network of more than 770 underground sensors and other technologies built to protect residents and visitors throughout California as part of its ShakeAlert® Earthquake Early Warning system, which is what powers the ShakeReadySD component of the SD Emergency App. This is the first time the ShakeAlert® system has been integrated into an existing emergency app.\n“When it comes to disasters, we plan for all hazards – earthquakes, fires, floods, terrorism, extreme weather,” said Jeff Toney, director of the San Diego County Office of Emergency Services. “And our SD Emergency app is a one-of-a-kind tool designed to provide all San Diegans valuable information before, during, and after disasters – all in the palm of your hand.”\nThe ShakeReadySD technology is designed to trigger an alert to your cellphone if you are in a location close enough to an earthquake with a magnitude 4.5 or greater with a shaking intensity of 3 or greater. Following the alert, the app could provide emergency notifications such as road closures, shelters or other relevant critical information as needed.\nSince it is tied to the statewide system of sensors, it will work anywhere in the state to alert people about imminent shaking.\n“ShakeReadySD can save lives and reduce injuries by giving people time to take a protective action like drop, cover, and hold on, or move away from hazardous areas,” said Robert-Michael de Groot of the USGS. “We look forward to working with San Diego County to provide real-time earthquake early warning alerts powered by ShakeAlert.”\nIn order for the new feature to work, users who already have the app will need to update it and then configure the settings including selecting English or Spanish and allowing the app to always track the phone’s location so it can accurately alert the user if an earthquake with moderate to strong shaking is expected in the area. If you have not yet downloaded SD Emergency, you only need to install the latest version on their mobile devices and configure the settings.\nThe app is now available for iOs and Android phones and is free. Visit ReadySanDiego to learn more.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210825.14.11.47"}