{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Could Go on State Watch List, Adopt More Restrictions", "description": "Spread of the novel coronavirus has caused the County of San Diego to be flagged by the California Department of Public Health, positioning the region to go on the state’s Watch List and ultimately face new closures if the number of COVID-19 cases continues to go up.", "datePublished": "2020-07-01T17:50:27-07:00", "url": "https://www.countynewscenter.com/county-could-go-on-state-watch-list-adopt-more-restrictions/", "keywords": ["health", "coronavirus", "covid-19", "watch list"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-02T11:53:05-07:00", "articleType": "article", "articleContent": "\nSpread of the novel coronavirus has caused the County of San Diego to be flagged by the California Department of Public Health, positioning the region to go on the state’s Watch List and ultimately face new closures if the number of COVID-19 cases continues to go up.\nOn June 30, the County was flagged because it surpassed the state’s trigger of no more than 100 positive cases per every 100,000 residents. On that day, the rate was 103.8 and rose to 105 July 1.\nIf the County has another day over that threshold, it will be placed the state’s Watch List on July 3 and monitored for an additional three days.\nIf the rate does not fall below 100 by July 6, then it would be required to adopt more restrictive measures and close indoor activities for three weeks at:\n\nRestaurants\nBars, breweries and wineries\nMovie theaters, family entertainment centers and cardrooms\nMuseums and zoos\n\n“If things don’t improve, we will be forced to take these additional measures,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We all should be wearing a face covering, staying away from others and taking other preventative measures to prevent the spread of COVID-19.”\nMasks, Distance Prevent Spread\nThe best way to prevent getting COVID-19 is to follow the public health guidance being issued by state and local health officials.\n“When people don’t follow the health guidance, they could be putting their lives and the lives of others in danger,” Wooten said.\nSan Diegans must do the following to protect themselves and the public’s health and keep other sectors of the economy from being closed:\n\nPractice good hand hygiene and sanitation\nKeep six feet apart\nWear a face covering\nAvoid crowded places\nStay home if they are sick\n\nNo Fourth of July Gatherings\nThe state, which is the entity issuing guidance on loosening public health restrictions, announced that Fourth of July fireworks are allowed but gatherings are not.\nAlso, outdoor picnics and barbecues can occur but only with household members, and they should take place at home or close to home.\nWhen outside the home, people should always wear a face covering and maintain physical distancing from others.\nLocal beaches will remain open for the 4th of July weekend. However, the state announced it will be closing parking lots at state beaches.\nLocally, cities will determine whether to close or limit parking at their beach lots.\nCOVID-19 Triggers, Tests, Cases and Deaths\nCommunity Outbreaks and Other Triggers:\nThe County is monitoring 13 measures, or triggers, that could prompt revisions to the health order.\n\nIn the past seven days, 13 community outbreaks were identified; three new outbreaks were identified June 30 at a restaurant, a source of food and a business.\nThe number of community outbreaks hit the trigger of seven in seven days.\nThe County also reached the Case Investigation trigger because only 69% of investigations were initiated within 24 hours of notification over a 7-day period. The percentage should be at least 71%.\n\nTesting:\n\n7,825 tests were reported to the County June 30 and 6% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 4.5%. \n\nCases:\n\n474 new cases were reported in San Diego County for a total of 14,623.\n1,791 or 12.2% of cases have required hospitalization.\n490 or 3.4% of all cases and 27.4% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSeven new COVID-19 deaths were reported for a regional total of 372.\nFour women and three men died between June 26 and June 30, and their ages ranged from 57 to 89 years.\nAll had underlying medical conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200701.17.50.27"}