{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Emergency Alert Tests Scheduled in San Diego County", "description": "The County Office of Emergency Services and the City of Chula Vista will be testing the Wireless Emergency Alert system next week. Wireless Emergency Alerts are a critical tool used to alert communities during an emergency or disaster.", "datePublished": "2022-09-07T08:56:57-07:00", "url": "https://www.countynewscenter.com/?p=209402", "keywords": ["government"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-09-07T09:06:51-07:00", "articleType": "article", "articleContent": "\nThe County Office of Emergency Services and the City of Chula Vista will be testing the Wireless Emergency Alert system next week.\nWireless Emergency Alerts are a critical tool used to alert communities during an emergency or disaster.  The Wireless Emergency Alert system is used to send text messages to cell phones in a specific area. The messages are sent to your mobile phone or other mobile device when you may be in harm’s way.\nThe City of Chula Vista will conduct a test of the Wireless Emergency Alert system Monday, September 12, 2022, at 3 p.m. and the text alert will be sent to phones near the Chula Vista Police Department located at 315 4th Ave., Chula Vista, CA 91910.\nThe San Diego County Office of Emergency Services will conduct a test of the Wireless Emergency Alert system Tuesday, September 13, 2022, at 3 p.m., near Julian.\nThe test message will go to all cell phones set up to receive “Public Safety Alerts” on their devices.  To see if you will receive alerts on your phone, check the Notifications folder on your device.\nThe test message will read “TEST. Go to https://www.fcc.gov/wea to provide feedback on your receipt of this test.”  The tests will target small areas but could be received by devices up to 10 miles away.\nThe test of the Wireless Emergency Alert system takes place during September, which is National Disaster Preparedness month.  San Diegans are urged to make a personal disaster plan, so you are better prepared for emergencies or disasters.  Your family should build a kit with items needed in case you need to evacuate your family and pets.  And stay informed by signing up for AlertSanDiego, the County’s emergency notification system. For more helpful disaster preparedness tips, visit ReadySanDiego.org.\nWEAs can be sent to your mobile device without the need to download an app or subscribe to a service. WEAs are messages that warn the public of an impending natural or human-made disaster. First responders may advise you to evacuate or to remain in place. The messages are short and can provide immediate, life-saving information.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220907.08.56.57"}