{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Creating 1,400 Affordable Housing Units", "description": "The County of San Diego is helping create almost 1,400 affordable housing units in 20 developments across 15 communities in the region.", "datePublished": "2021-08-31T15:07:45-07:00", "url": "https://www.countynewscenter.com/county-creating-1400-affordable-housing-units/", "keywords": ["government"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-08-31T15:08:36-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is helping create almost 1,400 affordable housing units in 20 developments across 15 communities in the region.\nThe figure was announced during an update Tuesday to the Board of Supervisors on the results of the Innovative Trust Fund, established by the County in 2017.\nThe Innovative Housing Trust Fund invested $50 million to build affordable housing units in the region. Those funds helped the County and its partners to leverage $567 million in other public and private funds to create and preserve 1,397 permanent affordable housing units throughout the county.\n“There is tremendous work being done countywide; not only to increase affordable apartment homes but also providing economic growth to the region,” said David Estrella, director of Housing and Community Development Services at the County Health and Human Services Agency (HHSA).\nOver the 99-year affordability period, the units created will serve an estimated 18,000 low-income families, older adults, veterans, developmentally disabled, people who are homeless and homeless with serious mental illness.\nFive of the 20 developments funded by the trust fund have opened over the past few years in the cities San Diego, Poway and Vista, and generated 368 affordable housing units.\nThe Grove in Vista has 81 apartments occupied by low-income seniors.\nThere are currently 10 developments under construction, and they are slated to be finished between Dec. 2021 and Jan. 2024. Five others are going through the financing process.\n“The Trust Fund is the first of its kind, being the first locally funded and administered program to offer funding for affordable housing throughout the entire San Diego region,” said HHSA Director Nick Macchione.\nAt the request of Supervisor Terra Lawson-Remer and Supervisor Joel Anderson, the Board also approved an additional $25 million to support the production of affordable housing.\nA total of $20 million of those funds will be used to create and/or preserve affordable housing in the region. Five million will be used for housing research, policy development, and piloting new programs and initiatives to develop comprehensive solutions that can accelerate housing production.\nThe goal is to come up with innovative housing solutions that advance equity, sustainability and affordability. It is estimated that the region will need about 83,000 affordable housing units by 2029 to keep up with population growth.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210831.15.07.45"}