{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Report to Address Inequity in the Region", "description": "Jobs and finances, food systems, health, and housing - data shows these areas have some of the largest equity gaps in the San Diego region. The Office of Equity and Racial Justice (OERJ) released the County’s first Equity Indicators Report on Wednesday.", "datePublished": "2024-02-07T11:16:55-08:00", "url": "https://www.countynewscenter.com/new-county-report-to-address-inequity-in-the-region/", "keywords": ["government", "and analytics", "equity indicators report", "food", "health", "housing", "jobs", "oepa", "oerj", "office of equity and racial justice", "office of evaluation", "performance"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-02-07T11:16:55-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesJobs and finances, food systems, health, and housing – data shows these areas have some of the largest equity gaps in the San Diego region.\nThe Office of Equity and Racial Justice (OERJ) released the County’s first Equity Indicators Report on Wednesday.\nThe report comes in the wake of the County’s declaration of racism as a public health crisis in January 2021.\nMany residents in San Diego County face oppression due to their race and ethnicity, gender, immigration status, disability, class and where they live. These residents suffer from inequities and racial disparities in ways that affect their health, safety, education, and wealth throughout their lifetimes.\nThe report clarifies where help is needed most so the County and other regional providers can identify spending priorities in the future as well as provide residents with data to assist in advocating for their communities.\nThe data will be updated annually to measure collective progress towards improving the quality of life for everyone.\n“It’s no secret that inequities exist in the region, but this report outlines where the problems are the greatest,” said OERJ Director Andrew Strong. “We have numbers that will help us, as a region, create solutions to address these issues and make changes that benefit all of us.”\nResearchers collected data and insights from County departments, community groups, stakeholders, regional and state data sources and the U.S. Census Bureau to compile 34 indicators across ten general themes.\nWith data from 2019-2022, some of the starkest differences are below:\n\nJobs and Finances:\n\n27% of people with disabilities were in the workforce versus 72% of non-disabled people. Black or African American and disabled people had the lowest employment rates of those in the workforce.\nBlack or African American, Hispanic or Latino, Native Hawaiian or Pacific Islander, some other race people, disabled residents and immigrants were more likely to be below 200% of the federal poverty level than other county residents.\nNative Hawaiian or Pacific Islander, Hispanic or Latino, and Black or African American children experienced poverty at more than twice the rate of White children in San Diego County.\nAbout 36% of residents did not make a self-sufficient wage.\n\n\nFood Systems:\n\nBlack or African American people were more than three times as likely to be enrolled in the Supplemental Nutrition Assistance Program (SNAP, called CalFresh in California) for food benefits than White people and twice as likely as county residents overall.\nData from 2019 show many areas of the County had few or very few grocery stores.\n\n\nHealth:\n\nLow birthweight was twice as common among births to Black or African American mothers compared to White mothers.\nThere was a 9.8-year gap between the lowest and highest life expectancies by race.\nOver a quarter of census tracts in San Diego County experienced either a mental health, dental, or primary care shortage.\nAmerican Indian or Alaska Natives were five times more likely to be uninsured, Hispanic or Latinos more than three times more likely, and Black or African Americans were twice more likely compared to White residents.\n\n\nHousing:\n\nWhite and Asian households were twice as likely to own their home compared to Black or African American residents.\nAbout 38% of households were cost-burdened. Black or African American households were more likely to spend more than half of their income toward housing compared to other households.\nThe City of San Diego, Oceanside, Chula Vista, and El Cajon had the greatest percentage of people experiencing homelessness in 2022.\n\n\n\nThe equity report also includes statistics on early childhood development, education, communities and civic life, infrastructure, parks and natural resources, crime and the legal system.\nThe County established the OERJ in 2020 to help San Diegans of every race, ethnicity, gender, age, ability and other identities reach their full potential.\nThe Office of Evaluation, Performance, and Analytics (OEPA) was created one year later. OEPA aims to improve quality of life for people in San Diego County by supporting County decisions through robust data and evidence.\nOERJ and OEPA worked with the San Diego Regional Policy & Innovation Center to create the report.\nYou can read the entire report on the OERJ website or the County’s Data Portal.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240207.11.16.55"}