{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Navy Association Takes Dogs Day Out to Pack Level", "description": "A dozen smiling dogs with wildly wagging tails led by Navy officers headed out to a Bonita trail for some exercise and fun Friday. This community service gives dogs a break from the shelter environment and lets them really stretch their legs. At the same time, it also helps advertise the foster program and adoption in the community. Visit fostering/Dogs Day Out on the San Diego County Department of Animal Services website to learn more about the program. ", "datePublished": "2024-12-13T16:07:06-08:00", "url": "https://www.countynewscenter.com/navy-association-takes-dogs-day-out-to-pack-level/", "keywords": [], "author": [{"type": "@Person", "name": "CNC TV", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "CNC", "familyName": "TV"}], "dateModified": "2024-12-13T16:07:06-08:00", "articleType": "video.other", "articleContent": "\nReading Time:  < 1 minuteA dozen smiling dogs with wildly wagging tails led by Navy officers headed out to a Bonita trail for some exercise and fun Friday. When the Navy’s Second Class Petty Officer Association reached out to the County’s Department of Animal Services asking to help in a way that would be meaningful, staff told them about the new Dog’s Day Out program. The program is a service to the community that allows people to foster an animal for a day or just a few hours for an outing. This service gives dogs a break from the shelter environment and lets them really stretch their legs. At the same time, it also helps advertise the foster program and adoption in the community. Visit fostering/Dogs Day Out on the San Diego County Department of Animal Services website to learn more about the program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241213.16.07.06"}