{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "No COVID-19 Testing Required Before Employees Can Go Back to Work", "description": "Based on new guidance from the Centers for Disease Control and Prevention, it is no longer recommended that employers require employees who tested positive for COVID-19 to be tested again before they can return to work.", "datePublished": "2020-07-27T17:06:48-07:00", "url": "https://www.countynewscenter.com/no-covid-19-testing-required-before-employees-can-go-back-to-work/", "keywords": ["health", "coronavirus", "covid-19", "covid-19 testing", "employers"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-28T09:46:06-07:00", "articleType": "article", "articleContent": "\nBased on new guidance from the Centers for Disease Control and Prevention, it is no longer recommended that employers require employees who tested positive for COVID-19 to be tested again before they can return to work.\nThe CDC test-based strategy is no longer recommended to determine when to discontinue home isolation, except in certain circumstances.\nPeople with COVID-19 who have mild to moderate symptoms and were directed to care for themselves at home may discontinue isolation under the following conditions:\n\nAt least 10 days have passed since symptoms began, have not had a fever for 24 hours without taking fever reducing medications and other symptoms have resolved.\nA limited number of people who have severe or critical illness or are severely immunocompromised are recommended to wait 20 days after symptoms developed and one day after fever resolution and improving symptoms.\nPeople who are severely immunocompromised but have no symptoms can leave isolation after 20 days after testing positive.\nPeople who tested positive for the novel coronavirus but never developed symptoms can stop isolation and other precautions 10 days after the date of their first diagnostic positive test virus.\n\n“Employers do not need to follow the test-based strategy for their employees to go back to work,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Employers must ensure that employees have met the new criteria to be released from isolation.”\nThe County has updated the County’s Health Officer Order to reflect these changes.\nDeaths, Cases in Congregate and Community Settings\nTo date, 133 COVID-19 deaths and 1,054 cases (675 residents and 379 staff) have been reported in skilled-nursing facilities.\nEighty-nine deaths and 1,074 cases (649 residents and 425 staff) have been reported in other congregate settings.\nIn comparison, nine COVID-19 deaths and a total 981 cases have been reported in outbreaks in community settings.\nCommunity Outbreaks Increasing\nThe number of COVID-19 outbreaks in community settings continue to be reported throughout the region. It has increased dramatically in July.\nOf the 120 COVID-19 outbreaks confirmed in community settings since the pandemic began, 59 have been reported in July. The total has surpassed the 34 that were reported in June and the 27 that were confirmed during the first three months of the pandemic.\n\nRestaurants with bars account for the great majority of community outbreaks confirmed this month. The County Department of Environmental Health continues to work with restaurants to make sure they are following the public health guidelines.\nCommunity Setting Outbreaks:\n\nTwo new outbreaks were identified on July 26, one in a business and another in a restaurant/bar.\nIn the past seven days, 13 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n6,456 tests were reported to the County on July 26 and 8% were laboratory-confirmed positive new cases.\nThe 14-day rolling average percentage of positive cases is 5.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,997. \n\nCases:\n\n523 new cases were reported in San Diego County for a total of 27,507.\n2,405 or 8.7% of cases have required hospitalization.\n618 or 2.3% of all cases and 25.7% of hospitalized cases had to be admitted to an intensive care unit. \n\nDeaths:\n\nNo COVID-19 deaths were reported in San Diego County on July 26. The region’s total remains at 533.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200727.17.06.48"}