{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Report Storm Damage in Unincorporated San Diego County with the Tell Us Now App", "description": "Most people in the region likely noted this week's rain and — in some parts of the county—snow. Residents of San Diego County’s unincorporated areas can report non-emergency storm damage through the “Tell Us Now!” app. ", "datePublished": "2025-03-14T16:16:01-07:00", "url": "https://www.countynewscenter.com/report-storm-damage-in-unincorporated-san-diego-county-with-the-tell-us-now-app/", "keywords": ["consumer", "flood damage", "rain", "road repair", "snow", "tell us now! app"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2025-03-14T16:16:01-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteMost people in the region likely noted this week’s rain and — in some parts of the county—snow. Residents of San Diego County’s unincorporated areas can report non-emergency storm damage through the “Tell Us Now!” app. \nStorm damage includes potholes, fallen trees, flooded roadways and downed powerlines. The free app makes it easy to report these issues and track the progress of your report on your smartphone. \nYou can download the app on both Apple and Android devices, it is also available in Spanish for those whose phone settings are set to Spanish. \nHow to Submit a Report \nTo report storm-related damage in unincorporated areas, follow these steps: \n\nDownload and open the Tell Us Now! app on your Apple or Android device. \n\n\nSelect a category and the nature of the request. \n\n\nAttach a photo of the request if available. \n\n\nProvide the location and a description of the request. \n\n\nEnter your contact information. \n\n\nSubmit the request. \n\nWhen a report is submitted, the appropriate County departments will be quickly notified. If the complaint is not under the County’s jurisdiction, the app will notify you of the correct authority to contact to fix the problem. \nIn addition to storm-related issues, residents can also report: \n\nAir quality complaints, such as smoke, odors or dust. \n\n\nVector control issues, like mosquito breeding areas, green pools or dead birds, which can be indicators of West Nile virus. \n\n\nCode compliance issues, like abandoned vehicles, graffiti or illegal dumping. \n\n\nPricing and scale issues at businesses, including gas pumps and grocery stores. \n\n\nNon-emergency problems at a County-operated park or space. \n\n\nOther road service requests that are not storm related. \n\nThe app is available in the app stores for iPhone and Android smartphones. Download and Tell Us Now! \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250314.16.16.01"}