{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrating Emergency Medical Services Professionals, Recertifying Skills Competency", "description": "The County’s Emergency Medical Services office thanked Emergency Medical Services (EMS professionals and held free skills verification sessions as part of the 50th Anniversary of EMS Week.", "datePublished": "2024-05-20T18:12:41-07:00", "url": "https://www.countynewscenter.com/celebrating-emergency-medical-services-professionals-recertifying-skills-competency/", "keywords": ["public safety", "county ems", "ems week"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-05-20T18:13:15-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County’s Emergency Medical Services office thanked Emergency Medical Services (EMS) professionals and held free skills verification sessions as part of the 50th Anniversary of EMS Week.\n“Although we dedicate one week a year to our EMS professionals, the fact of the matter is it’s really every single day that we want to recognize the incredible work that they do. EMTs and paramedics and other EMS first responders have an incredibly difficult job, they are often first on the scene for tragic medical emergencies,” said Jeff Collins, director of the San Diego County Fire Protection District at this recognition and training event May 20 at the County Operations Center in Kearny Mesa. “When our health is at its worst, they have to be at their best.”\nCollins said there are an estimated 10,000 EMS professional workers in San Diego County, including a significant fraction of those men and women not affiliated with a professional organization, but who signed up to help in their communities.\nIn a room behind the emergency medical service displays, CAL FIRE Engineer Paramedic Michael Wright led a group of about four EMTs who were being recertified. He estimated that he had provided testing for 40 to 50 EMS personnel and expected similar numbers in the afternoon session.\n“Today, we’re doing EMT skills verification. Every two years, EMTs must complete these hands-on skills to renew their state certification. This proficiency demonstration is important to ensure our EMS community is ready and prepared to jump in to save a life at a moment’s notice. I teach these sessions for CAL FIRE, but this is one time when we will provide this opportunity for anybody who’s available and wants to come and get checked off,” Wright said.\nThe EMTs moved from station to station, demonstrating skills such as trauma assessment, supine and seated spinal motion restriction, cardiac arrest management with AEDs, and childbirth and neonatal resuscitation.\n“It’s time for my training. I am due to renew in August, and I heard about this through Palomar Medical Center. We frequently collaborate with EMS and the fire departments about training and opportunities to train,” said Natalia Reed, an EMT at two local hospitals.\nCollins said the pandemic caused a downtrend in EMS professionals, and they are now building those numbers back up. For anyone interested in pursuing EMS as a career, he wants people to know, “This region needs you.”\nClaudia Rempel, president of the Ambulance Association of San Diego County, said she was excited for “The opportunity to just share the efforts that the County and the EMS providers are doing to increase diversity in EMS. It really is important you know that when the crews are responding to the community, people can see themselves in (the EMS responders) whether it’s for language translation purposes or better understanding cultural needs.”\nRempel highlighted an earn-to-learn program starting at Miramar College’s EMT school later this year that reached out to women applicants.\nCollins also reminded people in the community that they can do their part to lessen the burden on the EMS professionals by taking safety and prevention precautions, such as putting a locked fence around swimming pools, locking up prescription medications, securing children in safety seats and driving more carefully.\n“This week if you see an EMT, if you see a paramedic, if you see someone working on an ambulance, give them a thumbs up, give them a high five. They deserve it. They are there for us, and we greatly appreciate what they do.”\nEMTs, paramedics and first responders gathered for an EMS Week event at the County’s Kearny Mesa campus.\nOn May 23, County EMS will host the San Diego Blood Bank at the County Operations Center for blood donations. Anyone may donate and can make an appointment.\nTo learn more about EMS, visit the County’s EMS website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240520.18.12.41"}