{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bite-Sized Tips for National Nutrition Month", "description": "March is National Nutrition Month, an annual month of action that promotes healthy habits and food choices. ", "datePublished": "2023-03-27T10:23:42-07:00", "url": "https://www.countynewscenter.com/bite-sized-tips-for-national-nutrition-month/", "keywords": ["health", "calfresh", "health food", "nutrition", "nutrition month"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-03-27T10:23:42-07:00", "articleType": "article", "articleContent": "\nMarch is National Nutrition Month, an annual month of action that promotes healthy habits and food choices. \nThis year’s theme, “Fuel for the Future” embodies why good nutrition is essential at every stage of life and lowers the risk for serious health problems like heart disease, type 2 diabetes and obesity.  \nThree behaviors including poor nutrition, tobacco use and lack of physical activity contribute to four chronic diseases that cause 45 percent of all deaths in San Diego County. \n“We have probably all heard the saying, ‘you are what you eat’.  It is very true because our overall health may be largely determined by the nutrients we consume,” explained County Public Health Services Registered Dietitian, Barbara L. Hughes, MS, RD, CalFresh Healthy Living Program Nutrition Policy Advisor. “National Nutrition Month is a great opportunity to think about the foods and beverages you consume and learn about the easy changes we can all make to ensure we are choosing foods that contribute to our overall well-being.” \nHughes recommends choosing nutrient-dense foods that include vegetables, fruits, whole grains, dairy, proteins and oils and reducing foods that are higher in added sugars, saturated and trans fats and sodium. \nOther tips include: \n\nAdd color to your plate: Colorful fruits and vegetables have vitamins, minerals and dietary fiber. The goal is to make half your plate a colorful mix of produce. \nPlan your meals: Having a plan for the week can help you make healthier choices and ensure you are including a variety of different foods in your diet, while repurposing leftover ingredients.  \nPack your snacks: Healthy snacks between meals can help keep your energy levels up while adding extra nutrients to your overall diet.  \nGet cooking: Making your food at home is often a healthier option than eating out because you can control the ingredients you put into your meals. Plus, cooking at home can be rewarding and cost-effective.\nWatch for added sugar: Some foods and drinks can contain added sugar that provides no nutritional benefit. Try choosing drinks and foods that do not add unnecessary sugars. \nChange things up: Experiment with trying new foods like ancient grains, meatless options or new-to-you vegetables. Try a variety of foods from all food groups.  \n\nIf food affordability is an issue, food assistance may be available through CalFresh, also known as the Supplemental Nutrition Assistance Program (SNAP).  Visit San Diego County’s CalFresh website to learn more or call the Access line at 1-866-262-9881. You can also visit a local Family Resource Center to get assistance.  \nMore nutrition tips, healthy recipes, along with food and nutrition resources can be found on the EatFresh website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230327.10.23.42"}