{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "7 More COVID-19 Deaths Reported, Cases Exceed 2,000", "description": "Seven additional COVID-19 deaths have been reported, bringing the region’s total to 60, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-15T17:31:59-07:00", "url": "https://www.countynewscenter.com/7-more-covid-19-deaths-reported-cases-exceed-2000/", "keywords": ["health", "7 deaths", "coronavirus", "covid-19", "priority testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-16T07:18:50-07:00", "articleType": "article", "articleContent": "\n \nThe ages of the people who died range from 64 to 100 years. Four are men and three are women and all had underlying medical conditions.\n“Our sincere sympathies and condolences go out to the family and friends of all the people who have died because of COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The best way to protect those at higher risk of complications from COVID-19 is by staying at your regular home and wearing a face covering when in public.”\nThe age, gender and race and ethnic breakdown of the local COVID-19 deaths are:\nAge:\n\n80 and older: 32\n70 to 79: 15\n60 to 69: 6\n50 to 59: 4\n40 to 49: 1\n20 to 29: 2\n\nGender:\n\n34 Men\n26 Women\n\nRace and Ethnicity:\n\n24 White\n17 Hispanic\n4 Asian\n1 Multiple races\n14 Unknown\n\nCounty COVID-19 Cases Now at 2,012\nNearly 28,000 tests have been administered to San Diegans. To date, 2,012 people have tested positive for COVID-19, including 82 new cases announced today.\nOf the local cases, 1,017 (50.5%) were men and 989 (49.1%) were women. The gender of six people is unknown. Of the reported cases, 488 (24.3%) have required hospitalization and 173 (8.6%) of the total number of cases had to be placed in intensive care. Sixty (3%) have died.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nPriority Groups for COVID-19 Testing\nDue to the widescale shortages of laboratory supplies and reagents, the County is following the Centers for Disease Control and Prevention recommendations for testing for COVID-19. The three specific groups are:\nPriority 1\n\nHospitalized patients\nHealthcare facility workers with symptoms\n\nPriority 2\n\nPeople 65 years and older and patients in long-term care facilities with symptoms\nPatients with underlying conditions and first responders with symptoms\n\nPriority 3\n\nEssential workers with symptoms\nHealthcare facility workers and first responders\nPeople with symptoms who are not in above categories\nPeople with mild symptoms in communities with high numbers of COVID-19 hospitalizations\n\nCounty Microbiologist Jovan Shepherd prepares a specimen for testing of the novel coronavirus.\nSubmit Your #StayHomeSD Sign\nCounty officials continue to encourage San Diegans to join the #StayHomeSD campaign by staying at home, maintaining a physical distance and wearing a facial covering.\nTo join, submit a picture holding a sign that shows the reason why you are staying home. Your picture could be featured as one of the faces of our community in the campaign as we work together to flatten the curve and slow the spread of COVID-19.\n\nThose submitting a photo are encouraged to share it on their social media pages with the hashtags #StayHomeSD and #InThisTogetherSD.\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data is also broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200415.17.31.59"}