{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Creates Online Portal to Track General Plan Progress", "description": "Since the County adopted its General Plan nine years ago, 5,802 residences have been built in the county’s unincorporated communities, leaving capacity for another potential 60,748 residences under the plan. And now you can track progress on the General Plan and local development online, thanks to a new County website.", "datePublished": "2020-02-14T13:59:46-08:00", "url": "https://www.countynewscenter.com/county-creates-online-portal-to-track-general-plan-progress/", "keywords": ["housing", "land use", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-02-14T14:54:33-08:00", "articleType": "article", "articleContent": "\nSince the County of San Diego adopted its General Plan nine years ago, 5,802 residences have been built in the county’s unincorporated communities, leaving capacity for another potential 60,748 residences under the plan.\nAnd now you can track progress on the General Plan and local development online, thanks to a new County website — the Housing Capacity & Production Portal.\nThe portal includes text summary reports; maps that show how many residences have been built in each unincorporated community; the capacity the General Plan would still allow to be built in each community; and a search tool. It will be updated every quarter.\nThe County’s department of Planning & Development Services (PDS) created the new portal to give the public the ability to track the progress of the County’s General Plan on a regular basis.  PDS has been working on this system as required through the General Plan Implementation Plan and to facilitate the production of data needed for the annual report to the State on the General Plan’s Housing Element.\nThe current numbers in the portal are good as of Jan. 31, 2020, with information on 33 unincorporated communities in the county.\nThe portal, which also links to the County’s General Plan webpage, includes a total of 12 “heatmaps” depicting number ranges in colors, illustrating information including:\n\nNumber of residential dwelling units that are allowed by the County’s General Plan and could be built in the future if the land is suitable for construction, provided with infrastructure, and obtains necessary approvals from the County\nChanges to the General Plan since 2011 that either increase or decrease the number of residential dwelling units that could be built\nNumber of existing and new residential dwelling units that were built since 2011\nThe number of residential dwelling units that have received discretionary approvals from the county since 2011 but haven’t been built\nResidential Development Projects that are approved with units that either exceed or are below the amount allowed by the General Plan\nSites of residential dwelling units that are currently being graded and prepared for construction\n\nFor more information about the County’s General Plan, go to PDS’s General Plan webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200214.13.59.46"}