{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Nearly $17 Million Secured to Address San Diego Riverbed Homeless Encampments", "description": "A County-led partnership has been awarded nearly $17 million in State funds to help people experiencing homelessness along the San Diego riverbed into more permanent housing and connect them with much-needed services.  ", "datePublished": "2023-06-14T14:56:08-07:00", "url": "https://www.countynewscenter.com/nearly-17-million-secured-to-address-san-diego-riverbed-homeless-encampments/", "keywords": ["housing", "funding", "grant", "housing"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-06-14T16:29:32-07:00", "articleType": "article", "articleContent": "\nA County-led partnership has been awarded nearly $17 million in State funds to help people experiencing homelessness along the San Diego riverbed into more permanent housing and connect them with much-needed services.  \nLate last year, the State made $240 million in Encampment Resolution Fund grants available to local jurisdictions to help resolve encampments and get people into housing and services. \nThe County applied for that funding in collaboration with the City of San Diego, City of Santee and California Department of Transportation, and is getting $16,951,298. \nThe money, awarded to the County’s Department of Homeless Solutions & Equitable Communities, will help an estimated 300 people experiencing homelessness living along the San Diego riverbed. \nIt will pay for interim and permanent housing subsidies as well as seven staff who will conduct focused collaborative outreach and coordinate services. \n“This grant is the result of the strong collaborations with our partners at the City of San Diego, City of Santee and Caltrans, and we are grateful for everyone’s efforts,” said Barbara Jiménez, County Community Operations Officer. “With the funds, we’ll be able to provide safer, cleaner and healthier living conditions for our community members now living unhoused in the riverbed.”  \nOver the next several weeks, the County will work with the three partner entities to bring together the staff and resources to start work on the program. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230614.14.56.08"}