{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Chagas Added to County’s List of Reportable Diseases  ", "description": "County Public Health officials have added Chagas disease to the local reportable diseases list of ahead of World Chagas Day. ", "datePublished": "2024-04-12T14:22:16-07:00", "url": "https://www.countynewscenter.com/chagas-added-to-countys-list-of-reportable-diseases/", "keywords": ["health", "chagas", "chagas disease"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-04-12T14:35:02-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Public Health officials have added Chagas disease to the local reportable diseases list ahead of World Chagas Disease Day. \nConditions on the reportable disease list are either contagious, severe or are seen more frequently and require health providers to alert local or state public health officials when they come up.  \nThe County joined other public health agencies in California in making Chagas disease reportable. \nChagas disease is caused by an insect called a triatomine or kissing bug that is carrying a parasite called Trypanosoma cruzi. When these bugs bite and release feces into the wound, the parasite in the feces can cause Chagas disease.  \nThe disease can lead to long-term heart and intestinal health damage and even death.  \nChagas disease is more commonly found in rural areas of Latin America affecting people who live in homes made of mud, adobe or straw where the insects tend to hide.  \nIn the United States, it is estimated that more than 300,000 people are living with Chagas disease, with California having the most cases. \n“San Diego is a binational community and while we do see some cases of Chagas disease in San Diego in travelers, the current methods of gathering information are not providing the full picture,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “By making Chagas reportable, we will get a better count of the number of cases in San Diego through screening. Finding out how people got infected in the first place will help us more quickly treat patients before their condition gets worse.” \nChagas disease usually starts with either no symptoms or mild symptoms like a fever, headache, cough, abdominal pain or localized swelling near the insect bite. If left untreated, it can cause heart failure or gastrointestinal complications.   \nApril 14 is World Chagas Disease Day\nWorld Chagas Day is observed on April 14 to raise awareness about the disease and spread the word on how to prevent it.   \nThe Centers for Disease Control and Prevention recommends travelers to areas where Chagas is found wear protective clothing and insect repellant, use insecticide-treated bed nets, sleeping indoors, and not eat unpeeled or uncooked fruits and vegetables.   \nChagas disease can also be passed from mother to baby, through blood transfusions, organ transplantations and by eating food contaminated with the T. cruzi parasite. \nCounty Public Health officials are working closely with local healthcare providers to provide resources, investigate infections and monitor transmission patterns.  \nReach out to a healthcare provider if you or someone you know has symptoms that could be related to Chagas disease.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240412.14.22.16"}