{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "California American Water Company Lifts Boil Water Advisory", "description": "California American Water Company (Cal-Am) reports it has lifted a boil water advisory for affected areas in South County Saturday.", "datePublished": "2023-08-26T17:41:24-07:00", "url": "https://www.countynewscenter.com/california-american-water-company-lifts-boil-water-advisory/", "keywords": ["environment", "boil water advisory", "boil water advisory lifted", "california american water", "emergency", "lueg"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-08-26T17:50:26-07:00", "articleType": "article", "articleContent": "\nCalifornia American Water Company (Cal-Am) reports it has lifted a boil water advisory for affected areas in South County Saturday.\nThe boil water advisory was put into effect Aug. 24, 2023, due to E. coli contamination in the drinking water.\nThe County of San Diego Emergency Operations Center was activated and worked with the State, Cal-Am and the affected cities to help spread the word. The County also worked with impacted healthcare facilities and restaurants we govern to provide guidance to them.\nAfter extensive water testing, Cal-Am and the State Water Resources Control Board’s Division of Drinking Water (DDW) determined Saturday afternoon, the water is now safe to drink. Cal-Am says affected customers no longer have to boil their water or drink bottled water.\nCal-Am says the affected areas in their boil water advisory were portions of Imperial Beach, the City of Coronado south of Fiddler’s Cove, certain customers within the City of San Diego neighborhoods of Nestor and Otay Mesa West, and portions of Southwest Chula Vista.\nMore than 17,000 customer accounts, as many as 106,000 people, were affected by the Cal-Am boil water advisory. The cause of the contamination is still under investigation.\nCal-Am made the first notification to its impacted customers that their boil water advisory was lifted, and the information will also be shared by impacted cities and agencies.\nThe County Department of Environmental Health and Quality (DEHQ) is working with restaurants to provide updated guidance and resources on how to resume operations now that the boil water advisory is no longer in effect. Restaurants can also contact DEHQ at (858) 505-6900 or fhdutyeh@sdcounty.ca.gov.\nNo food facility inspection or approval will be needed as part of the restaurant reopening process.\nThe County is requesting that any businesses affected by Cal-Am’s boil water advisory to complete a voluntary Boil Water Advisory Economic Impact Survey. The information collected will be used to determine if the County should attempt to seek state and/or federal assistance. The form is informational only, completing the survey form does not guarantee that you will be eligible or will receive assistance, and it is also not a substitution for submitting a claim with California American Water Company (Cal-Am) or your insurance company. The deadline for completing the survey is Sept. 15.\nCounty Public Health continues to monitor for health-related issues and asks anyone experiencing gastrointestinal issues or any other symptoms to contact their healthcare provider.\nFor additional information regarding affected schools and guidelines for residential customers, please contact the responsible agency, California American Water, at 1-888-237-1333 or visit the California American alert page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230826.17.41.24"}