{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Declares Monkeypox Local Health Emergency", "description": "Local public health and elected officials today announced the declaration of a local health emergency to respond to monkeypox in the San Diego region.", "datePublished": "2022-08-02T17:11:03-07:00", "url": "https://www.countynewscenter.com/?p=209137", "keywords": ["government"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-08-02T17:15:52-07:00", "articleType": "article", "articleContent": "\nLocal public health and elected officials today announced the declaration of a local health emergency to respond to monkeypox in the San Diego region.\nThe action does not indicate that San Diegans are at higher risk of contracting the virus, but it is meant to reassure the public that local health authorities are proactively working to stay ahead of any challenges that may arise. The local health emergency must be ratified in 7 days, by the County Board of Supervisors, and then will need to be ratified again every 30 days, as needed.\n“Our County has taken monkeypox very seriously from the beginning and those efforts will continue,” said Chairperson Nathan Fletcher, County Board of Supervisors, who was joined by other elected officials to announce the declaration. “Today, the County is declaring a local health emergency for monkeypox to align our efforts with the approach taken by the State of California. This will also allow us to strengthen our County’s vaccination, prevention, education and treatment initiatives.”\nThe declaration of the emergency empowers the County to:\n\nmore effectively respond to monkeypox\nseek and utilize state resources for vaccine administration\nleverage the public health infrastructure related to testing, contact tracing and case investigation, as well as community outreach and engagement\nensure that the County’s health professionals and other local stakeholders have all the necessary tools at their disposal\n\n“All of these strategies were developed and strengthened during the COVID-19 response,” said Wilma Wooten, M.D., M.P.H., County public health officer. “To prevent the community-wide spread of monkeypox infection, the key is prevention, and this include vaccinations.”\nThe County has already taken multiple actions to deal with this emerging threat. It has been working with the lesbian, gay, bisexual, transgender and queer community to develop messaging, education materials and to administer the limited number of vaccines coming to the area. The County has also been communicating with other local jurisdictions and community organizations.\nThe County has conducted a forum, mass vaccination clinics and numerous other outreach efforts. To date, 3,987 doses of monkeypox vaccine have been received in San Diego County.\nAs of August 1, a total of 46 confirmed and probable cases have been reported. Only one patient required hospitalization and there have been no deaths. All cases were males, and their ages range from 27 to 58 years of age. The region’s case count will now be updated daily, Monday through Friday. \nA patient gets a monkeypox vaccine at a recent vaccination event.\nTwo vaccination events have already taken place, where more than 1,400 monkeypox vaccines were administered over four days. The County has also made doses of vaccine available to local healthcare providers. Some monkeypox vaccine doses are also available at the County Public Health Centers and STD clinics.\nThe County has also distributed 110 treatment courses of Tecovirimat, a drug used to treat monkeypox, to local health care organizations and County clinics.\nGiven the scarcity of the monkeypox vaccine and as guided by the California Department of Public Health, the County is focusing on delivering first doses to as many people at high risk as possible. For the current outbreak, that includes men who have sex with multiple male partners and close contacts of reported cases. The County’s approach is in line with strategies in other large jurisdictions with monkeypox outbreaks, including New York City and San Francisco.\nThe state allocates vaccines to counties based on the number of monkeypox, as well as the number of early syphilis cases in men reported in a region.\nThe County also set up a text message alert system to send San Diegans real-time information about monkeypox in the region. To sign up to receive the messages, text COSD MONKEYPOX to 468-311. A social media messaging and education campaign is underway to raise awareness about monkeypox.\nFor more information on monkeypox, how to prevent it, who should get vaccinated, visit the County’s monkeypox website or call 2-1-1.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220802.17.11.03"}