{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Outbreaks, Cases Increase; 14-day Rolling Percentage Remains Low", "description": "Three additional COVID-19 community outbreaks were reported today, bringing the region’s total to 10 over the past seven days. Also, more than 300 positive cases have been reported two days in a row.", "datePublished": "2020-06-22T17:30:33-07:00", "url": "https://www.countynewscenter.com/covid-19-outbreaks-cases-increase-14-day-rolling-percentage-remains-low/", "keywords": ["health", "community outbreaks", "coronavirus", "covid-19", "rise in cases"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-23T09:57:13-07:00", "articleType": "article", "articleContent": "\nThree additional COVID-19 community outbreaks were reported today, bringing the region’s total to 10 over the past seven days. Also, more than 300 positive cases have been reported two days in a row.\nThe latest figures are concerning, County health officials say, and they will continue to monitor them closely to make sure they don’t become a trend.\n“We expected that we would see more cases with the reopening,” said Wilma Wooten, M.D., M.P.H., County public health officer. “As we reopened, people are interacting more with each other and gathering in larger groups.”\nCommunity outbreaks of COVID-19 are one of 13 triggers the County is closely monitoring to determine whether additional measures are necessary to prevent the spread of the virus.\nThis trigger stipulates that no more than seven outbreaks should be reported over the past seven days. Since the three new outbreaks occurred in three different types of settings and in different parts of the county, health officials said there is no need for more restrictive measures at this time.\nHowever, the County is pausing on the reopening of additional sectors of the economy, even if the state releases new guidance, until it is safe to do it. Further actions also are possible.\n“If we see that a trend is developing, we could take action and close entities, if necessary,” said Wooten, stressing that the County does not expect to shut down sectors of the economy but rather focus on affected businesses where outbreaks are identified.\nWhile tracking case numbers is important, County health official said a better indicator is the 14-day average percentage of positive tests which, while slightly rising, continues to hover around 3%. The County will continue to monitor COVID-19 community outbreaks and cases to determine if a trend develops now that more sectors of the economy have reopened.\nAs the economy reopens and public gatherings increase, health officials stressed the need for San Diegans to continue following the local public health guidance.\nThey said San Diegans must do the following:\n\nPractice good hand hygiene and sanitation\nKeep six feet apart\nWear a face covering\nAvoid crowded places\nStay home if they are sick\n\n“The virus remains alive and dangerous throughout our communities,” Wooten said. “We don’t want to reverse course. People should continue to take these precautions because they help to prevent the spread of COVID-19.”\nCounty employee Esma Al Sabag is doing contact tracing in English and Arabic.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\nOf 5,831 tests reported to the County June 21, 5% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 2.9%.\n\nCases:\n\n302 new cases in San Diego County residents for a total of 11,096.\n1,627 or 14.7% of cases have required hospitalization.\n451 or 4.1% of all cases and 27.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo COVID-19 deaths were reported today. The countywide total remains at 338.\n\nThere are currently 59 active outbreaks in skilled nursing facilities and other congregate and community settings:\n\n17 outbreaks with 622 cases, including 70 deaths in skilled nursing facilities.\n20 outbreaks with 761 cases, including 25 deaths in other congregate settings.\n22 outbreaks with 225 cases, including no deaths in community settings.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200622.17.30.33"}