{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Invited to Give Input on County’s 2025 Legislative Program", "description": "The County will be holding a virtual community meeting to share information about and hear feedback on its 2025 legislative program.", "datePublished": "2024-09-25T14:23:39-07:00", "url": "https://www.countynewscenter.com/community-invited-to-give-input-on-countys-2025-legislative-program/", "keywords": ["government", "economic development and government affairs", "edga", "engage san diego county", "fgg", "legislative program", "virtual meeting"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-09-25T15:12:50-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County is holding a virtual community meeting to share information about and hear feedback on its 2025 legislative program. The meeting will take place at 5 p.m. on Oct. 2.\nEvery year, the County Office of Economic Development and Government Affairs (EDGA) identifies a legislative strategy for the Board of Supervisors. If approved, the strategy outlines County positions on state and federal legislation and other regulatory actions that impact the region.\nLast year, the County took a position on more than 40 state and federal bills. The County also sponsored four state bills that addressed issues ranging from fentanyl education and overdose prevention to wildfire resilience and health care access. Two of the bills were signed into law and the other two are waiting for the signature.\nCommunity input is an important aspect of the County’s legislative strategy. You can get more information about the 2025 Legislative Program and register for the community meeting at Engage San Diego County. You can also visit the site to submit comments via email through Oct. 6.\nIf you have questions about the virtual meeting, the legislative program or need disability-related modifications, language interpretation or other accommodations for the  virtual meeting, email Legislative.Program@sdcounty.ca.gov.\nEDGA is responsible for the County’s Legislative Program, economic development strategy, expanding the County’s role in arts and culture, administering a Grants Office, and updating and implementing the County’s Strategic Plan and governance documents.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240925.14.23.39"}