{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s Your Turn – The County Wants Input on Future Infrastructure Needs", "description": "If you’d like a say on County projects like sidewalks, fire stations, Live Well centers, and libraries, here’s your chance. The County is holding meetings to get your feedback on needed improvements and future facilities.", "datePublished": "2023-10-18T15:07:25-07:00", "url": "https://www.countynewscenter.com/its-your-turn-the-county-wants-input-on-future-infrastructure-needs/", "keywords": ["government", "capital plan", "community meetings", "engage san diego county", "public input", "public works capital plan"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-10-19T10:04:57-07:00", "articleType": "article", "articleContent": "\nIf you’d like a say on County projects like sidewalks, fire stations, Live Well centers and libraries, here’s your chance.\nThe County is holding meetings to get your feedback on needed improvements and future facilities.\nEach year, the County reviews and revises its forecast of planned and potential capital projects to ensure that they are taking care of aging infrastructure. But it also wants to address any emerging issues or needs.\nThe Department of Public Works will host meetings involving community infrastructure projects like County-maintained roads, bridges, storm drains, sidewalks and more.\nThese are typically in the unincorporated areas, outside of the region’s 18 cities.\nA separate meeting will address the County’s overall Capital Plan which includes the facilities and infrastructure located throughout the region – the unincorporated areas and the 18 cities.\nThey involve things like the Live Well centers, libraries, County administration buildings, recreation centers, Sheriff’s stations and the purchase of land to build parks.\nYou can find out what’s already underway in your community and give your input on what may be needed in the future.\nThe next Public Works meeting takes place Thursday, Oct. 19 at the Valley Center Library in the North County.\nYou’re also invited to a virtual session on Public Works projects on Wednesday, Nov. 1. Both meetings will run from 6 to 7:30 p.m.\nA virtual workshop on the Capital Plan projects is scheduled from 6 to 7:30 p.m. on Thursday, Oct. 26.\nFor more information about the plans that direct how we build and maintain those places that serve you, visit Engage San Diego County and click on County Facilities and Infrastructure.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231018.15.07.25"}