{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Keep the Flu Away from You", "description": "The winter months are quickly approaching and so is peak season for influenza. Now is the time to protect yourself and your family from the flu. The County provides flu vaccines at Public Health Centers throughout the region. Each year in October and November, the County also hosts flu events to bring the flu vaccine into local communities.", "datePublished": "2024-10-28T08:15:04-07:00", "url": "https://www.countynewscenter.com/keep-the-flu-away-from-you/", "keywords": ["health", "community vaccination event", "flu", "immunization", "influenza", "pod", "support dog"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-10-28T16:27:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe winter months are quickly approaching and so is peak season for influenza. Now is the time to protect yourself and your family from the flu.\nEvery year, millions of Americans get sick from the flu. Some of the most vulnerable die. Here in San Diego, from fiscal year 2022-2024, an average of 20,381 people got sick from the flu each year and 54 people died.\nA flu vaccine is the best defense against getting sick the virus and is especially important for people who are at high risk of complications from the flu. A flu shot is recommended to anyone six months of age and up. Last fiscal year, over 1,050,000 San Diegans received their flu shot.\nThe County provides flu vaccines at Public Health Centers throughout the region. Each year in October and November, the County also hosts flu events to bring the flu vaccine into local communities. The event is called a flu point of dispensing, or POD, and can provide up to 200 doses of flu vaccines in one day.\nThere are three additional flu PODS over the next several weeks. Anyone wanting to get immunized can walk in without an appointment and get the flu shot cost free.\n\nWednesday, Oct. 30, Northgate Market 1 p.m. to 4 p.m., 1058 3rd Chula Vista\nTuesday, Nov. 5, Southeastern Live Well Center, 10 a.m. to 3 p.m., 5101 Market St.\nWednesday, Nov. 13, Mission Valley Library 1 p.m. to 4 p.m., 2123 Fenton Parkway\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241028.08.15.04"}