{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Warns Against Raw Milk Products Amid Bird Flu Risk", "description": "County public health officials are warning San Diegans not to eat or drink raw milk products or give them to their pets because of the heightened risk for H5N1, or bird flu. ", "datePublished": "2024-12-20T15:49:52-08:00", "url": "https://www.countynewscenter.com/county-warns-against-raw-milk-products-amid-bird-flu-risk/", "keywords": ["health", "bird flu", "h5n1", "raw milk"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-12-20T15:59:51-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty public health officials are warning San Diegans not to eat or drink raw milk products or give them to their pets because of the heightened risk for H5N1, or bird flu. \nBecause raw milk and raw milk products are not pasteurized, they can contain harmful pathogens including H5N1 or bacteria like salmonella, toxin producing E. coli. and listeria. All of these can cause severe illness, hospitalization and even death, especially in people who are immunocompromised, the very young and pregnant women.  \nThe health warning extends to pet products containing raw milk. Dogs and cats can get sick if these products contain harmful bacteria or viruses. People also should also be mindful of keeping their pets away from sick or dead birds outside.  The Los Angeles County Department of Public Health has confirmed two cases of H5 bird flu in cats that consumed recalled raw milk from Raw Farm, LLC.   \nPasteurization is a heat treatment process. Pasteurized milk and other pasteurized dairy products are safe to consume because the heat treatment kills bacteria and other pathogens like the bird flu but otherwise does not change the product. \nEven before the emergence of bird flu in California, San Diego County public health epidemiologists have linked other illnesses to raw milk, including in 2023 when a series of salmonella cases were reported after consuming raw milk from a producer in Fresno. \nAbout Bird Flu \nEarlier this week, California Gov. Gavin Newsom declared a State of Emergency to strengthen the state’s response and preparedness for bird flu. The California Department of Public Health reports 34 confirmed cases statewide in humans and says the current risk remains low to for the public.   \nBird flu or H5N1 is a highly contagious virus that can sicken or kill birds and other animals. While rare, it can be spread to people when the virus gets in someone’s eyes, nose or mouth, or when it is inhaled.  \nCounty Public Health Services is monitoring the emergence of H5N1 flu types in coordination with health partners at the federal and state level. The County also is in communication with local veterinarians and healthcare providers. No cases in humans have been reported in San Diego County. The County continues to monitor influenza strains through its robust influenza surveillance system. \nThose most at risk for bird flu are farm or wildlife workers who may be around infected animals.    \nThe County has made personal protective equipment available to eligible farms, wildlife groups and animal control officers. While the seasonal influenza vaccine does not protect against bird flu, everyone is encouraged to get vaccinated to reduce the risk of serious illness. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241220.15.49.52"}