{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is the Last Day to Vote in the Presidential General Election", "description": "Tuesday, Nov. 5, is the final day to cast your ballot in the Presidential General Election. But voters can still vote early today at any one of more than 200 vote centers or drop off their ballot at any of the Registrar’s 150 official ballot drop boxes around the county.", "datePublished": "2024-11-04T08:00:37-08:00", "url": "https://www.countynewscenter.com/tuesday-is-the-last-day-to-vote-in-the-presidential-general-election/", "keywords": ["elections", "2024 presidential general election", "fgg", "nov. 5 presidential general election", "registrar of voters", "tuesday last day to vote"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-11-03T15:31:05-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesTuesday, Nov. 5, is the final day to cast your ballot in the Presidential General Election. But voters can still vote early today at any one of more than 200 vote centers or drop off their ballot at any of the Registrar’s 150 official ballot drop boxes around the county.\nAll will be open on the final day of voting, Nov. 5, from 7 a.m. to 8 p.m. Any voter who is in line at a vote center or an official ballot drop box at 8 p.m. will be allowed to vote. However, no one can join the line after the 8 p.m. deadline.\nIf you’re not registered to vote and want to participate in the election, you may visit any vote center to conditionally register and vote provisionally through Nov. 5.\nOnce the voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the state, the voter registration becomes active and the provisional ballot is counted.\nIn preparation for the increased voter turnout, the Registrar’s office has added more vote centers, including six super centers, equipped with additional check-in stations, voting booths, and poll workers.\nThe super centers are located in:\n\nChula Vista: MAAC Community Center, 1387 3rd Ave.\nEl Cajon: Wells Park, 1153 E. Madison Ave.\nEncinitas: Encinitas Community Center, Manzanita Room, 1140 Oakcrest Park Dr.\nKearny Mesa: Registrar of Voters, 5600 Overland Ave.\nSan Diego: San Diego LGBT Community Center, 3909 Centre St.\nSan Marcos: San Marcos Community Center, Mail Hall, 3 Civic Center Dr.\n\nIf you plan to vote in person, be prepared. Read your voter information pamphlet and mark your selections on the sample ballot in advance. When you go inside the voting booth at the vote center, you can refer to your choices on the sample ballot to conveniently mark your selections on your official ballot.\nYou can visit any vote center in the county. Find a location near you at sdvote.com.\nVote centers have replaced polling places and provide more services. You can:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selections on ballot marking devices. When finished, the voter will print out the official ballot, review it, place it in a secrecy sleeve, and hand it to a poll worker to insert it in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate, measure, or proposition on the ballot. Additionally, an individual may not circulate any petitions, including those for initiatives, referenda, recall or candidate nominations.\nDon’t delay! With a significant number of contests on the ballot, the voting process may take longer than usual.\nIf you have been holding onto your ballot, act now.\n\nVote from home.\n\nSign and date your return envelope, seal your completed ballot inside.\nReturn it promptly by mail.\nMail ballots postmarked on or before Nov. 5 and received by the Registrar’s office no later than Nov. 12 will be considered timely cast.\nOr return it to one of 150 official ballot drop boxes. The secure stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.”\n\n\nGo to a vote center.\n\nYou can bring the official ballot you received in the mail, check in at the vote center, sign the electronic roster and cast your ballot free of its return envelope.\n\n\n\nFind an official ballot drop box close to you through the Registrar’s locator map, your voter information pamphlet or online at sdvote.com. Most of these drop boxes are available 24/7. The rest depend on the hours of operation of the location. Check each location’s hours of operation before heading out to return your ballot. All will close at 8 p.m., Nov. 5.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you already returned your mail ballot, you can confirm when it was received by the Registrar’s office at sdvote.com or you can track it through the U.S. Postal Service by signing up for “Where’s My Ballot?”.\nLearn more about voting in the November Presidential General Election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241104.08.00.37"}