{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Hires First Two Local Subcontractors for Construction of Southeastern Live Well Center", "description": "Keeping its commitment to hire locally, the County’s contractor has brought on board two subcontractors who bid to work on the construction of the Southeastern Live Well Center.", "datePublished": "2021-09-16T11:42:58-07:00", "url": "https://www.countynewscenter.com/county-hires-first-two-local-subcontractors-for-construction-of-southeastern-live-well-center/", "keywords": ["health", "live well center", "southeastern live well center"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-17T11:46:35-07:00", "articleType": "article", "articleContent": "\nKeeping its commitment to hire locally, the County’s contractor has brought on board two subcontractors who bid to work on the construction of the Southeastern Live Well Center.\nIndustrial Fire Sprinkler Co. Inc. and Cats Excavating, Inc. were chosen out of nine trade applicants in the first bid group.\nLocated at 1944 54th St., Cats Excavating, Inc. specializes in demolitions, earthwork, underground utilities, paving and sidewalk and gutters.\nIndustrial Fire Sprinkler Co. Inc., located 3854 Imperial Ave., is a full-service fire sprinkler contractor that designs, installs, services and inspects fire sprinkler systems.\n“We pledged to hire local companies as part of this $65 million project and we’re keeping our promise,” said Chair Nathan Fletcher, County Board of Supervisors. “Construction of the new facility will involve local companies and workers from the area.”\nThe 65,000-square-foot Southeastern Live Well Center will serve as a hub for health and social services in the region.\nVirtually every aspect of the project has been reviewed by the community. Area residents were involved from the selection of the services the Southeastern Live Well Center will offer to the design, color, look, layout and feel of the facility.\nThe Southeastern Live Well Center, to be built at the intersection of Market Street and Euclid Avenue, will provide a full array of community services including medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities, and military and veterans services.\nThe center also will provide space for community meetings in its 4,000-square-foot conference center which includes a large main conference room and separate smaller spaces.\nThe County made a commitment that a minimum of 5% of the workforce will be comprised of local workers residing in Southeastern San Diego.\n“The Southeastern Live Well center will benefit area residents on two fronts: services and jobs,” said Vice Chair Nora Vargas. “The new facility will make the community proud and provide the services our residents need to improve their health and their overall well-being as well as jobs, and career opportunities for residents.”\nThe next informational meeting about the project is set for Sept. 20 with the Chollas Valley Community Planning Group.\nOn Oct. 14, there be will another virtual contract fair designed to bring in local businesses as subcontractors. You can register for the fair here. For additional information and to be included in the upcoming bidder list please contact SELWCOutreach@pcl.com. PCL Construction will be seeking bids in the coming weeks. More information is available here.\nPCL Construction + Steinberg Hart are expected to break ground on the Southeastern Live Well Center in October of 2021, and the facility should open in the summer of 2023. The public is invited to attend a commemoration of the Tubman Chavez Center and groundbreaking for the Southeastern Live Well Center on Friday, Oct. 1, at 9 a.m.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210916.11.42.58"}