{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Active Tuberculosis Reported at  Boys & Girls Club National City", "description": "Students and staff at Boys & Girls Club’s National City location and some Boys & Girl Club summer camp sites may have been exposed to tuberculosis, the San Diego County Health and Human Services Agency (HHSA) announced today.", "datePublished": "2023-01-26T15:21:04-08:00", "url": "https://www.countynewscenter.com/active-tuberculosis-reported-at-boys-girls-club-national-city/", "keywords": ["health", "exposure", "national city", "public health", "tb", "tuberculosis", "tuberculosis testing"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-01-26T15:21:04-08:00", "articleType": "article", "articleContent": "\nStudents and staff at Boys & Girls Club’s National City location and some Boys & Girl Club summer camp sites may have been exposed to tuberculosis, the San Diego County Health and Human Services Agency (HHSA) announced today.\nHHSA Public Health Services department and the Boys and Girls Club officials have worked in close collaboration to identify and notify those with a high risk of exposure to tuberculosis (TB). No-cost testing will be provided to individuals at increased risk for infection. The period of exposure is from May 28, 2022, to Nov. 8, 2022.\nTuberculosis is an airborne disease that is transmitted from person to person through inhalation of the bacteria from the air. The bacteria are spread when someone sick with TB coughs, speaks, sings or breathes. People with frequent and prolonged indoor exposure to a person who is sick with TB should get tested.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. Some who become infected with tuberculosis will become ill in the future, sometimes even years later. Blood tests and skin tests are effective to determine whether someone has been infected. All those notified of a high risk of exposure are encouraged to receive no-cost testing.”\nEffective treatments are available to cure people who are sick from active TB. It is especially important for individuals with symptoms of active TB and those who are immune compromised to see their medical provider to rule out active tuberculosis and to discuss treatment.\nPeople who test positive for TB but who don’t have symptoms of active TB should get a chest x-ray and talk to a medical provider, as they most likely have a latent TB infection.  People in this situation are infected with the TB germs, but the infection is essentially dormant or sleeping. Taking medicines for latent TB infection can keep these people from getting sick.\nIndividuals who would like more information on this potential exposure should call:\n\nBoys and Girls Club National City at (619) 452-1859\nSan Diego County TB Control Program at (619) 692-8621\n\nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 in 2020 and 201 people reported with active disease in 2021. Preliminary data shows 208 people were reported to have active TB disease in 2022. An estimated 175,000 people in San Diego County have latent TB infection and are at risk for developing active TB without preventive treatment.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230126.15.21.04"}