{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Opens Two COVID-19 Vaccination Clinics in South Bay", "description": "With the expected arrival of more COVID-19 doses to the region, the County has opened a vaccination super station in Chula Vista and a smaller clinic in National City.", "datePublished": "2021-01-21T17:14:47-08:00", "url": "https://www.countynewscenter.com/county-opens-two-covid-19-vaccination-clinics-in-south-bay/", "keywords": ["health", "chula vista superstation", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-21T17:14:47-08:00", "articleType": "article", "articleContent": "\nWith the expected arrival of more COVID-19 doses to the region, the County has opened a vaccination super station in Chula Vista and a smaller clinic in National City.\nThe Chula Vista site, operated by Sharp Healthcare, opened today at the former Sears at 565 Broadway.\nThe walk-up vaccination clinic will be open from 10 a.m. to 7 p.m. seven days a week. When fully operational, the site will have the capability to vaccinate 5,000 people daily.\n\nA smaller, County-run vaccination clinic in National City opened at the Martin Luther King Jr. Community Center, 140 E. 14th Street. It will be vaccinating people from 9:30 a.m. to 3:30 p.m., Sunday through Thursday and will have 500 COVID-19 doses available daily.\nBoth clinics will be vaccinating people in Phase 1A and people 75 years and older in Phase 1B and require appointments, which can be made at vaccinationsuperstationsd.com. Starting Jan. 22, people 75 and older who don’t have access to a computer can call 2-1-1 for assistance in scheduling an appointment.\n“We’ve expanded our vaccination efforts to reach more people at higher risk of contracting COVID-19 and who live in communities that have been disproportionately impacted by the pandemic,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “We will vaccinate as many people in this age group and regions as we can, provided we have enough vaccine doses.”\nThe County plans to open two more vaccination super stations in East and North County and people 75 years and older in Phase 1B will be able to start making appointments at those locations the week of January 25, pending supply availability.\nSome doctors, pharmacists and other healthcare providers may administer vaccinations to those 65 and older, if they have doses available.\nThrough Jan. 20, about 442,000 doses have been shipped to the region and nearly 182,000 have been administered. More information on vaccine distribution can be found on the County vaccination dashboard.\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed on Jan. 20: five in business settings, one in a healthcare setting and one in a government setting.\nIn the past seven days (Jan. 14 through Jan. 20), 47 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n8,635 tests were reported to the County on Jan. 20, and the percentage of new positive cases was 14%.\nThe 14-day rolling average percentage of positive cases is 11.9%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 19,973.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n1,176 cases were reported to the County on Jan. 20. The region’s total is now 219,731.\n8,605 or 3.9% of all cases have required hospitalization.\n1,323 or 0.6% of all cases and 15.4% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n48 new COVID-19 deaths were reported to the County on Jan. 20. The region’s total is now 2,222.\n24 men and 24 women died between Dec. 24 and Jan. 20.\nOf the 48 new deaths reported, 31 people who passed away were 80 years or older, nine people were in their 70s, four people were in their 60s, three people were in their 50s and one person was in their 30s.\n47 had underlying medical conditions and one did not.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210121.17.14.47"}