{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County of San Diego Seeking Applicants for Interim Sheriff", "description": "The San Diego County Board of Supervisors will consider interim County Sheriff applicants for appointment for the 10-month remainder of Sheriff Bill Gore’s term following his retirement on Feb. 3.", "datePublished": "2022-02-08T14:30:45-08:00", "url": "https://www.countynewscenter.com/county-of-san-diego-seeking-applicants-for-interim-sheriff/", "keywords": ["public safety", "board of supervisiors", "sheriff"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-02-09T15:10:46-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors will consider interim County Sheriff applicants for appointment for the 10-month remainder of Sheriff Bill Gore’s term following his retirement on Feb. 3.\nUnder the County Charter and Board policies, the selected appointee will hold office until January 2023, when the newly elected County Sheriff will begin a four-year term.\nThe Interim Sheriff application process will begin on Feb. 9 and end on March 4, 2022.\nThe County Sheriff’s office oversees one of the largest sheriff’s departments in the nation. It has nearly 4,700 employees, an annual budget of more than $1.07 billion and a service area of nearly 4,500 square miles including nine contract cities, 18 Indian reservations and the Grossmont/Cuyamaca Community College District. The department provides patrol and investigative operations, air support, search and rescue service and forensic support for the San Diego region. The department operates seven detention facilities countywide and provides security to seven courthouses.\nInterested applicants for Interim County Sheriff may go to the Clerk of the Board of Supervisors’ webpage for the job description, criteria, and application instructions. Applicants will need to submit their applications in person to the Clerk of the Board for verification that the application is complete.\nApplicants for this position must meet the following criteria:\n\nBe a registered voter of the County of San Diego;\nBe a citizen of the United States and the State of California;\nMeet the requirements of Government Code Section 24004.3 pertaining to criteria to hold office as a Sheriff;\nNot have been convicted of any crime disqualifying the applicant from holding elected office; and\nBe able to formally assume the position not later than 20 business days following the selection by the Board of Supervisors.\n\nThe first round of interviews will be during the regular Board of Supervisors meeting on March 15 at which time the Board of Supervisors has a goal to narrow the applicants to five finalists.\nEach applicant will have a three-minute opportunity to present themselves to the Board of Supervisors. After all the presentations, the Board may ask questions of the applicants. The public will also be given an opportunity to speak at the hearing. After this, the Board will vote to narrow the field of applicants to no more than five finalists.\nA final round of interviews and selection will occur at a special Board of Supervisors meeting at 9 a.m. on March 22. The finalists will have an opportunity to make a three-minute presentation to the Board and answer questions. The public will also be given an opportunity to speak at the special meeting. At the conclusion, the Board will vote on each finalist. The appointee will need at least three votes.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220208.14.30.45"}