{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Law Enforcement Work to Keep Election Day Safe, Secure", "description": "Local, state and federal law enforcement agencies in San Diego County are working together to make sure Election Day, Tuesday, Nov. 5, is a safe experience for all voters.", "datePublished": "2024-10-31T12:30:16-07:00", "url": "https://www.countynewscenter.com/law-enforcement-work-to-keep-election-day-safe-secure/", "keywords": ["government", "in-person voting locations", "rov", "safety", "san diego county sheriff s department", "security"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-10-31T13:30:41-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesLocal, state and federal law enforcement agencies in San Diego County are working together to make sure Election Day, Tuesday, Nov. 5, is a safe experience for all voters.\nThe San Diego County Sheriff’s Office is working with law enforcement partners to monitor intelligence and information related to any possible threats on Election Day. Currently, there are no known credible threats to our communities. However, the Sherriff’s Office and its law enforcement partners are prepared to handle any safety challenges that may arise.\n“In anticipation of the November 5 election, the Sheriff’s Office has been proactive in working with our local, state, and federal partners to evaluate potential threats and risks. The Sheriff is the regional coordinator for mutual aid response. Over the last year, we have held multiple internal and external trainings in preparation for any event that might take place related to election activities,” said Sheriff Kelly A. Martinez.\n“The Sheriff’s Office will have the Sheriff’s Operation Center staffed next week to quickly react and respond to any incident that could happen. We will be connected to all areas of the county to quickly understand and assess any incident that occurs. We respect everyone’s right to express their opinion under the First Amendment and urge members of the public to behave in a way that is respectful of others. Finally, we want to relay to the public that we are prepared for any contingency and will ensure the safety of our communities.”\nRegionally, the Sheriff’s Office communicates regularly with other law enforcement agencies and have developed systems of information sharing, and a strategy of large incident management to keep communities safe.\nLocal law enforcement wants to assure the public that the safety and well-being of everyone who heads to the polls on Election Day is a top priority.\nThe following are statements from various law enforcement agencies.\nFBI San Diego has not received information about any threats to voters or election staff in the San Diego region; however, we are ready to respond in the unlikely event a threat appears. The FBI remains committed to ensuring a safe election process, free from intimidation and violence. Everyone is entitled to their personal views and voices as protected by our First Amendment. Should that devolve into violence, criminal activity, or threaten our national security, the FBI will investigate with our federal, state, and local law enforcement partners to swiftly bring those accountable to justice.\nExercising your right to vote is one the most fundamental American values. The San Diego Police Department is committed to protecting this process locally and in coordination with the San Diego County Registrar of Voters, as well as our federal law enforcement partners. Any issues at polling places will be addressed swiftly if appropriate and after a call for service to law enforcement. We encourage civility before, during and after elections, no matter the outcome.\n“While there is no indication of intended disruptions at polling locations in the City of Chula Vista, I want our community to know their safety, especially when exercising their right to vote – as well as their freedom of speech – is at the top of our list throughout this election season,” said Police Chief Roxana Kennedy. “The law prohibits our officers from staging near election sites, but we will continue to work closely with our law enforcement partners in the region to assess and mitigate safety concerns, and our officers will be at the ready to respond to any calls for help.”\nThe El Cajon Police Department is actively enhancing safety and security measures for Election Day by increasing patrols and collaborating closely with local, state, and federal officials to ensure a safe voting environment. We are committed to protecting the rights of all voters while fostering a sense of community trust and safety throughout the election process.\nThe Carlsbad Police Department is dedicated to providing a safe and respectful environment for all voters on Election Day and in the days that follow. We are coordinating closely with local officials, as well as our mutual aid partners, and we will actively monitor for any disturbances to ensure every citizen can exercise their right to vote peacefully and securely.\nThe San Diego Law Enforcement Coordination Center has been working closely with state, local and federal partners in preparation for the upcoming election. The SD-LECC has an interactive Election Dashboard for law enforcement and governmental emergency managers to share election related issues in real-time. The dashboard has all election polling locations in San Diego and Imperial Counties with emergency contact information and other related data to assist personnel with communications and decision-making. The San Diego Law Enforcement Coordination Center is not aware of any credible threats to San Diego or Imperial Counties; however, the SD-LECC will be monitoring the situation throughout the election process with its state, local and federal partners.\nIf you have a concern about a potential Election Day threat or an incident that should be reported to authorities, contact your local law enforcement agency. In the event of an emergency, call 9-1-1.\nLearn more about election security from the San Diego County Registrar of Voters.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241031.12.30.16"}