{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Chairwoman Nora Vargas Announces County Qualifies for State Flood Relief Funds", "description": "Chairwoman Nora Vargas announced today that the County will qualify for state flood relief funds.", "datePublished": "2024-01-27T16:16:02-08:00", "url": "https://www.countynewscenter.com/chairwoman-nora-vargas-announces-county-qualifies-for-state-flood-relief-funds/", "keywords": ["public safety", "cal oes", "jan. 22 severe storm", "psg", "state disaster assistance act funds", "vargas"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-01-27T16:23:33-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteChairwoman Nora Vargas announced today that the County will qualify for state flood relief funds.\n“I am deeply grateful to Governor Newsom and CalOES for their swift action in approving the County of San Diego’s request for aid under the California Disaster Assistance Act,” said Chairwoman Vargas. “This support will play a critical role in the road to recovery ahead across the County. Collaboration like this demonstrates the strength and impact between state and local municipalities. As we pivot to recovery, I remain committed to bringing resources to our community.”\nThe California Office of Emergency Services called Board Chairwoman Nora Vargas with the news Saturday afternoon.\n“These funds will help us rebuild vital infrastructure damaged by the Jan. 22 storm,” said Chairwoman Vargas. “They will help the County and other governments in the region recover from and withstand future flooding emergencies.”\nThe County continues to encourage residents and businesses to fill out a voluntary online damage assessment survey. Completing the form will assist the County of San Diego with collecting damage information related to the storm. Completing the form does not guarantee that you will be eligible to receive any disaster relief assistance and is not a substitution for filing a claim with your insurance.\nThose impacted by the storm can also get support and resources at the County Local Assistance Center opening Sunday at the Spring Valley Library located at 836 Kempton Street. Flood victims can walk in without an appointment from 8 a.m. to 2 p.m. on Sunday and 10 a.m. to 7 p.m. Monday through Wednesday. The center will act as a one-stop shop for residents who need information on how to recover from the damaging storms. Additional storm recovery information and updates are available on the County recovery website.\n \n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240127.16.16.02"}