{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar Reminds Voters to Vote Early", "description": "If you're a registered voter and haven't cast your ballot yet, you'll soon get a reminder from the Registrar's office that you have just over one week to cast your ballot for the Nov. 8 Statewide General Election.", "datePublished": "2022-10-26T11:32:37-07:00", "url": "https://www.countynewscenter.com/registrar-reminds-voters-to-vote-early-2/", "keywords": ["elections", "fgg", "nov. 8 statewide general election", "post card reminders", "registrar of voters", "san diego county registrar of voters", "vote early post cards"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-10-26T13:09:54-07:00", "articleType": "article", "articleContent": "\nIf you’re a registered voter and haven’t cast your ballot yet, you’ll soon get a reminder from the Registrar’s office that you have just over one week to cast your ballot for the Nov. 8 Statewide General Election.\nThe Registrar sent over 1.7 million reminder postcards to registered voters in San Diego County who had not voted as of Oct. 21.\nDon’t delay! If you have been holding onto your ballot, act now and vote from the comfort of your home. Sign and date your return envelope, seal your completed ballot inside and return it by mail promptly to make sure it arrives at the Registrar’s office well before Election Day.\nYou also have the option to use one of the Registrar’s 141 official ballot drop boxes. The new stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.” Find one close to you through the Registrar’s online locator tool or inside your information pamphlet. Check each location’s hours of operation before heading out at sdvote.com.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you want to vote in person, that option is available too. You can cast your ballot at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday. Starting Saturday, Oct. 29, 39 vote centers will be open daily from 8 a.m. to 5 p.m.\nStarting Saturday, Nov. 5, 218 vote centers will be open daily from 8 a.m. to 5 p.m.\nAll vote center locations and the Registrar’s official ballot drop boxes will be open on Election Day, Nov. 8, when voting hours change to 7 a.m. to 8 p.m.\nYou can find a complete list of vote center and ballot drop box locations at sdvote.com.\nLearn more about voting in the Nov. Statewide General Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221026.11.32.37"}