{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 1-04-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Jan. 3, 2021.", "datePublished": "2021-01-04T15:06:51-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-1-04-2021/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-04T15:06:51-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Jan. 3, 2021.\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed on Jan. 3 in a daycare/preschool/childcare setting.\nFive new community outbreaks were confirmed on Jan. 2: two in business settings, one in an emergency services setting, one in a hotel/resort/spa setting and one in a distribution warehouse setting.\nFive new community outbreaks were confirmed on Jan. 1: four in business settings and one in a hotel/resort/spa setting.\nIn the past seven days (Dec. 28 through Jan. 3), 45 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n17,712 tests were reported to the County on Jan. 3, and the percentage of new laboratory-confirmed cases was 17%.\nThe 7-day, daily average of tests is 22,304.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n3,013 cases were reported to the County on Jan. 3. The region’s total is now 171,033.\n6,031 or 3.5% of all cases have required hospitalization.\n1,237 or 0.7% of all cases and 20.5% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSix new COVID-19 deaths were reported to the County on Jan. 3. The region’s total is now 1,598.\nThree men and three women died between Dec. 24 and Dec. 29, and their ages ranged from late early 60s to late 80s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n \n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210104.15.06.51"}