{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 4-23-2021", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through April 22.", "datePublished": "2021-04-23T17:31:44-07:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-4-23-2021/", "keywords": ["health", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-23T17:31:44-07:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through April 22.\nVaccination Progress:\n\nOver 2.65 million COVID-19 vaccine doses have been delivered to the region, and close to 2.45 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOverall, more than 1.35 million County residents have received at least one shot of the two-dose vaccine. That’s 50.3% of those eligible, a significant milestone in the fight against the pandemic.\nOf those vaccinated to date, over 880,000 County residents, or 32.7% of San Diegans 16 and older, are fully immunized.\nThe goal is to fully vaccinate 75% of San Diego County residents 16 and older or 2,017,011 people. To date, 67.0% of the goal population has received at least one vaccine and 43.7% are fully vaccinated.\nThose who received the one-dose Johnson & Johnson vaccine, which was approved for use by the FDA on Friday, April 23, 2021 following a pause for a study of adverse reactions in a small number of recipients, are being added to the total of fully vaccinated San Diegans. The County is awaiting guidance from the California Department of Public Health on how to proceed with the vaccine.\nThe County is awaiting further guidance from the California Department of Public Health before use of the Johnson and Johnson vaccine resumes in the region.\nThe difference between doses shipped and the number of vaccinations administered represents approximately what is expected to be used in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.1 cases per 100,000 residents (as of April 20).\nThe County remains in the Orange Tier or Tier 3 under the state’s new guidance. The California Department of Public Health indicates that unless there are extenuating circumstances, such as low rate of vaccine uptake, a county will only move to a more restrictive tier if hospitalizations are increasing significantly among vulnerable individuals, especially among vaccinated individuals, and both testing positivity and adjusted case rates show a concerning increase in transmission. This is currently not the case in the region.\nCurrently, the testing positivity percentage is 2.4%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 3.0% and is also in the Orange Tier or Tier 3.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 27.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed April 22 in a business setting.\nIn the past seven days (April 16 through April 22), 21 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n14,708 tests were reported to the County on April 22, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 1.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,322.\n\nCases, Hospitalizations and ICU Admissions:\n\n329 COVID-19 cases were reported to the County on April 22. The region’s total is now 275,096.\nA total of 1,145 duplicate cases were identified through quality assurance processes. These cases were removed from the case count April 23, 2021.\n15,137 or 5.5% of all cases have required hospitalization.\n1,670 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported April 22. The region’s total is 3,684.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210423.17.31.44"}