{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Reducing Mental Health Stigma in Black Communities Can Prevent Suicide", "description": "The death of Stephen “tWitch” Boss’ by suicide last week was a shock and heartbreaking to millions. It also serves as a sad and poignant reminder many people struggle with mental health challenges, but often suffer in silence.", "datePublished": "2022-12-19T14:23:33-08:00", "url": "https://www.countynewscenter.com/reducing-mental-health-stigma-in-black-communities-can-prevent-suicide/", "keywords": ["health", "suicide", "suicide prevention", "suicide warning sings", "twitch"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-12-19T15:35:06-08:00", "articleType": "article", "articleContent": "\nThe death of Stephen “tWitch” Boss’ by suicide last week was a shock and heartbreaking to millions. It also serves as a sad and poignant reminder many people struggle with mental health challenges, but often suffer in silence.\nThe acclaimed dancer, choreographer, actor, and producer is well-known for his time on the popular television series So You Think You Can Dance and The Ellen DeGeneres Show, as well as for his roles in high-profile films and shows, including Step Up All In, Magic Mike XXL, Disney’s Fairy Tale Weddings, and Modern Family. Boss, 40, is survived by his wife Allison Holker Boss and his three children Zaia, Maddox and Weslie.\n“The tragedy of Boss’ death brings visibility and attention to mental health and suicide, which are subjects that can be difficult to talk about, especially within communities of color, and particularly amongst Black Americans,” said Andrew Strong, director of the County of San Diego Office of Equity and Racial Justice. \n“Although members of the Black community are at an increased risk of developing mental health issues due to numerous historical, economic, social, and political factors [that systemically expose Blacks to factors known to be damaging to psychological and physical health], many do not get connected to the mental health services they need,” Strong added.\nThe statistics are startling.\n“Research indicates Black men who experience feelings of anxiety or depression are about half as likely to seek counseling as their non-Black peers,” said Dr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency.\nIn 2019, the U.S. Department of Health and Human Services found suicide was the leading cause of death for African Americans between the ages of 15 and 24 and the death rate was four times greater for Black men than Black women.  They are also more likely to experience symptoms:\n\nAfrican Americans are 20% more likely to experience serious psychological distress, such as major depressive disorder, than other racial groups, according to the National Institute on Minority Health and Disparities.\nBlack adults are more likely than white adults to experience persistent symptoms of emotional distress, such as sadness, hopelessness and feeling that they must dedicate extra effort to everything they do, according to the U.S. Department of Health and Human Services Office of Minority Health.\nBetween 2015 and 2018, rates of major depressive disorder in young Black adults—ages 18 to 25—increased by more than 3%, yet Black Americans of all age groups were less likely to seek treatment than white Americans, according to the Substance Abuse and Mental Health Services Administration.\n\nPsychologists and other behavioral health professionals are making great strides towards developing more tailored programming to support the mental health of Black men specifically, but there is still much work to be done. Dr. Howard Stevenson, Director of the Racial Empowerment Collaborative at the University of Pennsylvania and a national expert on racial stress and racial trauma, perhaps discussed this best.\n“We should place less emphasis on whether Black men are resistant to therapy and more on understanding the contexts in which they already feel comfortable talking about their feelings and traumas. If a Black man is able to find a treatment that is culturally responsive, that he understands, and that embraces the uniqueness of his difference, he is more likely to use that service,” Stevenson shared.\nMental Health Treatment is Available\n“Mental health conditions are deeply stigmatized, and sometimes seen as personal weakness or even moral failing,” said Bergmann. “And the persistent stigma that surrounds behavioral and mental health issues can make it challenging for people to seek out and get help. But culturally responsive treatment and supports are available and can be life-saving.” \nIt’s important to recognize everyone responds differently to suicide and that there is not a one-size-fits-all approach to coping in the wake of a tragedy.\nIt is also vital to remember that suicide is preventable, and there are steps you can take to help reduce the risk of suicide.\nThese steps may include:\n\nIncreasing access to mental health resources\nPromoting a culture of openness and acceptance around mental health\nKnowing the signs of suicide and how to get help\n\nIf you or someone you know is struggling, dial 988 or 888-724-7240 to speak with an experienced counselor who can help. They are available seven days per week, 24 hours per day.\nMore Information and Resources:\nMental Health Resources for Black Men\n\nMental Health in Black Communities: Challenges, Resources, Community Voices – NAMI California\nBlack Mental Health Alliance\nBrother, You’re on My Mind\nBrother, You’re on my Mind Toolkit for Communities\nBlack and African American Communities and Mental Health | Mental Health America (mhanational.org)\nGet Help Now – Black Emotional and Mental Health Collective\nThe Association of Black Psychologists \n\nMental Health Resources for BIPOC Communities\n\nBIPOC Mental Health Resources & Information in San Diego (up2sd.org)\nBIPOC Mental Health (thementalhealthcoalition.org)\n\nResources to Support Mental Health During the Holidays\n\nPreparing for the Holidays with a Mental Illness – Alvarado Parkway\nTaking Care of Your Mental Health Around the Holidays | MHC (mentalhealthctr.com)\nMaintaining Mental Health During the Holiday Season – NAMI California\nLooking for support during the holidays? Check out these free resources – Mental Health America\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221219.14.23.33"}