{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Ramona Fire Adds Crews and Resources in Transfer", "description": "San Diego County Fire has accepted a transfer of responsibility for fire protection and emergency medical services in Ramona.  The deal benefits the community, the Ramona Municipal Water District and County Fire. The 40,000 people in Ramona are already seeing increased personnel in fire stations.", "datePublished": "2022-08-02T15:32:21-07:00", "url": "https://www.countynewscenter.com/?p=209124", "keywords": ["public safety", "cal fire", "lafco", "ramona fire department", "ramona municipal water district", "san diego county fire", "san diego county fire director jeff collins"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-08-02T15:47:09-07:00", "articleType": "article", "articleContent": "\nSan Diego County Fire has accepted a transfer of responsibility for fire protection and emergency medical services in Ramona.  The deal benefits the community, the Ramona Municipal Water District and County Fire.\nThe 40,000 people in Ramona are already seeing increased personnel in fire stations.  The County has provided an additional crew member on two fire engines in the area.  The idea is to increase fire services and staffing at Ramona’s three fire stations to regionally acceptable levels.  Ramona Fire Station 80 had three crew members on its engines. Now engines at Ramona Fire Stations 81 and 82 will also have a third team member.\n“This is a great example of two groups coming together to better serve the community”, says Jeff Collins, San Diego County Fire Director. “Ramona will gain more firefighters, more paramedics and updated equipment that promotes safety and well-being for our residents.  County Fire protects the community, and the Ramona Municipal Water District can focus on providing water and wastewater services.”\nSince County Fire functions through a partnership with CAL FIRE, fire and emergency medical services are still provided in Ramona by professionals from CAL FIRE.\nCounty Fire is also adding an advanced life support paramedic to the area. Ramona will also get an additional ambulance, which will be based at Ramona Fire Station 82 once the ambulance  is built and delivered. Six cardiac monitors will be added to fire engines and ambulances serving the Ramona community.\nEventually, older fire engines at Ramona Stations 81 and 82 will be replaced.\nThe transfer of responsibility allows the county to further consolidate and enhance regional fire protection throughout the unincorporated areas of San Diego County and leverage its size to purchase goods and services at a lower cost.\nThe San Diego County Local Agency Formation Commission (LAFCO) approved the transfer of responsibility Aug. 1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220802.15.32.21"}