{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrate Earth Month with the County of San Diego", "description": "You don’t have to wait to celebrate Earth Day! You can enjoy an entire Earth Month with the County of San Diego — from virtual fun to real events that celebrate nature and teach us how to create sustainable communities and a healthier planet.", "datePublished": "2022-04-01T12:31:57-07:00", "url": "https://www.countynewscenter.com/?p=208091", "keywords": ["government"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-04-01T12:31:57-07:00", "articleType": "article", "articleContent": "\nYou don’t have to wait to celebrate Earth Day! You can enjoy an entire Earth Month with the County of San Diego — from virtual fun to real events that celebrate nature and teach us how to create sustainable communities and a healthier planet.\nStarting April 1, you can visit the County’s Earth Day webpage that will be filled with fun and education for kids and parents alike. You can take the Earth Day pledge to care for our planet. You can play games, solve puzzles, take virtual hikes in County parks, get hiking tips from a County Park ranger, watch animated video stories about whales and watersheds, sing the Earth song and learn about beekeeping and invasive bugs.\nYou can learn about environmental justice and what the County is doing about some of the top environmental concerns. You can watch Earth Day messages from County leaders, explore and travel around the world, even walk on Mars ― without leaving your room.\nThere will also be live events, including a County Earth Day celebration from 11 a.m. to 1 p.m., April 22 at the County Operations Center at 5500 Overland Avenue. That event will feature planting activities at the County’s Demonstration Garden, information about recycling, water quality, stormwater protection, landscaping with native plants, rain barrels, farmer’s markets and organics. There will be information about the County’s Climate Action Plan and regional decarbonization efforts. On Earth Day night, the County Administration Center downtown will be lit in green.\nOther scheduled events include:\nArbor Day Tree Planting at Flinn Springs County Park\n5:30 p.m. to 7:15 p.m. Friday, April 22 and 10 a.m. to 12:30 p.m. Saturday, April 23; 14787 Olde Hwy. 80, El Cajon; (619) 561-0180\nJoin Flinn Springs park staff for two days of planting native oaks and woody shrubs. Learn about the importance of conservation and preserving native oak populations while planting your own tree ― one you can visit for years to come! This physical activity centers on sustainability and is a great way to pay tribute to your parkland. Parking is $3.\nRanger-led Interpretive Hike at Sycamore Canyon/Goodan Ranch County Preserve in Poway\n9 a.m. to noon, Saturday, April 23; Goodan Ranch Staging Area\n16281 Sycamore Canyon Road, Poway\nJoin Ranger Patrick on a moderate 3.5-mile loop hike on Martha’s Grove Trail at Sycamore Canyon/Goodan Ranch County Preserve. Learn about the native plants and wildlife of this 2,272-acre preserve while walking through a variety of habitats, historic oak groves and the remnants of an old ranch. Meet at the Goodan Ranch Staging Area at 16281 Sycamore Canyon Road in Poway.\nNature Discovery Tables at Sycamore Canyon/Goodan Ranch County Preserve in Poway)\n9 a.m. to noon, Saturday, April 23; Goodan Ranch Staging Area\n16281 Sycamore Canyon Road, Poway\nTouch Tables at Ramona Grasslands County Preserve in Ramona\n10 a.m. to noon – Saturday, April 23, 10 a.m. – 12 p.m.; Rangeland Road and Highland Valley Road, Ramona; (760) 788-3326\nSkulls, skins and safety talks… all in one space? You got that right. We’re hosting nature touch tables to share information about local wildlife. Touch pelts and feathers or teeth and claws. A ranger will be on site to share park and trail information, and to answer all your park-related questions.\nPlant a Tree with Women in the Wild at Barnett Ranch County Preserve\n10 a.m. to noon Saturday, April 23; 1500 Deviney Lane/San Vicente Road, Ramona; (760) 788-3326\nEveryone is welcome to a tree-planting workshop and hands-on tree-planting experience in this female planned and led park activity. Equipment and trees will be provided. Guests should plan to wear something they don’t mind getting a little dirty. Once saplings are in the ground, the group will learn about tree care and maintenance, seasonal phenomenon, invasive species and how to protect against them, and more! Spots are limited; Reservations are required. Call the park for info (760) 788-3326.\nHike to the Dam at Lake Morena County Park\nSaturday, April 23, 10:30 a.m. – 12:30 p.m.; 2550 Lake Morena Drive, Campo; (619) 579-4101\nTake a nice hike through the beautiful woodland areas of Lake Morena County Park and learn all about local Native American tribes and how they lived off the land. A ranger will also share information about the flora and fauna along the trail and share the interesting history of the dam!\nTrail Trek at Wilderness Gardens County Preserve\nSunday, April 24, 9 a.m. – 12 p.m.; 14209 Hwy 76, Pala; (760) 742-1631\nThis behind-the-scenes trail adventure involves a 4.5-mile trek through diverse vegetation and to incredible panoramic views of Palomar Mountain and Pauma Valley. More than 40 bird species thrive on the land – a special treat for birdwatchers and photographers, alike!\nBalboa Park EarthFair\n10 a.m. to 5 p.m. Sunday, April 24; 1549 El Prado, San Diego; (858) 272-7370\nWe’re joining what San Diego EarthWorks calls the largest, free environmental fair in the world! The ranger crew from Stelzer County Park will be hosting a Build-A-Bug Activity in the fair’s Children’s Area. This fun, interactive game is part of a much larger initiative called the Discovery Program which provides park education and experiences to kids in grades K-6. Topics include insects, birds, geology, astronomy, trees and forest ecology, plants and photosynthesis, and how Native American people thrived in San Diego’s natural environment.\nSo, c’mon. Celebrate Earth Month with the County of San Diego!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220401.12.31.57"}