{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Taking Action to Strengthen Families During Child Abuse Prevention Month", "description": "In honor of National Child Abuse Prevention Month, San Diego County Child Welfare Services (CWS) is joining partners this April to raise awareness through activities that support child abuse prevention. ", "datePublished": "2023-04-04T08:38:54-07:00", "url": "https://www.countynewscenter.com/taking-action-to-strengthen-families-during-child-abuse-prevention-month/", "keywords": ["families", "child abuse prevention month", "child welfare services"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-04-04T08:43:51-07:00", "articleType": "article", "articleContent": "\nIn honor of National Child Abuse Prevention Month, San Diego County Child Welfare Services (CWS) is joining partners this April to raise awareness through activities that support child abuse prevention. \nAmong the partners in the collaboration are the YMCA of San Diego County, Rady Children’s Hospital, Palomar Health, the San Diego County Office of Education (SDCOE), Promises2Kids and the San Diego County District Attorney’s Office who are partnering to support families and build upon the strengths of parents to care for their children safely. \nFrom July 2021 to June 2022, CWS received more than 39,000 reports of alleged abuse and neglect, representing 67,824 children.  \n“The regional commitment to ensuring children throughout San Diego County grow up safe and nurtured is strong, as evidenced by the collaboration of these organizations,” said Dr. Kimberly Giardina, CWS director. “Every person in the region can play a role by joining us in connecting families to strengthening services that can keep them together.” \nGet involved this April: \n\nWear Blue for Kids Day— Friday, April 7 – Wear blue to show your commitment to child abuse prevention and post photos with #WearBlueForKids.\nPalomar Health and Rady Children’s Hospital will display “Pinwheels for Prevention” at their locations. \nVirtual Town Hall – Tuesday, April 25- Town Hall will cover child abuse prevention for child-serving healthcare providers in San Diego County.  \nPress Conference at County Administration Center with Chairwoman Nora Vargas, Promises2Kids and CWS—Wednesday, April 26, 1 p.m. \nCounty Administration Center lighting in blue—Wednesday, April 26 \nSan Diego County Office of Education officials will provide toolkits for parents on how to prevent child maltreatment. \nVirtual Run/Walk Challenge throughout the month organized by Rady Children’s Hospital—click here to sign up.\nYMCA Healthy Kids Day – Saturday, April 29, 10 a.m. to 2 p.m.  – Family health and well-being resource fair and activities at 14 YMCA locations. Event is free and open to the public.  \n\nThroughout the month of April and beyond, the County and its partners will work with a broad range of groups and individuals to assure that all San Diegans recognize how they can play a role in making San Diego a model for child and family strengthening. Ensuring parents have the knowledge, skills and resources they need to care for their children is a proven strategy for supporting the social and emotional well-being of children and youth and preventing child maltreatment within families and communities.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230404.08.38.54"}