{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 12-1-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Nov. 30.", "datePublished": "2020-12-01T16:54:50-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-12-1-2020/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-12-01T16:54:50-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Nov. 30.\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure of case rate or testing positivity to assign tiers regarding what activities are permitted. Indoor operations at restaurants, gyms, places of worship and movie theaters are currently not allowed.\nThe County’s state-calculated, adjusted case rate is currently 15.3 cases per 100,000 residents and the region is in Purple Tier or Tier 1 for that metric.\nThe testing positivity percentage is 2.3%, placing it in Tier 3 or the Orange Tier for that metric.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 10.6% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health announces tier assignments at least once a week.\n\nCommunity Setting Outbreaks:\n\nSeventeen new community outbreaks were confirmed on Nov. 30: six in retail settings, five in business settings, two in restaurant/bar settings, and one each in a faith-based setting, a TK-12 school setting, a daycare/preschool/childcare setting and a grocery setting.\nIn the past seven days (Nov. 24 through Nov. 30), 81 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n15,377 tests were reported to the County on Nov. 30, and the percentage of new laboratory-confirmed cases was 9%.\nThe 14-day rolling average percentage of positive cases is 6.3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,099.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n1,378 new cases were confirmed among San Diego County residents on Nov. 30. The region’s total is now 83,421.\n4,685 or 5.6% of all cases have required hospitalization.\n1,030 or 1.2% of all cases and 22% of hospitalized cases had to be admitted to an intensive care unit.\nA COVID-19 case rate map shows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nA total of 22 new deaths were reported in the County on Nov. 30. The region’s total is now 1,019.\nEleven women and 11 men died between Nov. 6 and Nov. 29. Their ages ranged from early 30s to late 90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201201.16.54.50"}