{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Unanimously Approves 2-year Home Kitchen Ordinance", "description": "The Board of Supervisors Wednesday unanimously approved a two-year temporary authorization of an ordinance that will ultimately allow people to legally operate “mini-restaurants” out of their homes.", "datePublished": "2022-01-12T16:09:43-08:00", "url": "https://www.countynewscenter.com/board-of-supervisors-unanimously-approve-home-kitchen-ordinance/", "keywords": ["government", "dehq", "home kitchen", "lueg", "mehko", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-01-14T12:12:20-08:00", "articleType": "article", "articleContent": "\nThe Board of Supervisors Wednesday unanimously approved a two-year temporary authorization of an ordinance that will ultimately allow people to legally operate “mini-restaurants” out of their homes.\nThey could serve as many as 30 in-person, take-out, or delivery meals a day, with a maximum of 60 meals a week. Operators will be required to get a health permit, and home kitchens must pass food safety inspections.\nVice Chair Nora Vargas and Supervisor Joel Anderson, who brought a request to draft an ordinance for microenterprise home kitchen operations, or MEHKOs, to the Board in September, said Wednesday that the home kitchens wouldn’t compete with established restaurants but would help local communities, the economy and people with cooking skills trying to make ends meet.\n“Legally implemented MEHKOS can serve as incubators for aspiring restaurateurs to test out and vet a menu while learning the basics of what it takes to run a small-scale retail operation,” Vargas said. “I want to make sure that families and businesses in our region are thriving, not just surviving, and this opens the door for home cooks to do just that.”\nAnderson said MEHKOS also provide a great service to communities “because people are getting quality food from their neighbors.”\n“On every level I just believe this is a terrific program,” Anderson said.\nCounty staff said comments collected in public meetings and hearings stated that microenterprise kitchens could have numerous potential economic and community benefits. They would give aspiring restaurateurs a way to earn a living and way to test their skills and ideas for an overall startup cost of about $740, rather than spending the estimated $275,000 average cost of opening a storefront restaurant. They would also provide “food justice” and healthy, home-cooked meals for communities that don’t have lots of restaurants or that lack access to healthy food.\nCalifornia established a MEHKO addition to the California Retail Food Code in 2019. The code is the state law that establishes health and sanitation standards and regulates food facilities. The County of San Diego is the regional local authority that conducts health inspections for all restaurants and food facilities and is the governing body to consider MEHKO authorization for all jurisdictions in the region.\nThe state law allows microenterprise kitchens with restrictions. Some of those include:\n\nThey must be operated by a resident living in the home or apartment\nThey cannot have more than one full-time employee excluding family members.\nFood must be prepared and served on the same day and sold directly to consumers.\nThey’re limited to $50,000 in sales a year.\nThey cannot operate as caterers, temporary event vendors, mobile event vendors or cottage food operators that prepare and sell packaged foods.\n\nHome cooks who want to operate a microenterprise kitchen would be required to submit an application, earn a food safety manager certificate from an approved school, pass an initial inspection, and undergo annual inspections. Kitchens that rely upon well water would also have to conduct private well tests to ensure the water is safe.\nThe Department of Environmental Health and Quality conducted approximately 50 stakeholder meetings to inform the drafting of the ordinance, including four public workshops with language translators, meetings with other public agencies, chambers of commerce and city councils.\nBecause the Board’s action creates a new ordinance to oversee regulation, it will need to be authorized again at a “second reading” Jan. 26, which will allow it to take effect 30 days after that.\nCounty staff said they would study local MEHKOS during the two-year temporary authorization of the ordinance and bring back that data to the Board before the ordinance expires for their consideration on whether to make it permanent.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220112.16.09.43"}