{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Starting This Weekend, Voting Locations Open For Four Days", "description": "You don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at one of 221 voting locations around the county, from 8 a.m. to 5 p.m., Saturday, Sept. 11 through Monday, Sept. 13.", "datePublished": "2021-09-10T09:24:40-07:00", "url": "https://www.countynewscenter.com/starting-this-weekend-voting-locations-open-for-four-days/", "keywords": ["elections", "early voting", "registrar of voters", "rov"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-09-10T09:24:40-07:00", "articleType": "article", "articleContent": "\nYou don’t have to wait until Election Day to vote in person. Voters can take advantage of early voting at one of 221 voting locations around the county, Saturday, Sept. 11 through Monday, Sept. 13 from 8 a.m. to 5 p.m.\nHours at the voting locations and the Registrar of Voters office will change to 7 a.m. to 8 p.m. on Election Day, Sept. 14.\nVoters are not assigned to a single voting location this election. You can visit any one of the County’s voting locations and cast your ballot.\nAll in-person voters this election will use ballot marking devices. The voter uses a touch screen to make their selections. When finished, the voter will print out a paper official ballot with their selections. The voter can review the ballot and place it in the ballot box to be counted at the Registrar’s office election night. This device does not store, tabulate, or count any votes.\nBallot marking devices are fully compliant with the Americans with Disabilities Act, and in addition to English, voters have the ability to select a translated ballot in one of the County’s four federally covered languages: Spanish, Filipino, Vietnamese and Chinese.\nThe Registrar of Voters has put in place protocols to help protect the health and safety of election workers, voters, and observers at the Registrar’s office, voting locations, and mail ballot drop-off locations. This includes:\n\nAll unvaccinated voters, observers and election workers must wear face coverings. Outdoor accommodations will be made available for voters who are unable to wear one.\nAll vaccinated voters, observers and election workers are strongly encouraged to wear face coverings.\nHand sanitizer readily available when entering and exiting facility.\nMasks and gloves available for all voters and visitors.\nPlexiglass barriers in use at the Registrar’s office and all voting locations.\nControlled path of travel when entering and exiting.\nRegular cleaning/disinfecting of frequently touched objects and surfaces.\n\nSome locations, such as schools, may require face coverings. You can check which locations require one before heading out. If you forget a face covering, election workers will have one to give you. Voters who are unable to wear a facial covering will be able to vote outside.\nRemember that campaigning or electioneering within 100 feet of a voting location or mail ballot drop-off location is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or question on the ballot.\nVoters can still save themselves the trip and mark their ballot from home. Be sure to sign and date the return envelope, seal your completed ballot inside and return it to a mail ballot drop-off location or voting location.\nYou can confirm your ballot was received by the Registrar’s office at sdvote.com.\nTo learn more about voting in the upcoming recall election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210910.09.24.40"}