{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Resumes Use of Johnson and Johnson Vaccine", "description": "The County is resuming vaccinations with the Johnson & Johnson vaccine after the California Department of Public Health gave the green light to do so over the weekend.", "datePublished": "2021-04-26T17:59:13-07:00", "url": "https://www.countynewscenter.com/county-resumes-use-of-johnson-and-johnson-vaccine/", "keywords": ["health", "coronavirus", "covid-19", "johnson and johnson resumes", "open vaccine appointments", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-04-26T17:59:29-07:00", "articleType": "article", "articleContent": "\nThe County is resuming vaccinations with the Johnson & Johnson vaccine after the California Department of Public Health gave the green light to do so over the weekend.\nVaccinations with Johnson & Johnson were temporarily paused earlier this month while the U.S. Food and Drug Administration studied adverse reactions in a small number of recipients. The FDA concluded April 23 that the benefits of the vaccine outweigh its risks and approved it for emergency use. Following the subsequent findings of the Western States Scientific Safety Review Workgroup, CDPH approved the vaccine’s usage.\nWomen under the age of 50 should be aware of the rare but increased risk of blood clots after vaccination with the Johnson & Johnson vaccine and talk to their medical providers about other options if they have concerns about the Johnson & Johnson vaccine.\nThe County of San Diego currently has about 12,000 doses of the Johnson & Johnson vaccine available and will offer them at mobile vaccination sites and walk-up vaccine pods. The single-dose Johnson & Johnson vaccine will also be used to vaccinate homebound individuals and agricultural workers who are often more difficult to reach for a second dose.\nAvailable Vaccine Appointments\nThanks to Johnson & Johnson vaccinations resuming and a steady supply of incoming vaccine shipments, vaccination sites across the County currently have appointments available for the coming days. A new vaccination location, the Linda Vista Vaccine Site at the University of San Diego, opens tomorrow. The site will be open from 9 a.m. to 3:30 p.m.\nYou can research appointment times and locations at www.vaccinationsuperstation.com.\nVaccine recipients will be informed during sign-up which vaccine they will receive, which is standard practice. Those signing up for appointments on MyTurn can see which of the three available vaccines, Johnson & Johnson, Moderna or Pfizer, will be offered to them.\nVaccination Progress:\n\nOver 2.72 million COVID-19 vaccine doses have been delivered to the region, and more than 2.53 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOverall, close to 1.39 million County residents have received at least one shot of the two-dose vaccine. That’s 51.7% of those eligible.\nOf those vaccinated to date, over 935,000 County residents, or 34.8% of San Diegans 16 and older, are fully immunized.\nThe goal is to fully vaccinate 75% of San Diego County residents 16 and older or 2,017,011 people. To date, 68.9% of the goal population has received at least one vaccine and 46.4% are fully vaccinated.\n\nThose who received the one-dose Johnson & Johnson vaccine, which was approved for emergency use by the FDA on Friday, April 23, 2021 following a pause for a study of adverse reactions in a small number of recipients, are being added to the total of fully vaccinated San Diegans.\nThe difference between doses shipped and the number of vaccinations administered represents approximately what is expected to be used in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.1 cases per 100,000 residents (as of April 20).\nThe County remains in the Orange Tier or Tier 3 under the state’s new guidance. The California Department of Public Health indicates that unless there are extenuating circumstances, such as low rate of vaccine uptake, a county will only move to a more restrictive tier if hospitalizations are increasing significantly among vulnerable individuals, especially among vaccinated individuals, and both testing positivity and adjusted case rates show a concerning increase in transmission. This is currently not the case in the region.\nCurrently, the testing positivity percentage is 2.4%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 3.0% and is also in the Orange Tier or Tier 3.\nCDPH assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 27.\n\nCommunity Setting Outbreaks:\n\nNo new community outbreaks were confirmed April 25.\nSeven new community outbreaks were confirmed April 24, three in business settings, two in restaurant/bar settings, one in a grocery setting and one in a retail setting.\nThree new community outbreaks were confirmed April 23, one in a business setting, one in a TK-12 school setting, and one in a retail setting.\nIn the past seven days (April 19 through April 25), 25 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n7,737 tests were reported to the County on April 25, and the percentage of new positive cases was 2%.\nThe 14-day rolling average percentage of positive cases is 1.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,959.\n\nCases, Hospitalizations and ICU Admissions:\n\n129 COVID-19 cases were reported to the County on April 25. The region’s total is now 275,540.\n15,164 or 5.5% of all cases have required hospitalization.\n1,673 or 0.6% of all cases and 11% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported April 25. The region’s total is 3,692.\nFour additional COVID-19 deaths were reported on April 24.\nAll of these deaths occurred in December and were just added to the list after a rigorous review of death certificates that were incorrect or incomplete and required the analysis of the patients’ medical records to determine if they were COVID-19 deaths.\nOne woman and three men died between Dec. 4 and Dec. 11.\nOf the people whose deaths were reported on Sunday, two were 80 years of age or older, one was in their 70s and one was in their 60s.\nThree had underlying medical conditions and one has medical history pending.\nFour additional deaths were reported on April 23.\nTwo women and two men died between April 12 and April 22.\nOf the people whose deaths were reported on Saturday, one was 80 years of age or older, two were in their 70s and one was in their 50s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210426.17.59.13"}