{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Eligible San Diegans Urged to Join the 540,000 Already Protected with Bivalent COVID-19 Booster ", "description": "Nearly 550,000 San Diegans have protected themselves, their family and friends by getting the bivalent COVID-19 booster since it became available in September 2022. County health officials are urging more to do the same as we start the new year.", "datePublished": "2023-01-19T16:57:32-08:00", "url": "https://www.countynewscenter.com/eligible-san-diegans-urged-to-join-the-540000-already-protected-with-bivalent-covid-19-booster/", "keywords": ["government"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2023-01-19T17:29:26-08:00", "articleType": "article", "articleContent": "\nMore than 540,000 San Diegans have protected themselves, their family and friends by getting a bivalent COVID-19 booster since it became available in September 2022. County health officials are urging more to do the same as we start the new year. \nThe COVID-19 virus is still widespread in our neighborhoods and county. County public health officials are specifically urging people 65 years of age and older―the group most at risk from serious complications, including death, of COVID-19―to get a bivalent booster.  \nThe Centers for Disease Control and Prevention and California Department of Public Health a recommend bivalent booster for everyone six months of age and older. \nNumerous studies have reported that the bivalent booster is more effective in protecting people from serious complications from COVID-19, including the newest Omicron variants that now make up four of every 10 cases in the U.S.  \n“It’s very important that San Diegans not let their guards down and continue to protect themselves by getting vaccinated if they haven’t been already,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “The virus is still circulating in the region. We’re still seeing high percentages of positive COVID-19 tests and detecting high levels of the virus in wastewater. Vaccinations, including bivalent boosters, can help protect you from getting seriously ill or even dying.”\nThe County Health and Human Services Agency reports 519,371 San Diegans chose to get the bivalent booster in the four months from when they were introduced September through the end of 2022. That included 126,772 in September, 178,256 in October, 123,450 in November and 90,893 in December. To date in January, 28,747 have obtained the bivalent booster. \nCOVID-19 vaccines, including bivalent boosters, and flu vaccines are widely available at local medical providers and pharmacies. The County continues to offer vaccinations throughout the region at its vaccination sites. Check online for the days and hours sites will be open.   \n Preventive Measures   \n In addition to vaccination and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:   \n\nCleaning hands thoroughly and often.   \n\n\nStaying away from sick people.   \n\n\nWearing a facial covering, especially in crowded indoor settings.   \n\n\nRegularly cleaning commonly touched surfaces.  \n\n\nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County of San Diego COVID-19 testing webpage. \n\nCOVID-19 Vaccination Progress  \n\nMore than 2.69 million or 80.5% of San Diegans have received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 548,143 or 22.0% of 2,497,222 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators.\nCOVID-19 Data  \nFor the week ending Jan. 14, 2023, the report shows:\n\n2,325 COVID-19 cases were reported to the County in the past seven days. The region’s total is now 972,887.\nThe 2,325 cases reported in the past week were lower compared to the 3,370 infections identified the previous week.\n22 additional deaths were reported in the week ending Jan. 14, 2023. The region’s total is 5,703.\nTwenty-one of the people who died were 65 or older.\nFourteen of the people had been vaccinated and eight were unvaccinated or had not completed the primary vaccine series.\nTwenty-two had underlying medical conditions.\n\nInfluenza Data  \nFor the week ending Jan. 14, 2023, the report shows the following:\n\nFour additional flu deaths; the season’s total is now 37.\nAll four had underlying medical conditions.\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 4% the previous week).\nLab-confirmed influenza cases for the week: 156 (compared to 342 the previous week).\nTotal lab-confirmed cases to date: 20,542 (compared to 1,449 at the same time last season and a 5,223 prior 5-year average during the same week).\n\nMore Information \nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230119.16.57.32"}