{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Declares Citrus Quarantine in Valley Center", "description": "The California Department of Food and Agriculture declared a new citrus quarantine in Valley Center Nov. 30 after detecting the fatal citrus tree disease known as Huanglongbing (HLB) or citrus greening in five orange trees on a residential property during regular inspections. ", "datePublished": "2023-11-30T13:10:42-08:00", "url": "https://www.countynewscenter.com/state-declares-citrus-quarantine-in-valley-center/", "keywords": ["agriculture", "citrus greening", "hlb", "lueg", "quarantine"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-11-30T13:23:04-08:00", "articleType": "article", "articleContent": "\nThe California Department of Food and Agriculture declared a new citrus quarantine in Valley Center Nov. 30 after detecting the fatal citrus tree disease known as Huanglongbing (HLB) or citrus greening in five orange trees on a residential property during regular inspections.\nThis bacterial disease is a major threat to San Diego County’s $138 million annual citrus crop and can impact residential citrus tree owners. HLB causes misshapen, bitter fruit and eventually kills infected trees. There are over 120 growers with approximately 1,100 acres of commercial citrus and 120 nurseries that may have citrus trees within the Valley Center quarantine. The commodities on these Valley Center properties are valued at $19.4 million.\nThis new quarantine adds to the existing HLB quarantines in the city of Oceanside and Rancho Bernardo. It covers the area bordered on the north by the intersection of I-76 and Pala area; to the south by I-15 and Deer Springs Road; to the west by Camino del Rey; and to the east by Valley Center. The maps for this HLB quarantine are available.\nThe intent of the quarantine is to protect the food supply, support the agricultural economy, and environmental sustainability by restricting people and businesses from moving citrus nursery stock, plant parts and fruit outside the quarantine boundaries and off their properties.  The only exception is for agricultural businesses that must adhere to specific requirements for treatment, cleaning, and packing commercial fruit prior to movement.\nThe disease is not harmful to people or animals but is deadly to citrus and could be devastating to the county’s citrus industry. HLB is spread by tiny insects, the Asian citrus psyllid, if they are carrying the bacterium when they feed on citrus trees. Samples from trees on the property where HLB was confirmed—as well as the surrounding area—are undergoing tests for the disease.\n“Unfortunately, Huanglongbing is fatal to citrus,” said San Diego Agricultural Commissioner Ha Dang, “so our goal is to prevent this disease from spreading any farther. By working together, we can all protect our food supply, local agriculture, and environment from this devastating disease. Partnering with state and federal regulatory partners, we are working closely with residents and agricultural operators and ask for everyone’s cooperation with the ongoing regulatory activities.”\nThe California Department of Food and Agriculture (CDFA) and County Department of Agriculture, Weights and Measures will work with residents in the immediate area to arrange for treatment of citrus trees as a protective measure against the disease. County officials are also proactively notifying local citrus growers, plant nurseries and other related businesses. If the disease is detected in additional citrus trees in the quarantine area, CDFA officials will contact properties regarding treatment and removal of the infected trees. Nearby trees will be treated, and regulatory survey efforts will be increased to prevent the spread of the disease in the area.\nInfected trees may have areas with mottled yellow leaves, generally seen in asymmetrical patterns and bear small, asymmetrical fruit which are partially green, bitter, and not fit for sale or eating. The disease destroys the appearance and economic value of the trees and eventually causes their death, typically within a few years.\nInside the quarantine area, we urge residents to take the following steps:\n\nDo not move citrus plants, leaves, or foliage into or out of the quarantine area.\nCooperate with agricultural officials who are inspecting trees, taking samples and treating for the pest.\nIf residents no longer wish to care for a citrus tree, consider contacting a tree removal service to discuss options to help ensure trees do not continue to be a host to the pest and disease.\nOnly buy citrus trees from reputable local nurseries.\nReport citrus trees that seem to be sick or dying even though they also appear to be well-watered and well-maintained by contacting CDFA’s toll free Pest Hotline at (800) 491-1899 or visit cdfa.ca.gov/plant/acp.\nFor questions regarding moving commercial citrus and HLB quarantine regulations, please contact the San Diego Department of Agriculture, Weights, and Measures at (760) 752-4700 or visit sdcawm.org.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231130.13.10.42"}