{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID Vaccines for Children Under 5 Expected Soon", "description": "If the Centers for Disease Control and Prevention and the Western States committee approve Moderna’s vaccine for children ages 6 months to 5 years and Pfizer’s for children ages 6 months to 4 years, San Diego County children in those age groups will soon be able to get vaccinated at their pediatrician’s office, community clinics and some retail pharmacies.", "datePublished": "2022-06-16T18:26:04-07:00", "url": "https://www.countynewscenter.com/?p=208781", "keywords": ["health", "coronavirus", "covid-19", "under 5", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-06-17T10:48:43-07:00", "articleType": "article", "articleContent": "\nChildren under 5 years of age are the only group that is not eligible to get a COVID-19 vaccine.\nThe situation is likely to change soon if the Centers for Disease Control and Prevention and the Western States committee approve Moderna’s vaccine for children ages 6 months to 5 years and Pfizer’s for children ages 6 months to 4 years.\nIf that occurs, San Diego County children in those age groups will be able to get vaccinated at their pediatrician’s office, community clinics and some retail pharmacies.\n“While children have not been as susceptible to COVID-19, it’s important that they, too, are vaccinated to keep them from getting sick and passing the virus to others,” said Wilma J. Wooten. M.D., M.P.H., County public health officer. “Some parents have been eagerly anticipating the COVID vaccine for their younger kids. They should make an appointment to get them vaccinated as soon as possible.”\nSmaller Doses for Younger Kids\nThe vaccines for children this age would be given in much smaller doses. The Pfizer vaccine would be given in three shots, each containing one tenth of an adult dose. The first two doses would be given three weeks apart and the final shot at least three months later.\nThe Moderna vaccine, which currently is only available for adults, is also likely to be approved for two more age groups: children between 6 and 17 years of age and those under 6. The Moderna shot for kids under 6 is a two-dose series, given about four weeks apart. Each dose contains one quarter of the adult dose.\nBoth the Pfizer and Moderna shots for kids under 6 are given with smaller needles and, most times, it is administered in the leg.\nEveryone 5 years and older can get a vaccine and boosters at no cost. Parental consent is required for all eligible minors to be vaccinated.\nVaccination Progress:\n\nReceived at least one shot: More than 2.97 million or 94.4% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.63 million or 83.6%.\nBoosters administered: 1,358,992 or 58.7% of 2,316,581 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nThree additional deaths were reported since the last report on June 9. The region’s total is 5,318.\nOf those three additional deaths, two were men and one was a woman. They died between June 9, 2022 and June 11, 2022; the three deaths occurred in the past week.\nTwo of the people who died were 80 years or older and one was in their 70s.\nTwo of the people who died were fully vaccinated and one was not.\nAll three had underlying medical conditions\n\nCases, Case Rates, Hospitalizations and Testing:\n\n4,003 COVID-19 cases were reported to the County in the past three days (June 13 – June 15, 2022). The region’s total is now 813,035.\n9,672cases were reported in the past week (June 9 through June 15) compared to 10,370 infections identified the previous week (June 2-June 8).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 42.13 for people fully vaccinated and boosted, 25.06 for fully vaccinated people and 75.59 for not fully vaccinated San Diegans.\n12,412 tests were reported to the County on June 11, and the percentage of new positive cases was 11% (Data through June 11).\nThe 14-day rolling percentage of positive cases, among tests reported through June 11, is 10.7%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220616.18.26.04"}