{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Child Support Services Recognized by DHHS for Outreach Efforts", "description": "The San Diego County Department of Child Support Services (DCSS) was recently recognized by the U.S. Department of Health and Human Services for its outreach efforts in 2020 to be inclusive to all members of the diverse San Diego community.", "datePublished": "2021-02-08T16:20:33-08:00", "url": "https://www.countynewscenter.com/san-diego-county-child-support-services-recognized-by-dhhs-for-outreach-efforts/", "keywords": ["public safety", "department of child support services", "public safety"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-02-08T16:20:33-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Department of Child Support Services (DCSS) was recently recognized by the U.S. Department of Health and Human Services for its outreach efforts in 2020 to be inclusive to all members of the diverse San Diego community.\nFederal officials recognized the child Support department by highlighting their email flyer outreach program in the December/January edition of Child Support Report, the official publication of the federal Office of Child Support Enforcement.\nDCSS is using a new way to communicate directly with parents who receive Child Support services and also identify Spanish as their primary language to improve engagement and access to child support information.\nJennifer Hellerud, Deputy Director of DCSS, said the office created outreach materials in both English and Spanish to highlight events, general information, and specific services and delivered the information using Peachjar, a company that specializes in sending digital flyers to the parents of K-12 students. The department cross-referenced geographic, economic, and populations statistics to identify key areas where the flyers would most likely be able to reach their target audience.\n“This was the first time our office used mass communication tools for outreach beyond existing case participants, and we carefully tailored the language and imagery in each flyer to address the needs of that community in the context of the child support program, said Eaton”\nDuring the first three months, DCSS sent flyers to nearly 200 schools resulting in a total of 330,987 emails. And 34% of the emails were opened, which is much higher than the 21% industry standard for government emails.\n“This impressive open rate may be because emails from schools are more familiar and trusted by parents,” said Eaton.\nJeff Grissom, Director of San Diego County DCSS, said the flyers and outreach materials that received the most clicks were ones that included a list of services in easily understood terminology on programs and services that matter most to our community.\n“Our website, which is available in both Spanish and English, also received a 22% increase in Spanish-speaking visitors over the previous year,” said Grissom. “And we experienced modest but noteworthy growth of Spanish-speaking new case openings and engagement.”\nGrissom said the office plans on continuing to use Peachjar to complement its website and Facebook and Twitter presence.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210208.16.20.33"}