{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar Reminds District Four Voters to Vote Early", "description": "If you’re a registered voter in the Fourth Supervisorial District and haven’t cast your ballot yet, you’ll soon get a reminder from the Registrar’s office that you have just over one week to cast your ballot for the Aug. 15 special primary election.", "datePublished": "2023-08-03T08:17:50-07:00", "url": "https://www.countynewscenter.com/registrar-reminds-district-four-voters-to-vote-early/", "keywords": ["elections", "aug. 15 special primary election", "d4 special primary election", "fourth district supervisorial election", "postcard", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-08-03T10:45:50-07:00", "articleType": "article", "articleContent": "\nIf you’re a registered voter in the Fourth Supervisorial District and haven’t cast your ballot yet, you’ll soon get a reminder from the Registrar’s office that you have just over one week to cast your ballot for the Aug. 15 special primary election.\nThe Registrar sent nearly 400,000 reminder postcards to registered voters in District 4 who had not voted as of July 26.\nDon’t delay! You can vote from home and return your ballot through the mail – no postage needed. Remember to sign and date your return ballot envelope. You must sign the return ballot envelope for your vote to count.\nYou also have the option to use one of the Registrar’s official ballot drop boxes. The secure stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.” Find one close to you through the Registrar’s online locator tool or inside your voter information pamphlet. Check each location’s hours of operation before heading out at sdvote.com.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you want to vote in person, that option is available too. Avoid long lines by taking advantage of early voting. Starting Saturday, Aug. 5, seven vote centers will be open daily from 8 a.m. to 5 p.m. until the final day of voting on Tuesday, Aug. 15, when 14 vote centers will be open from 7 a.m. to 8 p.m.\nAll vote center locations and the Registrar’s official ballot drop boxes will be open on Election Day, Aug. 15, when voting hours change to 7 a.m. to 8 p.m.\nYou can find a complete list of vote center and ballot drop box locations at sdvote.com.\nLearn more about voting in the District 4 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\nGet mobile updates by texting COSD D4Election to 468311.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230803.08.17.50"}