{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Friday is World Tuberculosis Day, Get Tested, Be Safe", "description": "County public health officials are encouraging at-risk San Diegans to get simple blood or skin tests to find out if they may unknowingly have a tuberculosis infection as the world observes World Tuberculosis Day Friday.", "datePublished": "2023-03-22T16:48:55-07:00", "url": "https://www.countynewscenter.com/friday-is-world-tuberculosis-day-get-tested-be-safe/", "keywords": ["health", "public health", "tb", "tuberculosis", "tuberculosis testing"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-03-22T16:48:55-07:00", "articleType": "article", "articleContent": "\nCounty public health officials are encouraging at-risk San Diegans to get simple blood or skin tests to find out if they may unknowingly have a tuberculosis infection as the world observes World Tuberculosis Day Friday.\nPublic health officials estimate that 175,000 San Diegans could be walking around with a hidden—but curable—tuberculosis (TB) infection. People with “latent” TB infections have no symptoms and cannot infect others.\nHowever, if that person’s immune system weakens, the infection can be triggered into a dangerous, highly infectious active TB disease that could make them, their family, friends and even strangers seriously ill.\nOfficials said people can remedy that by just getting simple blood or skin tests and antibiotic treatments if needed.\n“Knowing your risk for tuberculosis can help you protect yourself and your loved ones,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “If you’re at risk, testing now will help you get treated early, before the disease has a chance to make you sick and infect others.”\nWorld Tuberculosis Day is held every March 24 to remind people that the highly infectious bacterial disease passed from an infected person to others through coughing, sneezing, laughing or breathing can be eliminated in our modern world.\nDespite the fact it is preventable, TB is the 13th leading cause of death worldwide and the second deadliest infectious disease on earth, behind COVID-19, according to the World Health Organization.\nIn 2020, the County launched the San Diego County TB Elimination Initiative, a public-private partnership, to promote TB awareness and improve testing and treatment.\nPeople can become infected with “latent” TB and carry it for years without knowing it. That is because their healthy immune systems suppress the infection.\nBut if their immune systems become weakened by other chronic illnesses, conditions and medications, the latent TB infection they’ve carried can activate even after years of dormancy into active TB disease. That puts themselves and everyone they contact at risk.\nPeoples’ immune systems can be weakened by numerous illnesses and conditions including asthma, HIV/AIDS, diabetes, arthritis, and kidney disease, and habits like alcohol abuse, smoking or even getting older.\nCounty officials say without treatment, as many as 10% of all people with latent tuberculosis will develop active tuberculosis disease. Of the 175,000 San Diegans estimated to have latent tuberculosis, officials say only 25% know they have it and only 15% have been treated.\nPublic health officials say certain groups of people are at higher risk for TB. That includes people who have lived or worked in certain communal settings, such as public shelters and jails, and people born outside of the United States. County officials say 70% of people diagnosed with active tuberculosis disease were born outside of the U.S.\nIn San Diego County in 2022, 208 people were reported with active TB disease. Active TB disease mainly infects peoples’ lungs. It can cause long-lasting bad coughs, chest pain, coughing up blood, weakness, fatigue, weight loss, fever, chills, night sweats—and even death.\nIt is especially important for people who have symptoms of active tuberculosis, such as bad coughs that last longer than three weeks, to be tested for tuberculosis.\nCounty officials urge at-risk San Diegans to know their own potential risk, get tested if they have risk factors. People can use the County’s Tuberculosis Control Program’s Risk Assessment tool that is available on their website at: TB Risk Assessment (sandiegocounty.gov)\n“We want people to know today on World Tuberculosis Day that you can cure this serious infection, whether you are sick with active tuberculosis disease, or if you have latent tuberculosis and don’t know it,” said Dr. Jeffrey Percak, the chief/medical director of the County’s Tuberculosis Control and Refugee Health Branch. “Those cures start by knowing your risks and getting a blood test or skin test to find out if you are infected.”\nSo this year, observe World Tuberculosis Day; know your risk; get tested. And be safe.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230322.16.48.55"}