{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Invites Public to Discuss Available Federal Grants", "description": "The County wants to hear from you to discuss plans for federal funds that support community projects and programs for people in need of services. Housing and Community Development Services is inviting community members and local non-profit representatives to provide input on the department’s Feder...", "datePublished": "2022-07-19T13:57:22-07:00", "url": "https://www.countynewscenter.com/?p=209002", "keywords": ["government"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-07-20T08:38:37-07:00", "articleType": "article", "articleContent": "\nThe County wants to hear from you to discuss plans for federal funds that support community projects and programs for people in need of services. Housing and Community Development Services is inviting community members and local non-profit representatives to provide input on the department’s Federal Entitlement Annual Plan which covers available federal Housing and Urban Development grants.\nThe federal grant programs include the Community Development Block Grant (CDBG), HOME Investment Partnerships, Emergency Solutions Grants and Housing Opportunities for Persons with HIV/AIDS. These federal programs provide funding to cover things like neighborhood revitalization and community development projects and housing assistance for people experiencing homelessness and those living with HIV/AIDS. The County of San Diego receives approximately $12 million annually in federal entitlement funding for housing & community development.\nHousing and Community Development Services is hosting public in-person and virtual meetings between July 20 and 26. The meetings are an opportunity to identify community needs and connect with potential applicants. They will cover information on how to apply for CDBG including eligibility requirements as well as the purpose of the annual plan and its four federal grant programs and past projects funded by the federal. Each meeting will include time for a question-and-answer session.\nVirtual Meetings:\n\nAnnual Plan Community Forum \nWednesday, July 20, 2022, from 5-6pm\nMeeting number: 2458 239 5028\nSession password: SanDiego\nLink\nAnnual Plan Community Forum \nThursday, July 21, 2022, from 10-11am\nMeeting number: 2459 174 6344\nSession password: SanDiego\nLink\n\nIn-Person Meetings:\n\nAnnual Plan Community Forum \nMonday, July 25, 2022, from 10:30-11:30am\nFallbrook Library Community Room\n124 S. Mission Rd., Fallbrook, CA 92028\nAnnual Plan Community Forum \nTuesday, July 26, 2022, from 10:30-11:30am\nLincoln Acres Library Community Room\n2725 Granger Ave., National City, CA 91950\nAnnual Plan Community Forum \nTuesday, July 26, 2022, from 10:30-11:30am\nEl Cajon Library Community Room\n201 E. Douglas, El Cajon, CA 92020\n\nCommunity members attending in-person meetings should follow the County’s COVID-19 precautions to slow the spread of the virus, including:\n\nWear a mask indoors when in public\nGet all the vaccine doses and boosters\nStay home if you are sick and get tested\nAvoid crowded places\nTake other precautions, such as washing your hands and staying away from people who are visibly sick\n\nFor more information, visit the department’s County website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220719.13.57.22"}