{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Case Reported In Transit Rider", "description": "A passenger using the Metropolitan Transit System (MTS) has been diagnosed with infectious pulmonary tuberculosis (TB) according to San Diego County Health and Human Services Agency (HHSA).", "datePublished": "2022-09-01T14:25:50-07:00", "url": "https://www.countynewscenter.com/?p=209367", "keywords": ["health", "metropolitan transit system", "mts", "mts passenger", "public health", "tb", "tb control program", "tb symptoms", "tuberculosis"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-09-01T16:06:38-07:00", "articleType": "article", "articleContent": "\nA passenger using the Metropolitan Transit System (MTS) has been diagnosed with infectious pulmonary tuberculosis (TB) according to San Diego County Health and Human Services Agency (HHSA).\nHHSA is working with MTS officials to notify individuals who were possibly exposed. Riders using the following routes between Feb. 16 to July 16 were potentially exposed and are at risk for infection:\n\nBus route 950 from Otay Mesa Transit Center toward Iris Avenue Transit Center Monday through Friday between 4:30 a.m. to 6 a.m.\nBus route 950 from Iris Avenue Transit Center to Otay Mesa Transit Center from 3p.m. to 5 p.m.\nBlue Line Trolley from Iris Avenue to H Street from 5 a.m. to 6:30 a.m.\nBlue Line Trolley from H Street to Iris Avenue from 2:30 p.m. to 5 p.m.\n\nPotentially affected passengers are advised to consult with their medical provider or contact Public Health to arrange testing.\nMTS employees identified will be tested by their occupational health program.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “Most people who are exposed do not develop the disease and TB can be treated and cured with medication.”\nFor people with symptoms of TB, or who are immune compromised, it is important they see their medical provider to rule out TB.\nIndividuals who would like more information on this potential exposure are asked to call the County TB Control Program at (619) 692-8621.\nThe number of annual TB cases in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 264 cases reported in 2019, 192 cases in 2020 and 201 cases of tuberculosis disease reported in 2021. To date, 97 cases have been reported in 2022.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220901.14.25.50"}