{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Residents Urged to Be Prepared to Evacuate Early and Quickly as Fire Threat Increases", "description": "The Valley Fire, which has grown to thousands of acres in just a few days, is a growing threat to communities in San Diego County with the Santa Ana wind event forecast for today. Residents, particularly those who live in communities around the fire perimeter, are asked to be ready to evacuate in 15 minutes or less.", "datePublished": "2020-09-08T11:49:18-07:00", "url": "https://www.countynewscenter.com/residents-urged-to-be-prepared-to-evacuate-early-and-quickly-as-fire-threat-increases/", "keywords": ["public safety", "alertsandiego", "emergency", "fire preparedness", "valley fire"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-09-08T13:41:24-07:00", "articleType": "article", "articleContent": "\nThe Valley Fire, which has grown to thousands of acres in just a few days, is a growing threat to communities in San Diego County with the Santa Ana wind event forecast for today. Residents, particularly those who live in communities around the fire perimeter, are asked to be ready to evacuate in 15 minutes or less.\nSanta Ana winds are projected, at this point, to pick up in the evening hours, so it is important that residents be ready to go before then. In some previous fires, residents have been given less than 15 minutes to evacuate and were alerted in the overnight hours.\n“We want to remind people to get prepared to evacuate in case it is needed and stay alert to the weather conditions, news and notifications from officials. This is an active fire and it can change directions and intensity depending on weather, so it’s important to take warnings and orders seriously,” said Jeff Toney, Director of the Office of Emergency Services. “We also want people to know that if they do not feel safe, they can evacuate early. People do not need to, and should not, wait for an official evacuation order.”\nThis is the fire evacuation warning and order and fire perimeter map as of 8 a.m. Sept. 8.\n\nBe sure your cell phone is registered with AlertSanDiego, the county’s regional notification system to receive the warnings directly to your mobile phone. People may also register their VoIP phone numbers or emails as well.\nResidents may also download the ReadySanDiego SDEmergencyApp which also provides emergency information such as incident updates, shelter locations, evacuation areas and hazard perimeters.\nTune in to local news coverage on the fire. The main Emergency Alert System radio stations for San Diego County are KOGO AM 600 and KLSD AM 1360.\nNow is the time for households to review, or create, a personal disaster plan in English or in Spanish. The guide includes disaster preparedness and immediate safety tips that can be used in any emergency. Among the tips are what you need to know about evacuations and suggestions on what you can take with you. Residents may also consider various routes to take to leave the community, know more than one in case one is not safe to use due to the emergency.\nCheck on elderly or neighbors who might require assistance evacuating.\nHave a plan to shelter large animals or livestock and if possible, evacuate them early. If you need assistance evacuating call (619) 236-2341.\nTake household pets with you whenever possible.\nIf you have a life-threatening emergency, call 9-1-1.\nVisit our preparedness website org.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200908.11.49.18"}