{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Announces New Hires to Lead Government Affairs and Communications", "description": "New leaders in the County’s Economic Development and Government Affairs and Communications Offices have been announced.", "datePublished": "2024-10-03T17:07:27-07:00", "url": "https://www.countynewscenter.com/county-announces-new-hires-to-lead-government-affairs-and-communications/", "keywords": ["government", "communications", "economic development and government affairs", "edga", "fgg", "matthew parr", "michael workman", "new hires", "tammy glenn"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2024-10-07T09:19:41-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesNew leaders in the County’s Economic Development and Government Affairs and Communications Offices have been announced.\nMatthew Parr will be the new director of the Office of Economic Development and Government Affairs (EDGA). Parr has served as EDGA’s interim director for the last several months.\nPrior to that, Parr was the Deputy Director of Strategy and Intergovernmental Affairs, which includes management of the Board of Supervisors’ Legislative Program and oversight of the County’s state and federal legislation advocacy strategy and budget policies to support San Diego County communities.\nThrough his leadership, the County has successfully advanced legislative efforts protecting the environment, expanding access to health services and supporting vulnerable populations. This includes passage of Assembly Bill 636 enhancing protections for seniors, Senate Bill 872 delivering critical health services through mobile pharmacies as well as state and federal funding for the CARE Act and SB 43 implementation to provide behavioral health support to those in need of critical care.\nTammy Glenn has been selected as the Director of the County Communications Office. The department leads public and employee communications for the organization along with community engagement and language services to support the County workforce and the communities we serve. She’ll take on the new role as interim director, Michael Workman, prepares to leave County service next month.\nGlenn joined the County in 2007 and has been the Assistant Director of the Communications Office since 2012, supporting an award-winning team to provide critical and engaging information while creating opportunities for meaningful community input.\nShe has led the Joint Information Center at the County Emergency Operations Center during many regional emergencies, working closely with local, state and federal partners. She and her team manage County News Center and social media to provide updates to the public on programs and services that impact their lives, the County’s TV station which airs Board of Supervisors meetings, as well as Engage San Diego County where people can provide input on County projects.\nParr and Glenn begin their new roles Oct. 4.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241003.17.07.27"}