{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Surpasses 2,000 COVID-19 Deaths, Reports Youngest Victim", "description": "The County of San Diego has reached a somber milestone in the COVID-19 pandemic, reporting a total of 2,005 San Diegans lost to the virus.", "datePublished": "2021-01-14T17:41:39-08:00", "url": "https://www.countynewscenter.com/county-surpasses-2000-covid-19-deaths-reports-youngest-victim/", "keywords": ["health", "2000 deaths", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-01-14T17:41:39-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego has reached a somber milestone in the COVID-19 pandemic, reporting a total of 2,005 San Diegans lost to the virus. This includes an additional 53 deaths reported to the County Health and Human Services Agency today.\nThe deaths reported today include a 19-year-old male, the youngest San Diegan to die from complications of COVID-19.\n“Our deepest condolences go out to the family and friends of this teen and to the families and friends of the more than 2,000 San Diegans who have died of COVID-19 throughout the course of this pandemic,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “We understand that the pandemic has been trying on the community, but today’s report is a reminder that we must do everything we can to protect each other and slow the spread of COVID-19.”\nWooten continues to urge San Diegans to do the following:\n\nWash your hands\nWatch your distance around others\nWear a mask\nWhen sick, stay home and get tested\n\nFor more information about COVID-19, testing locations and vaccine distribution, visit www.coronavirus-sd.com.\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\nEight new community outbreaks were confirmed on Jan. 13: five in business settings, one in a community-based organization, one in a daycare/preschool/childcare setting and one in a government setting.\nIn the past seven days (Jan. 7 through Jan. 13), 48 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n42,878 tests were reported to the County on Jan. 13, and the percentage of new positive cases was 6%.\nThe 14-day rolling average percentage of positive cases is 13.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 27,146.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n2,595 cases were reported to the County on Jan. 13. The region’s total is now 204,175.\n6,809 or 3.3% of all cases have required hospitalization.\n1,280 or 0.6% of all cases and 18.8% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n53 new COVID-19 deaths were reported to the County on Jan. 13. The region’s total is now 2,005.\n23 women and 30 men died between Nov. 28 and Jan. 13.\nOf the 53 new deaths reported Jan. 13, 27 people who passed away were 80 years or older, 13 people were in their 70s, eight people were in their 60s, three people were in their 50s, one person was in their 20s and one person was a teenager.\n51 had underlying medical conditions, one did not and one had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210114.17.41.39"}