{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Live Well San Diego Kicks Off 10th Anniversary Celebration", "description": "Live Well San Diego kicked off its 10th anniversary celebration this weekend with a pair of fun activities. The County’s vision for a region that is healthy, safe and thriving was celebrated at a San Diego Gulls ice hockey game and during the grand opening of the new Sweetwater Bike Park.", "datePublished": "2020-01-06T12:45:07-08:00", "url": "https://www.countynewscenter.com/live-well-san-diego-kicks-off-10th-anniversary-celebration/", "keywords": ["health", "live well san diego", "live well san diego anniversary"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-01-09T09:48:53-08:00", "articleType": "article", "articleContent": "\nLive Well San Diego kicked off its 10th anniversary celebration this weekend with a pair of fun activities. The County’s vision for a region that is healthy, safe and thriving was celebrated at a San Diego Gulls ice hockey game and during the grand opening of the new Sweetwater Bike Park.\nDuring their game against the Bakersfield Condors on Saturday night, the San Diego Gulls became the newest Live Well San Diego partner, bringing the total number of recognized partner organizations to 479. The Gulls were presented with a proclamation from the County Board of Supervisors recognizing the organization’s commitment to advancing the Live Well San Diego vision.\n“We were proud to welcome the San Diego Gulls as a Live Well San Diego partner during Saturday’s game. It was great so many County of San Diego employees were in attendance,” said Supervisor Nathan Fletcher. “Athletes and sports teams understand the importance of living a healthy lifestyle and set a great example for all of us. The hard work and dedication the Gulls make daily to Live Well San Diego should be an inspiration to us all. It’s great to have them on the Live Well team.”\nLaunched in 2010, the Live Well San Diego vision was created by the County in response to statistics that found that throughout the nation and locally three behaviors (poor nutrition, lack of physical activity and tobacco use) were contributing to four diseases (heart disease/stroke, cancer, Type 2 diabetes and respiratory conditions) that resulted in more than 50% of deaths in San Diego County.\nTo address these issues, the County partnered with schools, government agencies, businesses, neighborhood-based organizations and other entities to leverage existing resources to improve the health and well-being of all County residents.\nIn the past decade, organizations and individuals have shared their knowledge, resources and ideas to address a broad spectrum of community concerns, from access to health care to crime prevention to improving the natural environment.\nThe 10th anniversary kickoff events over the weekend were the first of many planned for the coming months. The next event will be Love Your Heart on Valentine’s Day, Friday, February 14. For more information on all upcoming Live Well San Diego events, visit the Live Well San Diego 10th anniversary website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200106.12.45.07"}