{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Listening Sessions Scheduled to Ensure Local Access to New CalAIM Services", "description": "The two virtual sessions will share an overview of the new Enhanced Care Management and Community Supports offered through the California Advancing and Innovating Medi-Cal (CalAIM) initiative.", "datePublished": "2023-02-07T08:47:15-08:00", "url": "https://www.countynewscenter.com/listening-sessions-scheduled-to-ensure-local-access-to-new-calaim-services/", "keywords": ["health", "calaim", "enhanced care management", "healthcare", "listening session", "sdaim"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-02-07T11:28:12-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency (HHSA) is hosting two community listening sessions to review new services for Medi-Cal members with complex health and social needs and gather community input on how those services should be implemented. \nThe two virtual sessions will share an overview of the new Enhanced Care Management and Community Supports offered through the California Advancing and Innovating Medi-Cal (CalAIM) initiative.  \n“These sessions will help identify some of the challenges people are experiencing and point us to solutions. That will result in better coordinated efforts that improve services for the over one million Medi-Cal beneficiaries in San Diego County,” said Dr. Eric McDonald, Chief Medical Officer. “These conversations are the first step in ensuring whole-person care coordination and related services now available through CalAIM.”  \nHealthcare organizations, community-based organizations, consumer advocates and anyone who supports someone on Medi-Cal with complex health and social needs are encouraged to attend. \nRegistration is now open for the following virtual sessions: \n\nWednesday, February 15\n3:30 p.m. – 5 p.m. \n\n\nTuesday, February 21\n3:30 p.m. – 5 p.m. \n\nClick here to register. To request language interpretation or other special accommodations please register at least three business days prior to the session. \nYou will receive a confirmation email with information on how to join the meeting after registering. Please email any questions to SDAIM.HHSA@sdcounty.ca.gov. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230207.08.47.15"}