{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Safeguard Your Home from Wildfires", "description": "As temperatures rise this summer, it’s important to consider safeguarding your property from wildfires.", "datePublished": "2024-06-25T17:38:58-07:00", "url": "https://www.countynewscenter.com/safeguard-your-home-from-wildfires/", "keywords": ["public safety", "defensible space", "fire preparedness", "wildfire"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-06-25T17:38:58-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteAs temperatures rise this summer, it’s important to consider safeguarding your property from wildfires.\nWildfires are the biggest hazard in San Diego County and people should create 100 feet or more of defensible space around their homes and businesses.\nWhy is this so important? Reducing growth and clearing debris around your property can help minimize damage if a gust of wind carries a burning ember into the yard.\nAssess your property’s vulnerability. What would the burning ember land on? Dried leaves in your gutter? The wood pile stacked against your garage? A tall plant that sits under an overgrown tree with overhanging branches on your roof? All of these could lead to fire.\nPlease note that during hot, dry conditions, such as when a red flag warning is issued, people should not attempt to use power tools to clear or reduce brush, as this could spark a fire that can spread to grass and other brush.\nHome- and business-owners can create defensible space by:\n\nCutting grass down to a maximum of 4 inches high.\nRaking up lawn litter such as leaves and pine needles.\nCleaning gutters of leaves and pine needles.\nUsing fire-resistant plants.\nLeaving space between plants.\nCreating “fuel breaks” with gravel walkways, driveways or lawns.\nThinning and pruning shrubs and tree limbs around your home, business.\nRemoving lower tree branches especially any dead ones or ones that overhang or touch your roof.\nMoving flammable items such as wood stacks and propane tanks away from your home or business.\nDisposing of tree trimmings and debris piles quickly. Learn more about creating defensible space and other ways to prepare for wildfires.\n\nLearn more about creating defensible space and other ways to prepare for wildfires.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240625.17.38.58"}