{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Restricts Cruise Ships With COVID-19; Local Cases Reach 603", "description": "Health officials today announced the County is restricting the acceptance of cruise ships with COVID-19 cases and has instituted new rules for the unloading of passengers and crew members off cruise ships arriving in San Diego.", "datePublished": "2020-03-30T18:10:32-07:00", "url": "https://www.countynewscenter.com/county-restricts-cruise-ships-with-covid-19-local-cases-reach-603/", "keywords": ["health", "coronavirus", "covid-19", "cruise ships"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-31T11:58:23-07:00", "articleType": "article", "articleContent": "\nHealth officials today announced the County is restricting the acceptance of cruise ships with COVID-19 cases and has instituted new rules for the unloading of passengers and crew members off cruise ships arriving in San Diego.\nThe first order, which goes into effect immediately, states:\n\nNo passenger or employee may disembark a cruise ship in San Diego harbor without approval of the Health Officer, or designee, if any person on the cruise ship has tested positive for COVID-19.\nAny cruise ship that is permitted to dock in San Diego harbor shall notify the Health Officer, or designee, regarding any emergency medical treatment required for a passenger or employee, and shall follow all directives of the Health Officer, or designee.\n\nThe second order, which takes effect April 1, 2020, indicates:\n\nNo cruise ship in San Diego harbor may dock or disembark employees or passengers after March 31, 2020. However, upon approval of the Health Officer, a cruise ship may dock solely for the purpose of receiving fuel and provisions so long as no employee or passenger disembarks.\n\n\nCruise ships docked in San Diego harbor shall notify the Health Officer, or designee, regarding any emergency medical treatment required for a passenger or employee, and shall follow all directives of the Health Officer, or designee.\n\nThe second order goes into effect April 1 to allow for the disembarkation of passengers and crew members of the Celebrity Eclipse cruise ship, which began to disembark at the Port of San Diego today and is expected to be done by tomorrow, said Eric McDonald, medical director of the County Epidemiology and Immunization Services branch.\nMcDonald indicated all passengers and crew members have been medically screened and are healthy, except one who was taken to a local hospital with a heart ailment. Everyone in the ship is going home to self-quarantine for 14 days, including 17 people on the ship who are from San Diego.\nCongregate Living Update\nAt today’s media briefing, County Chief Medical Officer Nick Yphantides updated the County’s work with nursing homes and other congregate living facilities to keep COVID-19 from spreading among these vulnerable populations.\nYphantides said four outbreaks have been reported at congregate living facilities for a combined total of 33 COVID-19 cases and, unfortunately, two deaths. Monitoring and investigations are ongoing.\nHe also noted it is National Doctors’ Day and thanked doctors, nurses, paramedics and all other health care staff involved in the fight against COVID-19.\n“We appreciate you so much,” Yphantides said.\nCounty COVID-19 Cases Reach 603\nThrough March 30, a total of 603 COVID-19 cases have been reported in San Diego County, including 84 new cases today.\nOf San Diego County’s cases, 345 (57%) were men and 256 (43%) were women. Of the known cases, 118 (19%) have required hospitalization, 51 (8%) had to be placed in intensive care and 7 (1.2%) have died.\nCounty officials also talked about other measures and resources to deal with COVID-19. To date:\n\nMore than 8,100 San Diegans have been tested.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who are vulnerable and have no place to live.\nOf the 1,585 rooms for County Public Health Services use, 112 are occupied, including 109 people who are homeless.\nOf the 441 rooms assigned to the Regional Task Force on the Homeless, 170 are being occupied by people who are at higher risk of developing complications from COVID-19. There have been no positive tests among homeless residents of the hotel rooms.\n257 handwashing stations have been placed throughout the region and 10 portable bathrooms are being installed today and tomorrow.\n\nVolunteer Opportunities\nMany San Diegans have asked where they can volunteer during this time. A website launched through a County partnership lists volunteer opportunities currently available to help with the Covid-19 response, including health care volunteers. Organizations needing volunteers can request their group be posted. Visit JustServe.org/sdcounty.\nSocial Distancing Flattens Curve\nCounty health officials continue to ask the public to remain at home to avoid contracting the virus and infecting others. If people need to be out to do essential things such as grocery shopping, it’s important that they keep at least six feet apart from other people.\nSocial distancing has been proven to slow the spread of pandemics so that sick people don’t overwhelm the local health care system.\nThe goal is to flatten the curve of COVID-19 and lessen the number of people who contract the virus and need hospitalization. Doing so will give the local health care system time to increase its capacity to care for sick people.\nHow to Stay Mentally and Physically Active\nThe County has launched a resource site at its Live Well San Diego webpage. Live Well @ Home offers free resources with tips and strategies for people of all ages to stay physically and mentally healthy while staying at home.\nThe resources and activities are organized by age group and topic to make it easier for people to find the right tools.\nThe County’s COVID-19 webpage now contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200330.18.10.32"}