{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Restrictions to Affect County Board Meetings", "description": "The County Board of Supervisors will cancel next week’s Wednesday board meeting and discuss those agenda items during its Tuesday board meeting on March 24.", "datePublished": "2020-03-20T15:44:29-07:00", "url": "https://www.countynewscenter.com/covid-19-restrictions-to-affect-county-board-meetings/", "keywords": ["government", "board meeting restriction", "board meetings", "board of supervisors", "cancel board meeting", "coronavirus", "county board of supervisors", "covid-19", "teleconference"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-03-30T09:07:07-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors will cancel next week’s Wednesday board meeting and discuss those agenda items during its Tuesday board meeting on March 24.\nDue to COVID-19 and the governor’s March 19 directive for everyone in the State of California to stay home, in-person participation at Board of Supervisors meetings will not be allowed.\nResidents can still watch the meeting online or on television. Anyone who wants to participate in the meeting can do so via teleconference.\nLive video is available while the meeting is in progress and archived several hours later. The meeting will also be broadcast live on Cox channel 24 or 19, Spectrum channel 24 or 85, and AT&T U-Verse channel 99.\nA call-in line is also available to listen to the live Board meeting while it is in session at (619) 531-4716. Additional information is posted on the Clerk of the Board’s website.\nMembers of the public can use the eComment service to submit comments on agenda and non-agenda items until the beginning of the meeting.\nThose who want to participate in the meeting via teleconference can email their name and the agenda item number they wish to address to publiccomment@sdcounty.ca.gov  by 5 p.m., on Monday, March 23.\nTeleconferencing instructions are posted on the Clerk of the Board’s website. Large groups wishing to comment on a common item are encouraged to submit comments in writing or to identify one spokesperson to join the teleconference on behalf of the group.\nAdditionally, Board members may be attending the meeting via teleconference or phone conference and will conduct business as usual.\nFor more information, visit the Clerk of the Board website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200320.15.44.29"}