{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Shift, Increase COVID Testing in Southeastern San Diego", "description": "The County is increasing its COVID-19 testing capabilities in Southeastern San Diego.", "datePublished": "2021-09-24T16:57:09-07:00", "url": "https://www.countynewscenter.com/county-to-shift-increase-covid-testing-in-southeastern-san-diego/", "keywords": ["health", "coronavirus", "covid testing", "covid-19", "tubman-chavez community center"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-09-24T17:06:41-07:00", "articleType": "article", "articleContent": "\nThe County is increasing its COVID-19 testing capabilities in Southeastern San Diego. With the closing of the Tubman Chavez Community Center, several local churches are stepping up to provide sites for COVID-19 testing in the area.\nThe shift will ensure that the community will continue to have access to free testing. The move will also expand testing availability from five to seven days among the locations.\nBeginning Sunday, Sept. 26, the following sites will provide no-appointment COVID-19 testing:\nSundays and Mondays \n9 a.m. – 3:30 p.m.\nBayview Baptist Church\n6134 Pastor Timothy J Winters St, San Diego, CA 92114\nMonday – Friday \n10:30 a.m. – 5:30 p.m.\nEncanto Southern Baptist Church\n6020 Akins Ave, San Diego, CA 92114\nTuesday – Saturday \n10 a.m. – 5:30 p.m.\nCity of Hope International Church\n4999 Holly Dr, San Diego, CA 92113\n“The summer surge of COVID-19 cases brought increased demand for testing, and we appreciate these partners helping us bring new testing opportunities to the community,” said Wilma J. Wooten, M.D., M.P.H.\nThe Tubman Chavez Community Center closed its doors for good Thursday, ahead of the groundbreaking for the Southeastern Live Well Center next week. The new project will replace and expand the space for public events that was previously available at the Tubman Chavez Community Center.\nThe center has played a vital role in the response to COVID-19 since the onset of the pandemic. Since June 29, 2020, it has provided 182,082 COVID tests and 5,705 vaccinations.\nIn recent months, the Tubman Chavez Community Center has been open Sundays through Thursdays for COVID-19 testing, as vaccination services shifted across the street to the larger Joe and Vi Jacobs Center.\nVaccinations will continue to be available in the area from 9:30 a.m. – 3:30 p.m. Tuesday through Saturday, both at the Jacobs Center (404 Euclid Ave., San Diego, CA 92114) and the Educational Cultural Complex in Mountain View (4343 Ocean View Boulevard, San Diego, CA 92113).\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210924.16.57.09"}