{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Ballots Go Out to Registered Voters for June Primary Election", "description": "More than 1.9 million ballots are on their way to San Diego County registered voters for the June 7 Gubernatorial Primary Election. You may find yours in your mailbox as early as Monday, May 9", "datePublished": "2022-05-09T09:19:31-07:00", "url": "https://www.countynewscenter.com/?p=208466", "keywords": ["elections", "ballots go out", "fgg", "june gubernatorial primary election", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-05-09T10:24:30-07:00", "articleType": "article", "articleContent": "\nMore than 1.9 million ballots are on their way to San Diego County registered voters for the June 7 Gubernatorial Primary Election. You may find yours in your mailbox as early as Monday, May 9. You will also find your “I Voted” sticker inside your official ballot packet.\nEarly voting is underway at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nYou can vote from the comfort of your home and return your voted ballot through the mail – no postage needed – or to any of the Registrar’s official ballot drop box locations around the county starting Monday, May 9 through Election Day. Don’t forget to sign and date your return ballot envelope. Your signature is required for your vote to count.\nVoters who return their ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nYou can also choose to vote in person at any vote center. · Starting Saturday, May 28, select vote centers will be open daily from 8 a.m. to 5 p.m. including Memorial Day on Monday, May 30. Then starting Saturday, June 4, over 200 vote centers will be open daily from 8 a.m. to 5 p.m.\nAll vote center locations will be open on Election Day, June 7, when voting hours change to 7 a.m. to 8 p.m.\nYou can find an official ballot drop box or vote center location near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nLearn more about voting in the June Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220509.09.19.31"}