{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Equity Impact Grant Winners Announced", "description": "Ten local, small non-profit organizations are celebrating after winning $100,000 each in equity impact grants and a year’s worth of custom coaching designed to further their missions, advancing equity and belonging throughout the region.  ", "datePublished": "2024-12-11T12:51:53-08:00", "url": "https://www.countynewscenter.com/equity-impact-grant-winners-announced/", "keywords": ["government", "equity impact grant program", "equity impact grant recipients", "fgg", "oerj", "office of equity and racial justice", "taryell simmons"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-12-12T10:41:35-08:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesTen local, small non-profit organizations are celebrating after winning $100,000 each in equity impact grants and a year’s worth of custom coaching designed to further their missions, advancing equity and belonging throughout the region.\nThe winners were announced by the County’s Office of Equity and Racial Justice (OERJ) on Wednesday.\nThe recipients applied for the grants through the County’s Equity Impact Grant (EIG) Program.\nThe County and the Nonprofit Institute at the University of San Diego (NPI) developed the program last year. Through this partnership, the County provides the grant funding and NPI provides coaching on leadership, nonprofit governance, organizational resiliency and more.\nThe program was created after community feedback described how small organizations led by people of color encounter difficulties in obtaining government contracts and philanthropic funding. For example, complex grant applications that require significant time and grant writing experience to complete or a lack of grants that would serve their organization.\n“These grants will significantly benefit small organizations and the people they serve,” said Interim OERJ Director Taryell Simmons. “By awarding these grants, we acknowledge the challenges small nonprofits face. We are proud to support them in building capacity, enabling them to serve even more people who need their services.”\nThis is the second round of funding and coaching for the program. The first group received grants in May.\nTo be considered for the grant program, applying organizations had to have fewer than five employees and/or operate on $500,000 or less. The non-profits also had to show how they are addressing local inequities in one of the areas below:\n\nEducation and youth empowerment (early childhood through higher/continuing education).\nCivic engagement and movement building.\nArts, narrative change, and culture.\nHousing and community development.\nRestorative justice and alternatives to incarceration.\nHealth and healing.\nWealth building, workforce, and economic development.\nFood systems and environmental justice.\n\nThe 10 recipients to win funding in this round are:\nBetter Cuts Mental Health Alliance: Combining the art of barbering with the science of mental health to uplift, connect and transform the lives of men of color, Better Cuts Mental Health Alliance envisions a world where every man of color has access to culturally appropriate mental health services.\nClub FBS (Fitteds, Books & Sneakers): A book club and mentorship program for Black male middle and high school students that seeks to improve the grade-level reading rates of Black males while elevating their social-emotional well-being through character-building and positive masculinity models.\nDreams+Ducats: This educational nonprofit works with students, teachers, schools and school districts to connect classrooms and curriculum more meaningfully to community, culture, careers and the local economy.\nGreater than Tech: The organization integrates STEM (science, technology, engineering and mathematics) and business principles to help young people in underserved areas learn more about the opportunities these fields can offer the students now and in the future.\nLived Experience Advisors (LEA): LEA works with people who have experienced homelessness to help advocate for positive changes in homelessness service systems.\nMano a Mano Foundation: Creator of the region’s first Spanish language educational program about the fentanyl crisis, Mano a Mano works with the Latino community to provide educational services and comprehensive support to families in culturally appropriate ways, including on topics like substance abuse, gangs, domestic violence, mental health, and supporting children inside and outside of the classroom.\nOur Genetic Legacy: This organization helps young people in the Black, Indigenous and people of color (BIPOC) community tell the stories of their ancestral history in a variety of ways, including a drone program designed to record sites important in BIPOC history, a virtual museum and a history textbook that will be published in 2025.\nRISE San Diego: RISE San Diego provides training and support for resident leaders to increase their capacity to make meaningful community change. RISE’s vision is for thriving, resident-led urban neighborhoods that provide safe and healthy opportunities for youth and families to live, work and play.\nSan Diego International Birthing Project: This volunteer organization supports women of color through their pregnancy, baby’s birth and motherhood. The San Diego International Birthing Project helps women obtain prenatal care and provides one-on-one support throughout pregnancy. It also offers parenting and life skills for mothers and fathers, mental health referrals, health education and more.\nFoundation for Care Integration: The foundation provides financial aid for at-risk older adults and families, including BIPOC communities and individuals with disabilities who cannot bridge the financial gap between their insurance and their health needs. Through home modifications, caregiver support and access to essential medical care, Foundation for Care Integration empowers individuals to live independently and with dignity in their own homes.\nFor more information about OERJ, visit their website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241211.12.51.53"}