{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Advances Equity in Job Hiring for Formerly Incarcerated", "description": "A new County ordinance builds on the state’s Fair Chance Act to give people with a criminal past a better chance of gaining jobs in the unincorporated area.", "datePublished": "2024-11-12T15:54:03-08:00", "url": "https://www.countynewscenter.com/county-advances-equity-in-job-hiring-for-formerly-incarcerated/", "keywords": ["public safety", "fair chance act", "fgg", "hiring tool kit", "jobs", "justice-involved", "office of labor standards and enforcement", "psg"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-11-12T16:27:31-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteA new County ordinance builds on the state’s Fair Chance Act to give people with a criminal past a better chance of gaining jobs in the unincorporated area.\nLocal officials held a news conference Tuesday to announce how the ordinance will affect justice-involved people and their potential employers.\nThe ordinance ensures justice involved people have a fair chance at employment without being automatically disqualified due to past incarceration.\nAn employer can still conduct a background check, but now there are rules and guidelines about what they can consider regarding arrests and more.\nIf an employer decides to withdraw a job offer based on background check results, they must provide a written assessment explaining their decision and allow the applicant to respond with additional information.\nThe Fair Chance Ordinance went into effect Oct. 10. The County’s Office of Labor Standards and Enforcement (OLSE) is getting the word out about the program.\nOLSE is also offering a new hiring tool kit to give employers guidelines on the new ordinance.\nPenalties for violations of the ordinance will begin on July 1, 2025. Employers could be fined up to $20,000 for multiple violations.\nFor more information about the new ordinance and the hiring tool kit, visit the County’s Office of Labor Standards and Enforcement webpage or call 619-531-5129.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241112.15.54.03"}