{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County Celebrates Nurses During Nurse Appreciation Week", "description": "It is National Nurse Appreciation Week, and today the County celebrated more than 600 of its nurses for providing the highest level of care to our community during a special event at the County Operations Center.", "datePublished": "2023-05-12T15:44:20-07:00", "url": "https://www.countynewscenter.com/county-celebrates-nurses-during-nurse-appreciation-week/", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-05-12T15:44:20-07:00", "articleType": "video.other", "articleContent": "\nIt is National Nurse Appreciation Week, and today the County celebrated more than 600 of its nurses for providing the highest level of care to our community during a special event at the County Operations Center.\n“Every day you show bravery and resilience in the face of unprecedented challenges,” said County Board of Supervisors Chairwoman Nora Vargas. “We are grateful for your unwavering dedication to your patients and to the nursing profession.”\nCounty nurses care for thousands of residents across the region, at places like Edgemoor Skilled Nursing Facility, the Psychiatric Hospital and in the field making home care visits and on outreach teams. Each day, they strive to provide person-centered, trauma-informed, culturally relevant, and inclusive care across multiple departments and specialties.\n“You are dedicated to your jobs and filled with the compassion necessary to be that bedside friend, familiar face, and calming voice in times of uncertainty,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “Thank you for all you do.“\nThis year, county nurses continued to protect the community from COVID-19, upper respiratory infections and the flu, while also responding quickly to new cases of mpox, tuberculosis and Hepatitis A. Collectively they are instrumental in helping the County achieve the Live Well San Diego vision of a region that is healthy, safe and thriving.\n“When we talk about Live Well San Diego, we’re talking about you,” said Nick Macchione, Director of the County’s Health and Human Services Agency. “When we’re talking about providing healing and comfort, and providing a sense of safety, and of hope without being judgmental, I think about you.”\nThank you, San Diego County nurses, for your dedication, professionalism, and tireless service. You are making a difference every single day.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230512.15.44.20"}