{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Office Closures for New Year’s Holiday", "description": "In observance of the New Year’s Day holiday, County offices, family resource centers, libraries and animal shelters will be closed to the public Sunday, Jan. 1 and Monday, Jan. 2.", "datePublished": "2022-12-22T13:32:51-08:00", "url": "https://www.countynewscenter.com/county-office-closures-for-new-years-holiday/", "keywords": ["government", "county closure", "new year s day"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-12-22T13:32:51-08:00", "articleType": "article", "articleContent": "\nIn observance of the New Year’s Day holiday, County offices, family resource centers, libraries and animal shelters will be closed to the public Sunday, Jan. 1 and Monday, Jan. 2.\nCounty-operated COVID-19 vaccination and testing sites will be closed Dec. 31-Jan. 2 and will resume normal hours Tuesday, Jan. 3.\nPartner test sites will be affected as follows:\n\nDec. 30: The Border View YMCA will be closed. Chula Vista City Hall will be open from 8:30 a.m. to 3 p.m.\nDec 31: Cal State San Marcos and the Lemon Grove Senior Center will be open from 9:30 a.m. to 12:30 p.m. The former Boys and Girls Club. Heart Revolution Church, the Assessors Recorder County Clerk building and the North Inland Live Well Center will be open from 7 a.m. to 1 p.m. only.\nJan. 1: Cal State San Marcos, Lemon Grove Senior Center and the Border View YMCA will be closed.\nJan. 2: Chula Vista City Hall will be closed. The Imperial Beach Sports Park, North Coastal Live Well Center and the former University of San Diego Recycling Center sites will be closed.\n\nAll essential services, such as Sheriff’s Department patrols and animal control emergency response, will continue during the holiday.\nCounty parks, preserves and campgrounds will be open during normal business hours on Jan. 1. However, there will be no public vehicle access or restroom availability with the exception of campgrounds and neighborhood day-use parks.\nFacilities at several County Parks will be closed on the dates below.\n\nThe Valley Center Community Hall will be closed Jan. 2.\nThe Fallbrook Community Center will be closed Jan. 2.\nThe Lakeside Community Center will be closed Dec. 26 through Jan. 2.\nThe Lakeside Teen Center/REC Club will be closed Dec. 23 through Jan. 6.\nThe Spring Valley Community Center will be closed Jan. 2.\nThe Spring Valley Teen Center will be closed Dec. 22 through Jan. 6.\nThe Spring Valley Gym will be closed Dec. 31 through Jan. 6.\nThe 4S Ranch Recreation Office will be closed Jan. 1-2.\n\nCounty offices will resume normal hours on Tuesday, Jan. 3.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221222.13.32.51"}