{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "How San Diegans Can Help Keep COVID-19 Case Rate Down", "description": "With the County’s COVID-19 case rate continuing to decline, local health officials are urging San Diegans to keep taking measures to prevent the spread of the novel virus.", "datePublished": "2020-08-19T18:11:31-07:00", "url": "https://www.countynewscenter.com/how-san-diegans-can-help-keep-covid-19-case-rate-down/", "keywords": ["health", "case rate", "community outbreaks", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-21T17:37:28-07:00", "articleType": "article", "articleContent": "\nWith the County’s COVID-19 case rate continuing to decline, local health officials are urging San Diegans to keep taking measures to prevent the spread of the novel virus.\nThe County’s case rate is now at 85.2 and below the state watchlist threshold of 100 cases per every 100,000 residents. Because of that, the region is now in the second day of the 14-day period before all K-12 schools can reopen, if they choose to do so.\nTo make sure the region gets to that point, it’s important that all San Diegans keep taking the necessary actions to prevent COVID-19 community outbreaks and the spread of the virus. They include:\n\nWear face coverings\nMaintain physical distance\nWash your hands\nAvoid crowded places\nStay home if you are sick\n\n“Because there is no treatment or vaccine, this is really what we have to wrap our arms around to prevent the spread of COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “San Diego residents have done a phenomenal job in helping to push our case rate below 100.”\nWhy Outbreak Locations Are Not Released\nMany San Diegans have asked for the County to release the names and locations where COVID-19 community outbreaks are identified.\nCurrently, the County is not releasing the names of outbreak locations because there is no action that the public needs to take. There is no higher risk of infection at these locations because the virus is widespread.\n“Avoiding businesses where an outbreak has been identified does not lower your risk of infection,” Wooten said. “If there was a specific threat to public health, we would release that information.”\nFor example, Wooten said that the County would make public the location of a community outbreak if it posed a threat to the public, such as the E.coli outbreak at the 2019 San Diego County Fair or the measles outbreak that started at Disneyland in late 2014.\n“We release information when there is an action that an individual or the public could or should take,” Wooten said.\nCounty COVID-19 Testing to Be Done by Priority\nThe Centers for Disease Control and Prevention and the California Public Health Department recently updated their testing guidance, but their recommended priority categories/tiers were broad and did not address frequency.\nRecognizing that local healthcare providers, especially those with limited supplies and capacity, would have challenges adopting the new guidance, the County worked with partners to set the local priority levels.\nEarlier this week, an advisory went out to the local medical community with the updated five testing tiers:\n\nPeople with symptoms who are hospitalized, in congregate facilities, older adults, have underlying medical conditions or are part of a vulnerable population. People identified by public health investigations and disease control activities.\nPeople with symptoms such as healthcare workers and first responders, as well as patients requiring hospitalization and people who require surgical procedures.\nPeople without symptoms in congregate living facilities and close contacts of people who tested positive.\nPeople without symptoms such as healthcare workers, first responders, vulnerable populations, essential workers, older adults and people with underlying medical conditions and their caretakers.\nPeople without symptoms who are being tested for purposes of public health surveillance.\n\nSan Diego Public Health organizes free COVID-19 testing locations countywide. Appointments can be made at online, while three walk-in locations offer no-appointment testing where no one is turned away.\nCase Rate:\n\nThe region’s state-calculated case rate is 85.4 for Aug. 19. and the County was removed from the state’s monitoring list yesterday.\nThe County will now need to report a case rate below 100 cases per 100,000 people for an additional 13 days. Then all schools, grades K-12, can reopen.\nThe list of schools that have submitted waiver applications and received waivers to reopen can be found here.\nNo other businesses can reopen until the state provides further guidance.\n\nCommunity Setting Outbreaks:\n\nTwo new outbreaks were identified on Aug. 18: one in a business and one in a restaurant.\nIn the past seven days, 15 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.    \n\nTesting:\n\n6,781 tests were reported to the County on Aug. 16 and the number of laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 4.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,798.\n\nCases:\n\n214 new cases were reported in San Diego County for a total of 35,376.\n2,916 or 8.2% of cases have required hospitalization.\n723 or 2.0% of all cases and 24.8% of hospitalized cases had to be admitted to an intensive care unit. \n\nDeaths:\n\nFive new COVID-19 deaths were reported in San Diego County on Aug. 18 and the region’s total is now 638.\nThree men and two women died between Aug. 11 and Aug. 17 and their ages ranged from 56 to 87 years of age.\nAll had underlying medical conditions.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200819.18.11.31"}