{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What’s Changing When County Moves to Orange Tier", "description": "The County will move into the Orange Tier of the state’s COVID-19 prevention framework on Wednesday, April 7, further easing restrictions and allowing more indoor activities.", "datePublished": "2021-04-06T17:04:13-07:00", "url": "https://www.countynewscenter.com/whats-changing-when-county-moves-to-orange-tier/", "keywords": ["health", "coronavirus", "covid-19", "orange tier", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-04-06T17:05:33-07:00", "articleType": "article", "articleContent": "\nThe County will move into the Orange Tier of the state’s COVID-19 prevention framework on Wednesday, April 7, further easing restrictions and allowing more indoor activities.\nThe region can move into the Orange Tier of the Blueprint for a Safer Economy because its case rate has been under 6 cases per every 100,000 residents for the last two weeks, after moving to the Red Tier on March 17. The move comes after the state raised the case rate threshold for counties to meet after meeting a goal to vaccinate more than 4 million Californians who live in areas with the least healthy community conditions.\nNow, to qualify for the Orange Tier, a region must have a case rate between 2 and 5.9 case per every 100,000 residents. The County’s case rate is now 5.8 cases per every 100,000 residents.\n“We have made significant progress in lowering our local case rate,” said Wilma Wooten, M.D., M.P.H., County public health officer. “San Diegans should enjoy the benefits while continuing to take appropriate measures to protect themselves and others, especially washing their hands, wearing a mask, watching their distance and, when it’s their turn, getting vaccinated.”\nHere are some of the activities now allowed under the Orange Tier:\n\nRestaurants: Indoor seating increases to 50% capacity or 200 people maximum. The 10 p.m. to 5 a.m. curfew is also ending.\nGyms and Fitness Centers: 25% capacity indoors; indoor pools can open.\nWineries and Breweries: 25% or 100 people indoors maximum\nMovie Theaters: 50% or 200 people maximum.\nMuseums, Zoos and Aquariums: 50% capacity for indoor activities.\nPlaces of Worship: 50% capacity indoor activities.\nBars with no food service: Open outdoors with modifications.\nAll retail: No capacity limits.\n\nMany other restrictions will end April 15. You can see a complete list here. Also, Gov. Gavin Newsom announced today that if current trends continue, the tier system California has been using will disappear June 15, allowing for the complete reopening of the state’s economy.\nBoard Expands Rental Assistance, Great Plates Programs\nThe County Board of Supervisors today acted after receiving its bi-weekly COVID-19 update to help people who have been negatively impacted by the pandemic. The actions include:\n\nEstablish appropriations of $107 million for implementation of the Emergency Rental Assistance Program, which helps eligible households in qualifying areas who have been financially impacted by the COVID-19 pandemic.\nEstablish appropriations of $80 million for the Great Plates Delivered program, which delivers meals to older adults and people with disabilities who meet eligibility criteria.\nAccept $124 million in funding from the Centers for Disease Control and Prevention, directed through the state, to expand the County public health laboratory’s capacity.\n\nVaccination Progress:\n\nMore than 2.06 million COVID-19 vaccine doses have been delivered to the region, and nearly 1.87 million have been logged as administered. This number includes both County residents and those who work in San Diego County.\nOf those vaccinated to date, nearly 616,000 County residents, or 22.9% of San Diegans 16 and older, are fully immunized.\nOverall, almost 1.05 million County residents have received at least one shot of the two-dose vaccine. That’s 39% of those eligible.\nThose receiving the one-dose Johnson & Johnson vaccine are being added to the total of fully vaccinated San Diegans.\nThe difference between doses delivered and those used in a vaccination represents approximately what is expected to be administered in the next seven days and doses still to be entered in the record system.\nMore information about vaccine distribution can be found on the County’s vaccination dashboard. For details on groups currently eligible and vaccination opportunities, visit www.vaccinationsuperstation.com.\n\nState Metrics:\n\nCurrently, the testing positivity percentage is 2.3%, placing the County in Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 2.6% and is also in the Orange Tier or Tier 3.\nAll three metrics place the County in the Orange Tier or Tier 3 for activities, effective April 7.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, April 13.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed April 5 in a TK-12th grade school setting.\nIn the past seven days (March 30 through April 5), 13 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n6,995 tests were reported to the County on April 5, and the percentage of new positive cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,940.\n\nCases, Hospitalizations and ICU Admissions:\n\n212 COVID-19 cases were reported to the County on April 5. The region’s total is now 271,866.\n14,902 or 5.5% of all cases have required hospitalization.\n1,659 or 0.6% of all cases and 11.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nTwo new COVID-19 deaths were reported April 5. The region’s total is 3,587.\nA man in his 50s with no underlying medical conditions died April 2. Another man in his 70s and with underlying medical conditions died April 4.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210406.17.04.13"}