{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Healthy Habits Build Healthy Smiles", "description": "Cavities are the most common chronic childhood disease. When left untreated, cavities in children can be painful or cause infections leading to learning issues, school absences and even emergency room visits and hospitalizations. The good news is that they are completely preventable.  ", "datePublished": "2024-02-07T09:52:09-08:00", "url": "https://www.countynewscenter.com/healthy-habits-build-healthy-smiles/", "keywords": ["health", "children s dental health month", "dental health", "oral care"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-02-07T10:01:02-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCavities are the most common chronic childhood disease. When left untreated, cavities in children can be painful or cause infections leading to learning issues, school absences and even emergency room visits and hospitalizations. The good news is that they are completely preventable.  \nFebruary is National Children’s Dental Health Month which promotes the benefits of good oral health from an early age.  \n“It’s never too soon to begin taking care of children’s oral health,” said County Chief Dental Officer Fadra Whyte, DMD. “From babies to adulthood, practicing good oral hygiene and keeping up with the care of our teeth and mouth helps set us up for overall wellness.” \nIn San Diego County, nearly one in four children entering school had untreated tooth decay. Nearly 20 percent had either never been to the dentist, or it had been more than a year since their last visit.  \nDental check-ups and cleanings for children are recommended every three to six months starting six months after the first tooth erupts, but no later than 12 months of age, as well as following these daily health tips: \n\nBrush twice a day with a toothpaste that has fluoride. Kids under the age of six should be supervised as they develop brushing skills. \nFloss daily starting as soon as the teeth begin to touch \nReplace worn toothbrushes every three to four months. \nAvoid sugary snacks and drinks  \n\nCalifornia public schools require children to have had an oral health assessment within 12 months of starting school or by May 31 of the child’s first year in public school.  \nFind more information about the County’s Oral health Program online.  For help finding a Medi-Cal dental provider, visit smilecalifornia.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240207.09.52.09"}