{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Releases Climate Action Plan to Reduce Greenhouse Gases", "description": "The County of San Diego’s Draft Climate Action Plan, a blueprint for reducing greenhouse gas emissions in the unincorporated area and at County facilities, is now available for public review and comment.", "datePublished": "2023-10-26T13:30:51-07:00", "url": "https://www.countynewscenter.com/county-releases-climate-action-plan-to-reduce-greenhouse-gases/", "keywords": ["environment", "agriculture", "climate action plan", "climate change", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-10-26T13:30:51-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Draft Climate Action Plan (CAP), a blueprint for reducing greenhouse gas (GHG) emissions in the unincorporated area and at County facilities, is now available for public review and comment.\nActions outlined in the Draft CAP will ultimately help us reach net zero emissions by 2045. Net zero means removing the same amount of emissions that are produced.\nThe CAP is designed to improve overall sustainability while meeting the state’s GHG requirements through actions in the following sectors: built environment and transportation, energy, solid waste, water and wastewater, and agriculture and conservation.\nWhat Does Reducing GHG Emissions Achieve?\nImplementing the CAP actions that reduce GHG emissions will help preserve the environment, improve public health, increase access to green careers and improve quality of life.\nThe CAP can also help us reduce wildfire risk, increase energy reliability, and reduce utility bills for the unincorporated area.\nThe County has worked with attorneys, litigants and interested community members to make this CAP stronger by adding more choices for the public.\nIn January 2021, the Board of Supervisors called for a new CAP that uses updated data and modeling, prioritizes environmental justice and equity, includes a net-zero greenhouse gas emissions goal, and other key priorities. The Board rescinded the 2018 CAP, but the County continued many of its 26 measures, which were not challenged by the court and have been achieving good results.\nSince 2021, the County has worked closely with the community and special interest groups to shape the next CAP.\nHere are some of the County’s climate action measures:\n\nOpen space and agricultural easements acquisition.\nTree planting initiatives and rain barrel programs.\nCounty fleet fuel use and emissions reductions.\nSolar photovoltaic energy, which is a renewable source of energy, use at County facilities and in the community.\n\nAs of 2022, the County’s climate action efforts have:\n\nAcquired 8,766 acres of open space.\nEstablished conservation easements on 2,135 acres of farmland.\nPlanted more than 30,000 trees.\nCreated 369 miles of bike lanes.\nAdded 56 public electric vehicle charging stations.\nDistributed 10,493 rain barrels.\nContinued to support the use of clean energy by waiving solar permit fees.\n\nYou can find updates on all County greenhouse gas reduction measures here.\nHow Can You Participate in the Process of Developing the CAP?\nCommunity input has been vital to the County’s efforts to develop the CAP to date. Since the beginning of 2023, staff released a survey for unincorporated area residents, provided classroom workshops on clean air and water, and began a series of presentations to Community Planning and Sponsor Groups.\nThe public comment period will run through Jan. 5, 2024. Residents can review and provide feedback here.\nThe draft CAP will be considered by the County’s Board of Supervisors for adoption in Fall 2024.\nTo learn more about the CAP Update and get involved, visit our project and follow along on Facebook, Instagram, and X.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231026.13.30.51"}