{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New East Otay Mesa County Fire Station Will Serve Rapidly Developing Border Area", "description": "The San Diego County Fire Protection District broke ground Tuesday on Fire Station 38 in East Otay Mesa. Once built, the station will serve a rapidly developing area which includes warehouses, transport businesses, two power plants and a battery facility. Crews housed there will also respond to calls on expanding roads and highways in the area carrying traffic crossing the U.S. and Mexico border.", "datePublished": "2022-07-12T17:45:16-07:00", "url": "https://www.countynewscenter.com/?p=208946", "keywords": ["government"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-07-12T17:45:16-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Fire Protection District broke ground Tuesday on Fire Station 38 in East Otay Mesa. Once built, the station will serve a rapidly developing area which includes warehouses, transport businesses, two power plants and a battery facility. Crews housed there will also respond to calls on expanding roads and highways in the area carrying traffic crossing the U.S. and Mexico border.\nThe $14.6 million station will be staffed with 12 personnel and have a ladder truck, a fire engine, ambulances and other apparatus and will be located just to the south of the intersection of Alta and Otay Mesa roads.\nCounty officials held a ceremony Tuesday to kick off the construction project and to talk about its significance.\n“This is a project that is long overdue for our communities. Each year, there are approximately 1,500 calls for this service area and we know the number will be increasing as well. With the future addition of the East Otay Mesa Port of Entry, the arrival of new businesses, and upcoming housing developments, East Otay Mesa has a very vibrant future,” said Vice Chair Nora Vargas, San Diego County Board of Supervisors, District 1. “This new station will ensure that we continue to meet the needs of a growing region.”\nThe station will be 14.000 square feet with four double-depth apparatus bays, 12 bedrooms, a kitchen, an office, a day room, a fitness room and a conference room.\nStation 38 is designed to be the first Zero Net Energy fire station for the County with roof solar panels and is also designed to achieve LEED Gold certification.\n“We look forward to being back in a year to have the grand opening,” said Chief Tony Mecham, CAL FIRE/San Diego County Fire Protection District.\nThis year the County will be investing nearly $50 million annually into a cooperative agreement with CAL FIRE to staff 20 fire stations around-the-clock by employing over 200 personnel. When County-funded positions are combined with the State, San Diego County Fire is the second largest fire department in our region.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220712.17.45.16"}