{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar Reminds District One Voters to Vote Early  for Special Primary Election", "description": "If you’re a registered voter living in the County of San Diego’s First Supervisorial District and haven’t cast your ballot yet, you’ll soon get a reminder that you have less than two weeks to vote in the April 8 special primary election.", "datePublished": "2025-03-27T11:01:16-07:00", "url": "https://www.countynewscenter.com/registrar-reminds-district-one-voters-to-vote-early-for-special-primary-election/", "keywords": ["elections"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-03-27T11:01:16-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIf you’re a registered voter living in the County of San Diego’s First Supervisorial District and haven’t cast your ballot yet, you’ll soon get a reminder that you have less than two weeks to vote in the April 8 special primary election.\nThe Registrar sent over 345,000 reminder postcards to registered voters in District 1 who had not voted as of March 20.\nThe person elected will fill the district’s vacant seat for the remainder of the current term that ends in January 2029. If no candidate receives a majority vote at the April 8 election, the top two vote-getters will move on to the special general election on July 1. Only those who live in the district can vote in the election.\n\nDistrict 1 runs from the Pacific Ocean to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The district includes the cities of Chula Vista, Imperial Beach, National City, and some communities within the City of San Diego, including Barrio Logan, East Village, Golden Hill and more. It also includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside and La Presa.\nIf you’re not sure if you live in District 1, you can look it up at sdvote.com.\nDon’t delay! If you have been holding onto your ballot, act now. You can vote from home and return your ballot through the mail – no postage needed – or to any of the Registrar’s 29 official ballot drop boxes around the district. Remember to sign and date your return ballot envelope. You must sign your return envelope for your vote to be counted.\nThe Registrar’s official ballot drop boxes are open 24 hours a day up until 8 p.m. on the final day of voting, April 8. Visit sdvote.com to check the location list or the locator map to find a location near you.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nAdditional options to vote in person will begin Saturday, March 29, with the opening of seven vote centers. They will be open daily from 8 a.m. to 5 p.m. until the final day of voting, Tuesday, April 8, when 13 vote centers will be open 7 a.m. to 8 p.m.\nYou can find a vote center or an official ballot drop box near you inside your voter information pamphlet, or you can look up your pamphlet online with the View Voter Information Pamphlet (Sample Ballot) tool at sdvote.com.\nLearn more about voting in the District 1 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250327.11.01.16"}