{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Adding New Warning Category to Inform Beachgoers", "description": "On July 1, 2022, the County of San Diego will begin using a new beach water-safety category and signs at local beaches in its continuing efforts to educate and protect the public’s health. The new “warning” category will join the existing advisory and closure categories.", "datePublished": "2022-06-29T09:19:56-07:00", "url": "https://www.countynewscenter.com/?p=208880", "keywords": ["health", "beach closures", "beach water quality", "beach water testing"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2022-06-29T16:14:34-07:00", "articleType": "article", "articleContent": "\nOn July 1, 2022, the County of San Diego will begin using a new beach water-safety category and signs at local beaches in its continuing efforts to educate and protect the public’s health.\nThe new “warning” category will join the existing advisory and closure categories. Warning signs will tell beachgoers that beach water may contain sewage and may cause illness if people come into contact with it. With transboundary south swell conditions expected this Fourth of July weekend, warning signs may be posted at South County beaches.\nHere are the category differences:\nAdvisory Category\nAn advisory sign is posted for awareness for beachgoers when test results exceed State health standards, but no known sewage conditions exist, and water is not moving from south to north. When an advisory is posted, it means people have a higher chance of getting sick based on testing levels of contaminated water.\nNew Warning Category\nA warning sign will be posted for beachgoers when testing exceeds State health standards AND south swell (transboundary flow) ocean conditions are pushing waters from the south to the north. A warning indicates that even though sewage impacts are not verified, sewage may be in the water due to the south swell  conditions. Warnings will help people make their own decisions about whether to enter recreational waters. Previously, test results and a south swell would have resulted in a beach closure.\nClosure Category\nBeach closures are issued if there are known sewage impacts. This means it is known for sure there is sewage in the water, and to protect the public’s health, State law requires the closure of affected beaches. Closures follow reported sewage spills, or when the Tijuana River is flowing and reaching recreational waters, or when County environmental health experts verify sewage odors or water discoloration reported by lifeguards, beach managers, and/or surfers/swimmers.\nThe new warning category will be implemented through the end of September to evaluate how well it serves the public and our communities.\nNo Signs\nNo signs posted? No need to worry, just enjoy the beach! \nCounty officials encourage residents and visitors to learn more about water quality conditions and risks by using the QR code on posted beach signs or by visiting sdbeachinfo.com for more information.\nIn May, the County became the first coastal county in the United States to start using rapid, DNA-based water quality testing technology (ddPCR) that produces faster results.  This technique came after nearly 10 years of testing, pilot programs, and working with federal, state and local agencies.\nYou can learn more about each of these beach water quality management categories on DEHQ’s popular “Check in Before You Get In” website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220629.09.19.56"}