{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "15 San Diegans Have Died from COVID-19; Cases Reach 849", "description": "A total of 15 COVID-19 deaths have now been reported in the region, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-01T16:21:56-07:00", "url": "https://www.countynewscenter.com/15-san-diegans-have-died-from-covid-19-cases-reach-849/", "keywords": ["health", "convention center", "coronavirus", "covid-19", "six covid deaths"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-02T15:46:06-07:00", "articleType": "article", "articleContent": "\nA total of 15 COVID-19 deaths have now been reported in the region, the County Health and Human Services Agency announced today.\nThe new deaths are:\n\nA woman in her late 90s\nA man in his early 80s\nA man in his mid-70s\nTwo men in their early 70s\nA probable death announced yesterday has now been confirmed to have been COVID-19\n\n“COVID-19 deaths are very unfortunate, but they are occurring. Our hearts and prayers to all of their loved ones. We are very sorry for your loss,” said Nick Yphantides, M.D., M.P.H., County chief medical officer. “We must keep our physical distance to avoid contracting the virus and passing it to those who are at higher risk of severe complications from the virus, including death.”\n\n\n\n\nWe're live at the County Operations Center with another update on the coronavirus. For updates, visit coronavirus-sd.com or text COSD COVID19 to 468-311.\nPosted by County of San Diego – Government on Wednesday, April 1, 2020\n\nCounty COVID-19 Cases Reach 849\nThrough April 1, a total of 849 COVID-19 cases have been reported in San Diego County, including 115 new cases in the last day.\nGoing forward, the County will be reporting case updates during the daily media briefing and then publishing them on the County’s COVID-19 website later in the afternoon.\nOf San Diego County’s cases, 54% (461) were men and 43% (380) were women. The gender of 1% (4) is unknown. Of the known cases, 158 (19%) have required hospitalization, 65 (8%) had to be placed in intensive care and 15 (1.8%) have died.\nThe County has issued multiple guidance to flatten the curve of the COVID-19 pandemic, while increasing the capacity of the local health care system.\nCounty officials also talked about other measures and resources to deal with COVID-19. To date:\n\nMore than 11,300 San Diegans have been tested, including 989 tests reported on March 31.\nThe County has distributed nearly 1.2 million personal protective equipment items to local health care providers, including nearly 499,000 N-95 respirators and about 550,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who are vulnerable and have no place to live.\nOf the 1,585 rooms for County Public Health Services use, 102 are occupied by 111 guests. Those rooms include three homeless individuals who have tested positive for COVID-19.\nOf the 441 rooms assigned to the Regional Task Force on the Homeless, 183 are being occupied by 306 people who are at higher risk of developing complications from COVID-19.\n\nDonations of Personal Protective Equipment\nThe County, Rady Children’s Health System and Rock Church have partnered to collect, track and distribute donated critical-need medical equipment during the coronavirus pandemic to support care providers across the region.\nPeople and companies who would like to donate unused personal protective equipment and other needed items can contact Rady Children’s Foundation via email DonateCOVID19@rchsd.org or at 1-800-258-0007. See more details about the program and types of equipment needed.\nRady Children’s Health System will collect information from the potential donor and log it into a database. Once the donation is logged, the Foundation will provide the donor with an appropriate drop-off location based on the donor’s preference or shipping information, if needed.\nRock Church has created locations have where equipment can be dropped off. The volunteers at Rock Church drop-off locations will log items received and will use their fleet of vans to transport donations to the County Medical Warehouse.\nConvention Center Becomes Emergency Shelter\nToday, the City and County of San Diego began moving people who are homeless into the Convention Center, which will now serve as an emergency shelter.\nThe goal is to slow the spread of COVID-19 among people who are homeless by placing them in a facility that allows for appropriate physical distancing between people at the shelter.\nYesterday, the County announced three unsheltered people tested positive for COVID-19. The three people are in isolation at motel rooms secured by the County.\nPeople at the Convention Center will be monitored by County public health nurses for symptoms of COVID-19. They will also receive support from County Behavioral Health Services.\nThe City’s bridge shelters will now become locations where people who are unsheltered can receive health screenings and other services.\nThe County’s COVID-19 webpage now contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200401.16.21.56"}