{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Supervisors Approve New $848 Million Mental Health Services Plan", "description": "County supervisors approved a new three-year, $848 million Mental Health Services Act plan Tuesday that will increase spending for programs to help children, youth, families, adults and older adults who suffer serious mental illness or crises.", "datePublished": "2023-06-13T13:22:48-07:00", "url": "https://www.countynewscenter.com/county-supervisors-approve-new-848-million-mental-health-services-plan/", "keywords": ["health", "behavioral health services", "crisis stabilization unit", "mental health services act", "mobile crisis response teams"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-06-13T13:22:48-07:00", "articleType": "article", "articleContent": "\nCounty supervisors approved a new three-year, $848 million Mental Health Services Act plan Tuesday that will increase spending for programs to help children, youth, families, adults and older adults who suffer serious mental illness or crises.\nSome of those existing services include help with mental health services, housing and “wraparound” care that helps children by treating them within their own homes, schools and families. It also includes mobile crisis response teams that send mental health experts rather than law enforcement when appropriate to respond to someone in crisis. And it covers walk-in crisis stabilization units that give people who are experiencing mental-health episodes a safe, calm place to get around-the-clock help rather than being taken to jails or emergency rooms.\nBoard Chairwoman Nora Vargas praised the plan and said its funding source was critical. Funding comes from California’s Mental Health Services Act, Proposition 163, the 1% tax on state incomes over $1 million that voters approved in 2004 to expand and improve behavioral health help.\n“It’s a vital funding source for Behavioral Health Services, representing its biggest funding source,” Vargas said. “And so it’s going to be critical in providing vital treatments, prevention, innovation, and innovative behavioral health services for individuals experiencing serious mental health issues.”\nThe new three-year plan will spend $274.8 million in the 2023-24 fiscal year, the County’s largest sum ever and 20% more than 2022-23. That spending would increase to $286.6 million in fiscal years 2024-25 and 2025-26.\nCounty officials said the Mental Health Services Act funding was essential to mental health treatment statewide. But they said it can be volatile and could decrease in future years during a slowing economy.\nThe County plan was created with ongoing community input from focus groups, listening sessions, interviews and community events with the help of UC San Diego Health.\nHHSA officials said most of the $275 million in the 2023-24 year would fund the agency’s existing behavioral health programs. However, they said there would be increases to boost a number of programs. Some of those included:\n\n$12 million increase for the County’s Assertive Community Treatment services that use a “whatever it takes” approach to help people with serious mental illnesses who are experiencing homelessness.\n$4.6 million to boost Mobile Crisis Response and Psychiatric Emergency Response teams and the Vista County Crisis Stabilization Unit.\n$600,000 to support the Crisis Action Community Connection program. The program helps youth who have suffered recent psychiatric episodes by offering intensive mental health support and community resources. It also provides recuperative care for transition-age youth who need connections to services and housing.\n$7.4 million to boost public awareness and public messaging about suicide prevention, including adding a component of the “It’s Up to Us” campaign to focus on young people. The campaign helps San Diegans talk openly about mental health, recognize its challenges, find local resources and seek support to inspire good health, reduce mental health stigma and prevent suicide.\n$700,000 to invest in school-based suicide prevention and early mental-health intervention.\n\nFor more information about the County’s behavioral health program go to the Health and Human Services Agency’s behavioral health web page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230613.13.22.48"}