{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Health Officials Seeking Persons Who May Have Touched Rabid Bat at Safari Park", "description": "The County of San Diego Health and Human Services Agency is looking for anybody that may have come into contact with a live bat that tested positive for rabies and was found at the San Diego Zoo Safari Park on June 25, 2021.", "datePublished": "2021-06-27T11:58:23-07:00", "url": "https://www.countynewscenter.com/health-officials-seeking-persons-who-may-have-touched-rabid-bat-at-safari-park/", "keywords": ["health", "bat", "rabies"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-06-28T11:04:21-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is looking for anybody that may have come into contact with a live bat that tested positive for rabies and was found at the San Diego Zoo Safari Park on June 25, 2021.\nThe bat was found alive on Friday in the Mombasa Island Pavilion and was collected by a trained park employee. No human contact with the bat has been reported at this time.\nIf you or someone in your family or group had contact with the bat, you are urged to contact the County of San Diego Health and Human Services Agency as soon as possible at (619) 692-8499. If you did not have direct contact with the bat, such as touching or holding the animal, you are not at risk for rabies.\nThe bat was not one of the park’s collection animals. It was delivered to the County on June 25 and testing confirmed the animal to be positive for rabies. There has been one other rabid bat found in San Diego County so far this year.\n“Human rabies is usually fatal without prompt post-exposure vaccine and treatment,” said Wilma Wooten, M.D., M.P.H., County public health officer. “There has been no reported human or animal contact with this bat, but it was found in an area where many park visitors pass by, and we want to make sure that no one had contact with it.”\nRabies transmission can occur from a bat bite or if a bat’s saliva comes in contact with a cut or abrasion, or with mucous membranes, such as the eyes, nose or mouth.\n“People should always stay away from bats and other wild animals to prevent possible exposure to rabies,” said Wooten. “If you see a bat, dead or alive, don’t touch it.”\nRabies in humans can be prevented by avoiding contact with wild, stray, and unknown domestic animals, ensuring pets are up-to-date on rabies vaccinations, and receiving prompt medical advice following animal bites and other significant exposures to potentially rabid animals. Rabies is not uncommon in wild bats in San Diego County.\nIf direct contact with a bat does occur, wash the affected area thoroughly with soap and water and get medical advice immediately.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210627.11.58.23"}