{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s Preteen Vaccine Week, Protect Your Children", "description": "Sometimes the things you can’t see pose the biggest threats to our children—serious and sometimes deadly infections like diptheria and meningococcal disease, viruses like the flu and COVID-19, and even cancers. Fortunately, there are vaccinations to help parents and protect kids from those threats!", "datePublished": "2023-02-27T10:16:08-08:00", "url": "https://www.countynewscenter.com/its-preteen-vaccine-week-protect-your-children/", "keywords": ["health", "children vaccinations", "hhsa", "live well", "preteen vaccine week", "preteens"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-02-27T10:38:43-08:00", "articleType": "article", "articleContent": "\nSometimes the things you can’t see pose the biggest threats to our children—serious and sometimes deadly infections like diptheria and meningococcal disease, viruses like the flu and COVID-19, and even cancers.\nFortunately, there are vaccinations to help parents and protect kids from those threats!\nFeb. 26 through March 4 is California’s “Preteen Vaccine Week.” And County public health officials are reminding parents that they should call their children’s healthcare providers to get Tdap, chickenpox, human papillomavirus (HPV), COVID-19 and other vaccinations that can keep their children from getting ill.\n“Keeping your children safe from unseen dangers like serious and even deadly illnesses is a lot easier with these vaccines,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H. “Preteen Vaccine Week is a good reminder for all of us to get our children up to date with these vaccines.”\nThat message is extra important this year. That’s because the COVID-19 pandemic may have prevented parents and kids over the past few years from keeping current with vaccination schedules for children aged 11 to 12.\nThere are hundreds of thousands of preteens and adolescents in San Diego County and some have not had all their recommended vaccines. Making sure students have all the required vaccines is part of the countywide Live Well San Diego vision, an effort to improve the health and well-being of residents in the region.\nThe CDC recommends adolescent children get the following vaccinations to protect them from diseases:\nHPV (human papillomavirus)\nBoys and girls can begin getting HPV vaccinations at 9-years-old to protect against cancers that can be caused by the virus. The CDC says children ages 11-12 should get two doses six to 12 months apart. Children who start the HPV series on or after 15-years-old need three doses given over six months. HPV vaccine for girls and young women prevents cervical cancer. The vaccine is also recommended for boys to prevent anal cancer and genital warts.\nQuadrivalent meningococcal conjugate vaccine (MenACWY and MenB) (Meningococcal disease)\nThe MenACWY vaccine is recommended for preteens ages 11-12 for protection against bacteria that cause meningococcal disease, a very serious illness which can lead to death in as little as 48 hours. A MenACWY booster is recommended at the age of 16. A MenB vaccine may be recommended for some teens ages 16-18. The bacteria that can cause meningococcal disease can infect the blood and inflame the tissues covering the brain and spinal cord. Of teens who become ill, 10% die and another 15% suffer long-term disability such as loss of limbs, deafness, nervous system problems or brain damage.\nTetanus, diphtheria and pertussis (grouped in one vaccine called Tdap)\nAll students entering seventh grade need proof of a Tdap booster to attend school.  Epidemics of pertussis, also known as whooping cough, occurred in California in 2010 and 2014, and San Diego County saw increased cases in 2017.\nInfluenza\nThe flu vaccine is recommended every year for everyone 6 months old and older, including preteens and the whole family. Students who haven’t been immunized in the fall, when it is most helpful, can still benefit from the flu immunization now.\nChickenpox\nChickenpox, or varicella, is a viral infection that causes an itchy rash with small, fluid-filled blisters. While chickenpox is a mild disease for most people, it can be life-threatening for some. Two doses are recommended.\nCOVID-19 \nTwo doses of the COVID-19 vaccine are recommended for everyone 6 months and older to protect against the serious illness caused by COVD-19. Kids should also get the updated (bivalent) booster dose.\nThe above vaccines are available at physician offices, community clinics, and many retail pharmacies. People without medical insurance can get vaccinated at one of the six County locations; call 2-1-1 for a location nearest you.\nFor more information on vaccines, call the HHSA Immunization Branch at (866) 358-2966 or visit www.sdiz.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230227.10.16.08"}