{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Testing Ramps Up in Region", "description": "More COVID-19 testing sites will open in San Diego County starting tomorrow to meet the needs of the community.", "datePublished": "2020-05-04T17:01:51-07:00", "url": "https://www.countynewscenter.com/covid-19-testing-ramps-up-in-region/", "keywords": ["government", "coronavirus", "covid-19", "state testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-05T18:44:01-07:00", "articleType": "article", "articleContent": "\nMore COVID-19 testing sites will open in San Diego County starting tomorrow to meet the needs of the community.\nTwo sites, managed by the state, will open in El Cajon and Chula Vista May 5. The state will also take over the testing site at the North Inland Live Well Center in Escondido so that the County can redirect its efforts to other vulnerable populations and communities.\nThe state’s three sites will offer about 800 testing appointments, Monday through Friday at the following locations:\nGrossmont College\n8800 Grossmont College Dr., El Cajon, CA 92020\nFormer Sears in Chula Vista\n565 Broadway, Chula Vista, CA 91910\nNorth Inland Live Well Center in Escondido\n649 W Mission Ave., Escondido, CA 92025\nA doctor’s referral is not required for testing at the above sites, but appointments are required. Appointments can be made online at https://lhi.care/covidtesting, which is currently compatible with desktop computers and Android devices. Compatibility with Apple devices is coming soon. If you have no Internet access, call 888-634-1123, Monday through Friday, 7 a.m. to 7 p.m.\nThe County will continue to offer appointment-only COVID-19 testing at the San Diego County Credit Union Stadium and the Live Well Center at Chula Vista.\nThe new Live Well Mobile Office, which began providing testing in Southeastern San Diego last Saturday, will continue to be deployed for testing throughout the region, as well as the County Library’s bookmobiles and other County vehicles. A doctor’s referral and an appointment through 2-1-1 are required for testing at County sites.\nThe County also plans to hire an additional 200 public health nurses to help support the area’s testing efforts.\nReopening plans\nWith more testing and tracing being done, the County is further prepared to loosen more of the local restrictions and allow businesses considered low-risk to reopen, which according to the state could occur by the end of this week.\nAt its meeting tomorrow, the County Board of Supervisors will consider a Business Safety Framework, a general outline for local businesses highlighting the things they need to prepare for and do before they could reopen. It includes steps to cover customer safety, employee safety, sanitation practices, physical distancing and general business practices.\nTracing of COVID-19\nThe County is in the process of expanding the number of local contact tracers to about 450 in the coming months. The pool of tracers will be made up of current County employees and external applicants, who will be trained to do COVID-19 investigations.\nCurrently, the County has more than 130 case and contact investigators who have conducted nearly 5,000 COVID-19 investigations since monitoring for the novel virus began in the region.\nFace Coverings Required in Public\nCounty health officials continue encourage San Diegans to wear a face covering when in public to prevent getting and spreading COVID-19.\n“When you wear a face covering, whether you have symptoms or not, you’re less likely transmit the virus to others. And others are less likely to spread it to you,” said Wilma Wooten, M.D., County public health officer. “The face coverings protect you, but especially those around you.”\nPeople are not required to wear the face covering all the time, but anytime you come within six feet of people who are not a household contact, or when entering a business. You can carry the mask with you and put it on when approaching others, Wooten added. See more details and exceptions.\nFace coverings are now required when in public.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n1,293 tests were reported to the County Sunday and 93 or 7% were positive. Lower testing totals are typically reported on Sundays.\n6.2% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n93 new cases were reported for a San Diego County total of 4,020.\n842 or 20.1% of cases have required hospitalization.\n271 or 6.7% of all cases had to be placed in intensive care.\n\nDeaths:\n\nFive more COVID-19 deaths have been reported, bringing the region’s total to 144.\nThree women and two men between the ages of 62 and 88 years died May 2 and 3. All had existing medical conditions.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n56 active outbreaks; 37 at congregate living facilities and 19 in community settings\n72 deaths and 927 cases in congregate living facilities\n5 deaths and 164 cases in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200504.17.01.51"}