{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Encouraging Residents to Weigh In On Regional Priorities On Aging", "description": "The County of San Diego is asking residents ages 55 and older to share their thoughts in a comprehensive needs assessment survey. ", "datePublished": "2023-08-23T09:35:04-07:00", "url": "https://www.countynewscenter.com/county-encouraging-residents-to-weigh-in-on-regional-priorities-on-aging/", "keywords": ["health", "aging", "aging roadmap", "ais", "elder", "needs assessment survey"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-08-24T15:14:29-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is asking residents ages 55 and older to share their thoughts in a comprehensive needs assessment survey. \nThe state survey will be used to inform future local program development or maintenance. This survey was first sent out to randomly selected residents in July and is now available to the general public. The survey will close September 4th. \nThose 55 and older can fill out the survey online. \nThe state and the County’s Aging & Independence Services (AIS) will use the information collected to better understand the challenges and unmet needs of the region’s aging community. \n“San Diego County is expected to see a rapid rise of residents over 60 years old in the next decade,” Dr. Eric McDonald, Interim Director of County of San Diego Health and Human Services Agency said. “By 2030 we expect to see the region’s older adult population surpass 900,000, compared to 500,000 in 2010.” \nRegional efforts to support the county’s aging population are ongoing, and can be reviewed at the Aging Roadmap, which launched in 2019. \nThe Aging Roadmap is San Diego County’s regional vision and framework for supporting healthy aging for people of all ages.  \n“With the Aging Roadmap we have transformed the region’s ability to ensure the needs of older adults are met, including encouraging affordable housing, bridging the digital divide, improving access to transportation, and working with clinicians to create more age-friendly health systems.,” said Kimberly Gallo, Director of County Aging & Independence Services. “We intend to leverage the information gained from this survey, and aging experts, to ensure our county is the national model for elderhood.”  \nAn example of San Diego’s focus on the elder population is its creation last year of one of the nation’s first chief geriatric officer positions.  \nPeople with questions or those who want to learn more about the programs and services available for older adults can call the AIS Call Center at 1-800-339-4661.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230823.09.35.04"}