{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Three County Parks Closed in August Due to Summer Heat", "description": "Three San Diego County parks, El Capitan Preserve near Lakeside, Hellhole Canyon Preserve in Valley Center and Mt. Gower Preserve in Ramona, will be closed for the month of August starting Sunday, a measure taken each year because of the month’s typically high temperatures.", "datePublished": "2021-07-30T15:56:01-07:00", "url": "https://www.countynewscenter.com/three-county-parks-closed-in-august-due-to-summer-heat/", "keywords": ["parks and rec", "county parks", "county parks and recreation", "county parks close"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-07-30T15:56:01-07:00", "articleType": "article", "articleContent": "\nThree San Diego County parks will be closed for the month of August starting Sunday, a measure taken each year because of the month’s typically high temperatures.\nParks officials announced that El Capitan Preserve near Lakeside, Hellhole Canyon Preserve in Valley Center and Mt. Gower Preserve in Ramona will be closed.\nThe County previously closed Agua Caliente Regional Park and Vallecito County Park in the Anza Borrego desert for the summer, to reopen Labor Day weekend.\nIn addition to protecting the public from extreme temperatures, the closures give Department of Parks and Recreation staff the opportunity to conduct maintenance such as trail restoration.\nThere are more than 100 other County parks and preserves to explore during the month of August. Take in the views from the County’s newest trail in the South Bay, stay the night in one of the new cabins at Dos Picos County Park in Ramona, visit a butterfly garden at Lindo Lake County Park in Lakeside, or enjoy a free Summer Movies in the Park screening at dusk after it cools off. If it is really hot, plan your next hike by take one of these virtual tours of a County park.\nParks staff urged people to always take precautions when they’re outside in high temperatures.\nIf you do go out for a hike, be smart. Below are some safety tips hikers should consider before hitting the trails:\n\nLet someone know where you will be and when you plan to return.\nHike with others, never alone.\nLeave your dog at home for difficult hikes. Even “easy” hikes may be too much for your dog when the air or ground are too hot.\nTake plenty of water to stay hydrated. Rangers recommends one liter (about a quart) for every 2 to 3 miles.\nWear sunscreen, a hat and sunglasses.\nTake breaks in shade, if possible.\nTake a fully charged mobile phone, map and/or GPS.\nWear lightweight, light-colored, ventilated clothing.\nBring along a warm jacket if you plan to stay out after dusk.\nWear sturdy shoes with traction for slippery rocks.\nFollow all posted safety rules.\nBring ample food, sunscreen to reapply, a flashlight, first aid kit, multi-purpose tool and a whistle.\nKnow your limitations; choose trails that match your level of physical fitness and areas where you are not going to get lost.\n\nFor additional information on visiting County Parks, visit sdparks.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210730.15.56.01"}