{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Declares Citrus Quarantine in Rancho Bernardo", "description": "The California Department of Food and Agriculture has declared a new citrus quarantine in a 95 square-mile area of Rancho Bernardo after detecting a potentially threatening citrus tree disease during routine inspections.", "datePublished": "2023-02-07T16:00:26-08:00", "url": "https://www.countynewscenter.com/state-declares-citrus-quarantine-in-rancho-bernardo/", "keywords": ["agriculture", "citrus", "citrus psyllids", "hlb", "huanglongbing"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2023-02-07T16:00:26-08:00", "articleType": "article", "articleContent": "\nThe California Department of Food and Agriculture has declared a new citrus quarantine in a 95 square-mile area of Rancho Bernardo after detecting a potentially threatening citrus tree disease during routine inspections.\nThe bacterial disease, known as Huanglongbing (HLB), is a major threat to San Diego’s $115 million annual citrus crop. Trees infected with HLB can produce mishappen, bitter fruit and the disease can eventually kill the tree.\nThis new quarantine comes after HLB was found in a residential lime tree in the area and is in addition to the existing HLB quarantine in the city of Oceanside. It covers the area bordered on the north by the intersection of I-15 and Auto Park Way; to the south by Poway Road; to the west by Via De Las Flores; and to the east by Lake Ramona.  The maps for this HLB quarantine are available here.\nThe intent of the quarantine is to protect the region’s food supply and support the agricultural economy and environmental sustainability by restricting people and businesses from moving citrus nursery stock, plant parts and fruit outside the quarantine boundaries and off their properties.  The only exception is for agricultural businesses that must adhere to specific requirements for treatment, cleaning, and packing commercial fruit prior to movement.\nHLB is not harmful to people or animals but could be devastating to the county’s citrus industry. The disease is spread by the Asian citrus psyllids, tiny insects that can carry the bacterium when they feed on citrus trees.\n“Unfortunately, Huanglongbing is fatal to citrus,” said San Diego Agricultural Commissioner Ha Dang. “Our goal is to prevent this disease from spreading any further. By working together, we can all protect our food supply, local agriculture, and environment from this devasting disease.”\nThe County Department of Agriculture, Weights and Measures is partnering with state and federal regulators to limit the impact on the public and help prevent the spread of the disease. County and state officials will work with residents in the affected area to arrange for treatment of citrus trees as a protective measure against the disease.\nCounty officials are also proactively notifying local citrus growers, plant nurseries and other related businesses.\nSamples from trees on the affected property and the surrounding area are undergoing tests for HLB. If HLB is detected in additional citrus trees in the quarantine area, state agricultural officials will follow up with treatment and removal of the infected trees.\nResidents in the quarantine area are urged to take the following steps:\n\nDo not move citrus plants, leaves or foliage into or out of the quarantine area.\nCooperate with agricultural officials who are inspecting trees, taking samples and treating for the pest.\nConsider removing your citrus tree if you no longer need it.\nBuy citrus trees only from reputable local nurseries.\nReport citrus trees that seem to be sick or dying by contacting the San Diego Department of Agriculture, Weights and Measures at (760) 752-4700 or visit sdcawm.org.\nResidents can also call CDFA’s toll free Pest Hotline at (800) 491-1899 or visit cdfa.ca.gov/plant/acp.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230207.16.00.26"}