{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Approves Plan to Request Accelerated Reopening", "description": "The County Board of Supervisors today approved two measures intended to allow the region to accelerate the reopening of the local economy.", "datePublished": "2020-05-19T17:53:09-07:00", "url": "https://www.countynewscenter.com/county-approves-plan-to-request-accelerated-reopening/", "keywords": ["health", "coronavirus", "covid-19", "reopening plan"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-20T08:39:37-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today approved two measures intended to allow the region to accelerate the reopening of the local economy. Under the first, the County will submit a plan to the governor’s office that, if approved, would move San Diego further into Stage 2 of the California Resiliency Roadmap in the coming days.\nUnder the proposal, in-person dining at restaurants and retail shopping would be allowed, as long as businesses enact social distancing measures and follow various restrictions to prevent the spread of the novel coronavirus.\n“Based on the current readiness criteria, San Diego County is ready to move to the Accelerated Stage 2 of the state’s plan,” said Wilma J. Wooten, M.D., M.P.H, County public health officer. “The County has made great progress in the fight against COVID-19 and it is now safe for certain businesses to resume operations if they can implement safety measures outlined by the County and State.”\nStage 3 Pilot Proposal\nThe board also approved proposing a pilot program that would allow a select number of businesses from Stage 3 to gradually reopen ahead of the schedule outlined by the state.\nThe pilot program includes outdoor religious services, research labs, hair and nail salons, fitness facilities, youth sports and clubs and pools at apartment complexes. The pilot program would also allow therapeutic and peer support groups to offer sessions, but with group size limited to 12 people or fewer.\nThe California Department of Public Health and the Governor’s Office also will have to approve the County’s pilot program proposals before businesses from these sectors can begin to reopen.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n2,609 tests were reported to the County May 18 and 80, or 3%, were positive.\n3.9% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n80 new cases were reported for a San Diego County total of 6,026.\n1,136 or 18.9% of the total cases have required hospitalization.\n346 or 5.7% of all cases had to be placed in intensive care.\n\nDeaths:\n\nEleven additional COVID-19 deaths were reported today, bringing the region’s total to 222.\nTen had underlying medical conditions and there is no data about underlying medical conditions for the eleventh person.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n72 active outbreaks, 49 at congregate living facilities and 23 in community settings.\n1,327 cases, including 108 deaths in congregate living facilities.\n310 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200519.17.53.09"}