{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "140,000 San Diegans Past Due for Second COVID-19 Shot", "description": "More than 140,000 San Diegans who have received their first dose of the Pfizer or Moderna COVID-19 vaccine are overdue for their second dose, the County Health and Human Services Agency reports.", "datePublished": "2021-07-08T09:00:03-07:00", "url": "https://www.countynewscenter.com/140000-san-diegans-past-due-for-second-covid-19-shot/", "keywords": ["health", "coronavirus", "covid-19", "second dose"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-07-08T09:00:03-07:00", "articleType": "article", "articleContent": "\nMore than 140,000 San Diegans who have received their first dose of the Pfizer or Moderna COVID-19 vaccine are overdue for their second dose, the County Health and Human Services Agency reports. The recommended spacing of doses is three weeks for the Pfizer vaccine and four weeks for the Moderna vaccine.\nA single dose of either vaccine is significantly less effective at protecting people from getting sick, especially against the new variants of the virus, and County health officials encourage those overdue to get vaccinated as soon as possible. Completing the full two-dose series of the vaccine is recommended, regardless of how long ago a person received their first shot.\n“A single dose of those vaccines is only 33 percent effective against the more contagious delta variant of COVID-19, which has become the most prevalent strain of the virus in the United States and is likely to become more prevalent locally,” said Denise Foster, R.N., the County’s Chief Nursing Officer and COVID-19 Clinical Director. “San Diegans who are overdue for their second shot should take action as soon as possible to lower their risk of getting or spreading the virus.”\nEveryone 12 years and older is eligible to get a COVID-19 vaccine at no cost. Visit coronavirus-SD.com/vaccine for a full list of hours and locations of vaccine sites in the County.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210708.09.00.03"}