{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Improved Fire and Medical Services Delivered to Borrego Springs", "description": "One year out, San Diego County Fire Protection District is making good on its promise to deliver fire protection, emergency medical services, and ambulance transportation in Borrego Springs and major improvements are underway.", "datePublished": "2024-07-11T15:58:36-07:00", "url": "https://www.countynewscenter.com/improved-fire-and-medical-services-delivered-to-borrego-springs/", "keywords": ["government", "andrew strong", "borrego springs", "cal fire", "cal fire chief tony mecham", "cert", "community emergency response team", "county fire", "public safety interim deputy chief administrative officer", "san diego county fire protection district"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-07-11T16:02:29-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesOne year out, San Diego County Fire Protection District is making good on its promise to deliver fire protection, emergency medical services, and ambulance transportation in Borrego Springs and major improvements are underway.\nSupport for Borrego Springs joining the San Diego County Fire Protection District was initiated by a community-led effort to make the vision a reality. The transition, which took place July 1, 2023, began with a promise to improve service levels for the desert community’s 4,000 residents. It also included welcoming 14 Borrego Springs firefighters to the CAL FIRE/San Diego Fire team. San Diego County Fire appointed a Desert Battalion Chief to lead the Borrego Fire station and added a new fire engine, paramedic ambulance and a third firefighter on the engine to ensure equitable daily staffing. Additionally, the team has begun renovating both the fire station and an aging department administration building while considering options for   the timing and location of a new fire station to better serve community needs.\n“Ensuring that Borrego Springs has the best possible fire and medical services is crucial for the safety and well-being of our residents,” said Supervisor Jim Desmond. “This transition has significantly enhanced our community’s emergency response capabilities, and I’m proud of the progress we’ve made.”\nIn efforts to engage and empower the community, County Fire conducted training sessions for local residents. These sessions covered essential skills such as Cardiopulmonary Resuscitation (CPR), automated external defibrillator (AED) usage, home fire preparedness, earthquake response tactics, overdose intervention, and wildfire readiness.\n“This is a great example of two groups coming together to better serve our community,” said Andrew Strong, Public Safety Interim Deputy Chief Administrative Officer. “Borrego Springs gains more firefighters, more paramedics and updated equipment to promote safety and well-being for our residents.”\n“County Fire and CAL FIRE remain committed to serving and safeguarding the people of Borrego Springs and protecting the property and resources across San Diego County and the State,” County Fire/CAL FIRE San Diego Chief Tony Mecham said. “Our ongoing efforts include plans to replace the fire station, ensuring continued long-term improvements in the community.”\nBorrego Springs resident Gloria Hoff said she and her husband appreciate everything that CAL FIRE/San Diego County Fire have done, especially the informative LISTOS/Community Emergency Response Team (CERT) trainings that hone in on the importance of preparedness, use of equipment and resources.\n“These offerings are critical in our small rural isolated community with limited resources.  We are very grateful for these classes and look forward to the next class covering Fentanyl and Narcan.  Yet another critical subject for all of us here and elsewhere,” said Hoff.\nCounty Fire works to provide comprehensive fire protection and emergency medical services effectively and efficiently across more than 1.5 million acres of unincorporated San Diego County.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240711.15.58.36"}