{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reserves COVID-19 Vaccine Appointments for Project SAVE", "description": "The County is reserving a portion of available COVID-19 vaccination appointments each day for a pilot project that aims to equitably distribute the novel coronavirus vaccine.", "datePublished": "2021-02-17T17:17:17-08:00", "url": "https://www.countynewscenter.com/county-reserves-covid-19-vaccine-appointments-for-project-save/", "keywords": ["health", "coronavirus", "covid-19", "project save", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-17T17:17:17-08:00", "articleType": "article", "articleContent": "\nThe County is reserving a portion of available COVID-19 vaccination appointments each day for a pilot project that aims to equitably distribute the novel coronavirus vaccine.\nProject SAVE (Scheduling Assistance for Vaccine Equity) sets aside appointments for people who are in the currently eligible groups and at high risk for complications from COVID-19.\n“We need to make sure that communities that have been disproportionately impacted by COVID-19 have easier access to the vaccine,” said Wilma Wooten, M.D., M.P.H., County public health officer. “This project is making it easier for people who qualify to make appointments and get vaccinated.”\nThe pilot program is now operating in the southern region of the county and is managed by nine community groups who have access to reserve appointments at four vaccination sites. The sites are:\n\nSouth Region Live Well Center – Chula Vista\nMartin Luther King Community Center – National City\nMar Vista High School – Imperial Beach\nSouthwestern College – San Ysidro\n\nThe reserved appointments will be filled through outreach by community health workers or promotoras who are contacting people 65 and older at locations that include grocery stores, faith centers, food distribution sites and housing complexes in the South Bay.\nRescheduled Appointments\nDue to delays in vaccine shipments to San Diego, the County is rescheduling approximately 1,000 first-dose appointments at its sites on Thursday and Friday. Those affected are being notified they will be rescheduled for next week.\nAdditional Vaccine Information\nThe Metropolitan Transit System is offering free rides to people with proof of a vaccination appointment and 2-1-1 San Diego and promotoras also have the capacity to arrange for transportation.\nCurrently, all County vaccination super stations and points of dispensing, or PODs, are vaccinating people in Phase 1A and people 65 years and older in Phase 1B. All require appointments which can be made at vaccinationsuperstationsd.com.\nCounty clinics are only vaccinating people in Phase 1A and those 65 and older in Phase 1B.\nTo date, more than 765,000 COVID-19 doses have been delivered to the region. Of those, over 663,000 have been administered, including more than 135,000 San Diegans who have received two doses and are fully vaccinated. So far, 17.6% of the population over age 16 has received at least one dose. More information about vaccine distribution can be found on the County’s vaccination dashboard.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 22.2 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 6.4%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 9.7% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 23.\n\nCommunity Setting Outbreaks:\n\nFour new community outbreaks were confirmed Feb. 16: three in business settings and one in a grocery setting.\nIn the past seven days (Feb. 10 through Feb 16), 44 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n13,771 tests were reported to the County on Feb. 16, and the percentage of new positive cases was 4%.\nThe 14-day rolling average percentage of positive cases is 5.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 15,259.\n\nCases, Hospitalizations and ICU Admissions:\n\n539 cases were reported to the County on Feb. 16. The region’s total is now 254,180.\n12,286 or 4.8% of all cases have required hospitalization.\n1,556 or 0.6% of all cases and 12.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n57 new COVID-19 deaths were reported on Feb. 16. The region’s total is now 3,099.\n40 men and 17 women died between Jan. 11. and Feb. 15.\nOf the 57 deaths reported today, 19 people who passed away were 80 years or older, 11 people were in their 70s, 15 were in their 60s, eight were in their 50s and four were in their 40s.\n52 had underlying medical conditions and five had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210217.17.17.17"}