{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Edgemoor Named One of America’s Best Nursing Homes", "description": "Once again, the County Health and Human Services Agency’s Edgemoor Skilled Nursing Facility has been named  one of the best facilities of its kind in the state and the nation by Newsweek magazine.", "datePublished": "2021-10-12T10:02:51-07:00", "url": "https://www.countynewscenter.com/countys-edgemoor-named-one-of-americas-best-nursing-homes/", "keywords": ["health", "edgemoor", "edgemoor honored", "edgemoor skilled nursing facility", "newsweek ranking", "top honor"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-12T10:09:39-07:00", "articleType": "article", "articleContent": "\nOnce again, the County Health and Human Services Agency’s Edgemoor Skilled Nursing Facility has been named one of the best facilities of its kind in the state and the nation by Newsweek magazine.\nThis is the third time Newsweek has ranked Edgemoor as one of the top places in California and the United States. The magazine gave the facility the top ranking in the state in 2019 and 2020.\nThis year, the magazine analyzed nursing homes in 25 states with the highest population size and chose 450 winners.\nFor its list of America’s Best Nursing Homes 2022, the magazine looked at three critical criteria in creating its ranking: overall performance data, peer recommendations and each facility’s handling of COVID-19.\n“It’s no surprise. At Edgemoor, we provide the highest level of care to seriously ill and injured adult patients who require long-term care, and it has not gone unnoticed,” said Nick Macchione, director of the County Health and Human Services Agency.\n\nUnder the umbrella of County Behavioral Health Services, Edgemoor patients receive 24-hour skilled nursing care, physical rehabilitation, as well as recreational, occupational and speech therapy. Patients at the 192-bed facility require specialized interventions from highly trained staff.\n“Throughout the COVID-19 pandemic, we’ve taken every precaution to make our residents stay safe and healthy,” said Dr. Luke Bergmann, director of Behavioral Health Services. “Nursing home residents are particularly vulnerable to this virus, and I’m extremely proud of the work and commitment of both the Edgemoor staff and our guests to everyone’s safety in these challenging times.”\nThe commitment of the staff at Edgemoor embodies the County’s approach to service and exemplifies the Live Well San Diego vision of healthy, safe and thriving residents and communities.\n“The doctors, nurses and everyone else working at Edgemoor make every effort to provide exceptional care for our patients,” said Erin Chancler, Edgemoor’s administrator. “It’s a well-deserved recognition given everyone’s commitment and dedication.”\nThe latest Newsweek ranking adds to the national recognition Edgemoor has received for providing top-quality treatment and services. Edgemoor is a five-star facility, having received this highest rating from the Centers for Medicare and Medicaid Services for quality services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211012.10.02.51"}