{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Offices Will Close for Christmas Day Holiday", "description": "County offices, including family resource centers, library branches and animal shelters will be closed on Sunday, Dec. 25, and Monday, Dec. 26 in observance of the Christmas holiday.", "datePublished": "2022-12-20T16:48:45-08:00", "url": "https://www.countynewscenter.com/county-offices-will-close-for-christmas-day-holiday/", "keywords": ["government", "christmas", "county closure"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-12-21T16:24:17-08:00", "articleType": "article", "articleContent": "\nCounty offices, including family resource centers, library branches and animal shelters will be closed on Sunday, Dec. 25, and Monday, Dec. 26 in observance of the Christmas holiday.\nLibrary branches will be closing at 2 p.m. on Saturday, Dec. 24.\nCounty-operated COVID-19 vaccination and testing sites will be closed Dec. 24-26 and will resume normal hours Tuesday, Dec. 27.\nPartner test sites will be affected as follows:\n\nDec. 23: The Border View YMCA will be closed. Chula Vista City Hall will be open from 8:30 a.m. to 3 p.m.\nDec. 24: Cal State San Marcos and the Lemon Grove Senior Center will be open from 9:30 a.m. to 12:30 p.m. The former Boys and Girls Club in Chula Vista, Heart Revolution Church in National City, the Assessors Recorder County Clerk building in El Cajon and the North Inland Live Well Center in Escondido will be open from 7 a.m. to 11 a.m. only.\nDec. 25: Cal State San Marcos, Lemon Grove Senior Center and the Border View YMCA will be closed.\nDec. 26: Chula Vista City Hall will be closed. The Imperial Beach Sports Park, North Coastal Live Well Center in Oceanside and the former USD Recycling Center sites in San Diego will be closed.\n\nSheriff’s Department patrols and animal control emergency response, and other essential services will continue during the holiday.\nCounty parks, preserves and campgrounds will be open during normal business hours on Dec. 25. Restrooms and parking lots will be open at regional parks. All parks will remain open to walk-ins.\nFacilities at several County Parks will be closed on the dates below.\n\nThe Santa Ysabel Nature Center will be closed Dec. 25.\nThe Valley Center Community Hall will be closed Dec. 26.\nThe Fallbrook Community Center will be closed on Dec. 26.\nThe Lakeside Community Center will be closed Dec. 26 through Jan. 2.\nThe Lakeside Teen Center/REC Club will be closed Dec. 23 through Jan. 6.\nThe San Elijo Lagoon Nature Center will be closed on Dec. 25 but the parking lot and outside restrooms will be open.\nThe Spring Valley Community Center will be closed Dec. 26.\nThe Spring Valley Teen Center will be closed Dec. 22 through Jan. 6.\nThe Spring Valley Gym will be closed Dec. 31 through Jan. 6.\nThe 4S Ranch Sports Park recreation offices will be closed on Dec. 25-26, but the park offices and the park itself will be open.\n\nIf the Parks’ reservation phone line is not be available, you can make reservations online at sdparks.org.\nCounty offices will reopen for regular business hours on Tuesday, Dec. 27.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221220.16.48.45"}