{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves State Funding to Improve the Health of African-American Babies", "description": "The Board of Supervisors today approved $484,310 from the State to improve health outcomes for African-American babies.  ", "datePublished": "2024-09-24T17:48:34-07:00", "url": "https://www.countynewscenter.com/board-approves-state-funding-to-improve-the-health-of-african-american-babies/", "keywords": ["health", "black babies", "black infant health", "perinatal equity initiative"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-09-24T17:48:34-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe Board of Supervisors today approved $484,310 from the State to improve health outcomes for African-American babies.  \nThe funding comes from the California Perinatal Equity Initiative to address poor health outcomes like low birth weight, babies being born too early and even infant and maternal death among Black mothers and babies due to bias and racism particularly in health care settings.  \nIn San Diego County, deaths of Black babies before they reach one year of age are five times greater than White infants. Black infants are also 50 percent more likely to be born premature. \nIn California, Black women are more than three times more likely to die from pregnancy-related causes due to bias and racism than White women. \nThe County’s Perinatal Equity Initiative which started in 2018 is an expansion of its Black Infant Health program which works to provide culturally appropriate support services and resources to African-American families. \nFunding from the Perinatal Equity Initiative has been used for a fatherhood program for new and expectant dads to support their partners, to provide implicit bias training for hundreds of health care professionals and for the Black Legacy Now public awareness campaign.   \nA community advisory board is also active and includes 200 community members who give feedback and direction on program activities.  \nVisit www.blacklegacynowsd.com to find resources for current and future parents, get the facts, know your rights and commit to action by advocating for Black women, babies and families in San Diego. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240924.17.48.34"}