{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Probation Department Empowers Student to Pursue Musical Dreams at Prestigious School", "description": "A young student at the Probation Department’s Youth Development Academy is getting a unique opportunity to follow his academic and musical pursuits at a prestigious music college during his journey to restore his life. It’s a joint effort between the County Probation Department and the Berklee College of Music.", "datePublished": "2023-12-06T14:43:36-08:00", "url": "https://www.countynewscenter.com/probation-department-empowers-student-to-pursue-musical-dreams-at-prestigious-school/", "keywords": ["public safety", "berklee college of music", "county probation", "youth development academy"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-12-07T14:26:47-08:00", "articleType": "article", "articleContent": "\nA young student at the Probation Department’s Youth Development Academy is getting a unique opportunity to follow his academic and musical pursuits at a prestigious music college during his journey to restore his life. It’s a joint effort between the County Probation Department and the Berklee College of Music. Kenny, a determined individual with aspirations in music, is now attending virtual classes on a scholarship, highlighting Probation’s efforts to identify innovative solutions for supporting young people in their care.\nThis collaboration showcases the efforts of Probation and Information Technology professionals, who have set up specialized computer systems and instruments to provide Kenny with the tools he needs to excel in his academic and musical pursuits.\nThe dedicated efforts of officers and staff at Probation’s Youth Development Academy extend beyond ensuring accountability to actively nurturing the aspirations of individuals like Kenny. The department is committed to protecting public safety by coaching youth and clients to restore their lives, families, and the communities they live in, while balancing support and accountability.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231206.14.43.36"}