{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Suicides Dropped in San Diego County Last Year", "description": "The number of people who died from suicide in the region dropped last year, according to the San Diego County Suicide Prevention Council’s 2020 Report to the Community released Thursday.", "datePublished": "2020-09-10T13:15:54-07:00", "url": "https://www.countynewscenter.com/suicides-dropped-in-san-diego-county-last-year/", "keywords": ["health", "suicide", "suicide prevention", "suicide report"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-09-10T14:09:23-07:00", "articleType": "article", "articleContent": "\nThe number of people who died from suicide in the region dropped last year, according to the San Diego County Suicide Prevention Council’s 2020 Report to the Community released Thursday.\nIn 2019, there were 429 deaths by suicide, 36 fewer than the 465 reported in 2018.\nThe annual report provides a comprehensive look at suicide in the region and brings together data from multiple sources for the years 2015 through 2019.\nOther findings in the report include:\n\nSuicide rate per 100,000 population: 12.8 in 2019 compared to 13.9 in 2018. The 2019 suicide rate for the state was 11.0 and 14.5 for the nation.\nEmergency department discharges due to self-inflicted injury increased slightly to 3,163 in 2018, the most recent year available, compared to 3,091 in 2017.\nThe percentage of suicide crisis calls, as opposed to calls about other mental health issues, to the County’s Access and Crisis Line saw an increase from 47.6% in 2018 to 55.05% in 2019.\n\nThe great majority of people who die by suicide show warning signs. Knowing how to spot them and what you can do may help save a life.\nTo help curb suicide in San Diego, the County has several ongoing prevention efforts, including the It’s Up to Us campaign; the annual Check Your Mood Day; Question, Persuade and Refer trainings; and the Access and Crisis Line, a confidential counseling and referral hotline for people who feel overwhelmed or are experiencing a mental health crisis.\nIf you or someone you know needs help, call the Access & Crisis Line at 888-724-7240, seven days a week/24 hrs. a day and multiple languages available.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200910.13.15.54"}