{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Make Sure Children Are Caught Up on Vaccines", "description": "March 1-6, 2021 is Preteen Vaccine Week and County health officials say this is the ideal time for parents to catch up and make sure their children get all the recommended vaccines they may have missed.", "datePublished": "2021-02-26T09:34:53-08:00", "url": "https://www.countynewscenter.com/make-sure-children-are-caught-up-on-vaccines/", "keywords": ["health", "preteen vaccine week", "vaccinations", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-26T09:37:49-08:00", "articleType": "article", "articleContent": "\nMany childhood vaccines were missed last year because of concerns about COVID-19.\nMarch 1-6, 2021 is Preteen Vaccine Week and County health officials say this is the ideal time for parents to catch up and make sure their children get all the recommended vaccines they may have missed.\n“Vaccines help children to stay healthy and to protect themselves and others from contagious diseases, especially if they are doing in-person learning,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Parents should make sure their children have gotten all the recommended vaccines.”\nMaking sure students have all the required vaccines is part of the countywide Live Well San Diego vision, an effort to improve the health and well-being of residents in the region.  Staying up to date on vaccinations is also key to prevent you from getting diseases which, should you get infected with COVID-19, could result in worse outcomes.\nThe Centers for Disease Control and Prevention recommends adolescent children get immunized against the following diseases:\n\nHPV\nBoys and girls need all shots in the series for full protection. HPV vaccine for girls and young women prevents cervical cancer. The vaccine is also recommended for boys to prevent anal cancer and genital warts.\nMeningococcal disease\nMeningococcal bacteria are known to cause serious illnesses in children and adolescents. The bacteria can infect the blood and cause inflammation of the tissues covering the brain and the spinal cord. Ten percent of teens who become ill die, and another 15 percent suffer long-term disability such as loss of limbs, deafness, nervous system problems or brain damage.\nTetanus, diphtheria and pertussis (grouped in one vaccine called Tdap)\nAll students entering 7thgrade need proof of a Tdap booster in order to attend school.\nInfluenza\nThe flu vaccine is recommended every year for everyone 6 months and older. Even though influenza activity has been very mild this season, everyone 6 months and older should get a flu shot.\nChickenpox\nChickenpox, or varicella, is a viral infection that causes an itchy rash with small, fluid-filled blisters. While chickenpox is a mild disease for most people, it can be life-threatening for some. Two doses are recommended.\n\nThe above vaccines are available at physician offices, community clinics, and many retail pharmacies. People without medical insurance can get vaccinated at one of the seven County locations; call 2-1-1 for a location nearest you.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210226.09.34.53"}