{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mosquitoes test Positive for West Nile Virus at Los Peñasquitos Lagoon", "description": "A batch of mosquitoes collected from the north end of Los Peñasquitos Lagoon adjacent to Del Mar and parts of San Diego recently tested positive for West Nile virus, prompting County environmental health officials to remind people to protect themselves from mosquitoes that can transmit the virus to people. ", "datePublished": "2023-09-20T16:17:19-07:00", "url": "https://www.countynewscenter.com/mosquitoes-test-positive-for-west-nile-virus-at-los-penasquitos-lagoon/", "keywords": ["health", "health", "mosquito prevention", "mosquitoes", "west nile virus"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-09-20T16:17:19-07:00", "articleType": "article", "articleContent": "\nA batch of mosquitoes collected from the north end of Los Peñasquitos Lagoon adjacent to Del Mar and parts of San Diego recently tested positive for West Nile virus, prompting County environmental health officials to remind people to protect themselves from mosquitoes that can transmit the virus to people. \n \nCounty officials said people should continue to follow the County’s “Prevent, Protect, Report” guidelines, including finding and dumping out standing water around homes to keep mosquitoes from breeding. \n \nThis marks the first sign of the disease in mosquitoes this year. However, there have been no locally contracted human West Nile virus cases reported. \n \nIf people who become infected suffer symptoms, they are typically mild, including headache, fever, nausea, fatigue, skin rash or swollen glands. But in rare cases, West Nile virus can make people extremely ill and even kill them. In 2015, 44 San Diego County residents tested positive for West Nile virus and six county residents died. \n \nWest Nile virus is mainly a bird disease, but it can be transmitted to humans by local mosquitoes if they feed off an infected animal, mainly birds, and then bite people. \n \nProtecting against mosquitoes is always important in San Diego County. Mosquitoes like to live and breed near people, in yards and even inside homes. Some invasive types can potentially transmit diseases not naturally found here including chikungunya, dengue and Zika — but only if they first bite an infected person. \n \nCounty officials reiterated that people should help protect themselves from mosquitoes and potential illnesses by following the County’s “Prevent, Protect, Report” guidelines.\n \nPrevent mosquito breeding \nDump out or remove any item inside or outside of homes that can hold water, such as plant saucers, rain gutters, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquito fish, available for free by contacting the Vector Control Program, may be used to control mosquito breeding in backyard water sources such as stagnant swimming pools, ponds, fountains and horse troughs. \n \nProtect yourself from mosquito bites \nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out. \n \nReport possible mosquito activity and dead birds \nReport increased mosquito activity, or stagnant, green swimming pools and other mosquito-breeding sources, as well as dead birds — dead crows, ravens, jays, hawks and owls — to environmental health’s Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov. \n \nGo to San Diego County’s “Fight the Bite” website SDFightTheBite.com to learn how to prevent and protect from these mosquitoes. \n \nHere are some tips to help keep your yard from becoming a mosquito breeding ground. \n \n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230920.16.17.19"}