{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Determines Shigella Outbreak Over", "description": "With no new cases in more than a month, the shigella outbreak declared in October 2021 among people experiencing homelessness is over, the County Health and Human Services Agency announced today.   ", "datePublished": "2022-01-14T19:12:40-08:00", "url": "https://www.countynewscenter.com/county-determines-shigella-outbreak-over/", "keywords": ["health", "outbreak", "outbreak over", "shegellosis", "shigella"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-01-14T19:12:40-08:00", "articleType": "article", "articleContent": "\nWith no new cases in more than a month, the shigella outbreak declared in October 2021 among people experiencing homelessness is over, the County Health and Human Services Agency announced today.\nThe last shigella case connected to the outbreak was identified Dec. 11, 2021, and for over a month, cases have remained at the historical  baseline, which is no more than one case per week in people experiencing homelessness.\nOn Jan. 14, the County sent a letter to City of San Diego officials informing them that the current outbreak of shigellosis no longer exists. The California Department of Public Health has also deemed this outbreak to be over. The County will continue to closely monitor case counts.\n“I want to sincerely thank the City of San Diego for your continued commitment to the promotion of appropriate and proactive hygienic interventions in your jurisdiction,” Wilma J. Wooten, M.D., M.P.H., County public health officer, said in the missive. “The City’s quick response, as well as the continued communication, coordination, and collaboration with the County, have allowed us to successfully eliminate this outbreak.”\nThe shigella outbreak was first identified in early October when six people experiencing homelessness were hospitalized due to shigellosis.\nOn Oct. 11, 2021, the County issued a health advisory to the local medical community to be on the lookout for potential shigella cases.\nAt the same time, the County began working with the City of San Diego, potential exposure sites, and homeless service providers to mitigate the spread of shigellosis by ensuring good sanitation precautions, expanding public restroom availability, distributing personal hygiene kits, working with food service providers, identifying additional cases, and connecting ill people to treatment and housing.\nFor three months, the County held regular meetings with the City and other stakeholders to control the shigellosis outbreak, maintained a website to report cases, and issued news updates informing the public about new cases and containment measures being implemented.\nIn total, 53 shigella cases were connected to the outbreak — 47 confirmed and six probable infections. All cases were identified in people experiencing homelessness. There were no deaths.\nThe County’s ongoing disease investigation efforts will continue to monitor shigellosis cases and potential outbreaks in the region, providing early intervention as needed. Archived details on this now-closed shigella outbreak can be found here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220114.19.12.40"}