{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Earth Day Event at County Operations Center", "description": "The County will put on an Earth Day celebration from 11 a.m. to 1 p.m. Friday at the County Operations Center at 5520 Overland Ave. featuring planting activities at the County’s Demonstration Garden, electric fleet vehicles on display and information about numerous Earth-saving topics.", "datePublished": "2022-04-20T08:49:01-07:00", "url": "https://www.countynewscenter.com/?p=208216", "keywords": ["environment"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-04-21T08:36:17-07:00", "articleType": "article", "articleContent": "\nThe County will put on an Earth Day celebration from 11 a.m. to 1 p.m. Friday at the County Operations Center at 5520 Overland Ave. featuring planting activities at the County’s Demonstration Garden, electric fleet vehicles on display and information about numerous Earth-saving topics.\nIn addition to getting the opportunity to talk with the master gardeners and plant in the garden, the public can learn about recycling, water quality, stormwater protection, rain barrels, farmers markets and organics.\nCounty parks officials will also be there to talk about the tree plantings, recycling and composting being done in County parks. Agriculture, Weights and Measures officials will have tables with information about invasive pests, farmers markets and organic food. Environmental health officials will be on hand to talk about household hazardous waste and vectors — pests like rats and mosquitoes that can transmit disease.\nAttendees can also hear updates about the County’s Climate Action Plan and regional decarbonization efforts.\nIn addition to Friday’s event at the County Operations Center, other County Earth Day events are also scheduled to take place Friday and through the weekend. Those include:\nArbor Day Tree Planting at Flinn Springs County Park\n5:30 p.m. to 7:15 p.m. Friday, April 22 and 10 a.m. to 12:30 p.m. Saturday, April 23; 14787 Olde Hwy. 80, El Cajon; (619) 561-0180\nJoin Flinn Springs park staff for two days of planting native oaks and woody shrubs. Learn about the importance of conservation and preserving native oak populations while planting your own tree ― one you can visit for years to come. This physical activity centers on sustainability and is a great way to pay tribute to your parkland. Parking is $3.\nRanger-led Interpretive Hike at Sycamore Canyon/Goodan Ranch County Preserve in Poway\n9 a.m. to noon, Saturday, April 23; Goodan Ranch Staging Area\n16281 Sycamore Canyon Road, Poway\nJoin Ranger Patrick on a moderate 3.5-mile loop hike on Martha’s Grove Trail at Sycamore Canyon/Goodan Ranch County Preserve. Learn about the native plants and wildlife of this 2,272-acre preserve while walking through a variety of habitats, historic oak groves and the remnants of an old ranch. Meet at the Goodan Ranch Staging Area at 16281 Sycamore Canyon Road in Poway.\nNature Discovery Tables at Sycamore Canyon/Goodan Ranch County Preserve in Poway\n9 a.m. to noon, Saturday, April 23; Goodan Ranch Staging Area\n16281 Sycamore Canyon Road, Poway\nPlant a Tree with Women in the Wild at Barnett Ranch County Preserve\n10 a.m. to noon Saturday, April 23; 1500 Deviney Lane/San Vicente Road, Ramona; (760) 788-3326\nEveryone is welcome to a tree-planting workshop and hands-on tree-planting experience in this female planned and led park activity. Equipment and trees will be provided. Guests should plan to wear something they don’t mind getting a little dirty. Once saplings are in the ground, the group will learn about tree care and maintenance, seasonal phenomenon, invasive species and how to protect against them, and more. To learn more and participate, reserve your spot by calling (858) 673-3900.\nHike to the Dam at Lake Morena County Park\nSaturday, April 23, 10:30 a.m. – 12:30 p.m.; 2550 Lake Morena Drive, Campo; (619) 579-4101\nTake a nice hike through the beautiful woodland areas of Lake Morena County Park and learn all about local Native American tribes and how they lived off the land. A ranger will also share information about the flora and fauna along the trail and share the interesting history of the dam.\nPlant a Tree; See the Raptors at Lamar County Park\nSaturday, April 23, 1 p.m. – 4 p.m.; 3180 Bancroft Drive, Spring Valley (858) 565-3600\nThe County is replenishing the tree canopy at Lamar County Park in South County and you can help. All supplies, including saplings, will be provided. Participants can help plant a tree they can watch grow for years to come. Park rangers will also have raptors on hand for an up-close conversation on live birds of prey!\nTrail Trek at Wilderness Gardens County Preserve\nSunday, April 24, 9 a.m. – 12 p.m.; 14209 Hwy 76, Pala; (760) 742-1631\nThis behind-the-scenes trail adventure involves a 4.5-mile trek through diverse vegetation and to incredible panoramic views of Palomar Mountain and Pauma Valley. More than 40 bird species thrive on the land – a special treat for birdwatchers and photographers alike.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220420.08.49.01"}