{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New COVID-19 Boosters That Target Multiple Strains Now Available", "description": "The new COVID-19 bivalent boosters have arrived in San Diego County and limited supplies are now available at vaccination locations across the region, including pharmacies and medical providers.", "datePublished": "2022-09-08T16:57:11-07:00", "url": "https://www.countynewscenter.com/?p=209455", "keywords": ["health", "bivalent boosters", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-09-08T16:57:11-07:00", "articleType": "article", "articleContent": "\nThe new COVID-19 bivalent boosters have arrived in San Diego County and limited supplies are now available at vaccination locations across the region, including pharmacies and medical providers.\nThe new bivalent boosters were developed to generate an immune response from the original COVID-19 virus, as well as the BA.4 and BA.5 Omicron subvariants.\nThe Pfizer/BioNTech bivalent booster is available for individuals age 12 and older, while the Moderna bivalent booster is for those age 18 and older. The bivalent boosters have not yet been authorized for children under the age of 12. Youths in that age group can get boosted with the previous version of the monovalent Pfizer vaccine.\nSan Diegans need to be fully vaccinated before receiving the new booster, meaning they must have received the two-dose primary series of Pfizer, Moderna, or Novavax, or at least one shot of the Janssen vaccine. These vaccinations are still widely available. Anyone who received a previous COVID-19 vaccine less than two months ago can get the bivalent booster shot eight weeks after their last shot.\n“These new boosters are safe and effective at protecting people against the Omicron variants, which are currently causing the majority of new infections in our region,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Supplies of the bivalent vaccine will initially be limited, so we ask anyone who is planning to get the new booster to be patient.”\nInitially, County doses will be available at four County-operated locations:\nSouth Region Live Well Center\n150 doses a day\n690 Oxford St, Chula Vista, 91911\n10 a.m. to 5:30 P.M.\nEast Public Health Center\n60 doses a day\n367 N. Magnolia Ave, El Cajon, 92020\n8:30 a.m. to 3:15 p.m.\nCentral Region Public Health Center\n60 doses a day\n5202 University Ave, San Diego, 92105\n8:30 a.m. to 3:15 p.m.\nNorth Inland Public Health Center\n60 doses a day\n649 W. Mission Ave, Escondido 92025\n9:45 a.m. to 4:30 p.m.\nThe bivalent boosters will be available in the state’s My Turn system in the near future and will be given on a first-come, first-serve basis. While the initial shipments of the vaccine have been limited, the County expects more doses to arrive in the coming days and weeks, with the next shipment expected to arrive as soon as Friday afternoon.\nMore information about County vaccine locations is available at coronavirus-sd.com or by calling 2-1-1.\nVaccination Progress:\n\nReceived at least one shot: Close to 3.02 million or 90.3% of San Diegans age six months and older are at least partially vaccinated.\nFully vaccinated: More than 2.67 million or 79.9%.\nBoosters administered: 1,446,706 or 59% of 2,452,870 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n10 additional deaths were reported since the last report on Sept. 1, 2022. The region’s total is 5,474.\nOf the 10 additional deaths, five were women and five were men. They died between Feb. 28, 2022 and Aug. 30, 2022; six deaths occurred in the past two weeks.\nSeven of the people who died were 80 years or older, one was in their 70s and two were in their 60s.\nSix were fully vaccinated and four were not.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n881 COVID-19 cases were reported to the County in the past two days (Sept. 6 to Sept. 7, 2022). The region’s total is now 915,474.\n2,797 cases were reported in the past week (Sept. 1 through Sept. 7) compared to 3,978 infections identified the previous week (Aug. 25 through Aug. 31).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 21.53 for people fully vaccinated and boosted, 13.15 for fully vaccinated people and 42.24 for not fully vaccinated San Diegans.\n6,347 tests were reported to the County on Sept. 3, and the percentage of new positive cases was 5.6% (Data through Sept. 3).\nThe 14-day rolling percentage of positive cases, among tests reported through Sept. 3, is 6.9%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220908.16.57.11"}