{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 10-8-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Oct. 7.", "datePublished": "2020-10-08T15:08:41-07:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-10-8-2020/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-10-08T16:19:09-07:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Oct. 7.\nState Metrics:\n\nUnder the state monitoring metrics, San Diego County remains in Tier 2, also referred to as the Red Tier.\nSan Diego’s state-calculated, adjusted case rate is 6.5 per 100,000 residents, down from 6.7. The unadjusted case rate is 7.0, down from 7.2.\nThe testing positivity percentage is 3.5%, the same as last week, and it’s in Tier 3 or the Orange Tier.\nThe state has implemented a health equity metric that looks at the testing positivity for areas with the lowest healthy conditions. The new metric does not move counties to more restrictive tiers.\nThe County’s health equity testing positivity percentage is 6.2 and is in the Red Tier.\nThe California Department of Public Health will assess counties on a weekly basis, with the next report scheduled for Tuesday, Oct. 13.\n\nCommunity Setting Outbreaks:\n\n19 new community outbreaks were confirmed on Oct. 7: six in restaurant/bar settings, six in business settings, two in grocery settings, two in restaurants, one in a food processing setting, one in a residence and one in a hair salon/barbershop setting.\nIn the past seven days (Oct. 1 through Oct. 7), 32 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n10,915 tests were reported to the County on Oct. 7, and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 9,150.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n291 new cases were confirmed among San Diego County residents on Oct. 7. The region’s total is now 49,446.\n3,646 or 7.4% of cases have required hospitalization through Oct. 7.\n849 or 1.7% of all cases and 23.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSix new COVID-19 deaths were reported in San Diego County on Oct. 7. The region’s total is now 819.\nFour women and two men died between Sept. 4 and Oct. 7, and their ages ranged from late 40s to mid-70s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201008.15.08.41"}