{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Urges Parents to Get Children All Recommended Vaccinations", "description": "April 24-30 is National Infant Immunization Week, and the County Health and Human Services Agency is urging parents to make sure their children are vaccinated against all vaccine-preventable diseases.", "datePublished": "2022-04-25T16:20:18-07:00", "url": "https://www.countynewscenter.com/?p=208252", "keywords": ["health", "children and vaccines", "children vaccinations", "national infant immunization week"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-04-25T16:20:18-07:00", "articleType": "article", "articleContent": "\nThe COVID-19 pandemic continues to have a negative impact in the number of San Diego children getting routine childhood vaccinations.\nA Centers for Disease Control and Prevention report showed that during the 2020-21 school year, 94% of children had received all the required vaccines, about one percentage point lower than the previous school year.  In California, the decrease was about 0.3%.\nApril 24-30 is National Infant Immunization Week, and the County Health and Human Services Agency is urging parents to make sure their children are vaccinated against all vaccine-preventable diseases.\n“The pandemic changed everyone’s everyday life and reminded us of the value of vaccinations when we are up against a new virus. It also reminds us of the importance of routine childhood vaccinations to keep children healthy,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Parents should make sure their children have all the recommended vaccines to protect them.”\nVaccines reduce disease, disability and death from a variety of infectious diseases.\nThe CDC recommends that children—from birth to 6 years of age—get vaccinated against 16 diseases. COVID-19 vaccinations are also urged for children five years of age and older.\nVaccine-preventable diseases are not that common in the United States thanks to vaccinations. However, these diseases continue to sicken people around the world, and cases of diseases like mumps, measles and pertussis, also called whooping cough, can and do happen in San Diego County.\nSeasonal influenza is more common and requires a new vaccine each year and is recommended for all children 6 months and older.\n“Vaccinations and doctor visits are essential to keep children healthy,” Wooten said.\nIn addition to infant immunizations, children need the following:\n\nChildren 4 to 6 years of age are due for boosters of DTaP (diphtheria, tetanus and pertussis), chickenpox, MMR (measles, mumps and rubella) and polio.\nPreteens and teens need a Tdap booster shot to protect against tetanus, diphtheria and whooping cough. They also should get meningococcal and human papillomavirus vaccines.\n\nParents can obtain the vaccines for their children through their regular medical provider. People with no medical insurance can get vaccinated at a County Public Health Center at no cost. Local retail pharmacies also offer some vaccinations for a fee.\nFor more information about vaccines, National Infant Immunization Week, or back-to-school vaccine requirements, visit the Health and Human Services Agency Immunization Unit  website at www.sandiegocounty.gov/iz or call (866) 358-2966. To find the nearest County Public Health Center or community clinic, call 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220425.16.20.18"}