{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego Flu Cases Continue to Decline Amid COVID-19 Measures", "description": "A total of 81 lab-confirmed influenza cases were reported in the San Diego area last week, a 40 percent decrease from the 137 cases reported the week before, the County Health and Human Services Agency announced today.", "datePublished": "2022-01-12T12:57:18-08:00", "url": "https://www.countynewscenter.com/san-diego-flu-cases-continue-to-decline-amid-covid-19-measures/", "keywords": ["health", "flu", "flu shot", "influenza", "influenza vaccine"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-01-12T12:57:18-08:00", "articleType": "article", "articleContent": "\nA total of 81 lab-confirmed influenza cases were reported in the San Diego area last week, a 40 percent decrease from the 137 cases reported the week before, the County Health and Human Services Agency announced today.\nWhile influenza activity in the region is much lower compared to previous seasons, County health officials are urging San Diegans to get vaccinated to prevent getting sick at a time when hospitals are being inundated with COVID-19 patients.\n“With widespread transmission of COVID-19 in our community, it’s so important that all San Diegans do their part to prevent illness,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “I urge anyone who has not gotten the flu vaccine, to get vaccinated now. The flu vaccine is safe and effective, and you can get it at the same time as your COVID-19 booster.”\nThe County Health and Human Services Agency publishes the weekly Influenza Watch  report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Jan. 8, 2022, the report shows the following:\n\nEmergency department visits for influenza-like illness: 8% of all visits (compared with 7% the previous week)\nLab-confirmed influenza cases for the week: 81 (compared to 137 the previous week)\nTotal lab-confirmed cases to date: 1,262 (compared to 589 at the same time last season and a 4,002 prior 5-year average during the same week)\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe flu vaccine is especially important for people at higher risk of having serious complications from the virus.\nThey include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nDuring the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths. During the 2019-2020 flu season, a total of 108 San Diegans died from influenza and more than 20,700 flu cases were reported.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220112.12.57.18"}