{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: County and City Leaders Are Ready to Respond Together to Disasters", "description": "Leaders from the County of San Diego and the City of San Diego met at the County Emergency Operations Center to highlight collaboration and cooperation in San Diego.", "datePublished": "2022-05-04T17:02:47-07:00", "url": "https://www.countynewscenter.com/?p=208359", "keywords": [], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-05-04T17:02:47-07:00", "articleType": "video.other", "articleContent": "\nCounty and City Leaders Ready to Respond Together to Disasters\nLeaders from the County and City of San Diego met Wednesday at the County Emergency Operations Center to highlight collaboration and cooperation in responding to regional disasters.\nBoard Chair Nathan Fletcher, San Diego Mayor Todd Gloria and County Deputy Chief Administrative Officer for Public Safety Holly Porter toured the center, which becomes a hub for members of different agencies to coordinate actions during emergencies.\nDisasters faced by San Diego include wildfires, flooding, earthquakes, oil spills, tsunamis, pandemics and even acts of terrorism.\n“We think about how we are ready to respond to any situation that might occur,” said Board Chair Nathan Fletcher. “The folks who come to the emergency operations center, these are the unseen heroes, the folks who coordinate logistics, supplies and water and getting power turned back on and coordinate evacuation routes. And everyday of the year, they are doing planning and exercises and drills to make sure that our region is ready to respond to any situation or any crisis that we face.”\nAll leaders come together to help with an emergency, bringing “many voices, but one message” through collaboration and coordination.\n“Your City and County governments are working together seamlessly,” said San Diego Mayor Todd Gloria. “We work collaboratively, we share information, we share resources in order to make sure that when the unthinkable happens we are prepared to respond and do it effectively.”\nEvery resident of San Diego County can help. Visit ReadySanDiego.org and click on Know Your Hazards tool. This will tell you right at your address which hazards you may face. You can also complete a family disaster plan so you know what to do in an emergency. It only takes minutes.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220504.17.02.47"}