{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches Evacuation Plan Focused on Vulnerable People", "description": "If you needed to evacuate for an emergency, could you just get in your car and go? For some, the answer may be no because they lack transportation, need additional help with medical equipment or gathering items in their home.", "datePublished": "2020-01-22T15:30:18-08:00", "url": "https://www.countynewscenter.com/county-launches-evacuation-plan-focused-on-vulnerable-people/", "keywords": ["public safety", "cert", "emergency", "evacuation", "neighborhood evacuation team", "vulnerable"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-01-22T16:30:07-08:00", "articleType": "article", "articleContent": "\nIf you needed to evacuate for an emergency, could you just get in your car and go? For some, the answer may be no because they lack transportation, need additional help with medical equipment or gathering items in their home.\nStudies have shown that during a disaster, older adults or people with disabilities, or access and functional needs have added challenges when faced with evacuation. This information inspired the County Office of Emergency Services to come up with the Neighborhood Evacuation Team program in partnership with the Community Emergency Response Teams throughout the region. The teams are made up of disaster-trained volunteers who can help in their neighborhoods.\nPeople who reach out for assistance will be teamed up with a CERT member who can guide them through the process of making a plan that suits their needs, including working out transportation needs with a caregiver, neighbor or family member.\nThe County, CAL FIRE/Fire Authority, CERT and school project partners introduced the new program Wednesday at Kearny High School.\n“Having faced several major wildfires and other emergencies, some San Diego County residents have told emergency officials of the difficulty and delays they had to overcome to evacuate. This free service that is being offered through the NET program will help people who need extra help put together a plan tailored for their needs,” said County Supervisor Greg Cox. “Once they have a plan in place, if asked to evacuate, it may take them 15 minutes to leave instead of 45 or 75 minutes and that could save someone’s life.”\n“This program fits into the national Neighbors Helping Neighbors approach that is crucial in a disaster because we know that in a major disaster, first responders will be tied up managing the threat and it could be up to 72 hours before they could send someone to assist,” said Jeff Toney, director for County Emergency Services. “So, we are glad to be an impetus for this effort where neighbors check in with one another, particularly in rural areas, and especially if a neighbor may have additional needs.”\nCAL FIRE/San Diego County Fire Division Chief Burke Kremensky said the firefighters looks forward to working alongside CERT members to help residents. He called the program “positive growth happening in our rural communities” and said it could “prove to be a lifesaving benefit to residents.”\nThe pilot begins this week with information starting to go out to communities in 21 of the unincorporated areas. OES staff additionally partnered with students from Kearny High’s School of Digital Media and Design to help develop and create promotional materials such as videos and graphics to be used in community outreach and on social media. See a related story, Student Interns Help County Develop Promotional Materials for New Program, for more information.\nPeople interested in requesting this assistance, can visit ReadySanDiego.org to be paired with a CERT member.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200122.15.30.18"}