{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Distributing Information to Residents Ahead of CDC Community Health Assessment", "description": "County Public Health staff and volunteers will walk door-to-door in South County neighborhoods Thursday handing out information about an upcoming community health assessment, led by the Centers for Disease Control and Prevention (CDC) to address sewage pollution along the Tijuana River Valley.  ", "datePublished": "2024-10-02T16:36:10-07:00", "url": "https://www.countynewscenter.com/county-distributing-information-to-residents-ahead-of-cdc-community-health-assessment/", "keywords": ["health", "casper", "cdc", "health survey", "imperial beach", "sewage", "south bay", "south county", "south region", "tijuana river valley"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-10-02T16:36:10-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Public Health staff and volunteers will walk door-to-door in South County neighborhoods Thursday handing out information about an upcoming community health assessment, led by the Centers for Disease Control and Prevention (CDC) to address sewage pollution along the Tijuana River Valley.  \nMore than 6,000 households will receive information on flyers and doorhangers about the survey known as a Community Assessment for Public Health Emergency Response or CASPER.  \nPeople who live in the area may notice the volunteers who will be walking in pairs and wearing reflective vests. \n“We know that many community members are worried about their health and the health of their families because of the sewage contamination in their beach water and the Tijuana River Valley,” said Dr. Ankita Kadakia, interim public health officer. “We are pleased to have the support of the CDC partnering with the County so that we can listen to those concerns and experiences and get a big picture snapshot of the needs in these areas.”  \nAbout the CASPER Survey\nThe CASPER survey is a tool from the CDC to quickly gather information about the needs of an affected community through a series of questions. \nHouseholds that are interviewed are picked from a bigger sample of homes in 30 blocks or “clusters” in an affected area. From those 30 blocks, seven households from each block are picked to be interviewed for a total of 210 households.  \nCounty health officials encourage community members to share their experiences if their household is randomly selected to do the survey.  \nThe responses from the assessment are analyzed and used by public health officials to make decisions. It can help determine what public health actions to take, find gaps in information, what resources are needed, and understand new or changing needs within the community. \nOngoing Epidemiological Monitoring\nWhile the CASPER is a point in time assessment of the south region population, the County’s public health epidemiologists are monitoring public health data regionally 365 days a year. \nThese disease investigators find, evaluate and respond to contagious disease cases, outbreaks and health conditions in the region. They work to figure out which areas and groups of people are being affected to help keep the community safe and healthy. \nAnnually, the Epidemiology and Immunization Services Branch investigates more than 15,000 high priority cases of infectious disease and more than 100,000 new reports of contagious diseases. In recent years, work has surrounded increases in hepatitis A among people experiencing homelessness, Mpox, whooping cough, dengue and outbreaks of norovirus associated with oysters and salmonella with raw milk. \nWhen it comes to health concerns due to impacts from sewage pollution and obnoxious odors in the Tijuana River Valley, a weekly report monitors for spikes in gastrointestinal illness and asthma or chronic obstructive pulmonary disease (COPD) symptoms in south region residents. The website is regularly updated with additional information, including links to other agencies responding to the sewage and how people and families can protect themselves. \nTo learn more about health concerns and impacts from sewage and pollution in the Tijuana River Valley and the upcoming CASPER survey, visit sandiegocounty.gov/southregionhealth. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241002.16.36.10"}