{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "29 Official Ballot Drop Boxes Open for  District One Special Primary Election", "description": "Starting Tuesday, March 11, registered voters in the County of San Diego’s First Supervisorial District have the additional option of returning their mail ballot for the April 8 special primary election to any one of 29 official ballot drop boxes located around the district.", "datePublished": "2025-03-11T10:44:07-07:00", "url": "https://www.countynewscenter.com/29-official-ballot-drop-boxes-open-for-district-one-special-primary-election/", "keywords": ["elections", "county registrar of voters", "district 1", "district 1 special election", "fg3", "special primary election", "supervisorial district 1"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-03-11T10:44:07-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesStarting Tuesday, March 11, registered voters in the County of San Diego’s First Supervisorial District have the additional option of returning their mail ballot for the April 8 special primary election to any one of 29 official ballot drop boxes located around the district.\nMail ballots for the district’s 370,000 registered voters are expected to arrive this week. Some voters may have received theirs over the weekend.\nThe person elected will fill the district’s vacant seat for the remainder of the current term that ends in January 2029. If no candidate receives a majority vote at the April 8 election, the top two vote-getters will move on to the special general election on July 1. Only those who live in the district can vote in the election.\n\nDistrict 1 runs from the Pacific Ocean to the Otay and San Miguel mountains in the east, and from Barrio Logan in the north to the U.S./Mexico international border on the south. The district includes the cities of Chula Vista, Imperial Beach, National City, and some communities within the City of San Diego, including Barrio Logan, East Village, Golden Hill and more. It also includes the unincorporated areas of Bonita, East Otay Mesa, Lincoln Acres, Sunnyside and La Presa.\nIf you’re not sure if you reside in the County’s Supervisorial District 1, you can look it up at sdvote.com.\nWhat do the Registrar’s official ballot drop boxes look like?\nThe Registrar’s official ballot drop boxes are red, white and blue and feature the Registrar’s logo along with the County seal. All boxes are labeled “Official Ballot Drop Box” and made from high grade, heavy gauge stainless steel.\nEach official ballot drop box is designed to prevent physical damage and unauthorized access to mail ballots. The boxes feature double-locking access doors, anti-pry door jambs and other anti-theft construction measures. The Registrar’s ballot retrieval team is responsible for collecting ballots inside the box.\nHow do I return my ballot to an official ballot drop box?\nMark your ballot, seal your completed ballot inside your return envelope, date and sign your name on the return envelope, and return it in the mail or to one of the Registrar’s official ballot drop boxes around the district. Remember, your signature is required for your vote to count.\nThe Registrar’s 29 official ballot drop boxes are open 24 hours a day up until 8 p.m. on the final day of voting, April 8. Visit sdvote.com to check the location list or the locator map to find a location near you.\nHow do I vote in person?\nEarly voting began Monday at the Registrar of Voters office located on the County Operations Center campus in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday.\nStarting Saturday, March 29, District 1 voters can vote in person at any one of seven vote centers. They’ll be open daily from 8 a.m. to 5 p.m. until the final day of voting, Tuesday, April 8, when 13 vote centers will be open 7 a.m. to 8 p.m.\nYou can find a vote center or an official ballot drop box near you inside your voter information pamphlet, or you can look up your pamphlet online with the View Voter Information Pamphlet (Sample Ballot) tool at sdvote.com.\nLearn more about voting in the District 1 special primary election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250311.10.44.07"}