{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego Doctors Address COVID-19 Misinformation", "description": "An independent panel of local doctors today participated in a virtual event that addressed COVID-19 misinformation brought up at the Oct. 5 County Board of Supervisors meeting.", "datePublished": "2021-10-06T13:51:26-07:00", "url": "https://www.countynewscenter.com/san-diego-doctors-address-covid-19-misinformation/", "keywords": ["health", "coronavirus", "covid-19", "misinformation", "panel of doctors"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-06T14:14:46-07:00", "articleType": "article", "articleContent": "\nAn independent panel of local doctors today participated in a virtual event that addressed COVID-19 misinformation brought up at the Oct. 5 County Board of Supervisors meeting.\nDuring the 70-minute session, which was open live to the public for viewing, the doctors dispelled misleading claims about COVID-19, vaccine efficacy and approval, as well as misinformation about side effects and alternative treatments for the virus.\nThe panel, moderated by Dr. Eric McDonald, County chief medical officer, included Dr. Omid Bakhtar from Sharp Healthcare, Dr. Cynthia Gyamfi-Bannermann from UC San Diego Health, Dr. Christian Ramers from Family Health Centers of San Diego and Dr. Mark Sawyer from Rady Children’s Hospital.\nThe doctors have all worked on the front lines of COVID-19 since the pandemic’s beginning. Their discussion also included the accuracy of COVID-19 tests, the safety of the vaccines, the usefulness of masks, the efficacy of treatment options, and other issues that came up at Board of Supervisors meetings.\nCounty of San Diego Health and Human Services Agency staff are now tracking COVID-19 misinformation shared during public comment following novel coronavirus presentations to the Board of Supervisors.\nHHSA staff have been in the forefront of promoting accurate information on COVID-19 throughout the pandemic, but efforts to specifically target COVID-19 misinformation began after the Board adopted a new policy, at Chair Nathan Fletcher’s request, declaring misinformation a public health crisis.\nIn August, San Diego County became the first jurisdiction in the United States to declare health misinformation a public health crisis, and others have since followed.\nThe County also has launched a new website to debunk common false claims about COVID-19 and educate people on where to find credible medical information sources\nA video of the virtual event is available on the coronavirus-sd.com website. More virtual panels are expected to take place after future Board of Supervisors meeting where a COVID-19 update is provided by County staff.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211006.13.51.26"}