{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bird Flu Detected in Wastewater, But Not In People", "description": "San Diego County is become the fifth location in California to report the environmental detection of H5 influenza virus, commonly referred to as bird flu.  ", "datePublished": "2024-09-16T17:02:49-07:00", "url": "https://www.countynewscenter.com/bird-flu-detected-in-wastewater-but-not-in-people/", "keywords": ["health", "avian flu", "bird flu", "dr. kadakia", "h5", "phs", "public health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-09-16T17:05:01-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County has become the fifth location in California to report the environmental detection of H5 influenza virus, commonly referred to as bird flu.  \nThis detection was made through wastewater testing conducted on Sept. 1, 2024, by WastewaterSCAN, a privately funded operation that monitors wastewater for pathogens at more than 150 sites nationwide and 57 sites across California. Regular follow up sampling has not detected any virus. \nH5 influenza regularly circulates in wild birds and occasionally causes human cases. Recent outbreaks of H5N1 in cattle and a small number of human cases, primarily in farm workers, have brought attention to the virus this year. \nThe detection in San Diego County does not confirm the presence of a human H5 infection, the presence of live H5N1 virus, or the presence of the H5N1 B3.13 strain, also known as “Cattle Clade,” currently circulating in cattle and occasionally causing human disease in farm workers. \nH5 is also regularly detected in states with infected dairy herds such as Colorado, Michigan, and Texas. No detections of the H5 influenza virus have occurred in San Diego County cattle, birds or humans in 2024. There were wild bird detections in 2022 and 2023, and a poultry flock was infected in 2022.  \nCounty Public Health Services conducts surveillance of human influenza cases all year round and receives information about lab confirmed case reports, hospitalizations and deaths. In addition, the Public Health Lab collaborates with a network of regional labs to perform advanced testing to identify novel strains that might be emerging in our region or flu virus that may not be well matched with the annual flu vaccine. Regular surveillance updates on major respiratory viruses including Influenza, COVID-19 and Respiratory Syncytial Virus (RSV) are available online.  \n“San Diego County has a robust flu surveillance system,” said Dr. Ankita Kadakia, County interim public health officer. “While we have no evidence of the virus in people or animals, it is important to be transparent with the public both about the detection status and that we are vigilant and working with our partners at the California Department of Public Health, California Department of Food and Agriculture, and California Department of Fish and Wildlife to monitor for signs of H5 presence locally.”  \nSan Diego County has a closed sewage system, meaning that its stormwater and wastewater do not intentionally intermix. This greatly reduces, but does not eliminate, the probability that this detection is from an environmental source such as migrating birds.  \nThe virus may have been introduced into wastewater by discarding of contaminated animal products, infected wild bird droppings entering the sewage system, human infection, or animal infection. \nMore information about H5 can be found on the Public Health Services website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240916.17.02.49"}