{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Takes to the Sky Again to Fight Mosquitoes", "description": "San Diego County’s Vector Control Program is scheduled to conduct its first routine aerial larvicide drops of the year next week on up to 52 local waterways to help stop mosquitoes from potentially spreading diseases like West Nile virus.", "datePublished": "2025-04-16T11:04:42-07:00", "url": "https://www.countynewscenter.com/county-takes-to-the-sky-again-to-fight-mosquitoes-2/", "keywords": ["health", "dehq", "larvicide", "mosquito prevention", "vector control", "west nile virus"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2025-04-16T12:31:09-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County’s Vector Control Program is scheduled to conduct its first routine aerial larvicide drops of the year next week on up to 52 local waterways to help stop mosquitoes from potentially spreading diseases like West Nile virus.\nCounty officials said helicopter larvicide drops will be done on Wednesday, April 23, and Thursday, April 24, if necessary, to cover nearly 1,400 acres of hard-to-reach potential mosquito breeding areas.\nThe County conducts the aerial larvicide drops roughly once a month from April through October.\nThe solid, granular larvicide does not hurt people or pets but kills mosquito larvae before they can grow into biting mosquitoes.\nThe County started using helicopters to drop larvicide on hard-to-reach areas of standing water in rivers, streams, ponds and other waterways where mosquitoes can breed in the early 2000s after West Nile virus arrived.\nWest Nile virus is mainly a bird disease. However, mosquitoes can pass the potentially deadly virus on to people by feeding on infected birds and then biting people.\nWest Nile virus’ effect has been relatively mild in San Diego County in the past few years. Three or fewer people have tested positive annually since 2017. But it can still be dangerous, and people should avoid mosquitoes.\nThe larvicide drops are just one part of Vector Control’s Integrated Vector Management Strategy. County Vector Control also monitors approximately 1,600 potential mosquito-breeding areas each year and applies larvicide through a variety of techniques—aerial drops, boats, trucks and hand-crews. It also gives out free mosquito-eating fish to the public, tracks down and treats neglected swimming pools, tests dead birds for West Nile virus, and monitors mosquito populations for potential mosquito-borne illnesses.\nPublic has Important Role to Play\nCounty Vector Control officials are also reminding people to help protect themselves from mosquitoes in and around their homes by finding and dumping out standing water to keep the pests from breeding.\nProtecting against mosquitoes has required more help from the public in recent years because invasive Aedes mosquitoes, or “ankle biter” mosquitoes, have established themselves here. These mosquitoes prefer to live and breed around people’s homes and yards, and can potentially transmit diseases not naturally found here, including Zika, dengue and chikungunya.\nCounty Vector Control officials said the best way people can protect themselves from mosquitoes is to follow their “Prevent, Protect, Report” guidelines.\nPrevent Mosquito Breeding\nDump out or remove any item inside or outside of homes that can hold water, such as plant saucers, rain gutters, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquitofish, available for free by contacting the Vector Control Program, may be used to control mosquito breeding in backyard standing water sources such as unmaintained swimming pools, ponds, fountains and horse troughs. For more tips, go to Vector Control’s Prevention Toolkit website.\nProtect Yourself from Mosquito Bites\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nReport Increased Mosquito Activity and Dead Birds\nReport increased mosquito activity, stagnant, unmaintained swimming pools and other mosquito-breeding sources, as well as dead birds — including crows, ravens, jays, hawks and owls — to the County Department of Environmental Health and Quality’s Vector Control Program by calling (858) 694-2888 or emailing vector@sdcounty.ca.gov. \nIf you have checked around your home for standing water and are still experiencing mosquito issues, you can request an educational mosquito inspection by contacting the Vector Control Program at (858) 694-2888.\n \n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250416.11.04.42"}