{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Hundreds of Volunteers Join Annual Point-in-Time Count", "description": "Once a year, around 1,500 volunteers walk the streets of San Diego County before the sun comes up as part of the region’s Point-in-Time Count to find people experiencing homelessness . ", "datePublished": "2024-01-26T09:54:08-08:00", "url": "https://www.countynewscenter.com/hundreds-of-volunteers-join-annual-point-in-time-count/", "keywords": ["government", "homelessness", "point in time count", "we all count"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-01-26T09:58:29-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesOnce a year, around 1,500 volunteers walk the streets of San Diego County before the sun comes up as part of the region’s Point-in-Time Count to find people experiencing homelessness. \nThe annual survey, called We All Count, is led by the Regional Task Force on Homelessness and provides a one-day count of the number of people experiencing homelessness in San Diego County, including those in emergency shelters and safe parking lots. \nThe information from the Point–in–Time surveys is used to apply for federal and state funding to help people experiencing homelessness and find solutions on how to best serve them. \nVolunteers began the day at 4 a.m., at 31 sites throughout the County where they split into teams to walk or drive around their designated areas looking for people living outside. The count continues throughout the day and into the weekend for certain populations. \nThis year, 267 County employees volunteered to take part in the Point-in-Time Count.\nIn North region, a County team came across a young man who was cold and had been staying in the storm tunnels. He needed a safe place to sleep.  \nStaff with the County’s Department of Homeless Solutions and Equitable Communities worked with partners to find him help, including a phone and a hotel room through a referral into the Regional Homeless Assistance Program. As part of the program, he will receive follow-up support to connect to services and resources, including permanent housing. \nLater in the morning other County staff joined Caltrans to survey people living in encampments in the South County near freeway ramps and the riverbed in an area called “The Jungle”.   \nStaff spoke with several people there who agreed to take part in the survey, covering topics like how long they had been experiencing homelessness, in exchange for a gift card.  \nLast year, the County received two grants totaling $22 million for homeless outreach efforts along the San Diego Riverbed and “The Jungle” and that work is well underway.  \nThe County has multiple programs in place to help connect people to the services they need, including finding a stable place to live. People can find more information online  here or by calling 2-1-1. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240126.09.54.08"}