{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two Presumptive Cases of Monkeypox Identified in San Diego County", "description": "The County of San Diego Health and Human Services Agency has identified two presumptive cases of monkeypox, that must be verified by the Centers for Disease Control and Prevention (CDC).", "datePublished": "2022-06-15T14:14:12-07:00", "url": "https://www.countynewscenter.com/?p=208760", "keywords": ["health", "first presumptive monkeypox cases", "monkeypox"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-06-15T14:19:33-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency has identified two probable cases of monkeypox that must be verified by the Centers for Disease Control and Prevention (CDC). These would be the first cases to be found in San Diego County.\nThe two cases are unrelated to each other, but both individuals recently traveled internationally. Although symptomatic, they are doing well and are not hospitalized. Both individuals are isolated from others.\n“We have seen an increasing number of cases of the monkeypox virus across the world and in the U.S. in recent weeks, so our public health department was prepared for possible local cases,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Overall, the risk of monkeypox to the general population remains very low.”\nBoth cases are currently listed as probable as all suspected cases of monkeypox must receive final confirmation from the CDC. Confirmation is expected in the coming days.\n“The arrival of these probable cases in our region is not a surprise, but rather has been expected,” said Chair Nathan Fletcher, San Diego County Board of Supervisors. “Our public health leaders are confident there is very little risk of exposure to the majority of County residents.”\nAbout Monkeypox\nMonkeypox is a viral infection that can spread through contact with body fluids, sores on the body of someone who has monkeypox, or shared items (e.g., clothing and bedding) that have been contaminated with fluids from sores of a person with monkeypox.\nThe disease can also spread between people through saliva or respiratory droplets, typically between people in a close setting. Although monkeypox is not generally considered a sexually transmitted disease, it can be transmitted during sex through skin-to-skin and other intimate contact, regardless of gender or sexual orientation.\nThe virus is not known to linger in the air and is not transmitted during short periods of shared airspace.\nCases of monkeypox have previously been identified in travelers from, or residents of, countries in western and central Africa, where monkeypox is considered to be endemic. Since May 2022, monkeypox cases have been reported in several non-endemic countries, including the United States.  No deaths have been reported.\nMonkeypox Symptoms\nSymptoms of monkeypox are similar to, but milder than, the signs and symptoms of smallpox. They include:\n\nFever\nHeadache\nMuscle aches\nBackache\nSwollen lymph nodes\nChills\nExhaustion\n\nA rash usually develops within 1 to 3 days after the appearance of fever. The rash often begins on the face and then spreads to other parts of the body.\nMost people who develop monkeypox experience symptoms 7 to 14 days (and up to 21 days) after exposure.\nThe majority of people who become infected with monkeypox have a mild illness that improves without treatment over 2 to 4 weeks. Monkeypox is contagious and can spread to others until scabs have fallen off and a new layer of skin has formed.\nWhat People Should Do\nAnyone who thinks they may have symptoms of monkeypox, including unusual rashes or lesions, should contact a healthcare provider right away. Cover the area of the rash with clothing, wear a mask and avoid skin-to-skin or close contact with others until the symptoms are medically evaluated.\nFor more information on monkeypox, please visit https://www.sandiegocounty.gov/content/sdc/hhsa/programs/phs/community_epidemiology/dc/human-monkeypox.html\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220615.14.14.12"}