{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Non-Stop Charter Flights to and From Taos Start at McClellan-Palomar Airport", "description": "A new seasonal air charter service is scheduled to start flying Thursday between the County’s McClellan-Palomar Airport and Taos, New Mexico through the end of March.", "datePublished": "2020-01-08T14:29:50-08:00", "url": "https://www.countynewscenter.com/new-non-stop-charter-flights-to-taos-start-at-mcclellan-palomar-airport/", "keywords": ["transportation", "county airports", "mclellan-palomar"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-01-09T09:38:41-08:00", "articleType": "article", "articleContent": "\nA new seasonal air charter service is scheduled to start flying Thursday between the County’s McClellan-Palomar Airport and Taos, New Mexico through the end of March.\nTaos Air, a private air charter service that operates out of Taos, New Mexico, is scheduled to fly its first 30-seat jet charter flight into McClellan-Palomar at 12:45 p.m. Thursday, and fly back out to Taos Regional Airport at 1:30 p.m.\nCounty officials said that Taos Air plans to fly Dornier 328 jets to and from McClellan-Palomar Thursdays, Saturdays and Sundays — or holiday Mondays —through March 29. More information about Taos Air and flights can be found on its website.\nThe public charter service will provide San Diego County residents the only non-stop airline service from San Diego County to the Taos ski resort area.\nTaos Air Director of Operations Joe Zavda, who plans to be at McClellan-Palomar Thursday to greet the services first customers, said the company was very excited about the new service.\nCounty Supervisor Jim Desmond, whose district includes McClellan-Palomar, said, “this is a great new service for residents and the economy of North County. Being able to fly directly from North County to Taos will be a great opportunity for both cities!”\nTaos Air also flies charter services to and from Taos Regional Airport and Dallas, Texas, Austin, Texas and Los Angeles.\nMcClellan-Palomar Airport is one of eight airports operated by the County of San Diego’s Department of Public Works and the only one that operates scheduled public charter flights for county residents.\nBecause McClellan-Palomar is a smaller airport, passengers can escape the traffic, expensive parking and long security lines at other major airports.\nThe County has made several improvements at McClellan-Palomar in recent years, including a $24 million renovation in 2009 that added a modernized 18,000-square-foot terminal, parking and a restaurant, “The Landings.”\nParking at McClellan-Palomar airport is $5 a day.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200108.14.29.50"}