{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "The Thanksgiving Cook-Safely Quiz is Back!", "description": "Thanksgiving, our biggest day of feast is back! And if you’re cooking, the last thing you want to do is serve your family and friends plentiful platefuls of salmonella, listeria or other dangerous bacteria. Here's our annual quiz to help keep your cooking safe!", "datePublished": "2024-11-21T11:22:04-08:00", "url": "https://www.countynewscenter.com/the-thanksgiving-cook-safely-quiz-is-back/", "keywords": ["consumer", "dehq", "food safety", "lueg", "thanksgiving"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-11-21T13:00:00-08:00", "articleType": "article", "articleContent": "\nReading Time:  5 minutesWarm up the kitchen! Thanksgiving, our biggest day of feast is back.\nAnd if you’re cooking, the last thing you want to do is serve your family and friends plentiful platefuls of salmonella, listeria or other dangerous bacteria.\nThose sickening things can be carried by your turkey, stuffing, vegetables, salads and desserts—if you’re not prepping, cleaning and cooking right.\nFortunately, there are some simple rules to keep you and everyone else happy and safe. Bone up on them by taking our annual Thanksgiving safe-cooking quiz! See how safe you are.\nSome companies have now created turkeys you don’t have to thaw before cooking. But many of us are still doing it the old-fashioned way. So, do you know the right way to thaw frozen meat?\n\nOK this is simple. When you bring home your frozen turkey, just leave it out on the counter. After a couple of days, when the outside is mushy-soft, you’re good to go and ready to cook!\nYou can do this a lot faster. Just run it under hot water! Until the outside is mushy-soft.\nThawing is overrated. That’s what cooking is supposed to fix, right?\nPlease, PLEASE. Plan ahead and let meat defrost in your refrigerator. Meats, poultry and fish should be defrosted in the fridge. If you’re cooking a big turkey, you should allow at least 24 hours for every five pounds in weight.\n\nAnswer: D. If you picked A, B or C, please get a pizza instead. Thawing meat in the refrigerator is absolutely the best and safest method. That’s because a refrigerator allows meat to thaw slowly and evenly, rather than leaving parts of defrosted meat to stand at room temperature where bacteria can multiply exponentially.\nNote: The United States Department of Agriculture (USDA) says that you can also thaw meats in cold water. But—and this is important—the water must be cold, under 40 degrees, and should be changed every 30 minutes to keep it cold. Thawing in the fridge is easier!\nHow often should you wash your hands and cutting boards when preparing food?\n\nWashing hands and cutting boards? Whenever you feel like it; it’s no big deal.\nAlways during food prep; before prepping vegetables and always after cutting or working with raw meat, fish or poultry.\nAfter you pet the dog—or the cat. Or pick up the kids.\nAfter you sneeze, blow your nose or have to run to the bathroom.\nThe answer is B, C and D; but mainly, “OFTEN!”\n\nAnswer: Definitely E. You should wash your hands and cutting boards before and after everything in B, C and D, and pretty much as often as you can in the kitchen. Handwashing is always a key part of safe cooking. Harmful bacteria, from E. coli to salmonella and staphylococcus aureus, as well as viruses, can be removed from people’s hands through proper handwashing.\nHere are just a few other things you should wash your hands after doing: coughing, handling money, eating, drinking and playing with your cell phone or video games.\nShould you rinse off fruits and vegetables?\n\nAgain, this is totally unnecessary and time-consuming. They wash them at the supermarket, right?\nWash ‘em. You should definitely rinse fruits and vegetables with cold water. It will remove lingering dirt that can carry bacteria.\nIf you’re wearing clean clothes, wiping them off on your shirts or pants will do.\nNever wash them. It will wash all the flavor away.\n\nAnswer: B. Definitely wash ‘em. Rinsing with cold water cleans off dirt and other contaminants (think germs, not minerals…). But don’t wash them with detergents or soap, even dishwashing soap. You could end up eating residues from those cleaners if they’re absorbed by fruits and vegetables.\nWhy should you keep raw meats and meat products separated from fruits and vegetables when cutting them up or preparing them?\n\nMeats and vegetables. They just really don’t get along. Last thing you need is a food fight on your cutting board.\nDon’t separate them; keep them together. In fact, let those veggies soak for a while. Marinading makes everything better.\nBecause raw meats, meat products and blood can carry bacteria like E. coli and salmonella that can contaminate fruits and vegetables—and make people sick.\nWhat’s a vegetable?\n\nAnswer: The correct answer is C. Cross-contamination is one of the most common causes of food-borne illness according to the USDA. That is, the transfer of harmful bacteria from one food—particularly raw meats, poultry and shellfish—to other foods. When preparing food, you need to keep raw meats and their juices away from fruits, vegetables and all ready-to-eat foods.\nNote: If you can, use separate cutting boards for meats and produce. If you can’t use separate cutting boards, wash yours with hot, soapy water after using them on raw meats and before using them to cut fruits and vegetables. Or use your cutting board to chop vegetables first, then use it to prepare your uncooked meat, then wash it with hot, soapy water.)\nIs the “five-second rule” real? Can you eat something you’ve dropped on the floor if you pick it up in less than five seconds?\n\nIt’s actually the five-MINUTE rule. As long as nobody trips over it, you can let it sit there for a while before you eat it.\nMan, my pets eat stuff off the floor all the time and they never get sick. Nothing can contaminate your food in less than five seconds. Pick it up quick and blow on it.\nYou really shouldn’t eat anything you’ve dropped on floor. The “five-second rule” is NOT real.\n\nAnswer: C. Eating food off the floor is OK for the pets, but NOT people. Truth is, almost any contact is long enough for food to be contaminated by bacteria that can be found on the ground or in your house. According to Rutgers University, bacteria can transfer from a surface to food in less than one second!\nAnd finally, for the umpteenth year in a row, here’s our favorite cook-safely quiz question. Like Thanksgiving itself, it is an annual institution.\nWhat is the Danger Zone? And what does it have to do with Thanksgiving dinner?\n\nYOUR kitchen if you didn’t get any of the previous questions right!\nThe Danger Zone is the point during dinner where if eat another bite you won’t have any room for dessert!\nC’mon! There’s only one Danger Zone! Top Gun! Tom Cruise! Kenny Loggins! Sing it with me! “Highway to the DANGER ZONE! Riiiide in—to the DANGER ZONE!”\nNope, the real Danger Zone is the range of temperatures between 40 degrees Fahrenheit and 135 degrees Fahrenheit— temperatures where bacteria can grow like crazy in foods, doubling in number in as little as 20 minutes.\n\nAnswer: D; it’s definitely D. With all due respect to Top Gun, the real “Danger Zone” is that range of temperatures between 40 degrees and 135 degrees Fahrenheit that allows bacteria to breed exponentially—not a good thing. If hot foods cool or cold foods heat up enough to enter that zone, your food can become a bacteria-fest. And you, your family and friends can end up getting sick. So, keep hot foods safely heated with chafing dishes, preheated steam tables, warming trays, slow cookers and ovens. Place cold foods in containers on ice, or in the fridge. And refrigerate leftovers as soon as you can, but definitely within two hours.\nSo there! Now you’re an expert. But if you’re still interested, you can get more information about food safety tips at FoodSafety.gov’s “Food Safety by Types of Food” webpage, or by calling the USDA’s Meat and Poultry hotline at 1-888-674-6854.\nSo, be safe. Cook safe. And keep the safe-giving in your Thanksgiving! \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241121.11.22.04"}