{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Fighting the Fentanyl Overdose Epidemic", "description": "National Fentanyl Prevention and Awareness Day is in August, and the County is dedicated to spreading the word on the dangers of fentanyl poisoning and the precautions that can be taken to prevent fentanyl overdose deaths. The County’s comprehensive Harm Reduction Strategy includes the distribution of lifesaving naloxone and fentanyl test strips to anyone who wants them.", "datePublished": "2024-08-26T14:40:44-07:00", "url": "https://www.countynewscenter.com/fighting-the-fentanyl-overdose-epidemic/", "keywords": ["health", "fentanyl", "fentanyl awareness and prevention", "homeless outreach", "naloxone", "narcan", "vending machines"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-08-26T15:36:17-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteIllicit fentanyl is the single deadliest drug threat facing our nation and it can be found in every city, every community, and every neighborhood.  It is a synthetic opioid that is up to 50 times stronger than heroin and 100 times stronger than morphine. Fentanyl cannot be seen, smelled, or tasted and is often added to other drugs to make them cheaper, more powerful and more addictive.\nNational Fentanyl Prevention and Awareness Day is in August, and the County is dedicated to spreading the word on the dangers of fentanyl poisoning and the precautions that can be taken to prevent fentanyl overdose deaths.\nThe County’s comprehensive Harm Reduction Strategy includes the distribution of lifesaving naloxone and fentanyl test strips to anyone who wants them. Naloxone, also known as Narcan, is a nasal spray that can rapidly reverse an opioid overdose and save lives.  There are many locations across the county where cost-free naloxone is publicly available. (map).\nFrom January to December of 2023, the County distributed more than 28,000 naloxone kits, nearly 4,000 of them through the 16 naloxone vending machines available across the county.\nIf you or someone you care about is in crisis or would like behavioral health resources or support, please call the Access and Crisis Line at (888) 724-7240 (24 hours a day, 7 days a week). Calls are answered by experienced counselors, with assistance available in over 150 languages.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240826.14.40.44"}