{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bivalent COVID Boosters Approved, Available for 6 Months and Older", "description": "Bivalent COVID-19 vaccination boosters are now approved and available in San Diego County for children as young as six months of age. The County Health and Human Services Agency is urging parents to protect their children, and themselves, by getting vaccinated with the new booster. ", "datePublished": "2022-12-15T17:16:45-08:00", "url": "https://www.countynewscenter.com/bivalent-covid-boosters-approved-available-for-6-months-and-older/", "keywords": ["health", "coronavirus", "covid-19", "flu", "influenza"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-12-15T17:16:45-08:00", "articleType": "article", "articleContent": "\nBivalent COVID-19 vaccination boosters are now approved and available in San Diego County for children as young as six months of age. The County Health and Human Services Agency is urging parents to protect their children, and themselves, by getting vaccinated with the new booster.\nThe Federal Drug Administration (FDA) has expanded the emergency use of the updated Pfizer and Moderna bivalent booster vaccines for children as young as six months. The FDA previously expanded availability to include 5- to 11-year-olds in October. The Centers for Disease Control and Prevention and California Department of Public Health quickly recommended vaccinations for young children after the FDA approval.\n“We can now provide additional protection for children as young as six months of age from COVID-19,” said County Public Health Officer Wilma J. Wooten, M.D., M.P.H.  “This is especially important with the high incidence of COVID-19 in our community. Please take advantage and have your children vaccinated to protect them and the rest of your family.”\nCounty residents continue to deal with a triple threat of respiratory diseases this winter season, from COVID-19 to the flu to respiratory syncytial virus (RSV). Public Health officials still strongly urge people to get vaccinated for both COVID-19 and the flu.\nThe bivalent COVID-19 booster and flu vaccinations are separate shots, but they can be given at the same visit. They effectively decrease the chances of getting infected, being hospitalized, or dying from the separate viruses that each vaccine targets. Boosters are available through healthcare providers and at participating pharmacies. Parents can visit the state’s My Turn website to schedule an appointment.\nCounty of San Diego Health and Human Services Agency began offering boosters for children as early as six months age today. Booster dose availability is listed on the County’s COVID-19 vaccinations schedule webpage.\nThe updated boosters were designed to protect individuals from the worst outcomes of COVID-19, including hospitalization and death. Everyone six months of age and older who has had their primary vaccination series is eligible to get the updated booster two months following any COVID vaccine or booster dose.\nCounty officials also recommend wearing a mask if you are able, particularly during indoor public gatherings, to protect yourself and those around you.\nIn addition to vaccination and masking, San Diegans can take a number of other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include:\n\nCleaning hands thoroughly and often;\nStaying away from sick people;\nStaying home and avoiding contact with others when sick;\nHome testing when exposed or when ill; Regularly cleaning commonly touched surfaces.\n\nFederal Government Makes Free At-home Tests Available Again:\nThe White House has moved to make free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County of San Diego COVID-19 testing webpage.\nCOVID-19 Vaccination Progress:\n\nClose to 2.69 million or 80.4% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 474,245 or 19% of 2,494,254 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine. \n\nCOVID-19 Deaths:\n\n24 additional deaths were reported since the last report on Dec. 8, 2022. The region’s total is 5,608.\nOf the 24 additional deaths, 14 were women and 10 were men. They died between Jan. 8, 2022, and Dec. 6, 2022. Nine of the newly reported deaths occurred in the past two weeks.\n12 of the people who died were 80 years or older, four were in their 70s, two were in their 60s, five were in their 50s and one was in their 20s.\n15 of these people had been vaccinated and nine had not received any COVID-19 vaccines.\n21 had underlying medical conditions. Three had no underlying medical conditions.\n\nCOVID-19 Cases, Case Rates and Testing:\n\n4,821 COVID-19 cases were reported to the County in the past seven days (Dec. 6, 2022, to Dec. 12, 2022). The region’s total is now 952,752.\nThe 4,821 cases reported in the past week were higher compared to the 5,649 infections identified the previous week (Nov. 29, 2022, to Dec. 5, 2022).\n6,197 tests were reported to the County on Dec. 10, and the percentage of new positive cases was 10.1% (Data through Dec. 10).\nThe 14-day rolling percentage of positive cases, among tests reported through Dec. 10, is 10.1%.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report  weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Dec. 10, 2022, the report shows the following:\n\nSeven additional flu deaths; the season’s total is now 20.\nFour of the additional flu deaths were women and three were men. They died between Dec. 1, 2022, and Dec. 6, 2022.\nFour of them had received a flu shot this season and three had not.\nAll had underlying medical conditions. One of the newly reported deaths was coinfected with COVID-19.\nEmergency department visits for influenza-like illness: 7% of all visits (compared with 10% the previous week).\nLab-confirmed influenza cases for the week: 1,603 (compared to 2,600 the previous week).\nTotal lab-confirmed cases to date: 17,182 (compared to 696 at the same time last season and an 815 prior 5-year average during the same week).\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221215.17.16.45"}