{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans to Celebrate Their Sobriety with Virtual ‘Recovery Happens’ Event", "description": "San Diegans with substance use disorders will get to celebrate their recovery or find inspiration and resources to begin their journey at the County’s annual Recovery Happens event.", "datePublished": "2021-09-09T11:14:48-07:00", "url": "https://www.countynewscenter.com/san-diegans-to-celebrate-their-sobriety-with-virtual-recovery-happens-event/", "keywords": ["health", "recovery happens", "sobriety", "substance use disorder"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-09T11:38:36-07:00", "articleType": "article", "articleContent": "\nSan Diegans with substance use disorders will get to celebrate their recovery or find inspiration and resources to begin their journey at the County’s annual Recovery Happens event.\nHundreds of people are expected to attend the celebration which will be virtual given the ongoing COVID-19 pandemic.\nRecovery Happens, hosted by the County Health and Human Services Agency (HHSA), is a free, family-friendly event, and will take place from 10:00 to 11:30 a.m. Saturday, Sept. 18.\n“We host this annual event to celebrate San Diegans in recovery and the people who support them,” said Luke Bergmann, director of HHSA Behavioral Health Services. “Prevention works, treatment is effective, and people can and do recover.”\nNow in its 31st year, Recovery Happens is celebrated every September during National Recovery Month. The event will feature inspirational speakers and performers celebrating those in recovery – whether the journey has only been a few days or many years.\nThere will also be a virtual resource fair where attendees can connect to an array of services such as education and employment support, veterans’ services, financial and legal services, prevention and treatment information, community resources and more.\nOver the past year, the stress and isolation caused by the COVID-19 pandemic have presented unique challenges and stressors for people in recovery and those with a substance use disorder. Despite immense challenges, behavioral health treatment services are now more widely available than ever before. In an effort to keep the community connected to resources and support networks, the County has leveraged technology and is using telehealth to maintain a virtual presence and meet individuals where they are. All San Diegans are invited to attend this inspirational, virtual community event.\nBehavioral health is an essential part of overall health and wellness and is a part of Live Well San Diego, the County’s vision to improve the health and safety of all area residents.\nSan Diegans with substance use disorders or experiencing a mental health issue are encouraged to seek help by calling the County’s Access and Crisis Line at (888) 724-7240 or 2-1-1 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210909.11.14.48"}