{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Applications Open August 29 for County Rental Assistance Units in Three Affordable Housing Developments", "description": "The County’s Housing and Community Development Services (HCDS) is opening a waitlist for renters who are interested in living in three new housing developments with dedicated units supporting seniors, low-income families and disabled adults experiencing homelessness.  ", "datePublished": "2024-08-14T08:44:29-07:00", "url": "https://www.countynewscenter.com/applications-open-august-29-for-county-rental-assistance-units-in-three-affordable-housing-developments/", "keywords": ["housing", "hcds", "housing"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-08-14T08:44:29-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Housing and Community Development Services (HCDS) is opening a waitlist for renters who are interested in living in three new housing developments with dedicated units supporting seniors, low-income families and disabled adults experiencing homelessness.  \nThese units are supported by Project-Based Housing Choice Voucher (PBV) rental assistance. Eligible applicants will be selected from the waitlist and, if approved by the landlord, would pay an affordable rent that is equal to approximately 30% of their income. \nStarting Thursday, August 29 at 7:30 a.m., applications will become available and can be submitted online at www.sdhcd.org. Applications also will be accepted in person at the HCDS office, which will open at 7:30 a.m. and have copies available, or by calling 858-694-4801. \n“County Project Based Vouchers spur the development of much needed affordable housing in the region and are an important way the County supports the housing needs of vulnerable groups like the elderly and disabled,” said David Estrella, director of HCDS.  \nAdvance public notices are posted on HCDS’s website, local newspapers, social media, through email blasts and flyers distributed to County partners and community centers. \nThe waitlists will open for the following Project-Based Voucher developments. \nSanta Fe Senior Village \n\n53 furnished new, unoccupied units, a portion of the units will be filled through the waitlist and a portion through partner service provider referrals. \nHousing for seniors aged 62 and older \n414-428 N. Santa Fe Ave, Vista \n\nEstrella \n\n96 new, unoccupied units  \nHousing for low-income families, with 24 allocated to project-based vouchers \n604 Richmar Ave, San Marcos \n\nBreezewood \n\n23 project-based voucher units within an existing building that is currently occupied. This waitlist will be for future vacancies at the development.   \nHousing for disabled adults experiencing homelessness and low-income families \n1560 S. Escondido Blvd, Escondido \n\nThe need for affordable housing far outweighs the resources available, making a waitlist necessary in many rental assistance programs. The County is establishing waitlists to fill current and future vacancies at these sites. \nAll applicants will be selected from the HCDS’s waiting lists, following federal housing policies and program criteria. Please visit www.sdhcd.org for more information on eligibility requirements and services provided at each development. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240814.08.44.29"}