{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Awarded $12.4 million to Establish New Recuperative Beds", "description": "County Behavioral Health Services has been awarded $12.4 million in state funding for bridge housing. The funds will be used to create 49 new recuperative care beds for people who are experiencing homelessness and have a behavioral health condition. ", "datePublished": "2024-07-30T14:55:54-07:00", "url": "https://www.countynewscenter.com/county-awarded-12-4-million-to-establish-new-recuperative-beds/", "keywords": ["health", "behavioral health", "luke bergmann", "prop 1"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-07-30T14:55:54-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Behavioral Health Services has been awarded $12.4 million in state funding for bridge housing. The funds will be used to create 49 new recuperative care beds for people who are experiencing homelessness and have a behavioral health condition. \nThe award was part of a series of competitive grants issued by the California Department of Health Care Services as part of its Behavioral Health Bridge Housing funding.  \nThe new beds will be located both within a County-owned facility and in community-based providers that contract with the County. \n“Receiving the full amount requested shows the County and Board of Supervisors are fully engaged in addressing the critical housing and crisis service needs of those with behavioral health conditions,” said Chairwoman Nora Vargas. “Our progress remains steady and meaningful in our commitment to serve our underinvested communities and I want to thank the state for granting us the full amount requested.” \nThe money will be used for both operating and infrastructure startup costs to provide short-term recuperative care services for people experiencing homelessness with behavioral health conditions. \n“With recent policy shifts driven by Proposition 1 and looming changes to behavioral health conservatorship, this service will be especially important,” said Dr. Luke Bergmann, Behavioral Health Services director. “These recuperative care beds, co-located with substance use disorder treatment, will improve access to care for those in greatest need.” \nThis strategy will allow people to continue to receive care and support services in a stable location following release from hospitals, crisis stabilization units, jails and institutions in situation where they are unable to recover while living unhoused and the service is not eligible or available through existing federal, state, or county funds. \nCounty behavioral health agencies that had signed contracts for the first round of Behavioral Bridge Housing funding by April 10, 2024 were eligible to apply for this additional round of funding.  \nThe San Diego County Board of Supervisors a year ago accepted $44.3 million from this program, with the funding primarily dedicated to new board and care payments to supplement funds for Medi-Cal clients and help them meet escalating board and care rent costs.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240730.14.55.54"}