{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Pasqual Academy Celebrates 20th Anniversary with Graduation Ceremony for Foster Youth", "description": "It was all pomp and circumstance at San Pasqual Academy on a recent morning as 12 students celebrated their graduation day.", "datePublished": "2021-06-18T10:12:07-07:00", "url": "https://www.countynewscenter.com/san-pasqual-academy-celebrates-20th-anniversary-with-graduation-ceremony-for-foster-youth/", "keywords": ["families", "foster youth", "graduation", "san pasqual academy"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-06-18T10:12:07-07:00", "articleType": "article", "articleContent": "\nIt was all pomp and circumstance at San Pasqual Academy (SPA) on a recent morning as 12 students celebrated their graduation day. SPA is the first-in-the-nation residential educational foster academy, and 2021 marks the 20th anniversary of the campus.\nDesigned specifically for foster youth, SPA serves as a placement option for dependents of the Juvenile Court between the ages of 12 and 17. The campus also provides a home to non-minor dependents up to 19 years old.\nThe campus has been home to Eman Mansour-Ponce since the fall of 2018. When she arrived at SPA, she says she had a 1.19 GPA and was ready to drop out of high school.\nFast forward two and a half years and the 18-year-old is now a high school graduate with a 3.0 GPA. She is headed to San Francisco State University in the fall.\n“When I got to SPA, I received the support and tools I needed and that motivated me to set better goals and apply myself academically,” said Mansour-Ponce.\nSPA offers a comprehensive support system for its students, including an individualized academic plan, work readiness training, therapeutic services, and extracurricular activities, like clubs and sports.\nMansour-Ponce got involved in a wide variety of extracurricular activities, including basketball and softball. She credits these activities for allowing her to discover herself.\n“Before I came to SPA I was never able to just be a kid and do the things I enjoy,” Mansour-Ponce said. “My time at the academy really opened my eyes to what’s out there and made me realize that I can do whatever I set my mind to.”\nMansour-Ponce is excited to head to college in the fall but is leaving the academy with mixed feelings.\n“My SPA community has become my family and I am sad to leave it all behind,” Mansour-Ponce said. “But this is my opportunity to head out into the world on my own and prove myself and I’m grateful SPA helped me get to where I am today.”\nSPA is a public-private partnership between the County of San Diego, New Alternatives, Inc., San Diego County Office of Education, and Access, Inc. Since SPA was founded, more than 425 students have graduated from the on-site high school and over 120 of them have enrolled in four-year universities.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210618.10.12.07"}