{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Intensifying COVID-19 Outreach to Latino Communities", "description": "The County is intensifying its outreach efforts to Latinos across the region because they are carrying a bigger burden of COVID-19 compared to other groups.", "datePublished": "2020-07-21T10:31:38-07:00", "url": "https://www.countynewscenter.com/county-intensifying-covid-19-outreach-to-latino-communities/", "keywords": ["health", "coronavirus", "covid-19", "latinos", "south bay", "testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-21T10:41:34-07:00", "articleType": "article", "articleContent": "\nThe County is intensifying its outreach efforts to Latinos across the region because they are carrying a bigger burden of COVID-19 compared to other groups.\nCounty health officials are greatly concerned about the disproportionate impact the virus is having in Latino communities. They are responding to this health inequity by ramping up education and outreach to help address systemic barriers that are contributing to Latinos being more severely impacted by COVID-19.\nThe County has launched a new TV, radio, online and signage campaign describing protective measures and community resources. The campaign, which will include an emphasis on a youth audience, started this week.\nDigital ads in Spanish and English will start running this week.\nThe campaign comes on the heels of commercials on three of the most listened-to Spanish radio stations in the region. The two ads encouraged Latinos to get tested for the novel coronavirus and to answer the call when a County disease investigator or contact tracer calls them.\n\n“It’s important that we continue to encourage Latinos and all San Diegans to take preventive measures to slow the spread of COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We all have a role to play to protect ourselves and others, especially people who are more vulnerable to the virus.”\n\nDr. Wilma Wooten, County Public Health Officer.\nThe two campaigns supplement existing County outreach efforts that have been running since early in the pandemic when it became apparent through data that the virus was disproportionately impacting Latinos and other communities of color.\nSince the beginning the County has made outreach materials in English and Spanish, as well as multiple other languages. The County’s initial public awareness campaign also included TV, radio and online ads in Spanish and focused on getting San Diegans to, first, stay at home and later to stay healthy by wearing a face covering, maintaining physical distance and continuing taking other preventative measures.\nThe County coronavirus site, www.coronavirus-sd.com, has a Spanish translation feature, as well as the County News Center website where all of the updates and actions from local health officials are being published.\nThrough an agreement with the local Univision affiliate, the County’s media briefings are being interpreted live into Spanish. You can watch them online.\nLatinos and COVID-19\nSince the beginning of the pandemic, it became clear the novel coronavirus was having a more severe impact among Latinos, especially in South Bay communities.\n\nTo date, of the more than 24,000 COVID-19 cases with known race/ethnicity, about 60% are Hispanics. Latinos make up about 34% of the local population.\n\nCounty Health and Human Services Agency (HHSA) data also shows the case rate for Latinos is about 1,045 people per every 100,000 residents. The only other group with a higher infection rate is Native Hawaiian/Pacific Islanders with about 1,146 people testing positive per every 100,000 residents. Next are Black or African Americans with a rate of 522.\nIn comparison, white San Diegans have case rate of about 320 per 100,000 and represent 38% of all the cases.\nMore COVID-19 deaths are also being reported in the Latino community. Of the nearly 480 deaths, about 45% were Latinos. They are followed by whites at about 38% and Asians with 12%.\nThe County and its partners are examining the reasons for the disproportionality. One of the reasons supported by data from the San Diego Association of Governments points to Latinos being more likely to occupy high-contact professions such as essential or frontline workers who have continued to work during the pandemic and do not have the option of working remotely. Other reasons include broader social determinants of health that play out not only with COVID-19 outcomes but across other health outcomes.\nTesting, Tracing and Treating\nTo slow the spread of the virus, the County has expanded testing throughout the region, especially in the South Bay. Currently, more than 50% of all testing is being done in this region.\nThe County opened its newest COVID-19 testing site in Imperial Beach last week. This new location brings the total number to six testing sites in South County and is part of the County’s South Bay Saturation strategy. Additional testing sites are located in San Ysidro, Chula Vista (two) and National City (two).\nBarbara Jimenez is joined by HHSA Director Nick Macchione at the launch of a testing site in Imperial Beach.\nThe County has also increased its contact tracing capabilities and now has more than 500 disease investigators and contact tracers who are calling people who tested positive for COVID-19 and their close contacts so that they place themselves in isolation or self-quarantine. Nearly 100 more case investigators will come on board this week and the County will be hiring another 200 from the more than 2,300 job applications it recently received.\nIn collaboration with San Diego State University, the County is deploying about 100 specially trained community health workers and public health students as tracers under the promotora model. They will help perform contact tracing in underserved communities.\nTracers provide information, monitor the health of close contacts of positive cases and encourage them to seek care if they develop severe symptoms such as difficulty breathing.\nThe County has also been working with community and faith organizations, as well as regional elected officials, to share information on testing, tracing and treatment resources that is available in our county.\n\n“We’ve not only expanded our testing, but we’ve also increased our contact tracing in the region,” said Barbara Jiménez, director for the Central and South regions of the County Health and Human Services Agency.\n\nJiménez has been spearheading the County’s outreach efforts in South Bay communities and has been working with city mayors and many other partners to get prevention, testing and tracing messages to area residents.\n“We all need to follow the health prevention messages we’ve been promoting on preventing the spread of COVID-19. Let’s take care of ourselves, our families and our community,” Jiménez said.\nSan Diegans wishing to get a COVID-19 test can do it by calling their healthcare provider, especially if they have symptoms. People without a medical provider can call 2-1-1 to get a reference.\nTesting appointments can be made by calling 2-1-1 or online at 211sandiego.org.\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200721.10.31.38"}