{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Applications Open for Second Round of Equity Impact Grant Program", "description": "The County’s Office of Equity and Racial Justice and the Nonprofit Institute at the University of San Diego have opened the second round of funding for the Equity Impact Grant program.", "datePublished": "2024-07-22T13:15:25-07:00", "url": "https://www.countynewscenter.com/applications-open-for-second-round-of-equity-impact-grant-program/", "keywords": ["government", "equity impact grant program", "grassroots", "nonprofit", "oerj", "office of equity and racial justice", "small business"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-07-22T13:15:25-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Office of Equity and Racial Justice (OERJ) and the Nonprofit Institute at the University of San Diego (NPI) have opened the second round of funding for the Equity Impact Grant (EIG) program. \nOERJ and NPI developed the program to address the challenges that organizations face when applying for government contracts and philanthropic funding. These challenges are especially felt by small, grassroots organizations led by people of color.   \nThe program provides organizations with general operating funds, tailored coaching and capacity-building support. \nIn April, the County announced the first group of Equity Impact Grant recipients. \nTen additional San Diego-based social impact organizations will receive a grant of $100,000 in general operating funds. They will also receive workshops and coaching from NPI on topics like: \n\nLeadership. \nNonprofit governance. \nSocial change and innovation. \nFundraising. \nPower-building. \nCollective Impact. \nOrganizational resiliency. \n\nThe program is designed for organizations with fewer than five employees and/or operating expenses of less than $500,000. \n“The overwhelming number of applications we received is a testament to the remarkable work being done,” said Taryell Simmons, OERJ interim director. “This Equity Impact Grant initiative marks a significant milestone in reshaping how we support these exceptional nonprofits, ultimately making a profound difference in our county.”  \nThe EIG program seeks organizations that are addressing inequalities and forms of systemic marginalization in the following categories: \n\nEducation and youth empowerment (early childhood through higher/continuing education).   \nCivic engagement and movement building.    \nArts, narrative change, and culture. \nHousing and community development.  \nRestorative justice and alternatives to incarceration. \nHealth and healing. \nWealth building, workforce, and economic development.   \nFood systems and environmental justice.\n\nApplications are open from July 22 to August 23, with award announcements scheduled for November. \nOERJ and NPI will host three virtual information sessions during the application period. \nFor more information, visit the Equity Impact Grant Program website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240722.13.15.25"}