{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, State, Labor Leaders Celebrate Workers, Give Wage Theft Progress Report", "description": "More wage theft victims in San Diego County are getting the pay they’ve earned. County, state and labor leaders delivered that message as they gathered to celebrate workers, and report advances on addressing wage theft.  ", "datePublished": "2025-03-26T16:56:24-07:00", "url": "https://www.countynewscenter.com/county-state-labor-leaders-celebrate-workers-give-wage-theft-progress-report/", "keywords": ["government", "brenden butler", "d.a.", "d3", "district attorney summer stephan", "fgg", "office of labor standards and enforcement", "olse", "supervisor terra lawson-remer", "week of action"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-03-26T16:56:24-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesMore wage theft victims in San Diego County are getting the pay they’ve earned.\nCounty, state and labor leaders delivered that message as they gathered to celebrate workers, and report advances on addressing wage theft.\nWednesday’s breakfast event took place at the Employee Rights Center as part of a Week of Action honoring labor rights activist César Chávez.\nWorkers in the region lose nearly $6 million every year to unscrupulous employers.\nCounty Supervisor Terra Lawson-Remer told attendees too many workers are paid poverty wages, see their tips skimmed, are denied overtime or their pay. Justice-impacted workers who have paid their debt and want self-sufficiency aren’t given a fair chance at employment.\n“It’s not just unfair and it’s not just indecent,” said Lawson-Remer. “It makes it harder for workers to take care of their families, it makes it harder for honest employees to compete, and it’s illegal.”\nOne of the newest efforts to hold employers accountable is the Workers’ Rights Enforcement Program. It gives the County the authority to prosecute employers who are engaging in unlawful labor practices.\n“Since August, the Office of Labor Standards and Enforcement has handled over more than 400 inquiries related to wage theft and workplace violations,” said County Ethics, Compliance and Labor Standards Director Branden Butler. “Our office is currently investigating 40 cases with the goal of recovering unpaid wages.”\nAnd that is just one County program designed to help people who have lost their pay.\nThe Good Faith Restaurant Program recovered more than $106,000 in lost wages for restaurant workers.\nThe Workplace Justice Fund helped 34 applicants receive financial relief totaling $100,000 last year. This year, the County expects to help another 80 people. The fund helps workers who won legal judgments for lost wages but are still waiting for the money from their employers.\nThe DA’s Workplace Justice Unit was one of the first in California to investigate and prosecute criminal wage theft cases.\n“We continue to file case after case. I think we’re up to about 16 cases now and they’re growing, of felony wage theft cases, recovering thousands of dollars to employees who need that money to put bigger shoes on their kids, to put food on the table,” said District Attorney Summer Stephan.\n“In California, we have some of the strongest laws. These laws have not changed,” said State Labor Commissioner Lilia García-Brower. “A person labors, and they are to labor under certain conditions. And if they are not laboring under those conditions, then we have an obligation to hold them accountable.”\nThe County regularly works with both the State Department of Industrial Relations and the Employee Rights Center, and together they get results.\n“It’s the most important thing that we can do, is come together as a group rather than think you’re facing this by yourself or that there is no one out there who is aware or wants to help people confront those issues,” said Employee Rights Center Director Alor Calderón. “So, community and the legacy of César Chávez is our main message this week.”\nEmployers and workers who want more information about workers’ rights, wage theft or how to file a complaint, can visit the Office of Ethics, Compliance and Labor Standards website or call the office at 619-531-5129.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250326.16.56.24"}