{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Gov. Newsom Tours Vaccination Super Station at Petco Park", "description": "Gov. Gavin Newsom was in San Diego today to tour the County’s COVID-19 Vaccination Super Station at Petco Park.", "datePublished": "2021-02-08T18:16:44-08:00", "url": "https://www.countynewscenter.com/gov-newsom-tours-vaccination-super-station-at-petco-park/", "keywords": ["health", "coronavirus", "covid-19", "gov. newsom", "update", "vaccination super station"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-02-08T19:51:05-08:00", "articleType": "article", "articleContent": "\nGov. Gavin Newsom was in San Diego today to tour the County’s COVID-19 Vaccination Super Station at Petco Park. The site was the first of its kind in the state and the governor lauded the County and its partners for their efforts in vaccinating more than 100,000 San Diegans at the site since it opened last month.\nThe governor said the Vaccination Super Station at Petco Park helped inspire jurisdictions across the state to initiate similar large-scale vaccination efforts.\nLocally, the County has added three additional Vaccination Super Stations and more than a dozen vaccine PODS since Petco Park became operational as a vaccination site. Together, medical professionals at these sites have administered about a half million COVID-19 vaccines to San Diegans eligible to be vaccinated.\nThe operation in the Tailgate Lot at Petco Park is the result of a partnership between the County, UC San Diego Health, the San Diego Padres and the City of San Diego which owns the property. Speakers from all entities attended a press conference this morning to join the governor in talking about the region’s vaccination efforts.\nSpeakers included Gov. Newsom, County Board of Supervisors Chair Nathan Fletcher; San Diego Mayor Todd Gloria; Wilma J. Wooten, M.D., M.P.H.; County public health officer; and Erik Greupner, Chief Executive Officer, San Diego Padres. Highlights from this morning’s remarks are included in the above video.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 42.5 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 10.5%, placing the County in Tier 1 or the Purple Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 14% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers, but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 9.\n\nCommunity Setting Outbreaks:\n\nEight community outbreaks were confirmed Feb. 7: two in business settings, two in community-based organization settings, two in retail settings, one in a fitness/gym setting, and one in a government setting.\n10 new community outbreaks were confirmed on Feb. 6: six in business settings, one in a community-based organization setting, one in a construction setting, one in a fitness/gym setting and one in a retail setting.\n10 new community outbreaks were confirmed on Feb. 5: seven in business settings, two in healthcare settings and one in a daycare/preschool/childcare setting.\nIn the past seven days (Feb. 1 through Feb 7), 70 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n10,523 tests were reported to the County on Feb. 7, and the percentage of new positive cases was 7%.\nThe 14-day rolling average percentage of positive cases is 7.0%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 18,475.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel are also urged to get tested.\n\nCases, Hospitalizations and ICU Admissions:\n\n698 cases were reported to the County on Feb. 7. The region’s total is now 247,262.\n10,765 or 4.4% of all cases have required hospitalization.\n1,511 or 0.6% of all cases and 14.0% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported on Feb. 7. The region’s total is 2,821.\nNine COVID-19 deaths were reported Feb. 6. Two women and seven men died between Jan. 29 and Feb. 4.\nOf the nine deaths reported that day, two people who passed away were 80 years or older, one person was in their 70s, two people were in their 60s, three people were in their 50s and one person was in their 40s.\nEight had underlying medical conditions and one did not.\nThirty-five COVID-19 deaths were reported Feb. 5. Fifteen women and 20 men died between Dec. 30 and Feb. 5.\nOf the 35 new deaths reported that day, 15 people who passed away were 80 years or older, eight people were in their 70s, nine people were in their 60s and three people were in their 50s.\nThirty-three had underlying medical conditions and two had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210208.18.16.44"}