{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Resolve to Give Yourself the Gift of Health in 2023 ", "description": "The County Health and Human Services Agency is encouraging San Diegans to resolve to be healthy in 2023 and get vaccinated against COVID-19 and the flu. ", "datePublished": "2022-12-29T16:20:26-08:00", "url": "https://www.countynewscenter.com/resolve-to-give-yourself-the-gift-of-health-in-2023/", "keywords": ["health", "coronavirus", "covid-19", "flu", "respiratory virus surveillance report", "rsv"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-12-29T16:20:26-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is encouraging San Diegans to resolve to be healthy in 2023 and get vaccinated against COVID-19 and the flu. \nBoth viruses are circulating at high levels this winter. Vaccinations offer the best protection against getting ill and both the COVID-19 vaccines and bivalent boosters, as well as the flu shot are widely available at medical providers and local pharmacies. \n“Start the new year off right and protect yourself and others from COVID-19 and seasonal illnesses,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Make a New Year’s resolution to stay healthy, get updated on your vaccines and avoid gatherings if you are ill.” \nCOVID-19 vaccines, including bivalent boosters, and flu vaccines are widely available at local medical providers and pharmacies. The County will also be offering vaccinations throughout the holidays at its vaccination sites. Check online for the days and hours sites will be open. \nPreventive Measures \nIn addition to vaccination and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include: \n\nCleaning hands thoroughly and often. \nStaying away from sick people. \nWearing a facial covering, especially in crowded indoor settings. \nRegularly cleaning commonly touched surfaces.\nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can order one pack of four free tests through the U.S. Postal Service.  For more information about testing, go to the County of San Diego COVID-19 testing webpage. \n\nCOVID-19 Vaccination Progress:\n\nMore than 2.69 million or 80.5% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBivalent boosters administered: 510,895 or 20.5% of 2,495,435 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nCOVID-19 Deaths:\n\n15 additional deaths were reported since the last report on Dec. 22, 2022. The region’s total is 5,641.\nOf the 15 additional deaths, six were women and nine were men. They died between Dec. 25, 2021, and Dec. 19, 2022. Nine of the newly reported deaths occurred in the past two weeks.\n11 of the people who died were 80 or older, two were in their 70s, one was in their 60s and one was in their 50s.\nEight of these people had been vaccinated and seven had not received any COVID-19 vaccines.\n13 had underlying medical conditions and two did not have any underlying medical conditions.\n\nCOVID-19 Cases, Case Rates and Testing:\n\n4,537 COVID-19 cases were reported to the County in the past seven days (Dec. 20, 2022, to Dec. 26, 2022). The region’s total is now 962,312.\nThe 4,537 cases reported in the past week were lower compared to the 4,764 infections identified the previous week (Dec. 13, 2022 through Dec. 19, 2022).\n4,200 tests were reported to the County on Dec. 24, and the percentage of new positive cases was 14.9% (Data through Dec. 24).\nThe 14-day rolling percentage of positive cases, among tests reported through Dec. 24, is 10.6 %.\n\nInfluenza Activity\nThe County Health and Human Services Agency now publishes the Respiratory Virus Surveillance Report weekly. The report is published each Thursday and tracks key respiratory illness indicators, including flu cases and deaths.\nFor the week ending Dec. 24, 2022, the report shows the following:\n\nTwo additional flu deaths; the season’s total is now 29.\nBoth of the additional flu deaths were women and both died on Dec. 20, 2022.\nOne of them had received a flu shot this season and the other had not.\nBoth of them had underlying medical conditions and none of the newly reported deaths were coinfected with COVID-19.\nEmergency department visits for influenza-like illness: 6% of all visits (compared with 6% the previous week).\nLab-confirmed influenza cases for the week: 906 (compared to 1,155 the previous week).\nTotal lab-confirmed cases to date: 19,372 (compared to 1,093 at the same time last season and a 1,982 prior 5-year average during the same week).\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221229.16.20.26"}