{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Public Health Services Live Well on Wheels Bus Hits the Road", "description": "Public Health Services has a new mobile resource to help deliver health services and information directly to local communities. The County’s latest Live Well on Wheels (LWoW) bus made its debut this month and will soon hit the road.", "datePublished": "2025-04-17T13:56:51-07:00", "url": "https://www.countynewscenter.com/new-public-health-services-live-well-on-wheels-bus-hits-the-road/", "keywords": ["health", "community", "disease testing", "live wow bus", "mobile vaccinations", "outreach"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-04-18T15:28:51-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesPublic Health Services has a new mobile resource to help deliver health services and information directly to local communities.\nThe County’s latest Live Well on Wheels (Live WoW) bus made its debut this month and will soon hit the road. It expands the fleet of two existing Live WoWs and a recently added HIV, STD, and Hepatitis Live WoW bringing the total number to four mobile vehicles available for use.\nThe nearly 12-foot-long Winnebago Freightliner will serve as a rolling public health resource, expanding the County’s ability to meet people where they are and offer a wide variety of programs and services to individuals right in their own neighborhoods.\nLive WoWs can be outfitted to meet the needs of the community. Common uses are for delivering outreach for public benefits, providing educational health information, and giving vaccinations.\nThe new Live WoW will have a special focus on public health. It can be used to test for communicable diseases, like Hepatitis A, dengue, and food-borne illness. It can support large-scale site investigations for tuberculosis and serve as the command-and-control vehicle for related testing.\nThe newest Live WoW also can be used for dental services, such as screenings and tooth sealants. Other potential uses include emergency public health preparedness response training. The Live WoW would also be available to respond to natural or man-made disasters.\n        \nSince the first Live WoW debuted in July 2021, the mobile offices have supported over 1,400 community events across the region providing more than 117,000 service interactions, including almost 16,000 COVID-19, flu, and general vaccinations.\nThe County’s Live Well on Wheels mobile vehicles are dispatched by the County and made available to the community for events.\nInformation on how to request a LWoW bus is available online.   \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250417.13.56.51"}