{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "4S Ranch Community Celebrates New Four Gee County Park", "description": "The San Diego County Department of Parks and Recreation opened Four Gee County Park to an eager crowd of close to 200 people on Saturday in 4S Ranch.", "datePublished": "2024-05-13T12:08:03-07:00", "url": "https://www.countynewscenter.com/4s-ranch-community-celebrates-new-four-gee-county-park/", "keywords": ["parks and rec", "county parks and recreation", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-05-14T08:27:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe San Diego County Department of Parks and Recreation opened Four Gee County Park to an eager crowd of close to 200 people on Saturday in 4S Ranch.\nCounty Supervisor Joel Anderson led the celebration and reminded all that “Nothing brings a community together like a park.”\nThe event featured fun activities for families and their pets. Dogs made full use of their portion of the park. Laughter echoed from the playground, chess tables, cornhole and ping-pong tables. Park staff educated and entertained with a “Discovery Table” and a live owl.\nThe park, located at 16964 Four Gee Road, measures over 1 acre and offers a variety of amenities for people of all ages and varying interests to enjoy.\n\nFamilies with kids can enjoy a large, shaded play structure with nearby lawn area. There are also picnic tables, a grill, bike racks, walking paths and a restroom.\nDog owners can take advantage of the fenced, off-leash dog areas and agility course features, along with a drinking fountain that accommodates both dogs and their owners.\nSustainability is at the core of the County’s mission. All plants are drought-tolerant and watered by smart irrigation systems to support sustainability measures. Many of the trees and shrubs are native to the area, to complement existing vegetation and encourage wildlife.\nThe park will be open daily from sunrise to sunset, and both patrolled and maintained by County Parks and Recreation staff who are stationed at nearby 4S Ranch Sports Park.\nFour Gee County Park now helps to enhance the quality of life for both people and pets in San Diego by providing exceptional parks and recreation experiences and by preserving significant natural resources. The total project cost is estimated at $1.9 million.\nTo learn more about department facilities, programs and services, visit sdparks.org.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240513.12.08.03"}