{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Cannabis Program to Address Inequity in Unincorporated Area", "description": "The County adopted a new equity program Wednesday that helps people negatively impacted by the War on Drugs with cannabis business ownership in the unincorporated area.", "datePublished": "2024-05-01T17:44:41-07:00", "url": "https://www.countynewscenter.com/new-cannabis-program-to-address-inequity-in-unincorporated-area/", "keywords": ["government", "cannabis", "marijuana", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-05-01T17:51:55-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County adopted a new equity program Wednesday that helps people negatively impacted by the War on Drugs with cannabis business ownership in the unincorporated area.\nIn January 2021, the Board directed County staff to develop a Socially Equitable Cannabis Program that provides fairness in business ownership in the regulated cannabis market by reducing the barriers to entry.\nAs part of the wider proposed Socially Equitable Program, the Social Equity Entrepreneurs Program will help those negatively impacted by criminalization of marijuana participate in the legal cannabis industry.\nQualified applicants who choose not to participate in the cannabis industry but are deserving of some form of benefit can receive help through the Social Equity Beneficiaries Program which includes:\n\nInvestment into Impacted Communities\nBehavioral Health Services\nContinuing Education Assistance\nNon-Cannabis Small Business Grants\nJob Related Assistance\n\nBoth aspects of the program are designed to address the harmful impacts on people of color and communities caused by the War on Drugs (California Cannabis Equity Act).\nThe County worked with consultants to complete a Social Equity Assessment in October 2022 which includes community feedback from listening sessions, interviews, focus groups, and a survey. The assessment helps address the harms caused by cannabis criminalization. In June 2023, the County received $350,000 in grants from the State to help those that apply.\nSince the completion of the assessment and grant award, the Office of Equity and Racial Justice worked with County Counsel to develop the program. People who qualify for the program must meet one of the two criteria tiers:\n\nTier A focuses on people incarcerated for a San Diego cannabis-related crime prior to the passing of Proposition 64 (Control, Regulate and Tax Act – Adult Use of Marijuana)\nTier B focuses on people that have been convicted or arrested for a San Diego cannabis-related crime along with a low-income component.\n\nOnce approved, people who qualify will have an opportunity to receive a permit for sale, distribution or cultivation and receive help with any of the below listed elements:\n\nBusiness and Technical Assistance\nOne-on-One Assistance\nLegal Services\nGrants directly to social equity applicants\nRecord Expungement\n\n“This is a significant first step for our County to address harms that were done to our Community by the County and other government agencies. Although we are excited, we acknowledge that we can and need to do so much more,” said Andrew Strong, Director of the Office of Equity and Racial Justice.\nCounty officials say the program will provide sustainable opportunities for growth by providing support and resources for those who were most harmed by the War on Drugs.\n“I am proud that this program will focus on equity, access, and business opportunities to help rectify the injustices against people of color caused by the many years of failed policies like the War on Drugs,” said Chairwoman Nora Vargas.\nA nine-member group, one appointed by each County supervisor and four more to apply through application process, will assist on shaping the program and provide an annual report back to the Board.\nVisit our new Engage San Diego County platform to learn more about the development of the Cannabis Program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240501.17.44.41"}