{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Emergency Temporary Lodging Application Process Update", "description": "The new County program to provide lodging to families who had their homes damaged in the Jan. 22 flood is now providing safe and secure lodging for more than 400 families from across the County.", "datePublished": "2024-02-22T17:38:15-08:00", "url": "https://www.countynewscenter.com/emergency-temporary-lodging-application-process-update/", "keywords": ["public safety", "disasterassistance.gov", "emergency temporary lodging program", "federal emergency management agency", "fema", "fema helpline at 1-800-621-3362", "individuals and households program", "jan. 22 flood", "local assistance centers"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2024-02-23T14:05:41-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe new County program to provide lodging to families who had their homes damaged in the Jan. 22 flood is now providing safe and secure lodging for more than 400 families from across the County.\nThe Emergency Temporary Lodging Program is a 30-day program initiated on Feb. 10. The program provides support to households who were sheltered by community-based organizations immediately after the storm.\nThe County contacted more than 1,400 households who indicated they had damage to their homes and needed assistance.  Most were identified for the program because they spoke to workers at one of two Local Assistance Centers or filled out a damage assessment survey.\nThe application process for the Emergency Temporary Lodging Program ends at 6 p.m., Friday, Feb. 23. Flood victims who previously applied and have not yet been placed in a room may still be offered temporary accommodations.\nThis week, the Federal Emergency Management Agency (FEMA) issued a Major Disaster Declaration for San Diego County. Anyone impacted by the Jan.22 flooding is encouraged to register for FEMA assistance by visiting disasterassistance.gov or by calling the FEMA helpline at 1-800-621-3362.\nFEMA can offer help through the Individuals and Households Program. The program provides financial assistance and direct services to eligible individuals and households who were uninsured or underinsured. The financial assistance is intended to help meet basic needs and supplement disaster recovery efforts.\nThe Small Business Administration may also offer low interest loans to households and small businesses impacted by the floods.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240222.17.38.15"}