{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Restrictions Remain in Effect for County Board Meetings", "description": "For a second time, the County Board of Supervisors will cancel Wednesday’s board session and discuss those agenda items during its Tuesday board meeting.", "datePublished": "2020-04-06T13:05:57-07:00", "url": "https://www.countynewscenter.com/restrictions-remain-in-effect-for-county-board-meetings/", "keywords": ["health", "board of supervisors meeting", "clerk of the board", "coronavirus", "covid-19", "facebook", "novel coronavirus", "tele-comments", "teleconference"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-07-10T11:00:40-07:00", "articleType": "article", "articleContent": "\nFor a second time, the County Board of Supervisors will cancel Wednesday’s board session and discuss those agenda items during its Tuesday board meeting.\nDue to COVID-19 and the governor’s March 19 directive for everyone in the State of California to stay home, restrictions on in-person participation at Board of Supervisors meetings will remain in effect and not be allowed for the April 7 meeting.\nThe County will offer residents more ways to watch the meeting online. The meetings are also broadcast on television.\nWatch Online: There may be a 45-second or more delay when viewing the broadcast online, depending on the service and your Internet connection.\n\nAgenda Web Stream (Available live and archived several hours later)\nVimeo Livestream\nCounty YouTube Channel\nFacebook\nTwitter\n\nWatch on TV: The meeting will also be broadcast live on:\n\nCox channel 24 or 19\nSpectrum channel 24 or 85\nCurrently, not available on AT&T U-Verse channel 99\n\nA call-in line is also available to listen to the live Board meeting while it is in session at (619) 531-4716. Additional information is posted on the Clerk of the Board’s website.\nTypically, members of the public can use the eComment service to submit comments on agenda and non-agenda items until the beginning of the meeting. At this time, eComments can also be submitted during the meeting.\nThose who want to participate in the meeting and speak via teleconference must fill out the online Board of Supervisors tele-comments form and submit it by 8:30 a.m. on Tuesday. After submitting the form, you’ll get instructions on how to call in to the meeting to provide your comments.\nLarge groups wishing to comment on a common item are encouraged to submit comments in writing or to identify one spokesperson to join the teleconference on behalf of the group.\nAdditionally, Board members may be attending the meeting via teleconference or phone conference and will conduct business as usual.\nFor more information, visit the Clerk of the Board website or call 619-531-5434.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200406.13.05.57"}