{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Seeks Ways to Expand Opportunities for Local Wineries", "description": "The County is moving forward with a plan to allow wine operations in the unincorporated area opportunities to expand. ", "datePublished": "2024-02-29T13:48:59-08:00", "url": "https://www.countynewscenter.com/board-seeks-ways-to-expand-opportunities-for-local-wineries/", "keywords": ["government", "ordinance", "unincorporated areas", "wineries"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-02-29T13:48:59-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County is moving forward with a plan to allow wine operations in the unincorporated area opportunities to expand. \nThere are currently four types of wineries allowed in agricultural zones governed by the County’s Tiered Winery Ordinance. \nThe streamlined plan considers the wine industry market, zoning and geographic characteristics to find the right lands for wineries.\nThe Board chose from three options on how to move forward. The chosen option offers the fastest way to expand wineries in certain areas, potentially adding between 33,000 to 62,000 wine-friendly acres to the unincorporated area. \nAny official zoning changes for wineries in the unincorporated area will take more than a year. County staff will need to finish a program and conduct further research that will cost about $700,000.\nThe County will develop the new winery ordinance with help from the local wine industry and community members. The goal is to create a path for wineries to expand operations under a streamlined permitting process.\nWineries wishing to expand will still have to prepare site plans and environmental documents for their projects.\nThe four types of wineries currently operating in the unincorporated area include: \n\nWholesale Limited Winery: Small-scale limited production (12,000 gallons), no tasting rooms or on-site sales\n Boutique Winery: Small-scale limited wine production can have tasting rooms and on-site sales.\n Small Winery: Larger scale, tasting rooms, on-site sales, and some events.\n Winery: Largest scale, more flexibility with events and services\n\nThe County will also determine how to allow amplified music at all types of existing wineries as part of an upcoming routine ordinance update.\nAdditional Board of Supervisor hearings will be needed to consider a final program and amend the actual ordinance to support proposed changes.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240229.13.48.59"}