{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County’s 25 Most Remarkable Teens Honored for Accomplishments", "description": "The San Diego County Public Defender’s Office collaborated with the San Diego Public Library to name and recognize the 25 Most Remarkable Teens from around San Diego County at a special ceremony Tuesday.", "datePublished": "2024-11-20T16:34:59-08:00", "url": "https://www.countynewscenter.com/san-diego-countys-25-most-remarkable-teens-honored-for-accomplishments/", "keywords": ["families", "most remarkable teens", "public defender"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-11-20T16:34:59-08:00", "articleType": "article", "articleContent": "\nReading Time:  15 minutesThe San Diego County Public Defender’s Office collaborated with the San Diego Public Library to name and recognize the 25 Most Remarkable Teens from around San Diego County at a special ceremony Tuesday.\nThe 25 teens were selected from 98 nominated by the community for their inspiring contributions and efforts in categories such as community empowerment, activism for the environment, people with disabilities, LGBTQ+ community, innovation in STEM, robotics and technology, science, arts and culture and health advocacy.\nThe program recognizes youth ages 13 to 19 for their accomplishments. Every nominee was interviewed by the San Diego County Public Defender staff and its Youth Council panel. All nominees received a certificate of recognition.\n“Our office is proud to recognize the extraordinary resolve, spirit and achievements of these teens, who can only serve as an inspiration to other youth in San Diego County and other regions. These shining stars are on their way to greater accomplishments in their young lives,” said Public Defender Paul Rodriguez.\nCounty and City officials joined the public defender in presenting the awards at the San Diego Central Library. This is the seventh year the program has honored teens.\nThe 25 Most Remarkable Teens for 2024 are:\n\nAlex Battikha, a senior at Westview High School won in the Robotics category. He is a young innovator dedicated to merging technology with community impact. Alex has a pending patent for a unique robotics project developed with mentors from Johns Hopkins University. He leads his high school robotics engineering club and guided them to a first-place victory at the FIRST Tech Challenge. He is committed to solving real-world issues. Inspired by his grandfather’s health challenges, he developed a HELP button for wheelchair users to easily request assistance. A passionate advocate for environmental issues, Alex co-founded a non-profit focused on water conservation, collaborating with a U.S. senator on legislation to protect water resources, and has an upcoming role as a U.S. delegate at an international environmental conference. Alex envisions a career in environmental engineering where he can integrate robotics and sustainability to make a lasting impact both locally and globally.\n\nArianna Alvarado, a senior at Lincoln High School, won in the Mental Health Advocacy category. She is an inspiring mental health and community advocate with a vision to uplift underserved communities through her work to destigmatize mental health issues and raise awareness of local mental health resources. She will join young leaders from across the nation as a new member of the ACLU National Advocacy Institute to study social justice and advocacy. Her advocacy work includes testifying on policy issues and supporting her peers in navigating challenges with empathy and resilience. Arianna dreams of a career in law, hoping to work in politics to advocate for underserved communities and those who face systemic obstacles. With her sights set on a future of service, Arianna is a role model and beacon of hope for her peers, inspiring them to embrace their potential and work toward a more equitable society.\n\nArya Bosworth, a senior at Poway High School, won in the Tech for Good category. Arya is a powerful advocate for tech accessibility and a role model in the field of STEM education. She founded Mechanical Advantage, a non-profit focused on bringing STEM education to underprivileged areas. She founded the first robotics club at a high school in South San Diego, where she taught classes over Zoom during the pandemic, overcoming significant challenges to help students discover their potential in STEM. Arya’s dedication to promoting tech access extends across borders, teaching robotics to girls in Afghanistan. Her efforts have also raised over $80,000 to support STEM initiatives, ensuring resources for schools and communities in need. Arya serves as the president of her school’s Society of Women Engineers Next club and is the captain of her robotics team.\n\nAva Farr, a junior at Del Lago Academy, won in the Community Healing and Trauma Support category. She is a compassionate leader committed to helping others navigate life’s challenges. Inspired by a friend who struggled with homelessness while transitioning to college, Ava founded One Step with You, a non-profit that provides support and care packages for students facing similar hardships. Ava’s organization involves 30 students across multiple schools, delivering essentials like pillows, blankets and sewing kits to those in need. She has created a network of empathy and support ensuring that vulnerable students feel cared for and seen. Beyond her non-profit, she has initiated peer support groups and organized workshops focused on emotional well-being and resilience within her school community. Ava envisions a future where mental health resources and trauma support are accessible to all and aspires to study psychology or social work.\nElla Aldridge, a junior at the San Diego School of Creative and Performing Arts, won in the Excellence in Creative and Performing Arts category. She is a dedicated musical theatre major and ta confident artist. Her proudest accomplishment to date is the original song she wrote and performed for the Bonitafest Melodrama. The experience of overcoming her shyness to connect with an audience has fueled her passion for theatre as a tool for self-expression and empowerment. She recognizes that she is fortunate to attend a school focused on the arts and wants to ensure other young people have similar opportunities. Ella believes that safe spaces for performance are essential for character development and hopes to bring such spaces to underfunded schools in the future. Ella envisions a future where she uses her talents to create positive change, making her a rising star in the world of performing arts.\nEmma Weibel, a senior at La Jolla High School, won in the Environmental Activism category. Emma wrote a powerful Climate Action Poem in seventh grade that won accolades at the state level. She founded an environmental action club in high school and is a leading voice in the fight for sustainable policies within the school district. Emma is the student lead for the school district’s electrification campaign. She rallied support for a resolution to eliminate fossil fuels in the district, organizing a petition, educating her peers and speaking at board meetings to advocate for clean energy. The resolution was passed unanimously. She is one of 18 youth plaintiffs in a lawsuit seeking to hold the government accountable for its role in climate change. Emma received the prestigious SanDiego350 “Planet’s Choice” Award and the District 77 Environmental Hero Award from Assemblymember Tasha Boerner. With her eyes set on a future in environmental law, Emma is committed to fighting for a sustainable world and inspiring her generation to take meaningful action.\n\nFrahiwot Legess, a senior at Hoover High School, won in the Courage to Overcome Adversity category. She has overcome personal and societal challenges to advocate for inclusion and cultural representation. In 10th grade, Frahiwot’s choice to wear a hijab was a powerful act of self-empowerment and identity, allowing her to embrace her faith and cultural heritage openly and fearlessly, despite facing vocal disapproval from her father. Frahiwot also revitalized the Muslim Student Association at Hoover High, growing its membership and creating a welcoming space for Muslim students to connect and share their experiences. She led efforts to organize inter-school events, bringing together students from various backgrounds to foster awareness and understanding of Muslim culture. She has significantly contributed to creating a more inclusive and supportive environment at her school. Frahiwot plans to study neurobiology, inspired by her younger sister with special needs.\n\nFrances Aguilar, a junior at the Academy of Our Lady of Peace, won in the Disability Activism category. She draws inspiration from her older brother, her best friend, who has cerebral palsy and requires full-time care. She has developed a unique perspective on inclusivity and empathy that she brings into all areas of her life. Frances founded a Best Buddies chapter at her high school to create meaningful friendships between general and special education students. Frances has built a welcoming community, where differences are celebrated and every student feels valued. Beyond her school’s borders, Frances volunteers in transition classrooms at Abraxas High, helping students with community-based skills like using public transportation, grocery shopping and budgeting. Frances envisions a world where empathy and support for people with disabilities are the norm.\n\nGlendy Hernandez Orduna, a senior at Madison High School, won in the Community Empowerment category. As the oldest of four children in a family of immigrants from Mexico, Glendy has embraced her role as a trailblazer, setting an inspiring example for her siblings and peers. She is the founder of the First Gen Scholars Club, an organization that provides support to first-generation students navigating the complexities of college applications and scholarships. Through this initiative, Glendy has helped her peers overcome barriers, empowering them to pursue higher education and achieve their dreams. She is making the most of her parents’ sacrifices, striving to honor the opportunities they have worked hard to provide. Glendy aspires to study law or political science, with hopes of becoming an immigration or criminal justice lawyer to combat injustices she has witnessed and making systemic change possible.\n\nHayden Crocker, a senior at Canyon Crest Academy, won in the Innovation category. He is an ambitious student leader and the co-founder of Go Greenish, a student-led initiative advocating for sustainability in schools. Starting in 2022, Go Greenish has grown into a nationwide movement, with over 500+ student volunteers across 22 school districts. Hayden has raised over $43,000+ for efforts such as recycling, composting, food diversion, and air sensors across schools in San Diego and beyond. A passionate advocate for climate action, Hayden is deeply involved in local policy as a San Dieguito Union High School District Student Board Member and the Chair of the Youth Commission on the Solana Beach Climate Action Commission. Hayden intends to drive change through education, innovation, and collaboration for a more sustainable and equitable future.\nHudson Kim, a senior at Westview High School, won in the STEM Stewardship category. He is known for his dedication to robotics, space exploration and community impact. His passion led to an internship with NASA, where he developed software to aid in wildfire monitoring. Locally, he has built a community around STEM, sharing his knowledge with thousands of young students through summer camps and workshops, raising over $50,000 to support these programs. Hudson recently designed a smart device for a friend who has Spinal Muscular Atrophy, allowing his friend to communicate more easily with his caretakers. An award-winning competitor, Hudson revitalized his school’s robotics team after a challenging start, leading them to victory in the 2024 championships. Hudson sees climate change as his generation’s biggest challenge and hopes to continue developing solutions that benefit both people and the planet.\n\nScreenshot\nIzayah Ringfield, a senior at Chula Vista High School, won in the Community Organizing category. As ASB President, Izayah has transformed his school’s student government into an inclusive platform, ensuring that every voice is heard and every student feels represented. His commitment to civic engagement goes beyond his school’s walls—he is the founder and president of his school’s Black Student Union and has spearheaded numerous voter registration drives, helping register over 1,500 people. His voter outreach work is one of his proudest achievements, allowing him to turn his passion for civic engagement into meaningful action. Izayah is driven by a vision of equal representation and social justice, which he hopes to pursue as a future attorney extending his advocacy beyond Chula Vista to communities across the nation and the world.\n\nJeremy Liew, a junior at Pacific Ridge High School, won in the Social Media Innovation & Creativity category. With aspirations of furthering his impact through social media, Jeremy envisions a future where digital platforms are used to foster support and connection among young people. He founded the non-profit Teenage Handbook, a platform aimed at helping teenagers navigate life’s challenges through articles, videos and podcasts that cover topics ranging from mental health to academic success. His approach has earned him widespread recognition, including from Lady Gaga for his mental health advocacy and a first place win in the UNESCO Youth Multimedia Competition. Jeremy is also a co-host of a popular podcast and a digital storyteller. Jeremy has also completed an internship with NASA, an experience he considers a pivotal achievement.\n\nKenia Cruz Solano, a senior at Gompers Preparatory Academy, won in the Diversity, Equity, and Inclusion (DEI) Advocacy category. She is committed to breaking down cultural and social barriers within her community. Her work includes supporting students from immigrant backgrounds by providing resources and fostering an inclusive environment. Kenia has spearheaded initiatives at her school to address mental health stigmas, particularly within the Latinx community. Inspired by her family experiences and the loss of a cousin to mental health struggles, she launched Be Well Wednesdays at her school, where she promotes open dialogue about mental health. She’s also worked with her school to bring therapy dogs on campus. Her advocacy extends to public policy. She is actively working on legislation to support sexual health resources for marginalized communities and recognizing illiteracy as a national health crisis.\n\nKiera Latulippe, a senior at Valley Center High School, won in the Public Safety Advocacy category. As the lone survivor of a tragic DUI accident that took the lives of her family members, she is determined to make a difference by raising awareness about the dangers of drunk driving. She brought the impactful Every 15 Minutes program to her school, a two-day event sponsored by the California Highway Patrol that educates students about the consequences of impaired driving. Kiera shared her story hoping to prevent similar tragedies in her community. She openly speaks to her peers about her experiences, offering support and inspiration to those who may face their own challenges. Kiera’s advocacy, determination, and leadership make her a remarkable voice for public safety, reminding her community that every effort to save a life is worth it. Her goal is to become an educator like her father.\n\nKimmy Dang, a first-year college student at Yale University, won in the Perseverance category. As a first-generation college student and the eldest of three siblings, Kimmy embraced the role of role model and caretaker after the passing of her father when she was in eighth grade. Kimmy helps her family with tasks like translating and managing paperwork, all while balancing her academic aspirations. She sought out numerous scholarships during high school to fund her college education—  allowing her to attend Yale without financially burdening her mother. She founded a first-generation college club to support other students in navigating the college application and financial aid process and helped many of her classmates achieve college acceptance, fostering a supportive network for future first-generation students. Her resilience shines as she continues to inspire her family and community, proving that circumstances don’t define one’s potential.\n\nKristan Laureta, a senior at Morse High School, won in the LGBTQ+ Activism category. As a proud transgender and Filipina woman, Kristan has taken an active role in championing LGBTQ+ rights within her school and community. Her advocacy includes organizing awareness campaigns and speaking to peers and teachers about the importance of safe spaces for self-expression, especially for those exploring their gender and sexual identities. Kristan uses social media to spread messages of self-acceptance, often posting videos aimed at uplifting school spirit and reminding her peers to persist in their passions. Her own journey through bullying and adversity has made her a resilient voice for others in similar situations. Kristan is committed to creating a future where all youth can feel safe to be themselves. She dreams of becoming an architect, designing spaces where inclusivity is built into every corner.\n\nLeanne Fan, a senior at Westview High School, won in the Scientific Innovation category She is celebrated for her groundbreaking work in the field of biomedical engineering. Her passion for improving healthcare accessibility led her to develop a unique light-therapy technique aimed at accelerating wound healing, an achievement that earned her the Senior Division Grand Award at the Greater San Diego Science and Engineering Fair. This led to an invitation from NASA to expand her research into the effects of microgravity on wound healing, exploring how light-therapy can be adapted to the unique environment of outer space where injuries pose a significant challenge due to delayed healing. Leanne’s research offers promising solutions to enhance astronaut care during missions. She mentors younger students, volunteers in local STEM outreach programs and encourages her peers to explore the impact they can make through science.\n\nMilan Shah, a senior at Westview High School, won in the category of Civic Engagement. Milan has established himself as a prominent voice for social justice in his community. Currently serving as the Chair of the San Diego Youth Commission, Milan advises city council members and works to empower his peers, ensuring that youth perspectives are represented in local government. As the only youth commissioner on the Human Relations Commission, he played a pivotal role in rewriting its bylaws to promote respectful civil discourse, an achievement that has fostered inclusivity and strengthened community dialogue. He also works as a youth attorney for the Community Youth Court and addresses generational issues such as drug use and mental health challenges. Additionally, Milan contributes to research on California immigration policies in collaboration with UCSD. He uses film as a platform for connecting communities and amplifying underrepresented voices. Milan is motivated to continue pushing boundaries and advocating for positive change.\n\nSamuel Pardo Improta, an eighth grader at Roosevelt International Middle School, won in the Most Promising Teen category. He is a young leader with a passion for social justice, community advocacy and innovation. He aspires to launch his own prosthetics company, creating accessible solutions for those in need. Samuel has already begun designing prosthetic models, showcasing his commitment to improving lives through technology. Inspired by his mother’s resilience and her dedication to social causes, Samuel is a proud member of the Chavez Club, where he engages in meaningful discussions on issues like human trafficking and mental health. His community involvement started in seventh grade and continues to shape his identity and goals. Samuel envisions a future filled with impact and purpose.\n\nSantos Hidalgo Aguero, a senior at Gompers Preparatory Academy, won in the Community Service category. Santos is recognized for his commitment to giving back, especially to the younger generation. As a soccer coach for a local girls’ team, he finds joy in mentoring and supporting kids. At school, he serves as ASB president, where he works to strengthen school spirit and foster a supportive environment for his peers. Identifying as bisexual, he initially struggled with acceptance within his conservative family but he learned to embrace his identity and focus on self-acceptance in his sophomore year. From coaching to cheerleading—where he’s the only male on the varsity team—Santos’s courage and determination are evident in every role he takes on.\n\nSiddharth Yelisetty, a student at Mt. Carmel High School, won in the category of Community Collaboration. Siddharth has made it his mission to provide resources, mentorship and opportunities to young students eager to explore robotics and computer science. Siddharth founded Keep It Simple, a robotics team that has since grown into a successful program where he mentors younger students, encouraging them to engage with STEM in accessible, practical ways. He has reached over 1,200 students and families in San Diego with his program, inspiring many to pursue their interests in technology. As an Eagle Scout, he embodies the values of service and leadership, and has engaged with city leaders, including San Diego’s mayor, to discuss the importance of STEM in future workforce development.\n\nSophie Zeng, a student at The Bishop’s School, won in the Social Conscience category. A native San Diegan with a passion for environmental stewardship, Sophie co-founded Project Arise, a non-profit organization dedicated to combating invasive species and reducing the impact of wildfires. Her project partners with park rangers, local agencies and peers to raise awareness and provide innovative solutions for preserving San Diego’s natural beauty. She believes in the power of collaboration and has worked tirelessly to show that teens can make a significant impact on their communities. A talented filmmaker, Sophie uses her documentaries to shed light on important social issues. Her first documentary, Priceless Pride, critically examines corporate practices during Pride Month, exploring how companies engage with the LGBTQ+ community. Sophie envisions a future where young people lead with empathy and a sense of responsibility toward their communities and the environment.\n\nVibha Yadav Ganji, a junior at Del Norte High School and a twin, won in the Cultural Representation category.  Vibha draws strength from her Indian heritage, which she proudly honors while navigating life in the United States. Having moved from India at a young age, Vibha’s upbringing is enriched by her family’s customs, language and values, which she strives to keep alive in her daily life. This motivates her dedication to ensuring that diverse cultural identities are recognized, respected and celebrated. Vibha cofounded the non-profit STIGMA Today to address societal issues often overlooked or stigmatized, promoting open conversations that build bridges between cultural and social perspectives. Through her work, Vibha encourages young people to embrace self-acceptance and take pride in their cultural backgrounds, helping them find their place while honoring their roots.\nVidha Ganji, a junior at Del Norte High School and Vibha’s twin, won in the Public Health Advocacy category. Driven by a love of writing and a passion for health, Vidha cofounded the non-profit, STIGMA Today, aiming to dismantle stigmas and educate communities about critical health issues. Her work spans research projects, advocacy and community engagement, where she merges her interest in epidemiology with her commitment to public wellbeing. Vidha says one of her proudest moments is completing a piece of writing knowing it has the potential to inform and inspire others. Her greatest challenge, she notes, has been learning to communicate effectively with diverse groups, a skill she’s actively honing through her advocacy efforts. In a perfect world, Vidha envisions a future where mental health is widely recognized and self-acceptance becomes easier for her generation.\n\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241120.16.34.59"}