{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Public Health Recommends Staying ‘Up To Date’ With Updated COVID-19 Vaccine", "description": "The County of San Diego has received the new updated COVID-19 vaccine and joins the California Department of Public Health (CDPH) and the Centers for Disease Control and Prevention (CDC) in recommending all Californians stay up to date on this and all their vaccinations. ", "datePublished": "2023-09-25T12:27:54-07:00", "url": "https://www.countynewscenter.com/public-health-recommends-staying-up-to-date-with-updated-covid-19-vaccine/", "keywords": ["health"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-09-25T12:27:54-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego has received the new updated COVID-19 vaccine and joins the California Department of Public Health (CDPH) and the Centers for Disease Control and Prevention (CDC) in recommending all Californians stay up to date on this and all their vaccinations. \nThe new COVID-19 vaccine was designed to respond to the current strains of the virus now in circulation. It replaces the former bivalent boosters, which have now been deauthorized and are no longer in use. \n“This new vaccine is a welcome resource to our ongoing COVID-19 prevention efforts, especially as we enter the fall and winter seasons when cases traditionally increase,” said Wilma Wooten, M.D., M.P.H., County public health officer. “As virus remains prevalent in our community, I encourage everyone eligible to get the updated vaccine.” \nThe CDPH forecasts supplies of updated COVID-19 vaccine are expected to increase statewide in the coming weeks. For added convenience, COVID-19, flu, and RSV vaccines can all be administered in the same visit.  \nPeople can schedule a vaccine appointment by visiting MyTurn.ca.gov or contacting their local pharmacy or health care provider. The vaccines will continue to be free for most people through their health insurance plans, including Medi-Cal and regular health care providers. \nCounty Public Health Centers will provide the vaccine to those who are uninsured and participate in outreach to vaccinate in the underserved communities. Availability at County vaccine events will be updated on coronavirus-sd.com. Initial supplies are expected to be limited. \nGuidance from the CDC says the vaccine will provide renewed protection against severe illness, hospitalization and death, and minimize symptoms for people who do become infected so they can return more quickly to daily activities more quickly. \nAll people 5 years and older should receive one dose of the updated COVID-19 vaccine, as long as it’s been 2 months or more since their most recent dose.  \nInfants and younger children, 6 months through 4 years of age, who have previously been vaccinated against COVID-19 are eligible to receive one or two doses of the updated vaccine. The timing and number of doses depends on the previous COVID-19 vaccine received. Parents or caregivers should consult the child’s healthcare provider. \nAlong with the vaccine, people can take a number of individual actions to protect themselves and limit the spread of COVID-19. These include: \n\nStay home if you are sick. \nSeeking treatment from your doctor immediately after testing positive. Paxlovid and other treatments are very effective and work best if started promptly. \nConsider wearing a mask in public places, especially in crowded or poorly ventilated spaces. \nWash your hands and practice good hygiene. \nCover your cough or sneeze. \n\nMore information is available at coronavirus-sd.com \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230925.12.27.54"}