{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Make It A Happy Thanksgiving By Never Driving While Impaired", "description": "Thanksgiving is a time of gathering for many people and one of the busiest travel times of the year. Millions of people are hitting the road to get to their destinations. The San Diego County Sheriff’s Department is reminding those getting behind the wheel not to drive under the influence of alcohol or drugs. ", "datePublished": "2023-11-22T12:06:44-08:00", "url": "https://www.countynewscenter.com/make-it-a-happy-thanksgiving-by-never-driving-while-impaired/", "keywords": ["public safety", "dui", "dui grant", "san diego sheriff s department"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-11-22T12:06:44-08:00", "articleType": "article", "articleContent": "\nThanksgiving is a time of gathering for many people and one of the busiest travel times of the year. Millions of people are hitting the road to get to their destinations.\nThe San Diego County Sheriff’s Department is reminding those getting behind the wheel not to drive under the influence of alcohol or drugs.\nWith safe driving in mind, from Wednesday, Nov. 22, through Sunday, Nov. 26, deputies will be conducting increased impaired driving patrols. The goal is to get people driving under the influence off the roadways for the safety of both the driver and others.\n“Please help our deputies keep everyone safe this Thanksgiving holiday weekend by not driving while impaired,” said Sheriff Kelly A. Martinez.\nSo far in 2023, Sheriff’s Deputies have arrested nearly 1,000 people for impaired driving in San Diego County.\nKeep in mind that driving under the influence (DUI) doesn’t gust mean alcohol. Prescription medications, over-the-counter drugs and marijuana can also impair, especially in combination with alcohol and other drugs.\nThe Sheriff’s Department offers these tips for a safe Thanksgiving holiday:\n• Plan a safe way home.\n• Before drinking, designate a sober driver and leave your car keys at home.\n• If you are impaired, use a taxi, ride-sharing service, call a sober friend or family member or use public transportation.\nIf you see an impaired driver on the road, call 9-1-1 or the Sheriff’s Department at (858) 565-5200. Remember: Buzzed driving Is drunk driving.\nAnd if you are caught driving while under the influence of alcohol or drugs, there will be a high price to pay. An impaired driving arrest and conviction can cost more than $15,000 in legal and court fees.\nFunding for the Thanksgiving impaired driving enforcement program was provided by a grant from the California Office of Traffic Safety through the National Highway Traffic Safety Administration.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231122.12.06.44"}