{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Score Padre Tickets, T-shirts for Getting COVID-19 Vaccine", "description": "For the third time, the Padres and County are teaming up for a vaccination event at Petco Park, this one set for Tuesday, Aug. 24.", "datePublished": "2021-08-17T09:37:23-07:00", "url": "https://www.countynewscenter.com/score-padre-tickets-t-shirts-for-getting-covid-19-vaccine/", "keywords": ["health", "coronavirus", "covid-19", "padres", "padres tickets", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-08-17T10:58:59-07:00", "articleType": "article", "articleContent": "\nWant to get a free pair of Padres tickets and a Padres Hero T-shirt?\nFor the third time, the Padres and County are teaming up for a vaccination event at Petco Park, this one set for Tuesday, Aug. 24.\nThe first 150 people who get vaccinated at Gallagher Square in Petco Park will receive a free pair of tickets to the Sept. 8 game against the Los Angeles Angels along with a commemorative T-shirt.\nThe vaccination clinic will take place as the Padres host a game against the Los Angeles Dodgers. The clinic runs from 1 to 5 p.m. for everyone, and from 5:30 to 7:30 p.m. for those with tickets to that evening’s game. The entrance is at the 9th & J gate with no-cost parking available between 1-3 p.m. at the Padres Parkade, 440 11th Avenue (vouchers are provided after the vaccination).\nFirst and second shots will be administered, and an unlimited supply of all three vaccines will be available. The tickets and T-shirts are available to everyone vaccinated, regardless of whether it is a first or second shot.\n“While San Diegans have done a great job getting vaccinated, we need even more people to be immunized so that we can slow the spread of COVID-19, especially now that the Delta variant is taking hold in our communities,” said Chair Nathan Fletcher, County Board of Supervisors. “Get vaccinated so that we can knock COVID-19 out of the county.”\nThis is the third time the County has teamed up with the Padres to vaccinate San Diegans at the Park. Two other vaccination events took place in June. The Aug. 24 clinic will coincide with a three-game series where the Padres are celebrating Mexican Heritage and African American Heritage.\n“COVID-19 is now primarily impacting people who are not fully vaccinated,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The vaccine is the best way out of this pandemic and we value the Padres, and all of our community partners, for leaning in on this critical public health need. Do it for yourself. Do it for your friends and family.”\nAlong with hosting the third clinic, the Padres and Major League Baseball provided hundreds of game tickets that were distributed to San Diegans at community vaccination events and clinics throughout July.\n“The health and safety of our employees and guests at Petco Park is our highest priority. When vaccines were first available we helped launch California’s first super vaccination station at the ballpark and began encouraging all of our employees to get vaccinated once the vaccine was available to them,” said Padres CEO Erik Greupner. “With the latest increase in cases due to the Delta variant, we felt that it was important to once again partner with the County to help encourage San Diegans to get vaccinated.”\nVaccine availability is plentiful and widespread throughout San Diego County. You can find it at doctors’ offices, retail pharmacies, community clinics and County sites for people with no medical provider. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210817.09.37.23"}