{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Names First Director for Office of Immigrant and Refugee Affairs", "description": "After a national recruitment, the San Diego County Health & Human Services Agency has selected Lucero Chavez Basilio, an experienced representative for immigrants and refugees, as the first director for the County Office of Immigrant & Refugee Affairs (OIRA).", "datePublished": "2022-07-14T14:11:02-07:00", "url": "https://www.countynewscenter.com/?p=208977", "keywords": ["government"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-07-14T14:11:44-07:00", "articleType": "article", "articleContent": "\nAfter a national recruitment, the San Diego County Health and Human Services Agency has selected Lucero Chavez Basilio, an experienced representative for immigrants and refugees, as the first director for the County Office of Immigrant and Refugee Affairs.\n“After years of advocacy from the community, I was proud to bring forward a proposal with Vice Chair Vargas last year to create the Office of Immigrant & Refugee Affairs,” said Nathan Fletcher, Chair, San Diego County Board of Supervisors. “I am truly excited to welcome Ms. Chavez Basilio to head the Office, I am confident that with her experience, passion and leadership, we will continue to make San Diego County more welcoming for all residents.”\n“Lucero Chavez Basilio brings a wealth of experience working with immigrant and refugee families and has the vision to lead the new Office of Immigrant and Refugee Affairs,” said Nora Vargas, Vice Chair, San Diego County Board of Supervisors. “I am thrilled she will lead the agency working in partnership with the community and elevating the positive contributions immigrants and refugees bring to our culture and economy in the bi-national region.”\nA bilingual Spanish speaker and attorney, Chavez Basilio has spent more than 10 years representing immigrant and refugee children and families in immigration proceedings and in humanitarian and family-based petitions. She has worked with city councils, community organizations and law enforcement agencies throughout Southern California to create and implement pro immigrant policies and programs.\n“This is an important day for the County of San Diego, one that acknowledges the rich and ongoing contributions, as well as the needs, of our region’s immigrants and refugees,” said Nick Macchione, director of the Health and Human Services Agency. “The Board of Supervisors was visionary in its creation of the Office of Immigrant & Refugee Affairs, and now we have a director with the life experience and skills to lead it forward.”\nChavez Basilio said she recognized the County’s expanded commitment to immigrants and refugees and was eager to get started.\n“It is an honor and privilege to work with the residents of San Diego and our partners throughout the county to build the Office of Immigrant and Refugee Affairs,” said Ms. Chavez Basilio. “I look forward to creating and promoting programs and initiatives that are responsive to the needs of the community.”\nThe County Office of Immigrant and Refugee Affairs is located within the County’s Health and Human Services Agency’s Department of Homeless Solutions and Equitable Communities, which is headed by Community Operations Officer Barbara Jiménez who has long and deep ties to the immigrant and bi-national community.\n“For the County and our communities, this is very exciting news,” said Jiménez. “We are all eager for Ms. Chavez Basilio to join the team and engage the community, both in building out and leading this new office.”\nChavez Basilio grew up in a working-class immigrant neighborhood in South East Los Angeles and is the proud daughter of Mexican immigrants. She holds a B.A. in American Literature and Culture and Chicana/o Studies from UCLA and a J.D. from the UC Berkeley School of Law. She also has taught Administrative Law at Western State College of Law and Immigration Law and Policy at the UC Irvine School of Law.\nShe starts her new position July 15.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220714.14.11.02"}