{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Thanksgiving’s Different but Safe Cooking Never Changes; Take our Quiz!", "description": "Thanksgiving is definitely going to look very different this year. But if you're cooking, doing it safely never changes. Take our cooking safely quiz to find out if you're ready!", "datePublished": "2020-11-20T11:04:35-08:00", "url": "https://www.countynewscenter.com/thanksgivings-different-but-safe-cooking-never-changes-take-our-quiz/", "keywords": ["consumer", "food safety", "lueg", "thanksgiving"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-11-20T12:05:09-08:00", "articleType": "article", "articleContent": "\nThanksgiving is definitely going to look very different this year. Zoom and virtual visits with extended family and friends. Fewer people around our tables — ideally, just our immediate households.\nBut adjusting the holidays to fight COVID-19 doesn’t mean you can’t cook a Thanksgiving meal!\nAnd if you’re the chef, remember — use safe-cooking rules like, “keep hot foods hot and cold foods cold, keep meats and veggies separated during food prep, and practice good hygiene.”\nBecause the last thing you want to do, after fighting COVID and staying safe, is to accidentally serve up helpings of bacteria like E. coli, listeria and salmonella that can turn your meals into heaping plates of food-borne illness!\nWith that in mind, the County’s Department of Environmental Health is offering its annual (and fun) safe-Thanksgiving cooking quiz to help you prepare.\nHere you go!\nWhat’s the best way to thaw frozen meat? (this year’s smaller turkey, Cornish game hen, whatever…)\n\nPut it out on the counter, don’t let anyone touch it and wait till the outside is mushy-soft.\nRun hot water over it until it gets mushy-soft.\nLet it sit in a pot of water until it gets (wait for it…) mushy-soft!\nLet it defrost in the fridge. Meats, poultry and fish should be defrosted in the refrigerator. (If it’s a big turkey, for at least 24 hours for every five pounds in weight.)\n\nAnswer: D, of course. Using the refrigerator to thaw slowly and evenly is the best, safest way to defrost any meat. Because bacteria can grow exponentially at room temperatures.  Note: The United States Department of Agriculture says that you can also thaw meats in cold water. But — and this is important — the water must be cold, under 40 degrees, and should be changed every 30 minutes to keep it cold. The refrigerator’s easier!\nHow often should you wash your hands and cutting boards when preparing food?\n\nYou don’t have to wash your hands and cutting boards. A few germs will toughen up your immune system!\nBefore you start cooking.\nAfter you pet the dog, the cat, the gerbil or pick up the kids.\nIf you sneeze, blow your nose or have to run to the restroom.\nEverything except answer A, but mainly, “OFTEN.”\n\nAnswer: Definitely E. (Get out of the kitchen if you answered A) You should wash your hands and cutting boards before and after everything in B, C and D. Handwashing is always a key part of safe cooking. And this year, with COVID? It’s important even if you’re not cooking! So wash your hands. Harmful bacteria, from E. coli to salmonella and staphylococcus aureus, as well as viruses, can be removed from people’s hands through proper handwashing.\nHere are just a few other things you should wash your hands after doing: coughing, blowing your nose, using the restroom handling money, eating, drinking, smoking and handling or preparing raw food.\nShould you rinse off fruits and vegetables?\n\nNot if they look clean.\nNah, the supermarket washes them, right?\nNope. They grew in nature. That’s good enough for me.\nYes. You should rinse fruits and vegetables with cold water to remove lingering dirt that can carry bacteria.\n\nAnswer: Absolutely D. Rinsing with cold water cleans off dirt and other contaminants. But don’t wash them with detergents or soap, even dishwashing soap. You could end up eating residues from those cleaners if they’re absorbed by fruits and vegetables.\nWhy should you keep raw meats and meat products separated from fruits and vegetables when cutting them up or preparing them?\n\nMeat can make your veggies taste weird. Or veggies can make your meat taste weird. Either way, weird.\nFace it, meats and fruits and vegetables just don’t like each other. Last thing you need is a food fight.\nBecause raw meats, meat products and blood can carry bacteria like E. coli and salmonella that can contaminate fruits and vegetables — and make people sick.\nYou do not have to. It’s called “marinade.”\n\nAnswer: The correct answer is C. (If you said D, again — get out of the kitchen.) Cross-contamination is one of the most common causes of food-borne illness, according to the USDA. That is, the transfer of harmful bacteria from one food, particularly raw meats, poultry and shellfish to other foods. When preparing food, you need to keep raw meats and their juices away from fruits and vegetables and all ready-to-eat foods. Not socially-distant away (you don’t need 6 feet), but still, apart.\nIf you can, use separate cutting boards for meats and produce. If you can’t, wash cutting boards with hot, soapy water after using them on raw meats and before using them to cut fruits and vegetables!\nWhat is the Danger Zone? And what does it have to do with Thanksgiving dinner?\n\nThe Danger Zone is that classic 1996 adventure-thriller movie starring Robert Downey Jr. and Billy Zane! It has nothing to do with Thanksgiving … (We know, you were hoping for “that song from the 80s movie “Top Gun.” We figured it was time to change it up…)\nIt’s that toy-strewn distance you have to traverse, carrying all the Thanksgiving food from your kitchen to the table, without dropping everything!\nIt’s the range of temperatures between 40 degrees Fahrenheit and 140 degrees Fahrenheit — the temperatures where bacteria can grow like crazy in foods, doubling in number in as little as 20 minutes.\n\nAnswer: The correct answer is C. We love a good adventure-thriller movie as much as you do. But the Danger Zone is the range of temperature between 40 degrees and 140 degrees Fahrenheit that allows bacteria to breed exponentially — not a good thing. If hot foods cool or cold foods heat up enough to enter that zone, your food can become a bacteria-fest. And you can end up getting sick. Keep hot foods safely heated with chafing dishes, preheated steam tables, warming trays, slow cookers and ovens. Place cold foods in containers on ice, or in the fridge. And refrigerate leftovers as soon as you can, but definitely within two hours. Here’s more about the “Danger Zone.”\nAnd finally:\nIs the “five-second rule” real? Can you eat something you’ve dropped on the floor if you pick it up in less than five seconds?\n\nYes. It is definitely real. Just pick it up quick and blow on it. Nothing can contaminate your food in less than five seconds. Uncle Dave taught me that.\nIt’s not real. And you really shouldn’t eat anything you’ve dropped on floor. (Sorry Uncle Dave.)\nMy dogs eat everything off the floor and I’ve never seen them get sick.\n\nAnswer: B. It’s OK for the dog to eat food that’s fallen to the ground but it’s not safe for people. Truth is, almost any contact is long enough for food to be contaminated by bacteria that can be found on the ground or in your house. According to research conducted this year by Rutgers University, bacteria can transfer from a surface to food in less than a second!\nSo there you have it. We hope you’re an expert. But if you’re still interested, you can get more information about food safety tips at FoodSafety.gov’s “Food Safety by Types of Food” webpage, or by calling the USDA’s Meat and Poultry hotline at 1-888-674-6854.\nBe safe. And have a good Thanksgiving!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201120.11.04.35"}