{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Live Well San Diego Celebrates 600th Regional Partner", "description": "The City of Vista has just become the 600th recognized partner in a regional collective of local organizations, businesses and governments working together to create a better quality of life for all San Diego County residents.  ", "datePublished": "2025-05-28T13:33:44-07:00", "url": "https://www.countynewscenter.com/live-well-san-diego-celebrates-600th-regional-partner/", "keywords": ["government", "city of vista", "live well san diego", "recognized partners"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-29T11:30:53-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe City of Vista has just become the 600th recognized partner in a regional collective of local organizations, businesses and governments working together to create a better quality of life for all San Diego County residents.  \nEstablished in July 2010, Live Well San Diego is a vision for a region that is building better health, living safely and thriving. \nAmong the 600 recognized partners are 39 school districts, education organizations, local government agencies, businesses, sports teams, media, non-profits and faith-based organizations. \n“We recognize that government alone can’t solve complex issues surrounding health, housing and community supports,” said Kimberly Giardina, County deputy chief administrative officer for the Health and Services Agency. “Lasting change requires the strength of many in our region coming together to make a bigger impact on those we serve. After years of partnership, I am excited to welcome the City of Vista into this incredible collective vision.”   \nLive Well San Diego’s impact is reflected through ten indicators that demonstrate increases in life expectancy, quality of life and high school graduation and decreases in crime rates and the proportion of the population living in poverty. \nAdditionally, efforts in support of the Live Well San Diego vision have driven a 13% reduction in the number of deaths associated with preventable health threats from 2007 to 2022.  \nThe City of Vista, Vista Community Clinic and the County partnered on the Healthy Cities, Healthy Residents program, a County-funded effort focused on improving public health through community engagement and policy development. It resulted in more sidewalks being created in the community, helping families and children to be more active and stay safe. It also, importantly, created a model for community engagement in the region.   \nRecognizing the City of Vista as the 600th Live Well San Diego partner is not just a milestone — it’s a reflection of a shared commitment to healthier, safer, and thriving communities. Each new partner strengthens the foundation of this regional vision, underscoring the vital role of cross-sector collaboration to support all County residents. \nLearn more about Live Well San Diego online and read the Annual Impact Report. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250528.13.33.44"}