{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Art Therapy and the Beautiful Results", "description": "The process of creating art is therapeutic and can improve mental health, decrease anxiety, build self esteem and improve social skills. County Behavioral Health art programs are extremely popular and the beautiful results were on display at a public art show where clients celebrated their work with their peers and an audience.", "datePublished": "2024-12-19T17:06:40-08:00", "url": "https://www.countynewscenter.com/art-therapy-and-the-beautiful-results/", "keywords": ["health", "art therapy", "behavioral health", "mental health", "stengths based case management"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-12-20T09:39:25-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteArt is a beautiful way for people to share personal thoughts, experiences and emotions that are not easily expressed in words. The process of creating art is therapeutic and can improve mental health, decrease anxiety, build self esteem and improve social skills.\nArt therapy is often woven into the treatment plan for people with behavioral health conditions as a complimentary therapy to more conventional healthcare. It provides an enjoyable way for clients to externalize their feelings and experiences and in some cases, begin their healing process.\nCounty Behavioral Health art programs are extremely popular and are revealing impressive talents. To share this success, the Strengths Based Case Management team held a public art show, where clients had the chance to showcase and celebrate their work with their peers and an audience.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241219.17.06.40"}