{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Board Adopts 2024 Climate Action Plan", "description": "The County’s Board of Supervisors adopted Wednesday the 2024 Climate Action Plan, a blueprint for reducing greenhouse gas emissions in the unincorporated area and at County facilities to reach net zero emissions by 2045. ", "datePublished": "2024-09-12T09:00:32-07:00", "url": "https://www.countynewscenter.com/county-board-adopts-2024-climate-action-plan/", "keywords": ["environment", "climate action plan", "environment", "equity and access", "health", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-09-12T09:00:32-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Board of Supervisors adopted Wednesday the 2024 Climate Action Plan (2024 CAP), a blueprint for reducing greenhouse gas emissions (GHG) in the unincorporated area and at County facilities to reach net zero emissions by 2045.\nThe document features 70 actions that reduce GHG emissions. These features also protect the public’s health and safety, supports the environment and improves the quality of life for all residents.\nThe 2024 CAP is a community-driven plan that includes measurable performance outcomes like timeliness and costs that can be monitored over time. The CAP will be carried out by nine County departments through programs, policies, and incentives.\nThe 2024 CAP was developed through a public engagement process to make sure the plan is shaped by community input and centered on environmental justice.\nWhat’s in the 2024 CAP?\nThe 2024 CAP is designed to improve overall sustainability while meeting the state’s GHG requirements through strategies, measures and actions organized under the following five emissions reduction sectors:\n\nBuilt Environment and Transportation\n\n\nEnergy\n\n\nSolid Waste\n\n\nWater and Wastewater\n\n\nAgriculture and Conservation\n\n How is the 2024 CAP different from the previous one?\n\nIt helps streamline development, including housing projects and increase workforce opportunities by shifting to electric-powered buildings.\n\n\nAgriculture operators in the region will benefit from more incentives to increase carbon storage.\n\n\nNew infrastructure improvements to roadways, bike lanes and sidewalks to help reduce GHG emissions and improve air quality.\n\n\nA new program to create renewable energy that can help increase energy reliability and reduce utility bills for the unincorporated area.\n\n\nIt includes equity-based outcomes for populations most impacted by climate change. Including improvements in community health, increases in workforce and increased access to services in the unincorporated area.\n\nIn January 2021, the Board of Supervisors called for a new CAP that uses updated data and modeling, prioritizes environmental justice and equity, and includes a net-zero greenhouse gas emissions goal.\nThe Board rescinded the 2018 CAP because the court took issue with its environmental impact report, but the County continued implementing many of its measures as part of the County’s ongoing commitment to the environment.  Using 2018 CAP measures, the County has met or exceeded its GHG-reduction goals. Including areas of agricultural land conservation, tree planting and permitting solar use on existing homes.\nThe County is also taking efforts to increase sustainability and address climate change, through the development of a Sustainable Land Use Framework and the Regional Decarbonization Framework.\n The 2023 Annual Report shows that in 2023, the County’s climate action efforts:\n\nReduced the GHG equivalent of reducing emissions from 29,304,377 gallons of gasoline.\n\n\nPermitted residential solar power equivalent to 17,459 homes.\n\n\nDistributed 1,197 rain barrels through the County’s discounted rain barrel program.\n\n\nAdded 66 new electric vehicles (EVs) to the County fleet.\n\n\nPlanted 5,604 trees by the Department of Parks and Recreation.\n\n\nConserved 448 acres of open space through the Multiple Species Conservation Program.\n\nWhile developing the 2024 CAP, staff received input and stakeholder feedback through 21 public workshops that included approximately 700 participants and over 230 meetings and in-person events. Plus, regular engagement on our website, e-newsletter and social media channels.\nDuring the public review period for the 2024 CAP, the County’s engagement portal received over 2,000 visits since its release to the public in October 2023. To increase awareness of the release of the documents, staff hosted in-person office hours and continued to participate in community meetings and events.\nTo learn more about the County’s 2024 CAP Update, visit our project website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240912.09.00.32"}