{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports First Locally Acquired Dengue Case  ", "description": "The County is investigating the first ever case of locally acquired dengue. The Escondido resident who became sick with dengue did not travel to an area where the mosquito transmitted illness is common. No additional locally acquired cases have been identified at this time. ", "datePublished": "2024-10-06T08:57:26-07:00", "url": "https://www.countynewscenter.com/county-reports-first-locally-acquired-dengue-case/", "keywords": ["health", "dengue", "locally acquired dengue", "mosquito prevention", "mosquitos", "public health", "vector control"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2024-10-06T08:57:26-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesThe County is investigating the first ever case of locally acquired dengue. The Escondido resident who became sick with dengue did not travel to an area where the mosquito transmitted illness is common. No additional locally acquired cases have been identified at this time. \nTo protect the public’s health and keep mosquitoes from potentially spreading the dengue virus, County Vector Control began spraying this weekend for mosquitos at about 170 homes in Escondido. Treatments started on Friday and will continue through Thursday, Oct. 10. \nDengue is a tropical viral disease that is not commonly found in the United States. Since the invasive Aedes mosquitoes were first detected in San Diego County in 2014, there had been no locally acquired case of dengue until now.  \nPeople who travel to countries where dengue is common can get infected with dengue through mosquito bites. So far this year, there have been 49 cases of travel-related dengue in San Diego County.  \n“While the risk of widespread transmission of dengue remains low in San Diego County, County Public Health and Vector Control are working closely to respond quickly to prevent mosquitoes from spreading the illness in this area,” said Dr. Ankita Kadakia, County interim public health officer. \nThe arrival of locally acquired dengue in San Diego County is not a surprise. Los Angeles County recently reported five cases of locally contracted dengue this year. Long Beach and Pasadena had their first cases of locally acquired dengue in late 2023.  \nVector Control did similar treatments in Oceanside in September and in the Mount Hope area of San Diego in July of this year.  Both of those treatments were initiated as a precaution to prevent potential local spread of dengue due to travel-associated dengue cases and the high numbers of Aedes mosquitos in the neighborhoods. \nInformation on Dengue \nDengue is spread by mosquitoes, when a mosquito bites an infected person and then feeds on another person. \nIt can take four to seven days for someone who is bitten by a mosquito infected with dengue to start feeling symptoms. Dengue can be determined by a blood test that can be discussed with a healthcare provider. \nThe most common symptoms are fever, chills and any of the following: aches and pains (eye pain, muscle, joint or bone pain), nausea, vomiting, and rash.  \nSymptoms can be moderate and last two to seven days. Most people recover after about a week. However, symptoms can also become severe, be deadly, include shock and respiratory distress, and can require hospitalization. There are no specific medicines to treat dengue.  \n“Fight the Bite” – How to Prevent and Protect Yourself from Mosquitos \n\nDay-biting Aedes aegypti mosquitoes, also known as “ankle-biters,” are the primary transmitter of dengue. These mosquitoes like to live and breed around people, often in yards and in small amounts of water. \n\n\nDump out, drain, or remove any items inside and outside of homes that can hold water, such as plant saucers, rain barrels, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquitofish, available for free at locations throughout the county, may be used to control mosquito breeding in backyard standing water sources, such as unmaintained swimming pools, ponds, fountains, and horse troughs. \n\n\nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors.  \n\n\nUse insect repellent that contains EPA-approved ingredients like DEET, picaridin, oil of lemon eucalyptus, or IR3535.  \n\n\nMake sure screens on windows and doors are in good condition and secured to keep insects out. \n\nCounty Mosquito Control Efforts Underway\nTrained County technicians are working to reduce the number of adult mosquitoes that can spread dengue by applying AquaDuet, a pesticide approved for use by the Environmental Protection Agency, using ultra-low-volume backpack sprayers in focused areas and trucks to apply the product to a wider part of the area. \nThe County began by informing neighbors and leaving doorhangers at homes in the treatment area Friday. Treatment boundaries along with additional information can be found on Vector Control’s adult mosquito control webpage. The treatment product is low risk to people and pets and dissipates in roughly 20 to 30 minutes. People in the area can avoid or minimize their exposure to the pesticide by taking simple steps: \n\nStay inside and bring pets indoors if possible \n\n\nClose doors and windows, and turn off fans that bring outdoor air inside the home \n\n\nWash any pet food and water bowls that were left outside during the treatment \n\n\nCover fishponds to avoid direct exposure \n\n\nRinse fruits and vegetables from your garden with water as you normally would before cooking or eating \n\n\nWipe down or cover outdoor items such as toys and barbecue grills \n\n\nBeekeepers and those with insects kept outdoors are encouraged to shelter hives and habitats during treatments. Beekeepers registered with the County’s Department of Agriculture, Weights and Measures can request to receive advance notice when a pesticide that may affect bees is applied to blossoming plants in their areas. \n\n\nYou may resume normal activities 30 minutes after the treatment\n\nFor more information about mosquitoes go to San Diego County’s “Fight the Bite”  website.  \nFor people in the affected area, County Public Health staff are on site in the Escondido community today and tomorrow and available to answer questions and provide information about dengue. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241006.08.57.26"}