{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Distributing More Than 700 Vials Of Mpox Vaccine", "description": "The County of San Diego is distributing 705 vials of Mpox (monkeypox) vaccine this week to healthcare providers around the region.", "datePublished": "2022-08-22T17:56:27-07:00", "url": "https://www.countynewscenter.com/?p=209254", "keywords": ["health", "monkeypox", "monkeypox vaccine", "mpox"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-08-22T18:24:11-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego is distributing 705 vials of Mpox (monkeypox) vaccine this week to healthcare providers around the region.\nThe vials will be used for the newly authorized intradermal procedure, allowing up to five doses from a single vial, which initially equaled a single dose. Some individuals, including those who are less than 18 years-old or who are immunocompromised, will still require a full-vial dose.\nThese vaccines are being made available from County reserves.\nWith the vials being distributed this week, healthcare providers are expected to independently notify patients who qualify for the vaccine and then schedule vaccination appointments. These appointments are not being made by the County or through 2-1-1.\nIn addition, County Public Health Clinics began making a limited number of daily Mpox vaccinations available Monday through the state of California’s MyTurn appointment system. All available appointments were reserved this morning. The MyTurn system is familiar to the public for its role in scheduling COVID-19 vaccinations. The County Public Health Centers will continue to vaccinate those who have a documented exposure, and to serve individuals without a healthcare provider.\n“Being able to expand the number of doses through the intradermal procedure is going to help us vaccinate many more eligible San Diegans,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Because the overall supply of vaccine remains extremely short of what is needed, we will continue to request additional doses from the state. In the meantime, we ask those at high risk to be cautious about their partners and have any signs of monkeypox immediately checked out by a physician.”\nCalifornia allocates vaccines to counties based on the number of Mpox cases in the county in the past two weeks, as well as the number of early syphilis cases in men reported in a region. The County is expecting another 990 vials of the vaccine to arrive from the state soon.\nA text message alert system is available for those seeking the latest information about monkeypox in the region. To sign up to receive the messages, text COSD MONKEYPOX to 468-311.\nFor more information on monkeypox, how to prevent it, and who should get vaccinated, visit the County’s Mpox website or call 2-1-1. The County is following California Department of Public Health guidance in transitioning the name of the virus from monkeypox to Mpox.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220822.17.56.27"}