{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Bars, Breweries, Wineries to Close Again in County", "description": "San Diego region bars, wineries and breweries without a license to serve food will need to close to prevent community outbreaks of COVID-19 and the spread of the virus, the County Health and Human Services Agency announced today.", "datePublished": "2020-06-29T18:15:29-07:00", "url": "https://www.countynewscenter.com/bars-breweries-wineries-to-close-again-in-county/", "keywords": ["health", "bars close again", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-30T10:29:07-07:00", "articleType": "article", "articleContent": "\nSan Diego region bars, wineries and breweries without a license to serve food will need to close to prevent community outbreaks of COVID-19 and the spread of the virus, the County Health and Human Services Agency announced today.\nStarting July 1, these establishments must close their doors until further notice.\nFor those businesses with a food license, they can only serve food to customers seated at a table and alcohol can only be consumed while those patrons are eating.\nThe County will not consider further reopenings of any additional types of businesses or activities earlier than Aug. 1 to further slow the spread of COVID-19.\nThe decision was made given the number of outbreaks being identified in the region and the increasing number of cases and hospitalizations reported recently.\nNearly 500 cases of COVID-19 were reported in the County June 28, the highest total since the pandemic began.\nCases are being identified in a variety of settings, but recent outbreaks have been linked to bars, restaurants and private residences.\nA growing number of cases are being identified in young people, especially those between the ages of 20 and 29. At the end of April, 15% of all cases reported were in people in that age range. Now, that percentage has increased to 22%.\n“It’s obvious that more young people are going out and not following the public health guidance. That’s why we’re seeing more community outbreaks,” said Wilma Wooten, M.D., M.P.H., County public health officer. “They are going to bars, restaurants and having house parties and not wearing a mask or maintaining physical distance.”\nAnother group showing increasing percentages are those 10 to 19 years old. That percentage has risen from 2.4% in late April to almost 6% currently.\n\n“People are going out in larger numbers and interacting with people outside their household,” Wooten said. “While younger people have less severe symptoms from COVID-19, it’s important to note that they could be spreading the virus to others who are more vulnerable.”\nFor people in their 30s, the percentage of positive cases has remained steady, and in older demographics the percentage has been steadily decreasing.\n“Older people are heeding the public health advice and staying away from crowded places to avoid getting the virus,” Wooten said.\n\nYour Actions Can Save Lives\nThe best way to prevent getting COVID-19 is to follow the public health guidance being issued by state and local health officials.\n“Our actions have power and can save lives,” Wooten said.\nSan Diegans must do the following to protect themselves and the public’s health and keep other sectors of the economy from being closed:\n\nPractice good hand hygiene and sanitation\nKeep six feet apart\nWear a face covering\nAvoid crowded places\nStay home if they are sick\n\nCOVID-19 Tests, Cases and Deaths\nCommunity Outbreaks:\n\nIn the past seven days, seven community outbreaks were identified; two new outbreaks were identified June 28 at two local restaurants.\nThe number of community outbreaks hits the trigger of seven in seven days.\n\nTesting:\n\n6,908 tests were reported to the County June 28 and 7% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 4.1%. \n\nCases:\n\nA record 498 new cases were reported in San Diego County for a total of 13,832.\n1,754 or 12.7% of cases have required hospitalization.\n481 or 3.5% of all cases and 27.4% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported. The region’s total remains at 361.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200629.18.15.29"}