{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Honor Beloved Pets for Día de los Muertos and Consider Adopting a New Love", "description": "County Animal Services is honoring the lives of beloved pets who have passed as part of the Day of the Dead. This cultural tradition, which celebrates the memory of loved ones, including pets, invites the community to share a photo of departed pets and consider offering some of that love to a County shelter pet.", "datePublished": "2024-10-01T16:45:43-07:00", "url": "https://www.countynewscenter.com/honor-beloved-pets-for-dia-de-los-muertos-and-consider-adopting-a-new-love/", "keywords": ["animals", "adopt pets", "dia de los muertos", "pet adoption"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-10-01T16:45:43-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Animal Services is honoring the lives of beloved pets who have passed as part of the Day of the Dead. This cultural tradition, which celebrates the memory of loved ones, including pets, invites the community to share a photo of departed pets and consider offering some of that love to a County shelter pet.\n“Día de los Muertos offers us a special moment to remember the pets who have enriched our lives with unconditional love. By celebrating their memory, we are reminded of the joy they brought and the lasting impact they’ve had on our hearts,” said Animal Services Director Vaughn Maurice. “We also encourage the community to visit and consider adopting a new companion, so we can create more memories and love-filled homes for animals in need.”\nFrom October 1st through November 2nd, Animal Services will feature special Día de los Muertos displays at its Carlsbad and Bonita shelters. The community is welcome to join in this heartfelt celebration by contributing photos of pets who have crossed the Rainbow Bridge. These photos will be placed on ofrendas, or Day of the Dead altars, that are beautifully decorated with flowers, candles and treats to commemorate the pets that have passed but remain in our hearts.\nHow to Participate:\n\nBring a printed photo of your beloved pet to the lobby at either our Carlsbad or Bonita shelter during the month of October.\nYour pet’s photo will be displayed on the Día de los Muertos ofrendas, where we will honor their memory. We will share a photo of the ofrenda on Día de los Muertos.\nWhile you’re visiting, take time to meet our wonderful adoptable pets who are eager to find their forever homes.\n\nCounty Animal Services set up the displays to provide comfort and connection to those grieving.\nConsider opening your hearts and homes to the many pets waiting for adoption.\nAll animals adopted from County shelters will be spayed or neutered, have vaccinations, a microchip and a one-year license for dogs in the service area.\nPlease visit County Animal Services’ Adoptions page and browse the beautiful and lovable animals from cats to dogs to pigs, roosters and a chinchilla available now. Animal Services staff recommend that people pick out a second and third choice too, just in case your first choice is already chosen by another person.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nCounty Animal Services is committed to the safety and welfare of animals and the community. Through education, adoption, and compassionate care, it works to provide homes for adoptable animals while promoting responsible pet ownership.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241001.16.45.43"}