{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voting by Mail: Simple, Convenient, Secure", "description": "As ballots start showing up in mailboxes around San Diego County, the Registrar of Voters office is encouraging voters to vote early.", "datePublished": "2022-05-17T11:29:24-07:00", "url": "https://www.countynewscenter.com/voting-by-mail-simple-convenient-secure/", "keywords": ["elections", "ballots", "fgg", "june 7 gubernatorial primary election", "mail ballot drop-off locations", "registrar of voters office", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-05-17T13:16:06-07:00", "articleType": "article", "articleContent": "\nAs ballots start showing up in mailboxes around San Diego County, the Registrar of Voters office is encouraging voters to vote early.\nMore than 1.9 million ballots for the June 7 Gubernatorial Primary Election were sent out to registered voters last week. If you haven’t received yours by Tuesday, May 17, contact the Registrar’s office.\n“You don’t need to wait until Election Day to vote,” said Registrar of Voters Cynthia Paes. “And the sooner we get your ballot back, the sooner we can start processing it. Your ballot can be in the first release of election night results.”\nVoting by mail is:\n\nSIMPLE: A ballot, instructions and an “I Voted” sticker are included in your official ballot packet.\nCONVENIENT: Make voting decisions and mark your ballot comfortably at home.\nSECURE: Sign and date your envelope, seal your completed ballot inside and return it postage free to a trusted source:\n\n\n\n\nReturn your ballot through the mail. For a location near you, visit the U.S. Postal Service office or collection box website.\nReturn it to one of 132 official mail ballot drop-off locations around the county. Find the closest one to you by visiting the Registrar’s online locator tool. Check each location’s hours of operation before heading out.\nReturn it to the Registrar’s office where early voting is already underway. Hours run from 8 a.m. to 5 p.m. Monday through Friday.\n\n\n\nVoters who return their mail ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”\nYou can also choose to vote in person at any vote center.\n\nStarting Saturday, May 28, select vote centers will be open daily from 8 a.m. to 5 p.m. including Memorial Day on Monday, May 30. Then starting Saturday, June 4, over 200 vote centers will be open daily from 8 a.m. to 5 p.m.\nAll vote center locations will be open on Election Day, June 7, when voting hours change to 7 a.m. to 8 p.m.\n\nLearn more about voting in the June Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220517.11.29.24"}