{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Contest Gets Middle School Students Thinking About Fire Safety", "description": "Students at a local middle school are helping their families prepare for an emergency by creating home fire safety escape plans.", "datePublished": "2024-06-03T14:42:57-07:00", "url": "https://www.countynewscenter.com/contest-gets-middle-school-students-thinking-about-fire-safety/", "keywords": ["public safety", "county fire", "emergency", "fire safety"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-06-03T15:52:04-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesStudents at a local middle school are helping their families prepare for an emergency by creating home fire safety escape plans.\nBorrego Springs Middle School students created the plans as part of a contest and shared them at a recent safety resource fair. It’s for a pilot program created by San Diego County Fire using state emergency preparedness grant funding.\nThe contest coincided with Wildfire Awareness Month as well as National Electrical Safety Month, both in May, but the timing is even more important as school summer break approaches, when kids may be at home more, sometimes on their own.\n“Learning fire safety and drawing escape plans could save a life. These students better understand the importance of preparing for disaster and were empowered to take responsibility for themselves and their families,” said Teresa Greenhalgh, Community Emergency Response Team (CERT) Coordinator for County Fire.\nCounty Fire staff went to the school in early May to kick off the program, talk about careers in fire service, home fire safety tips and of course, the contest rules. Plans were required to include a detailed home floor plan showing the locations of smoke alarms, two escape routes from every room, and a destination located a safe distance outside the home for the family to meet after evacuating. A panel of community partners and County Fire selected the winners.\nCounty Fire and partners including the San Diego Sheriff’s Department, the County Office of Emergency Services, the County Library, LiveWell San Diego, SDG&E, the American Red Cross, and CAL FIRE visited the school on May 28 to present the awards and put on an interactive safety fair.\nAmong the skills stations were hands only CPR, fire extinguisher safety using a fire simulator, electrical and kitchen hazards safety, and SDG&E’s electrical safety demonstration Students who completed all the training earned a fire blanket.\n\nNearly 80 students participated in the contest. Each received a starter go-bag with supplies to use if they had to evacuate in a fire or other emergency, including a Listos Disaster Ready Guide, flashlight, first aid kit, and an emergency blanket. Contest winners got a family-sized go-bag for four people including those items and an emergency AM/FM radio/flashlight, camping lanterns, extra batteries, personal hygiene items, and plates, and utensils. Those honored for their outstanding plans were seventh grader, Mateo Garcia, and sixth grader, Gael Fuentes.\nThe program and prizes were funded by the Listos California CERT Support Grant out of the governor’s Office of Emergency Services to help prepare residents for an emergency or disaster.\nFor more local resources, visit San Diego County Fire and AlertSanDiego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240603.14.42.57"}