{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Provides Legal Defense for Immigrants", "description": "The County of San Diego announced today a first-of-its-kind legal defense program for immigrants going through removal proceedings in federal court. People detained, on monitoring or under house arrest can now receive free legal representation contracted by the Public Defender’s Office.", "datePublished": "2022-04-29T08:33:42-07:00", "url": "https://www.countynewscenter.com/?p=208291", "keywords": ["government", "american bar association immigration justice project", "deportation", "immigrant legal defense", "jewish family service", "public defender s office", "removal", "representation", "southern california immigration project", "supervisor terra lawson-remer"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-04-29T09:17:04-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego announced Thursday a legal defense program for immigrants going through removal proceedings in federal court. People detained, on monitoring or under house arrest can now receive free legal representation contracted by the Public Defender’s Office.\n“Eight out of ten people facing deportation in San Diego County cannot afford to hire an attorney,” said County Supervisor Terra Lawson-Remer. “Today, San Diego County is changing that and making history in the process. San Diego County is now the first border region in the United States to provide free legal representation for immigrants, refugees and asylum seekers facing removal proceedings. We are declaring with one voice that our justice system must be based on facts and laws, not access to wealth and resources.”\nThe Immigrant Legal Defense Program uses three contractors to provide legal counsel to anyone detained here in San Diego County. That representation starts before they go to their first hearing until their case is finished.\nThe Board of Supervisors approved this initiative looking for a solution which upheld the principles of fairness and due process in our immigration courts.\n“Our program is established, not to promote illegal immigration, but exactly the opposite,” said Michael Garcia, director of the Office of Assigned Counsel and the leader of project. “It is meant to promote the lawful application of our immigration laws and due process within the four walls of all our courtrooms in the County of San Diego.”\nGarcia continued, “Of those unrepresented, 83% have to navigate the complex legal system on their own. The success rate of gaining any relief whatsoever during their case is a mere 4%. By contrast, when represented by counsel, the success rate climbs to over 40%.”\nThose seeking legal representation can contact any of three service providers to help with their cases:\n· American Bar Association Immigration Justice Project: 619-736-3315\n· Southern California Immigration Project: 619-516-8119\n· Jewish Family Service: 858-637-3365\n“Immigration law is one of the most complicated areas of law and trying to navigate it without help is overwhelming – and if you’re detained, it’s almost impossible,” said Andrew Neitor, an attorney with the Southern California Immigration Project. “This program isn’t just important for individuals in need of a lawyer, it’s important for our entire system of justice, where we have always believed that people should be able to have legal representation regardless of their race, nationality, or income.”\nThe pilot program will be used to gather data and inform future immigrant legal defense projects. The program is intended to reduce the backlog in the immigration system, reduce the workload of immigration judges and save taxpayer dollars by moving people through the system more efficiently and getting people out of expensive detention facilities.\nMuna Shegow, a downtown resident and refugee who fled war-torn Somalia in 1999, and her 9-year-old daughter were once detained because of a paperwork mix-up. An attorney was able to clear up the issue, getting both released from detention and back to their community.\n“I don’t know what I would have done without the help of my attorney.” she said.\nSupervisor Lawson-Remer says detainees with legal counsel are four times more likely to be released allowing them to return to their jobs, to their families, and their communities while they await the results of their legal matter, and they can get back to work supporting their families.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220429.08.33.42"}