{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Over 3,600 New COVID-19 Cases", "description": "The County Health and Human Services Agency is reporting a sharp increase in new COVID-19 cases, adding 3,653 new cases in a single day today.", "datePublished": "2021-12-29T18:44:30-08:00", "url": "https://www.countynewscenter.com/county-reports-over-3600-new-covid-19-cases/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-12-29T18:56:06-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is reporting a sharp increase in new COVID-19 cases, adding 3,653 new cases in a single day today. This is the highest number of new cases reported since Jan. 7 of this year, when 4,550 cases were reported.\nCounty health officials attribute the spike in cases to holiday gatherings and the more contagious Omicron variant.\nWhile the majority of cases in the region are still Delta variant infections, an additional 69 Omicron cases were reported in the past week (Dec. 22 through Dec. 28), bringing the region’s total of known Omicron variant cases to 91.\nTesting Resources\nWhile testing demand is high, the overall testing system has the capacity to meet demand. Testing is available throughout the region, including at County testing sites and neighborhood pharmacies.\nThe County is recommending that people worried about COVID-19 infection and others seeking COVID-19 testing not go to a hospital to be tested, unless they have severe symptoms. This preserves hospital resources for patients who are critically ill.\nThose with mild COVID-19 symptoms or other COVID concerns should contact their health care provider via phone or telehealth for guidance. Rapid antigen tests, which are available at many local pharmacies, are a good option if a testing site is unavailable.\nHere’s a list of other locations where people can get COVID-19 tests.\nAvoid Getting Sick\nMeanwhile, County health officials are urging San Diegans to take every precaution necessary to avoid getting sick and slowing the spread.\n“Given the significant uptick in COVID-19 cases, the continued spread of the more contagious Omicron variant, and the increased risks of spread that come with gathering with others, San Diegans must continue to make decisions with their own health and the public’s health in mind,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “As we close out this difficult year, the best resolution we can make for 2022 is to rededicate ourselves to the public health strategies that have been proven to work.”\nThose strategies include:\n\nWearing the right kind of mask and wearing it correctly\nLimiting indoor activities when gathering with people outside your household\nIf you have symptoms, get tested whether you’ve been vaccinated or not, and isolate until results are known\nIf you test positive, stay home, isolate and seek treatment if necessary\n\nSan Diegans who have not been vaccinated, or are overdue for their booster, are strongly encouraged to get vaccinated as soon as possible. There are more than 400 vaccination sites across the county, including at pharmacies, medical providers, clinics and County locations.\nMore information about COVID-19 vaccination is available here.\nVaccination Progress:\n\nDoses administered: Close to 6.14 million.\nReceived at least one shot: Over 2.77 million or 88.2% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.46 million or 78.2 %.\nBoosters administered: 748,737.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n27 new deaths were reported since the last report on Dec. 22, 2021. The region’s total is 4,461.\n11 women and 16 men died between Sept. 11 and Dec. 26, 2021.\nEight were age 80 or older, nine were in their 70s, seven were in their 60s, two were in their 50s and one was in their 40s.\nTwo of the people who died were fully vaccinated and 25 were not fully vaccinated.\n24 had underlying medical conditions and three had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n3,653 COVID-19 cases were reported to the County on Dec. 28, 2021. The region’s total is now 420,089.\n16,657 cases were identified the previous week (Dec. 22 through Dec. 28) compared to 7,507 cases reported in the past week (Dec. 15 through Dec. 21).\nDuring the 30-day period between Nov. 16 to Dec. 15, there were 486 COVID-19 hospitalizations; 350 people were not fully vaccinated and 136 were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 20.0 overall, 11.4 for fully vaccinated people and 36.0 for not fully vaccinated San Diegans.\n\nCommunity Setting Outbreaks:\n\n47 new community outbreaks were confirmed in the past seven days (Dec. 22 through Dec. 28): 12 in business settings, six in daycare/preschool/childcare settings, five in faith-based agency settings, five in restaurant/bar settings, five in TK-12 grade school settings, four in retail settings, two in emergency services settings, two in government settings, two in healthcare settings, one in a community-based organization, one in a distribution warehouse setting, one in a grocery setting and one in a hotel/resort/spa setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211229.18.44.30"}