{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Southern Fire Reminds Residents to Take Action Before Fire Strikes", "description": "The Southern Fire that forced evacuations in the Anza Borrego Desert over the weekend came at the start of “Wildfire Preparedness Week” and underscores the messages of the San Diego County Office of Emergency Services and CAL Fire/San Diego County Fire to take hands-on action to be ready for wildfires.", "datePublished": "2021-05-03T15:11:44-07:00", "url": "https://www.countynewscenter.com/southern-fire-reminds-residents-to-take-action-before-fire-strikes/", "keywords": ["public safety", "defensible space", "emergency", "emergency preparedness", "southern fire", "wildfire", "wildfire preparedness week"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-05-03T15:28:41-07:00", "articleType": "article", "articleContent": "\nThe Southern Fire that forced evacuations in the Anza Borrego Desert over the weekend came at the start of “Wildfire Preparedness Week” and underscores the messages of the San Diego County Office of Emergency Services and CAL Fire/San Diego County Fire to take hands-on action to be ready for wildfires.\nThe 2020 fire season broke numerous records, and California experienced six of the largest and most destructive wildfires in state history. More than 4 million acres burned across the state, which was double the previous record set in 2008.\nWith continued dry conditions and temperatures above normal for this time of year, the upcoming 2021 wildfire season could be even more catastrophic and devastating than last year. San Diego County residents can play an important role in preparing for and preventing wildfires, and now is the time to ensure there is adequate defensible space around homes and buildings, to make homes more fire-resistant and to have a personal disaster plan.\nThis is especially important since many county residents live in high-risk fire zones. Fire prevention tools such as protective fuel breaks, fire-resistant landscaping, and home hardening for their safety and survival. These tools work together to build more fire-resilient communities.\nTo protect their home during a fire, the single most important thing a person can do is to create defensible space around their home; 100 feet is required by state law. It is important to remember that any clearance work involving any type of mower or power equipment should only be done during non-critical fire conditions because it can actually spark a fire.\nResidents who are physically and financially unable to create and maintain defensible space around their home may be able to receive assistance through the County’s Defensible Space Assistance Program.\nIndividuals and families are also urged to have an emergency plan and practice it regularly so it’s not unfamiliar in a high-stress situation like a fast-approaching wildfire. This plan should include identified evacuation routes and designated meeting locations outside of your home and neighborhood, and a list of local and out-of-area emergency contacts.  Owners of large animals such as horses or livestock should also have an evacuation plan and know when to leave in an emergency.\nIt’s also important to prepare an emergency kit in advance with important supplies, including copies of important documents, photos, non-perishable foods, water, extra clothes, medications and medical equipment, phone chargers, extra batteries, and supplies for pets.\nLastly, residents also encouraged to register their cell phones on AlertSanDiego, the county’s emergency notification system and download the SD Emergency App at no cost. An emergency plan template is available in English, Spanish, Tagalog, Vietnamese, Japanese, Arabic, traditional and simplified Chinese, Farsi, French, Korean, Somali, and in English and Spanish an audio versions.\nTo learn more about how to prepare before a fire and what to do during a fire situation, visit ReadySanDiego.org and ReadyforWildfire.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210503.15.11.44"}