{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Upcoming Work on Border Sewage System May Temporarily Increase Tijuana River Valley Flows", "description": "The second and final phase in the connection of a sewer line in Mexico (the new International Collector) will begin soon and may temporarily increase wastewater flows to the U.S.", "datePublished": "2025-05-09T18:06:24-07:00", "url": "https://www.countynewscenter.com/upcoming-work-on-border-sewage-system-may-temporarily-increase-tijuana-river-valley-flows/", "keywords": ["health", "odors", "sewage", "tijuana river"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-09T18:06:24-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe second and final phase in the connection of a sewer line in Mexico (the new International Collector) will begin soon and may temporarily increase wastewater flows to the U.S.\nThe completion of this line is critical for preventing potential catastrophic failures and increasing reliability of Tijuana’s wastewater infrastructure. The line moves untreated wastewater to both to the South Bay International Wastewater Treatment Plant (ITP) in the U.S. and the San Antonio de los Buenos Plant in Mexico.\nExpected to begin May 13 and take about a week to complete, the work may temporarily increase transboundary sewage flows into the Tijuana River Valley. Water at South County beaches may also experience more pollution during this work as some untreated wastewater is diverted directly to an ocean outfall south of the border.\nThe US International Boundary and Water Commission (USIBWC) will be in continuous contact with the construction and project managers in Mexico to monitor progress and share updates. The USIBWC has been working extensively with Mexico to mitigate wastewater spills as much as possible and have coordinated bypass lines to pump as much wastewater as possible to the ITP.\nA collaborative partnership that includes the USIBWC, U.S. Environmental Protection Agency (EPA), California Department of Public Health (CDPH), San Diego Regional Water Quality Control Board (SDRWQCB), San Diego County Air Pollution Control District (SDAPCD), and the County of San Diego has been working together since 2024 on the sewage treatment issues, progress updates and health concerns.\nPeople in affected communities can take steps to reduce the impact of the hydrogen sulfide (H2S) odors by:\n\nLimiting their outdoor activities if the smell from the odors is bothersome.\nKeeping doors and windows closed to prevent the odor from coming indoors. Air out your home or building when odor is not present (by opening doors and windows, for example).\nIncreasing air circulation indoors with fans or using central or portable air conditioning on recirculation, if available.\nRunning an air purifier with a high efficiency particulate air (HEPA) filter, activated charcoal and potassium permanganate, is particularly effective for H2S odors. SDAPCD offers free purifiers for people in the three principally affected zip codes. People interested in purchasing their own air purifiers can find a verified model with potassium permanganate on the California Air Resources Board website.\n\nPeople who are more sensitive to air pollution such as those with asthma, chronic obstructive pulmonary disease (COPD), or other chronic lung conditions should have their rescue medication(s) readily available. If symptoms from strong odors are persistent, worrisome, or get worse, people should seek medical care.\nSDAPCD monitors odor complaints and hydrogen sulfide levels for communities near the river valley.\nMore information about the ongoing pollution in the Tijuana River Valley and South County beach water is available from the SDAPCD, IBWC and the County’s dedicated South Region Health Concerns webpage.  The County also recently launched an interactive online dashboard and map displaying current environmental conditions in South County including beach water quality and sewage odor data.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250509.18.06.24"}