{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Summer is Time for Road Trips — and Road Work!", "description": "Summertime means road trips — not just for those of us heading out for fun or vacation, but also for crews working to maintain and improve San Diego County’s unincorporated roads to protect drivers and keep the public safe.", "datePublished": "2021-08-23T13:33:01-07:00", "url": "https://www.countynewscenter.com/summer-is-time-for-road-trips-and-road-work/", "keywords": ["transportation", "dpw", "public works", "road repair", "roads", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-08-23T13:33:01-07:00", "articleType": "article", "articleContent": "\nSummertime means road trips — not just for those of us heading out for fun or vacation, but also for crews working to maintain and improve San Diego County’s unincorporated roads to protect drivers and keep the public safe.\nCrews have already started working on this year’s $40 million worth of resealing and resurfacing on 98 miles of unincorporated roadways, with plans to spend an additional $56 million on additional roads in 2022.\nSlurries and overlays are designed to make roads live longer, be quieter for drivers and improve traction and safety.\nThe work covers roads around the county, in 24 unincorporated communities and planning areas. The complete list of roads for the fiscal 2020/21 year runs through Alpine, Bonsall, Crest, Fallbrook, Jamul, Julian, Lakeside, Pine Valley, Ramona, Spring Valley and many others.  You’ll know the County is coming to your neighborhood when you receive a letter in the mail, a door hanger notification and see signs posted on streets being resurfaced.\nThe County’s Department of Public Works regularly maintains more than 1,900 miles of unincorporated roads — long enough to stretch from San Diego to Atlanta, Georgia. The department uses visual and mechanical inspection, as well as input from people and communities, to determine which roads need resurfacing every year.\nThe County’s annual road work received a big financial boost when California’s Senate Bill 1, the Road Repair and Accountability Act, was signed into law in 2017.\nThat led to County supervisors approving an expanded County road improvement plan; the County is currently in the fourth year of that plan. The County resurfaced 154 miles of roads the first year, 131 miles the second year, and is just finishing up 141 miles from the third year.\nRecent advances now allow the County to use up to 25% recycled materials in new pavement, which means resurfacing is more sustainable than ever. In the first three years of the expanded road resurfacing program nearly 200,000 tons of recycled material was reused.\nThe County expects to receive $538 million from SB 1 through 2027.\nSo, when you see a crew out there working, give them a wave. Road trip!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210823.13.33.01"}