{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Expands Oyster-Linked Illness Investigation", "description": "The investigation of oyster-linked illnesses by County of San Diego health officials has expanded to include additional oyster harvest locations in Mexico. Health officials are recommending consumers and restaurants throw away any oysters imported from locations in Mexico until further notice.", "datePublished": "2024-01-18T15:29:58-08:00", "url": "https://www.countynewscenter.com/county-expands-oyster-linked-illness-investigation/", "keywords": ["health", "imported oysters", "mexico", "oysters"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-01-18T15:51:18-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe investigation of oyster-linked illnesses by County of San Diego health officials has expanded to include additional oyster harvest locations in Mexico. Health officials are recommending consumers and restaurants throw away any oysters imported from locations in Mexico until further notice. \nThe local norovirus outbreak now includes 69 confirmed and probable cases. The severity of the infections in San Diego County has remained mild, with no hospitalizations reported to date. The initial investigations identified 41 probable and confirmed norovirus cases linked to oysters harvested in Sonora, Mexico. The sickened patrons dined at the Fish Shop chain and Carlsbad Aquafarm. Twenty-eight more cases have been added including 20 who ate oysters from other food venues.  \nOyster associated norovirus cases are also being reported in Orange, Riverside, San Bernardino, Ventura, and Los Angeles counties. Both the California Department of Public Health and U.S. Food and Drug Administration (FDA) are now actively engaged in the investigation.  \nThe FDA, which has jurisdiction over oysters imported into the country, issued an initial advisory on Jan. 11, based, at least in part, on the findings of the investigation conducted by County health officials.  \nOn Jan. 17th, the FDA issued a second advisory for Laguna De Guerrero Negro and Laguna Manuela, both on the Pacific Coast of Baja California, Mexico but locations geographically distant from Sonora. Today, FDA updated the initial advisory on Sonora oysters to include a second harvest location, Estero Morua. \nThe new FDA recommendations advise restaurants and retailers to dispose of any oysters they still have or contact their distributor to coordinate return or destruction. People who have them in their homes should do the same. \nAll of the implicated oysters were harvested in December 2023 and no oysters since then have been distributed to food venues in San Diego from those locations.  \nGiven the expanding number of harvest locations associated with illness and the potential of other sites to be involved, County Public Health is recommending against the use of all oysters imported from Mexico at this time. \n“The County recommends that people ask where oysters were harvested when eating out or getting food from wholesale locations to avoid consuming oysters imported from Mexico,” said Dr. Ankita Kadakia, Deputy County Public Health Officer. “Norovirus is typically a mild illness but can cause dehydration especially for the very young and very old. Given the increasing number of cases, the chance for others at greater risk for more severe illness in the same home is also increased. I want to remind people who become ill, and those that live with them, to wash their hands frequently to avoid contaminating surfaces and foods that could further spread the infection.”  \nEating raw oysters has been linked to outbreaks with other germs including Vibrio, Shigella, and E. coli, in addition to norovirus. If you eat raw or undercooked oysters, germs that might be in the oyster can make you sick.  \nPeople who have or develop symptoms should reach out to their healthcare provider. To report illness to the County after dining out or purchasing from wholesale food locations call (858) 505-6814, or email fhdepi@sdcounty.ca.gov.  \nMore information on seafood and shellfish safety is available here, general information on norovirus is here, and prevention of norovirus spread in the home information is here. \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240118.15.29.58"}