{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Events Planned for CalFresh Awareness Month", "description": "Learn more about CalFresh and get in-person help with the application process at a variety of events throughout May in recognition of CalFresh Awareness Month. ", "datePublished": "2025-05-08T14:46:05-07:00", "url": "https://www.countynewscenter.com/community-events-planned-for-calfresh-awareness-month/", "keywords": ["health", "calfresh", "ebt", "snap"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-05-08T14:46:40-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteLearn more about CalFresh and get in-person help with the application process at a variety of events throughout May in recognition of CalFresh Awareness Month. \nCalFresh is California’s federal food assistance program, the state’s version of the U.S. Department of Agriculture’s Supplemental Nutrition Assistance Program, or SNAP, and is designed to increase access to fresh and healthy food. \nMore than 400,000 San Diegans are CalFresh recipients and applications for the benefit are accepted year-round. \nEach year the County and its community partners come together over the course of a month to provide special event opportunities where people can be screened for the program and receive help applying. Dozens of events are planned throughout May around the County.  \nCalFresh benefits are distributed through Electronic Benefits Transfer (EBT) cards. For a list of authorized retailers that accept the Electronic Benefits Transfer (EBT) cards, visit fns.usda.gov. \nTo find eligibility information and to apply online, visit BenefitsCal.com or call 2-1-1. \nMore information about CalFresh is available on the County’s CalFresh website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250508.14.46.05"}