{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrating Inclusion with Internship Program", "description": "Four interns from an inclusive internship program were recently recognized at a graduation celebration for their contributions to the County. The April 11 ceremony at the County Operations Center marked the completion of their 6-month internship with the County through Jay’s Program.", "datePublished": "2024-05-01T13:21:06-07:00", "url": "https://www.countynewscenter.com/celebrating-inclusion-with-internship-program/", "keywords": ["government", "internship", "jay s program"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2024-05-01T13:21:06-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesFour interns from an inclusive internship program were recently recognized at a graduation celebration for their contributions to the County. The April 11 ceremony at the County Operations Center marked the completion of their 6-month internship with the County through Jay’s Program.\nJay’s Program provides on-the-job training for those with intellectual and developmental disabilities. The program is designed to help participants improve job skills and increase opportunities for future employment. In partnership with PRIDE Industries and the San Diego Regional Center, the program includes professional development training and support from coaches and mentors.\nThe program also allows participating County departments to expand their perspective on inclusivity and belonging in the workplace.\nAt the graduation ceremony, Board of Supervisors Vice Chair Terra Lawson-Remer thanked the graduates for demonstrating tenacity, creativity, dedication and an unwavering commitment to their personal and professional growth over the internship.\n“You have proven that diversity of thought and being is not just a valuable asset for the County but a vital one,” said Lawson-Remer. “Thank you for sharing with us your unique perspectives and extraordinary talents.”\nThe April 2024 graduates interned with following departments: Agricultural, Weights and Measures; Environmental Health & Quality; Medical Care Services; and the Office of Equity and Racial Justice.\nTo date, 21 people have graduated from Jay’s Program.\nLearn more about qualifications and steps for participation in Jay’s Program.\nQualifications:\n\nPeople with an intellectual or developmental disability.\nLegal working age and eligible to work.\nMinimum high school diploma or equivalent education\nCan travel independently or has dependable transportation.\nCan work 20 hours a week.\nMust be both an active San Diego Regional Center and PRIDE Industries client.\nPreferred basic computer skills (MS Word, Outlook, Excel, PowerPoint, and Teams).\n\nSteps for those interested in interning with Jay’s Program:\n\nHave or apply for San Diego Regional Center services (Eligibility)\nRecommended: Have or apply for Department of Rehabilitation\nBecome a PRIDE Industries client and inform them that you are interested in the County of San Diego Jay’s Program.\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240501.13.21.06"}