{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tips to Maintain Your Mental Health During COVID-19", "description": "May is Mental Health Month and County officials are encouraging you to monitor your mental wellbeing and that of your loved ones. They’re also offering tips on how to mentally cope with pandemics.", "datePublished": "2020-05-11T16:00:18-07:00", "url": "https://www.countynewscenter.com/tips-to-maintain-your-mental-health-during-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "mental health tips"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-11T16:11:47-07:00", "articleType": "article", "articleContent": "\nOutbreaks of infectious diseases can be a stressful time. With additional concerns about the economic impact of the pandemic, many may feel overwhelmed with anxiety, fear, or worry.\nMay is Mental Health Month and County officials are encouraging you to monitor your mental well-being and that of your loved ones. They’re also offering tips on how to mentally cope with pandemics.\nCommon signs of distress may include:\n\nFeelings of numbness, disbelief, anxiety, or fear\nChanges in appetite, energy, and activity levels\nDifficulty concentrating\nDifficulty sleeping or nightmares and upsetting thoughts and images\nPhysical reactions, such as headaches, body pains, stomach problems, and skin rashes\nWorsening of chronic health problems\nAnger or short temper\n\nLuke Bergmann, director of County Behavioral Health Services, said it’s important to keenly observe your mental and emotional wellbeing and to find ways to safely stay connected to your friends and family. Be aware of the signs of stress and know when to seek help for yourself, and those you care about.\n“While COVID-19 is impacting communities in different ways and to different extents, it is traumatic for all of us.  We all need one another, now maybe more than ever, to get through difficult times,” Bergmann said. “Find ways to stay connected. Call or video chat with friends and family or a support line until it’s safe to do it in person.”\nHere are other tips to maintain your mental health:\n\nTake care of your body by stretching, taking deep breaths, and meditating.\nEat healthy and well-balanced meals.\nExercise and get plenty of sleep.\nMake time to unwind and engage in activities you love, if they’re allowed.\nLimit time spent watching, reading or listening to information about the pandemic, even on social media.\n\nMental Health Resources Available Year Round\nMental Health Month was established to raise awareness, educate communities and reduce stigma surrounding people experiencing mental illness.\nThe County Administration Center, located at 1600 Pacific Highway, will be lit lime green from May 11-15 to celebrate people in recovery and those who support them.\nThe County and its partners have created virtual events to commemorate the month, due to the restrictions on public gatherings. People can still come together to break the stigma and support mental health.\nIt’s important for residents to know that despite the COVID-19 pandemic, mental health resources and support are still readily available through County Behavioral Health Services and its many service providers.\nIf you or someone you know need help or are experiencing a mental health crisis, you can talk to a trained counselor by calling the County’s 24-hour, multi-lingual Access and Crisis Line at (888) 724-7240. Other resources are available on Behavioral Health Services’ COVID-19 Resources for Families, Parents & Caregivers webpage or the It’s Up to Us website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200511.16.00.18"}