{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County of San Diego​ Awarded Grant from the Office of Traffic Safety for Child Safety Seat Education Program", "description": "The County of San Diego Health and Human Services Agency,​ received a ​$250,000​ grant from the California Office of Traffic Safety (OTS).", "datePublished": "2023-11-29T08:44:48-08:00", "url": "https://www.countynewscenter.com/county-of-san-diego-awarded-grant-from-the-office-of-traffic-safety-for-child-safety-seat-education-program/", "keywords": ["families", "car seat", "child safety", "grant"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-11-29T08:44:48-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency,​ received a ​$250,000​ grant from the California Office of Traffic Safety (OTS). It will support the County’s Department of Homeless Solutions and Equitable Community’s efforts to educate parents and caregivers about the importance of child safety seats and making sure that every child in our community travels safely. \n“This grant reinforces our dedication to raising awareness of the proper use and installation of child safety seats,” The County of San Diego Health and Human Services Agency, Community Operations Officer Barbara Jiménez said. “With this support, we can help strengthen families by offering valuable education and providing child safety seats.”  \nFunds will be used for a variety of community outreach events, education classes, distribution of child safety seats, and training on the installation and use of child safety seats.  \n The car seat safety program includes:  \n\nChild safety seat inspection events and education classes.  \nChild Passenger Safety Technician (CPST) training and recertification courses.  \nChild safety seats at no-cost for families with income 200 percent or more below the federal poverty level.   \nPartnering with local organizations on car seat safety community outreach efforts in underserved communities.  \n\nThe program runs through September 2024. \nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231129.08.44.48"}