{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Health Officials Investigating Outbreak Linked to Raw Milk", "description": "County of San Diego health officials have linked nine cases of Salmonella illness to unpasteurized or “raw” milk or milk products from a producer in Fresno, CA. The cases began in late September and the County of San Diego Health and Human Services Agency (HHSA) urges anyone who may have recently purchased Raw Farm LLC raw milk or milk products to not consume it and discard the product.", "datePublished": "2023-10-20T14:09:05-07:00", "url": "https://www.countynewscenter.com/health-officials-investigating-outbreak-linked-to-raw-milk/", "keywords": ["health", "health", "salmonella"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-10-20T14:09:05-07:00", "articleType": "article", "articleContent": "\nCounty of San Diego health officials have linked nine cases of Salmonella illness to unpasteurized or “raw” milk or milk products from a producer in Fresno, CA. The cases began in late September and the County of San Diego Health and Human Services Agency (HHSA) urges anyone who may have recently purchased Raw Farm LLC raw milk or milk products to not consume it and discard the product.\nThe illnesses have been caused by Salmonella bacteria, which is commonly found in human and animal intestines. The nine San Diego County residents who became ill have reported consuming Raw Farm LLC raw milk or milk products the week before their illness onset. The cases range in age from 1 to 41 years old. Three of the nine were hospitalized, all of which were children.   \n“The County recommends that people who have products from this company in their homes dispose of them immediately,” said Dr. Seema Shah, medical director of the County’s Epidemiology & Immunization Services Branch. “It’s also important for anyone sick to seek medical care. People who are ill, and those that live with them, should wash their hands frequently to avoid contaminating surfaces and foods that could spread the disease.” \nRaw or “natural” milk has not gone through the pasteurization process that heats the milk to a high temperature for a short period of time to kill harmful germs that can contaminate raw milk. These germs can include Salmonella, Listeria, E. coli, and other bacteria, viruses, and parasites. Pasteurization is the only effective method for eliminating most harmful germs in raw milk or milk products and does not significantly change dairy’s nutritional value. \nThe Centers for Disease Control and Prevention recommends against the consumption of raw milk and related products. People most at risk for severe illness are adults 65 years and older, children younger than 5 years of age and individuals with weakened immune systems. \nPeople infected with Salmonella generally develop bloody or watery diarrhea, stomach cramps, fever, nausea, vomiting, and headache approximately six hours to six days after consuming contaminated foods. The illness typically lasts for 4-7 days. In some cases, people may develop severe illness that leads to hospitalization.  \nThe County of San Diego HHSA is working closely with California Department of Public Health (CDPH) and the California Department of Food and Agriculture (CDFA), to continue investigating illnesses associated with raw milk and milk products. People who have or develop symptoms should reach out to their healthcare provider. More information on raw milk safety is available here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231020.14.09.05"}