{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Update: Shigella Outbreak in San Diego County – 10-26-2021", "description": "Six new shigella cases associated with an ongoing outbreak have been reported in San Diego County, bringing the total to 23 confirmed and four probable cases among people experiencing homelessness.", "datePublished": "2021-10-26T15:40:50-07:00", "url": "https://www.countynewscenter.com/update-shigella-outbreak-in-san-diego-county-10-26-2021/", "keywords": ["health", "homeless", "outbreak", "shigella", "shigellosis"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2021-10-26T15:51:50-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego has announced six new shigella cases associated with an ongoing outbreak, bringing the total to 23 confirmed and four probable cases among people experiencing homelessness.\nThe continuing investigation shows onset of illness dates between Aug. 16 and Oct. 17, with the three new cases occurring between Sept. 10 and Oct. 17. The 27 cases in this outbreak represent 9% of the 290 total cases reported to date in San Diego County.\nThe cases are all among individuals experiencing homelessness who resided at multiple locations in central San Diego. No source of the outbreak has currently been identified.\nThe County is working closely with the City of San Diego to:\n\nIdentify potential exposure sites.\nPromote good hygienic precautions among homeless service providers and food providers.\nIdentify additional cases.\nConnect ill individuals to treatment and housing.\n\nOther steps include:\n\nRelocation of currently deployed handwashing stations to areas frequented by homeless individuals and evaluation of need for additional stations.\nIncreased cleaning of portable and fixed public bathrooms.\nIncreased sidewalk sanitization from twice weekly to seven days per week for the time being. Frequency will be continually assessed.\nNotification by the County Department of Environmental Health and Quality about the outbreak – and precautions – to food facilities in the downtown area, charitable feeding operators, the California Restaurant Association, Downtown San Diego Partnership,  Regional Task Force on the Homeless and Gaslamp Quarter Association.\nPublic health nurses conducting outreach at shelters.\nHomeless Outreach Teams offering shelter resources and distributing shigella information as part of hygiene kits given to persons experiencing homelessness, including an extra 600 the week of Oct. 18.\n\nShigella is a contagious infection typically spread by contaminated surfaces, food or water, or person to person. Those at increased risk include young children (especially those in daycare), people who are experiencing homelessness, travelers to locations with poor sanitation and men who have sex with men. In 2020, a total of 240 shigellosis cases were reported in San Diego County residents while the 426 cases reported in 2019 was the highest since 1995.\nTypical symptoms of shigellosis include diarrhea (sometimes bloody), fever and stomach cramps. While most people will recover fully without antibiotic treatment, some individuals with poor immune systems can develop life-threatening disease and may need further treatment.  People with symptoms that resemble shigella should contact their medical care provider. The provider may order stool testing to help with the diagnosis.\nStrategies to avoid getting or spreading shigella include frequent hand washing and not preparing food while ill with diarrhea.\nMore information about shigella and precautions are available through the County, a California Health Alert Network notification and the Centers for Disease Control and Prevention.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211026.15.40.50"}