{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Case Rate Increasing; Could Move to Lower Tier", "description": "The case rate for the region increased in the past week, placing the County at risk of dropping to Tier 1, the highest-risk level.", "datePublished": "2020-09-09T17:48:40-07:00", "url": "https://www.countynewscenter.com/county-case-rate-increasing-could-move-to-lower-tier/", "keywords": ["health", "case rate", "coronavirus", "covid-19", "purple tier"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-09-09T22:25:55-07:00", "articleType": "article", "articleContent": "\nThe case rate for the region increased in the past week, placing the County at risk of dropping to Tier 1, the highest-risk level.\nThe region’s case rate rose to 6.9 cases per 100,000 residents after entering the state’s new monitoring system with a 5.8 case rate and being placed in Tier 2, also known as Red Tier.\nShould the case rate continue to increase, the County could be moved to Tier 1, or Purple, which carries more restrictive COVID-19 measures.\n“San Diegans should continue taking the necessary measures to keep COVID-19 from spreading and the case rate from increasing,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nTier placement is also based on each County’s percentage of tests coming back positive for COVID-19.\nThe positivity rate also increased from 3.4 to 4.2%, but still well below the state’s goal of 8% or less.\nShould the County positivity rate hit 8% and the case rate continue to increase to more than seven cases per 100,000 residents for two consecutive weeks, the region would have to be moved to the Purple Tier.\nFor those counties not testing their residents at the same rate as the state, new adjustment factors have been added, potentially increasing a region’s case rate. Counties that are testing above the state’s rate have had their case rates scaled down.\nBased on the state’s testing data from the County, the region’s case rate is at 7.9 per 100,000 residents, but the region did not get penalized because the state has been having issues, going back several months, that prevent it from getting the County’s correct testing numbers.\n“We’re working with the state to resolve the issue,” Wooten said. “Currently, the state has indicated that they will use the County’s data to calculate the case rate and positivity percentage over the next several weeks.”\nShould the County’s case rate drop to under 3.9 for a consecutive two weeks, it would qualify to move into Tier 3, or Orange Tier. The region’s positivity percentage has been under 4.9% for over two weeks and would allow the region to move to the higher, less-restrictive Tier 3. However, both metrics will need to qualify for the Orange Tier for two weeks before the County could move into it.\nThe state will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 15.\nSix, No-Appointment COVID-19 Testing Sites Now Open\nThe County has increased the number of free, no-appointment testing sites to make it easier for San Diegans to get a COVID-19 test.\nSix sites now provide free testing across the region. They are located at:\n\nCalifornia State University San Marcos – Viasat Engineering Pavilion\nUniversity of San Diego Parking Lot\nSan Diego State University Parking Lot 17-B (Moving to the Alumni Center on Monday, Sept. 14.)\nTubman-Chavez Community Center\nMar Vista High School (Drive-up site)\nSan Ysidro Port of Entry PedEast\n\nAppointments are necessary at other County testing sites. To make an appointment, visit www.211sandiego.org or call 2-1-1.\n\nNew State Metrics:\n\nUnder the new state monitoring metrics, San Diego County is currently in Tier 2, also referred to as the Red Tier.\nSan Diego’s state-calculated, unadjusted case rate is 6.9. The testing positivity percentage is 4.2%.\nThe state will assess counties on a weekly basis, with the next report scheduled for Tuesday, Sept. 15.\n\nCommunity Setting Outbreaks:\n\nThree new outbreaks were confirmed on Sept. 8: one in a restaurant/bar and two in business settings.\nIn the past seven days, 22 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n4,556 tests were reported to the County on Sept. 8 and the percentage of new laboratory-confirmed cases was 5%.\nThe 14-day rolling average percentage of positive cases is 4.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 6,339.\n\nCases:\n\n247 new cases were confirmed among San Diego County residents on Sept. 8 for a total of 41,324.\n3,237 or 7.8% of cases have required hospitalization.\n773 or 1.9% of all cases and 23.9% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n12 new COVID-19 deaths were reported in San Diego County on Sept. 8. The region’s total is now 721.\nSix women and six men died between Aug. 29 and Sept. 7. Their ages ranged from mid-50s to late 80s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200909.17.48.40"}