{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two County Programs Win Challenge Awards", "description": "An innovative program that offers $100,000 grants for 20 small nonprofit businesses and another that helps incarcerated caregivers read books to their children were honored with California State Association of Counties (CSAC) Challenge Awards.", "datePublished": "2025-01-13T12:20:27-08:00", "url": "https://www.countynewscenter.com/two-county-programs-win-challenge-awards/", "keywords": ["government", "county library", "csac", "equity impact grant program", "raising a reader"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-01-13T15:04:00-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesAn innovative program that offers $100,000 grants for 20 small nonprofit businesses and another that helps incarcerated caregivers read books to their children were honored with California State Association of Counties (CSAC) Challenge Awards.\nThe Challenge Awards spotlight creative programs and services offered by California Counties that are effective and cost-saving. This year, CSAC honored 16 programs from 11 different counties. San Diego County and Nevada County tied for the second most awards with two wins. The top contender was Riverside County with three awards.\nThe County of San Diego Office of Equity and Racial Justice launched the Equity Impact Grant Program, which selects 20 small nonprofits for the unrestricted operating grants, and provide coaching and training to seek additional funding opportunities. This program has created additional opportunities for grassroots and small organizations led by individuals from Black Indigenous People of Color communities who often face many barriers in securing funding. The new program gave out its first 10 grants in May 2024 and those recipients have reported that the grants are helping them continue their work and amplify its impact. The second round of 10 grants were awarded in December.\nThe San Diego County Library’s Raising a Reader workshops program is geared toward incarcerated adults with a child up to 5 years old. Library staff go into the women’s incarceration and re-entry facility to provide a curriculum in early literacy that encourages them to read to their children and educates them about the lifelong benefits of literacy and library services. As a bonus, the caregiver picks two free children’s books to practice reading while incarcerated that they can take them home upon their release. The workshops are voluntary and are held monthly. This program addresses the high functional literacy rate among juveniles who interact with the court and the issue of generational incarceration since children of incarcerated parents are six times more likely to become incarcerated themselves.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250113.12.20.27"}