{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Achieves National Public Health Reaccreditation Status", "description": "The Public Health Services department, in the County of San Diego’s Health & Human Services Agency, received national recognition for its continued progress in keeping the region healthy, safe and informed about public health issues and concerns.", "datePublished": "2023-08-31T17:17:00-07:00", "url": "https://www.countynewscenter.com/county-achieves-national-public-health-reaccreditation-status/", "keywords": ["health", "education", "public health", "public safety"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-09-01T09:40:00-07:00", "articleType": "article", "articleContent": "\nThe Public Health Services (PHS) department, in the County of San Diego’s Health & Human Services Agency (HHSA), received national recognition for its continued progress in keeping the region healthy, safe and informed about public health issues and concerns.\nPHS achieved initial accreditation, in 2016, from the national Public Health Accreditation Board and was recently reaccredited on Aug. 21, 2023.\n“Protecting the health of individuals is the County’s number one priority,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Reaccreditation confirms that the local public health systems are helping to achieve the mission of protecting all communities.”\nThis recognition demonstrates that the County continues to meet national standards and provide needed quality public health services to the community, some of which include the following:\n\nInvestigating public health problems\nInforming and educating the public about health issues\nEnforcing public health laws and regulations\nPreparing for and responding to public health threats, emergencies and disasters\nAdvancing health equity across a diverse population\n\nEarning public health reaccreditation is a process that requires review of standardized measures by an expert panel.\nThe panel looks at procedures investigating public health threats, which include foodborne illness, active tuberculosis, and communicable diseases such as Ebola, Zika and COVID virus.\nThe panel also reviews processes used in enforcing public health laws and regulations related to beach closures, hazardous materials, and restaurant inspections.\nThe County’s PHS department, partnering with the Department of Environmental Health and Quality, Medical Care Services and the Office of Emergency Services delivers these essential public health services.\n“This reaccreditation designation recognizes the County’s continued commitment across departments and with our community partners throughout the region when responding to public health issues,” said Dr. Eric McDonald, interim HHSA director.\nMore information about public health accreditation is available at www.phaboard.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230831.17.17.00"}