{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Encourages a Wellness Practice for Mental Health Awareness Month ", "description": "May is Mental Health Awareness Month, a time to highlight the importance of mental health and to note that no one is alone in confronting struggles.   ", "datePublished": "2024-05-16T14:07:37-07:00", "url": "https://www.countynewscenter.com/county-encourages-a-wellness-practice-for-mental-health-awareness-month/", "keywords": ["health", "mental health awareness month", "mental wellness", "san diego mental health resources"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-05-16T14:07:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesMay is Mental Health Awareness Month, a time to highlight the importance of mental health and to note that no one is alone in confronting struggles.   \nThis month, people are encouraged to check-in with friends and loved ones, learn more about resources and reach out to get support for their mental health or that of a loved one.   \nCounty Behavioral Health Services invites you to take the 30-Day Mental Wellness Practice, a free and friendly way to engage in daily self-care activities. \n“Mental Health Awareness Month reminds us of the importance of taking care of our mind and emotions,” said Dr. Luke Bergmann, Director of County Behavioral Health Services. “The 30-Day Mental Wellness Practice is a great way to get started and try new self-care activities that we hope people will make part of their everyday lives.” \nThe 30-Day Mental Wellness kit includes 40 self-care practices and activity worksheets, phone wallpapers and more. All materials are available in both English and Spanish.  \nSelf-care activities include developing a nighttime routine, trying a new recipe, calling a loved one, doing a one-day digital detox, coloring or watching the sunset.  \nResources are available to help people experiencing a mental health challenge that can affect thinking, emotions, behaviors or mood.   \nIf you or someone you know is experiencing a mental health challenge, call the Access and Crisis Line at 1-888-724-7240.  \nMental health resources and information  \n\nIt’s Up to Us SD has information on how you can support your mental health and help others in need.    \nExplore the Behavioral Health Services Managing Your Mental Wellness webpage for resources to help you manage life’s daily stressors.  \nThe San Diego Mental Health First Aid program offers a free course to increase your personal mental health literacy.  \nThe San Diego Suicide Prevention Council offers free “Question, Persuade, and Refer” Gatekeeper Trainings for Suicide Prevention covering basic skills to recognize warning signs that someone may be contemplating suicide.  \nThe Breaking Down Barriers Program does outreach and education program and works with Black, Indigenous, and People of Color (BIPOC) and the LGBTQIA+ community to talk about mental wellness. \n\nServices for Older Adults \n\nThe Elder Multicultural Access and Support Services program serves older adults in need of specialized support services with focused attention to Black, Chaldean, Iraqi, Filipino, Hispanic, and Somali seniors (60 years and older) by providing outreach, engagement, and education for prevention and early intervention of mental health challenges. \n\nServices for Veterans \n\nThe Courage to Call program is dedicated to improving mental wellness for Veterans, Active Duty, Reservists, National Guardsmen, and their families throughout San Diego County. The 24/7 helpline is available at 1-877-698-7838 or 2-1-1 Option 4.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240516.14.07.37"}