{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Pet Buddy Will Brighten and Warm Your Life", "description": "Nothing makes June-gloomy days brighter than a sweet friend, whether furry, feathered or scaly. They bring their own sunshine into your life.", "datePublished": "2025-05-30T13:50:52-07:00", "url": "https://www.countynewscenter.com/new-pet-buddy-will-brighten-and-warm-your-life/", "keywords": ["animals", "adopt pets", "das"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-05-30T14:21:27-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesNothing makes June-gloomy days brighter than a sweet friend, whether furry, feathered, or scaly. They bring their own sunshine into your life.\nAll pets, 6 months old or older, are just $25 to adopt from June 1-7 at San Diego County Animal Services shelters in Bonita and Carlsbad. This fee includes spay/neuter, microchip, up-to-date vaccinations and a one-year DocuPet dog license for residents in the County Service area.\nZara, 2, a Red Merle Australian Cattle Dog/Catahoula Leopard Dog mix is available at the County’s Northern Shelter\nAdoption fees are waived for senior pets and pets that have been at the shelter longer than 6 months. Seniors, age 60 and up, also can adopt for no adoption fees.\nLook at these beautiful and sweet little faces that could bring sunny rays into your summer. Walk-in hours: 10 a.m. to 4 p.m., Tuesday through Sunday. Just bring a valid photo ID — adoptions are first-come, first-served.\nVisit County Animal Services at either shelter location:\n🐾    South Shelter: 5821 Sweetwater Road, Bonita\nEmma, 8, a Weimaraner and a ray of sunshine, is available a the South Shelter.\n🐾    North Shelter: 2481 Palomar Airport Road, Carlsbad\nIf you love animals but are not ready to adopt, try fostering. Give a shelter pet a temporary break and help them adjust to home life — it’s a great way to help, and we provide all the supplies you need like food, leash, bedding, etc. Fostering makes a huge difference in helping pets get adopted.\nAnimal Services has eliminated jurisdiction restrictions for administering pet vaccines. This means all pet owners can just walk-in with their pet to get a vaccine, even if you live in a city. No appointments are needed.\nThis is one of several 3-month-old German Shepherd puppies available for adoption at the County’s South Shelter.\nCounty Animal Services provides services such as low-cost microchip and rabies vaccination clinics at County animal shelters every day with no appointment necessary and educational resource information such as disaster preparedness for pets, training, low-cost vaccination clinics and safety tips on its website.\nThe department also helps reduce pet overpopulation by altering all animals which are put up for adoption from its shelters.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250530.13.50.52"}