{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Success Story: Sheriff’s Department Reentry Programs Key to Woman’s New Path in Life", "description": "Everyone makes mistakes, and San Diego native Angela Carapia is no exception.", "datePublished": "2021-05-13T08:45:43-07:00", "url": "https://www.countynewscenter.com/success-story-sheriffs-department-reentry-programs-key-to-womans-new-path-in-life/", "keywords": ["public safety", "justice system reform", "re-entry", "san diego sheriff s department"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-05-13T14:25:51-07:00", "articleType": "article", "articleContent": "\nEveryone makes mistakes, and San Diego native Angela Carapia is no exception.\nShe said her life began to spiral out of control in 2013 while being a single mother, preparing to send her son off to college, taking care of an ailing mother, attempting to reconnect with an absentee father, dealing with substance use, and trying to manage the day-to-day finances of the family. It was just too much.\nShe made a series of bad decisions around that time; before she knew it, she was at the Las Colinas Detention and Reentry Facility facing a possible sentence of 18 years. Her story could have stopped there, as it does for many men and women in the county who experience similar issues. Not Carapia.\nAlmost immediately after arriving at Las Colinas, Carapia said she decided the incarcerated life was not the way she wanted to live. She credits the multiple reentry programs offered by San Diego County Sheriff’s Department for putting her on a new path in life.\n“It’s a very humbling experience, and these programs actually do help,” said Carapia. “They aren’t here to make you fall or trip you up like many people might think. They are here to actually help you get your life back on track and have a future for yourself.”\nCarapia entered the Incentive-Based Housing program just a few weeks after arriving at Las Colinas. The program allows inmates more access to reentry programs if they agree to take part in psychosocial, education, and wellness classes.\nAfter completing the housing program, Carapia took the opportunity to participate in one of the vocational programs offered at Las Colinas that helps to prepare women for reentry into society once their sentences are complete. Ms. Carapia completed nearly all the programs offered at the facility, ranging from the Beyond Anger and Violence program to working with The Old Globe theater, which she still does.\nBridget Wright, a supervisor with the Sheriff’s Reentry Services Division, said that Carapia’s performance in the Culinary Arts Program and interest in continuing in the field led to additional opportunities in food service.\n“She was encouraged to complete the new Kitchens for Good Management Program, and she did,” said Wright. “She was actually awarded the OASIS award from instructors and staff at the Grossmont Adult Education School for being an outstanding student during her Kitchens for Good graduation last month.”\nWright said, “While the support and reentry programs are there, Ms. Carapia is doing all the hard work herself. She will now begin her 20-month apprenticeship working in restaurants, while continuing to prioritize her recovery and meeting the conditions of her mandatory supervision.”\nCarapia is currently working as a cashier at Sombrero Mexican Food in the Grantville neighborhood, a local, family-owned restaurant chain. She said the skills she learned in the Culinary Arts Program will help her move up into other kitchen and restaurant management positions in the area.\n“There were times when I wanted to throw in the towel, but I saw the light at the end of the tunnel,” said Carapia. “It wasn’t easy, but a lot of people are proud of me, and I’m proud of myself.”\nFor women leaving the justice system and returning to the community, Carapia highly recommends the reentry programs available. Her advice for others in similar situations in the justice system is simple. She tells them not to give up on themselves, no matter what the current circumstances may be because things get better.\n“We all have battle scars from our past,” said Carapia. “These services are there to help you, and they really want you to succeed and not go back to being locked up.”\nDuring the almost five years she spent behind bars at Las Colinas, Ms. Carapia said in addition to the reentry programs she also found comfort in a poem that makes its way around the facility, as well as other detention facilities in the U.S., called “God’s Hotel.”\n“That poem is very inspirational to me,” said Ms. Carapia. “It says God put me there, even though it wasn’t my choice or his choice either, but it was a place where I could focus on myself.”\nYou can watch a video of Carapia participating in the Sheriff’s Theater Arts program. Learn more about the many Sheriff’s Department reentry programs preparing inmates for their return to society.\nSheriff’s Healing Through Arts Program\nSheriff’s Culinary Arts\nSheriff’s Reentry Video Program Showcase\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210513.08.45.43"}