{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Association of Counties Recognizes Five Innovative County Programs ", "description": "Five San Diego County programs were chosen by the California State Association of Counties for  2020 Challenge Awards, highlighting innovation among programs developed and implemented in county government.  ", "datePublished": "2020-11-13T09:00:41-08:00", "url": "https://www.countynewscenter.com/state-association-of-counties-recognizes-five-innovative-county-programs/", "keywords": ["government", "awards", "csac", "love your heart"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-11-16T16:33:52-08:00", "articleType": "article", "articleContent": "\nFive San Diego County programs were chosen by the California State Association of Counties for  2020 Challenge Awards, highlighting innovation among programs developed and implemented in county government.    \nSan Diego County received the second most awards this year. Los Angeles County received seven. In total, 49 programs from 25 counties were awarded this year.  \nThe Love Your Heart, Heart Health Awareness program received a Challenge Award in the Health and Human Services category. The Love Your Heart annual campaign was launched on Valentine’s Day 2012 to address the negative impacts of heart disease in the region. Partnering organizations and businesses provide volunteers to check blood pressures, collect data, and help promote the availability of blood pressure sites in a variety of locations and settings to ensure broad accessibility. The inaugural year, 1,000 blood pressure readings were taken at the event. In 2020, through the help of hundreds of volunteers, there were more than 56,000 blood pressure readings completed across 542 sites in the United States and Mexico. Of these, more than 5,441 hypertensive cases were identified and referred to urgent or emergency care, as appropriate. \nCSAC also gave a Merit Award in the same category to the Health and Human Services Agency for its Stopping the Incarcerated Homeless Mentally Ill Cycle program. The program provides inmates who have been diagnosed with a mental illness immediate housing upon their release from jail. This is accomplished with peer-led care coordination and system navigation in the community to connect participants to permanent housing and supportive services. The Community Care Coordination program team is led by HHSA and teams up with the Sheriff’s Department and the Office of the Public Defender. The program continues to work with people for up to 12 months after their release from custody to ensure they are getting appropriate care.\nThe Probation Department’s Promoting Youth Success with Alternatives to Detention Program earned a Merit Award in the Administration of Justice and Public Safety Category. The program provides youth with needed services from community providers to reduce youth contact with the juvenile justice system. This ultimately reduces recidivism and the youth’s time in custody. Additionally, it lowers costs associated with detaining youth in custody. \nThe Virtual Recreation Center program received a Merit Award in the Government Finance, Administration and Technology category. When COVID-19 restrictions closed local parks in the spring and restricted events and regular parks programming, the Department of Parks and Recreation figured out a way to continue offering its content online using its website, social media and videoconferencing. Parks offered talks with rangers using videoconferencing, re-imagined the Summer Movies in the Park to Summer Movies at Home, offering fun recipes for families to try out as an added option. Parks also offered interactive content such as a trivia contest on social media with a local hiking author, ranger-led talks using Facebook Live and virtual hike videos to entice people to explore safely once trails were reopened.   \nThe Accessory Dwelling Unit Program accepted a Merit Award in the Housing, Land Use and Infrastructure category. The Planning and Development Services Department’s program provides several cost and time saving incentives from permit waivers to pre-approved plans to expedited plan check services for property owners who build additional dwellings, often referred to as granny flats, on their properties.  By encouraging people to build accessory dwellings on their property, it helps with the shortage of affordable housing. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201113.09.00.41"}