{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Holds Cool Zone Event with Weather Warming Up", "description": "County Board of Supervisors Chairwoman Nora Vargas and County health officials held a press event Tuesday to remind people the County’s Cool Zone program gives them free, safe, air-conditioned sanctuaries to escape extreme heat as temperatures are expected to rise this weekend.", "datePublished": "2023-06-27T13:09:18-07:00", "url": "https://www.countynewscenter.com/county-holds-cool-zone-event-with-weather-warming-up/", "keywords": ["health"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-06-28T09:34:00-07:00", "articleType": "article", "articleContent": "\nCounty Board of Supervisors Chairwoman Nora Vargas and County health officials held a press event Tuesday to remind people the County’s Cool Zone program gives them free, safe, air-conditioned sanctuaries to escape extreme heat as temperatures are expected to rise this weekend.\nA complete list of Cool Zone sites, their hours and locations is located online. The site includes a map feature where people can type in their address to find locations near them. People can also call 2-1-1 to find a location, or, if they cannot get to a Cool Zone, ask for help with free transportation.\nThe Cool Zone program runs from June 1 through Oct. 31. It gives people more than 60 places, including County and city libraries and community centers, to go to if they need respite from extra-high temperatures.\nExtreme heat can be especially dangerous for older adults and children. The County Health and Human Services Agency 2022 Excessive Heat Report released Friday stated there were 15 Heat Alerts issued by the National Weather Service, compared to 16 the year before.\nEveryone is recommended to shelter in cool locations when the temperatures get too hot. Working or exercising outside on a hot day or staying in a hot space too long can cause heat-related illnesses. Those can range from cramps to exhaustion and heatstroke—a condition when the body can no longer control its temperature.\nFor more information about the County’s Cool Zone program, go to the Health and Human Services Agency’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230627.13.09.18"}