{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mail Ballots Go Out to Registered Voters for Nov. 3 Election", "description": "More than 1.9 million mail ballots are on their way to San Diego County registered voters for the Nov. 3 Presidential General Election. You may find yours in your mailbox as early as Monday, Oct. 5.", "datePublished": "2020-10-05T08:00:09-07:00", "url": "https://www.countynewscenter.com/mail-ballots-go-out-to-registered-voters-for-nov-3-election/", "keywords": ["elections", "2020 presidential general election", "drop-off locations", "fgg", "mail ballots", "michael vu", "nov. 3 general election", "vote safer san diego", "where s my ballot"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-10-05T08:37:55-07:00", "articleType": "article", "articleContent": "\nMore than 1.9 million mail ballots are on their way to San Diego County registered voters for the Nov. 3 Presidential General Election. You may find yours in your mailbox as early as Monday, Oct. 5. You will also find your “I Voted” sticker inside your official mail ballot packet.\nThe Registrar of Voters office in Kearny Mesa is also now open for early voting from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar urges voters to take advantage of their mail ballots.\n“We encourage voters to act early and make voting decisions from the comfort and safety of their home,” said Registrar of Voters Michael Vu. “Mark your ballot, sign, seal and return your mail ballot to a trusted source. The sooner we receive your ballot, the sooner we can start processing it so it will be counted right when the polls close at 8 p.m. on Nov. 3.”\nWhile polling places will open for in-person voting, all California voters are receiving mail ballots for this election to help them avoid contact with others during the COVID-19 pandemic.\nYou can return your marked ballot in the pre-paid postage envelope to any U.S. Postal Service office or collection box. Starting Tuesday, Oct. 6, you’ll also have the option to drop off your ballot at one of 126 mail ballot drop-off locations around the county. Find a drop-off location near you with this locator tool.\nYou can now track your mail ballot by signing up for Where’s My Ballot? Find out how at sdvote.com and receive automatic notifications on the status of your ballot.\nIf you haven’t received your mail ballot by Wednesday, Oct. 14, call the Registrar’s office at (858) 565-5800.\nTo learn more about Vote Safer San Diego and voting in the Nov. 3 election, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201005.08.00.09"}