{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Record-High Deaths as More Local Cases of New COVID-19 Strain Are Confirmed", "description": "The County of San Diego Health and Human Services Agency is reporting a record-high number of new COVID-19 deaths. The 62 deaths reported today well surpass the previous single-day record of 39 deaths reported on Dec. 22.", "datePublished": "2020-12-31T17:15:10-08:00", "url": "https://www.countynewscenter.com/county-reports-record-high-deaths-as-more-local-cases-of-new-covid-19-strain-are-confirmed/", "keywords": ["health", "62 deaths", "coronavirus", "covid-19", "uk strain"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-12-31T17:15:10-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Health and Human Services Agency is reporting a record-high number of new COVID-19 deaths. The 62 deaths reported today well surpass the previous single-day record of 39 deaths reported on Dec. 22.\nMeanwhile, whole genome sequencing has detected three new cases of the United Kingdom variant of COVID-19, also known as B.1.1.7., beyond yesterday’s report.\nThe three newly-confirmed variant cases reported today were initially identified by Helix during diagnostic testing, then confirmed by whole genome sequencing by Scripps Research.\nThe new cases of the UK strain were found in men, two in their 40s and one in his 50s. Contact tracing shows two men did not travel outside of the county while the third case has yet to be fully interviewed. None of the men had any known interaction with each other or the other confirmed case.\nA household contact of the first local B.1.1.7. strain case reported yesterday has been hospitalized for COVID-19, with whole genome sequencing pending.\nThe discovery of the additional cases leads County Health Officials to believe that the new strain of the virus is widespread in the community. The four individuals who have tested positive for the B.1.1.7. strain live in La Mesa, Mission Beach, Otay Mesa and the Carmel Mountain/Rancho Bernardo area.\n“We believe that many more cases of the B. 1.1.7. strain will be confirmed in the coming days and weeks,” said Eric McDonald, M.D., M.P.H., medical director of the County Epidemiology and Immunizations Services branch. “This strain of the virus has been reported to be spread more easily in the UK and so it is therefore crucial that now, more than ever before in this pandemic, we follow the public health orders and keep each other safe.”\nIn light of the high case numbers and new strain being detected in the region, County health officials urge San Diegans to:\n\nWash your hands\nWear a mask\nKeep your distance from others and leave your household only for essential activities\nIf you’re sick, get tested, and then stay home and isolate yourself\n\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) bed availability for the Southern California region is now 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last until the region’s ICU availability meets or exceeds 15%.\n\nCommunity Setting Outbreaks:\n\n12 new community outbreaks were confirmed on Dec. 30: Three in healthcare settings, two in business settings, two in emergency services settings, two in faith-based agency settings, one in a food/beverage processing setting, one in a TK-12 school setting and one in a daycare/preschool/childcare setting.\nIn the past seven days (Dec. 24 through Dec. 30), 59 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n28,183 tests were reported to the County on Dec. 30, and the percentage of new laboratory-confirmed cases was 11%.\nThe 14-day rolling average percentage of positive cases is 11%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 21,379.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n3,083 new cases were reported to the County on Dec. 30. The region’s total is now 155,595.\n5,869 or 3.8% of all cases have required hospitalization.\n1,216 or 0.8% of all cases and 20.7% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n62 new COVID-19 deaths were reported to the County on Dec. 30. The region’s total is now 1,534.\n26 women and 36 men died between Dec. 15 and Dec. 30, and their ages ranged from mid- 40s to early 100s.\nA total of 59 had underlying medical conditions, one did not have medical conditions and two have medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201231.17.15.10"}