{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reminds People About Federal Internet Discount Program", "description": "The County is reminding the public about a Dec. 31 deadline for low-income residents and families to apply to receive discounted high-speed Internet service through the Federal Communications Commission.", "datePublished": "2021-12-15T09:03:10-08:00", "url": "https://www.countynewscenter.com/county-reminds-people-about-federal-internet-discount-program/", "keywords": ["consumer", "digital divide", "high-speed internet"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-12-15T09:03:10-08:00", "articleType": "article", "articleContent": "\nThe County is reminding the public about a Dec. 31 deadline for low-income residents and families to apply to receive discounted high-speed Internet service through the Federal Communications Commission.\nEligible residents and families who apply by Dec. 31 can receive FCC high-speed Internet discounts through March 2022 through local providers — up to $50 a month for households and $75 a month on qualifying tribal lands.\nThe FCC created its Emergency Broadband Service discount program during the COVID-19 pandemic to help eligible residents and families get or stay connected to high-speed Internet service. The program is being replaced in March 2022 by a new FCC discount program.\nFor general information about the program and links to relevant websites, be sure to go to the FCC’s emergency broadband benefit website. FCC officials have warned the public that a fraudulent website falsely offered enrollment in the program to collect people’s information.\nHow to Apply\nEnrollment is a two-step process.\n\nFirst, go to GetEmergencyBroadband.org to print out a mail-in application or submit an application online.\nContact your preferred participating provider to select an eligible plan and have the discount applied to your bill.\n\nNote: Eligible households MUST apply for the program and contact a participating provider to select a high-speed Internet program. \nWho Is Eligible?\nA household is eligible if a member of the household meets one of the following:\n\nHas an income at or below 135% of the Federal Poverty Guidelines, or who participates in certain assistance programs, such as SNAP (Supplemental Nutrition Assistance Program), Medicaid, or Lifeline, the FCC’s Lifeline Support for Affordable Communications program\nIs approved to receive benefits under the free and reduced-price school lunch program or the school breakfast program, including through the USDA Community Eligibility Provision in the 2019-2020, 2020-2021, or 2021-2022 school year\nReceived a Federal Pell Grant during the current award year\nExperienced a substantial loss of income due to job loss or furlough since Feb. 29, 2020 and the household had a total income in 2020 at or below $99,000 for single filers and $198,000 for joint filers; or\nMeets the eligibility criteria for a participating provider’s existing low-income or COVID-19 program.\n\nEnsuring that all San Diegans have access to high-speed Internet is important to the County. The County is a member of the San Diego Association of Government’s (SANDAG) Regional Digital Divide task force and is working on a plan to develop wider high-speed Internet infrastructure throughout the unincorporated areas. County Supervisors also voted unanimously in May to commit up to $1.4 million to a SANDAG/Caltrans project to expand fiber optic cable along state route 67.\nHere’s a list of frequently asked questions about the high-speed Internet discount program.\nFor more information about the program go to the FCC’s emergency broadband benefit website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211215.09.03.10"}