{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Assisting As CalFresh Enrollment Breaks Records", "description": "The County is experiencing record enrollment in the CalFresh food supplement program. As of June 1, 2024 CalFresh benefits are being received by more than 398,000 eligible people in the region, which is a 5.8% increase compared to the same month in 2023. ", "datePublished": "2024-06-12T08:16:57-07:00", "url": "https://www.countynewscenter.com/county-assisting-as-calfresh-enrollment-breaks-records/", "keywords": ["health", "calfresh", "community engagement", "equity", "food", "self sufficiency"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-06-12T08:19:40-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County is experiencing record enrollment in the CalFresh food supplement program.\nAs of June 1, 2024 CalFresh benefits are being received by more than 398,000 eligible people in the region, which is a 5.8% increase compared to the same month in 2023.  Over 539,000 persons have been enrolled at different points over the last 12 months. \nThe record month coincided with the celebration of CalFresh Awareness Month. \n“We’ve seen this trend steadily increase as the need increased” said Rick Wanne, director of County Self-Sufficiency Services. “Our focus remains on outreach, enrollment and widely sharing information to connect individuals and families with the resources they are eligible to receive.”  \nFeeding America reports food insecurity effects about 10 percent of the people in San Diego County. Over the past decade CalFresh enrollment has increased by 59% percent as part of local efforts to address this shortfall.  \nAs part of its ongoing outreach, the County hosted a month of events in May to share information about CalFresh and offer free, in-person help to enroll those eligible. \nCalFresh is California’s federal food assistance program, the state’s version of the U.S. Department of Agriculture’s Supplemental Nutrition Assistance Program.  \nIt is designed to increase access to fresh and healthy food, by providing a financial supplement to an eligible households’ meals purchasing power. Enrollees can use this financial supplement to buy foods like fruits, vegetables, meat and dairy products at most grocery stores and other authorized retailers. \nThis program works with other federal and local programs to round out food needs for people and their families. One of those programs is SUN Bucks which helps families with school-aged children through the summer months. \nCalFresh also aligns with the County’s Live Well San Diego commitment to healthy, safe, and thriving communities. \nCalFresh isn’t the only self-sufficiency program on the rise. As of June 1, 2024 CalWORKs has 51,348 enrollees, which is up 10% from the same time in 2023.  \nCalWORKs is a program that provides temporary cash assistance to eligible families with children under 18-years-old and helps parents find independence through workforce training. \nTo learn more about CalFresh and how to apply, go online to the County’s website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240612.08.16.57"}