{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Site Managers Needed for In-Person Voting Locations", "description": "The Registrar of Voters is seeking temporary site managers to operate in-person voting locations for the November presidential general election. Site managers earn $20 per hour.", "datePublished": "2024-06-13T13:05:09-07:00", "url": "https://www.countynewscenter.com/site-managers-needed-for-in-person-voting-locations-2/", "keywords": ["elections", "fgg", "in-person voting locations", "november 2024 general election", "november presidential general election", "registrar of voters", "site managers needed"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-06-13T16:32:22-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe Registrar of Voters is seeking temporary site managers to operate in-person voting locations for the November presidential general election. Site managers earn $20 per hour.\nSite managers will be required to lead poll workers while representing the Registrar of Voters in a professional, nonpartisan manner. The Registrar is seeking people who are team players, exhibit strong leadership skills and display flexibility, patience, and the highest level of integrity at all times. Previous management and/or poll worker experience desired.\nSite managers must attend two days of paid poll worker training and one additional day of paid site manager training to learn procedures, tasks and responsibilities.\nVote center assignments range from four to 11 days managing operations and assisting voters, in addition to one day to set up the vote center and one day to pack up after Election Day.\nSite managers must be available to work from 7:30 a.m. to 5:30 p.m. on assigned workdays as well as weekends during in-person voting. On Election Day, Nov. 5, site managers will work extended hours.\nEnglish speakers who are bilingual in Spanish, Filipino, Vietnamese, Chinese, Arabic, Japanese, Korean, Laotian, Persian, or Somali are also needed. If you are fluent in one of these languages, be sure to indicate it on your application.\nSite manager applications are available at sdvote.com. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240613.13.05.09"}