{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisors Approve Program to Promote Native Plants", "description": "County supervisors approved developing a program to promote the use of native plants Wednesday, to preserve the county’s natural environmental character and unique plant life, reduce water use, stormwater pollution and protect animals from the effects of climate change.", "datePublished": "2022-12-14T15:05:27-08:00", "url": "https://www.countynewscenter.com/supervisors-approve-program-to-promote-native-plants/", "keywords": ["government", "lueg", "native plants", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-12-14T15:05:27-08:00", "articleType": "article", "articleContent": "\nCounty supervisors approved developing a program Wednesday to promote the use of native plants.\nThe program would aim to preserve the county’s natural environmental character and unique plant life, reduce water use, stormwater pollution and protect animals from the effects of climate change.\nThe multi-year program will begin with creating a website where people can learn more about native plants, developing educational materials for the public and professional landscapers, and installing demonstration gardens at County buildings. The program would ultimately create incentives to encourage people to use native plants, offer ready-made landscaping templates to incorporate their use, and create a native plant landscaping design manual.\nNative plants such as the beautiful California buckwheat, lilacs, oaks and sages that grow wild around the backcountry evolved here over thousands of years. That means they naturally need less water than plants, like non-native flowers and non-indigenous plants that originated in rainier climates. Native plants also provide natural habitat for native animals and pollinating insects.\n“These native plants are really what makes San Diego County our county,” said Board Chair Nathan Fletcher, who forwarded the idea of developing a native plant policy with Supervisor Terra Lawson-Remer in 2021.\n“They’re a real asset,” Fletcher said. “They don’t just foster biodiversity, provide habitat, facilitate our habitat corridors, (provide) drought management and stormwater reduction. There’s a lot of really important reasons why the work and action we’re taking here is important. Not to mention we have some incredibly beautiful plants that really add a feel to our environment and are a constant reminder of the incredible natural resources that are unique to us here in San Diego.”\nLawson-Remer said the native plant program could also benefit the county’s regional economy by expanding the market for landscape design and nursery production.\nStaff members from County Land Use and Environment Group departments worked with a group of nearly 60 experts in native plants, landscape ecology and design and habitat conservation, including the California Native Plant Society to lay the groundwork to begin the program.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221214.15.05.27"}