{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Countywide Effort Aims to Eliminate DUI Fatalities, Injuries", "description": "Today, the County Health and Human Services Agency, San Diego District Attorney Summer Stephan, and other community partners joined forces in support of Vision Zero, a countywide initiative to reduce the number of fatalities and injuries related to driving under the influence of alcohol and/or other drugs to zero by 2025.", "datePublished": "2022-04-29T13:21:12-07:00", "url": "https://www.countynewscenter.com/?p=208288", "keywords": ["health", "drunk driving", "dui", "substance abuse", "substance abuse prevention"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-04-29T13:39:20-07:00", "articleType": "article", "articleContent": "\nAbout seven San Diegans are injured every day in motor vehicle crashes involving drivers impaired by drugs or alcohol.\nToday, the County Health and Human Services Agency, San Diego District Attorney Summer Stephan, and other community partners joined forces in support of Vision Zero, a countywide initiative to reduce the number of fatalities and injuries related to driving under the influence of alcohol and/or other drugs to zero by 2025.\nIn 2021, nearly 40 fatalities were caused by people driving under the influence of alcohol or drugs, according to the San Diego County District Attorney. The figure surpasses the 33 fatalities reported in 2020 and more than doubles the 18 deaths which occurred in 2019.\nLast year also saw a record number of alcohol- and drug-related incidents with over 400 crashes reported. In comparison, 380 DUIs occurred in 2020 and 350 in 2019. In 2021, about one-third of DUI cases involved people who were under the influence of alcohol, cannabis, and prescription drugs, often at the same time.\nDr. Luke Bergmann, director of Behavioral Health Services at the County Health and Human Services Agency, said there has been a 14% increase of DUI injuries in San Diego County over the last five years, a trend that is alarming.\n“We are addressing this trend head-on through multi-layered prevention efforts including advocacy of environmental changes and education around safe consumption,” Bergmann said. “We need to continue to work toward educating the public about safe consumption, with particular attention to the dangers of consuming multiple substances simultaneously.”\nBergmann said servers, retailers, promoters, and marketers of alcohol and cannabis need to be aware of the responsibilities surrounding safe consumption. A new California law taking effect later this year will require alcohol servers and sellers to be trained about the effects of alcohol, signs of overserving, and how to refuse service.\nThe County funds the Binge and Underage Drinking Initiative and the Marijuana Prevention Initiative, as well as the Meth Strike Force and the Prescription Drug Abuse Task Force. The County also funds prevention and treatment services throughout the region.\nPeople experiencing a substance use problem can call the County’s Access and Crisis Line at (888) 724-7240 or 2-1-1 San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220429.13.21.12"}