{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Ballots Go Out for 80th Assembly District Election", "description": "Nearly 250,000 ballots are on their way to eligible registered voters for the April 5 Special Primary Election for Assembly District 80.", "datePublished": "2022-03-07T10:08:15-08:00", "url": "https://www.countynewscenter.com/ballots-go-out-for-80th-assembly-district-election/", "keywords": ["elections", "80th assembly district special primary election", "april 5 special primary election", "fgg", "mail ballots", "san diego county registrar of voters", "special primary election"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-03-07T10:26:05-08:00", "articleType": "article", "articleContent": "\nNearly 250,000 ballots are on their way to eligible registered voters for the April 5 Special Primary Election for Assembly District 80.\nOnly those who live in the state’s 80th Assembly District under the 2011 district boundaries can vote in the election. If that’s you, then you should find your ballot in your mailbox this week. You will also find your “I Voted” sticker, voting instructions, and important election information inside your official ballot packet.\nThe district covers portions of southern San Diego County and includes parts of the cities of Chula Vista, National City, and San Diego. If you’re not sure whether you were in the 2011 district boundary, you can look it up at sdvote.com.\nThis special election is to fill a vacancy in the 80th Assembly District for the remainder of the current term ending in December 2022. Even though recent redistricting changed assembly district borders, the boundaries used when the term began will determine who can vote to fill the seat to complete the term.\nThis will be the first special election conducted under the Voter’s Choice Act. Under the act, every active registered voter will automatically receive a ballot in the mail. You don’t have to wait until Election Day to vote.\nYou can vote from the comfort of your home and return your voted ballot through the mail – no postage needed, to one of the Registrar’s official ballot drop box locations, or at any vote center in the district. If you are dropping off your ballot, check each location’s hours of operation at sdvote.com before heading out. Some ballot drop box locations and the Registrar of Voters office will be closed on Thursday, March 31 in observance of Cesar Chavez Day.\nDon’t forget to sign and date your return ballot envelope. Your signature is required for your vote to count.\nVoters who return their ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nIf you want to vote in person that option is available too. Starting Saturday, March 26, five vote centers will be open daily from 8 a.m. to 5 p.m. until Election Day, Tuesday, April 5, when nine vote centers will be open from 7 a.m. to 8 p.m.\nYou can find a ballot drop box or vote center location near you inside your official ballot packet, your voter information pamphlet, or you can look it up online at sdvote.com.\nLearn more about voting in the Assembly District 80, Special Primary Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220307.10.08.15"}