{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Gets Grant for Child Safety Seat Education Program", "description": "The $225,000, one-year grant will pay for a car seat education program that encourages the proper installation and use of child safety seats.", "datePublished": "2020-11-12T13:07:27-08:00", "url": "https://www.countynewscenter.com/county-gets-grant-for-child-safety-seat-education-program/", "keywords": ["health", "child safety education", "child safety grant", "ots"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-12T15:45:56-08:00", "articleType": "article", "articleContent": "\nA new grant from the California Office of Traffic Safety (OTS) will help the County Health & Human Services Agency teach parents and caregivers how to keep their children as safe as possible while riding in a vehicle.\nThe $225,000, one-year grant will pay for a car seat education program that encourages the proper installation and use of child safety seats.\nThe grant funds the following activities:\n\nOne-on-one appointments to inspect car seats\nChild safety seat education classes for parents and caregivers\nChild safety seats at no-cost to low-income families following education classes\nChild Passenger Safety Technician training and certification courses\nWork with community partners to promote child passenger safety education\nCollaborate with law enforcement to increase occupant protection awareness\n\nAccording to the National Highway Traffic Safety Administration, 46% of car seats are misused.\n“Car seats save lives,” OTS Director Barbara Rooney said. “Keeping children safe in a vehicle is as important as ever, and funding for car seat programs plays a vital role in ensuring the proper use of child safety seats.”\nThis safety campaign aligns with Live Well San Diego, the County’s vision for healthy, safe and thriving residents and communities.\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\nFor more information, contact Noemi Duenas from the Pacific Safety Center at (858) 621-2313 ext. 114.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201112.13.07.27"}