{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Valley Senior Village Celebrates Grand Opening", "description": "Valley Senior Village celebrated its grand opening Thursday in Escondido, becoming a haven for seniors in need of an affordable place to live. The apartment community features 50 homes for those at least 62 years old and serves low-income and formerly unsheltered seniors.", "datePublished": "2023-11-09T16:00:41-08:00", "url": "https://www.countynewscenter.com/valley-senior-village-celebrates-grand-opening/", "keywords": ["housing"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-11-09T16:00:41-08:00", "articleType": "article", "articleContent": "\nValley Senior Village celebrated its grand opening Thursday in Escondido, becoming a haven for seniors in need of an affordable place to live.\nThe apartment community features 50 homes for those at least 62 years old and serves low-income and formerly unsheltered seniors. Construction on the community began in January of 2022 and finished in August of 2023 as a result of a collaboration between the County of San Diego, National CORE and San Diego Community Housing Corporation.\nValley Senior Village offers residents an array of medical and mental health programs and services, including case management, designed to promote stability and independence. The services are provided by the Hope through Housing Foundation, San Ysidro Health, and Interfaith Community Services through a contract with County Behavioral Health Services.\nThe $24 million complex includes about $10 million from the County’s Innovative Housing Trust Fund and No Place Like Home capital and operating funding.\nThis is the County’s seventh affordable housing development ribbon cutting of 2023. In addition, the County has been a partner in breaking ground on nine additional affordable housing projects so far this year.\nValley Senior Village is currently 100% occupied. More information about Valley Senior Village is available on the National CORE website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231109.16.00.41"}