{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "High Number of COVID-19 Deaths Continues to Be Reported", "description": "Fifty-seven COVID-19 deaths were reported in the past week (Sept. 8-14), the highest weekly total during this current surge of the pandemic.", "datePublished": "2021-09-15T17:50:02-07:00", "url": "https://www.countynewscenter.com/high-number-of-covid-19-deaths-continues-to-be-reported/", "keywords": ["health", "coronavirus", "covid-19", "pandemic of the unvaccinated", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-09-17T11:47:56-07:00", "articleType": "article", "articleContent": "\nFifty-seven COVID-19 deaths were reported in the past week (Sept. 8-14), the highest weekly total during this current surge of the pandemic.\nThat’s more than triple the 18 COVID-19 deaths that were reported the previous seven days (Sept. 1-7) and higher than the 49 announced the week before that (Aug. 25-31).\nThe new deaths occurred between Aug. 19 and Sept. 13, and 11 (19%) of the 57 people who died were fully vaccinated. The deceased were 34 men and 23 women; 54 had underlying medical conditions, one did not and two had medical history pending.\nOf the 57 deaths, 15 were 80 years of age or older, 11 were in their 70s, 22 were in their 60s, four were in their 50s, two were in their 40s and three were in their 30s. A total of 3,983 San Diegans have died from COVID-19 in the region.\n“These deaths are very unfortunate. Our condolences go out to their family and friends,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “COVID-19 vaccines are widely available and can prevent San Diegans from getting seriously ill, getting hospitalized or, worse, dying.”\nCOVID-19: A Pandemic of the Unvaccinated\nCOVID-19 continues to be a pandemic of the unvaccinated in San Diego County.\nAccording to the latest County Health and Human Services Agency COVID-19 Watch report, since March 1, 2021, over 96% of hospitalizations (2,150) and nearly 89% of deaths (208) have occurred in people who are not fully vaccinated. In comparison, the report, which covers data through Sept. 11, shows that 75, or 3.4% of, fully vaccinated San Diegans have required hospitalization and 11.1%, or 26, died.\nFurthermore, 81.3% (65,635) of the COVID-19 cases have occurred in San Diegans who are not fully vaccinated compared to 19.7% (15,138) cases in people who were fully vaccinated.\nIn the last 30 days, 21,741 cases and 548 hospitalizations (2.5% of the total) have occurred in those not fully vaccinated, compared with 5,587 cases and just nine hospitalizations (0.2 percent of the total) for those fully vaccinated.\n“While we’ve seen a higher number of breakthrough infections, almost all of the deaths and hospitalizations are occurring in San Diegans who are not fully vaccinated,” Wooten said. “The COVID-19 vaccine is the best tool we have to get out of this pandemic. Protect yourself and others. Get vaccinated now.”\nNo-cost COVID-19 vaccines are widely available in the region. They can be found at medical providers, retail pharmacies, community clinics and County public health centers for people who do not have a medical provider. For a list of locations and more information, visit  www.coronavirus-sd.com/vaccine.\nVaccination Progress:\n\nDoses administered: Close to 4.7 million.\nReceived at least one shot: About 2.5 million or 87.1% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Over 2.16 million or 77.2%.\nThe goal: fully vaccinate 75% of San Diego County residents 12 and older or 2,101,936 people, with at least one dose.\nTo date, 116.1% of the goal population has received at least one vaccine and 102.9% are fully vaccinated.\nMore vaccination information can be found coronavirus-sd.com/vaccine.\n\nCases, Case Rates and Testing:\n\n742 COVID-19 cases were reported to the County on Sept. 14. The region’s total is now 346,934.\nSan Diego County’s case rate per 100,000 residents is 33.6 overall, 13.9 for fully vaccinated people and 59.3 for not fully vaccinated San Diegans.\n17,728 tests were reported to the County on Sept. 14, and the percentage of new positive cases was 4.2%.\nThe 14-day rolling percentage of positive cases among tests is 4.5%.\n\nCommunity Setting Outbreaks:\n\n56 new community outbreaks were confirmed in the past seven days (Sept. 8 through Sept. 14): 17 in TK-12 grade school settings, 10 in business settings, eight in restaurant/bar settings, four in faith-based settings, three in distribution warehouse settings, three in government settings, two in restaurant settings, two in hotel/resort/spa settings, two in daycare/preschool/childcare settings, one in a fitness/gym setting, one in an emergency services setting, one in a health care setting, one in a retail setting and one in a day camp setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210915.17.50.02"}