{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Don’t Delay – Get Vaccinated Against COVID-19 and Flu Now", "description": "The County Health and Human Services Agency is asking San Diegans to do their part in preventing illnesses this winter and schedule their COVID and flu vaccines as soon as possible.", "datePublished": "2022-09-29T16:52:22-07:00", "url": "https://www.countynewscenter.com/?p=209638", "keywords": ["health", "coronavirus", "covid-19", "covid-19 vaccine"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-09-29T16:52:22-07:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency is asking San Diegans to do their part in preventing illnesses this winter and schedule their COVID and flu vaccines as soon as possible.\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months or older get vaccinated against COVID-19 and the flu. COVID vaccines, bivalent boosters and flu shots are widely available across the region.\n“Vaccines save lives and it’s safe to receive both your COVID vaccine and flu shot at the same time,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The vaccines are effective and everyone who is eligible should get vaccinated to avoid getting sick and spreading viruses to others.”\nBoth vaccines can be administered during the same visit and it is not recommended to delay either vaccination. The CDC recommends to get a COVID-19 vaccine as soon as possible and to get a flu shot by the end of October.\nWho is Eligible?\nThe Pfizer/BioNTech bivalent COVID booster is available for anyone age 12 and older. Bivalent boosters have not yet been authorized for children under the age of 12. Youths in that age group can get boosted with the previous version of the monovalent Pfizer vaccine.\nSan Diegans must be fully vaccinated with the primary series of one of the approved COVID-19 vaccines before receiving a bivalent booster, meaning they must have received the two-dose primary series of Pfizer, Moderna, or the relatively new Novavax. All of those vaccines remain widely available.\nAlso eligible for the bivalent booster are those who received at least one shot of the Janssen vaccine, which is no longer widely available.\nAnyone who wants to get a bivalent booster must wait at least eight weeks after they received a previous COVID-19 vaccine until they are eligible. In addition, anyone who is fully vaccinated and recently tested positive for COVID-19, should wait three months after infection to get a bivalent booster.\nVaccination Progress:\n\nClose to 2.68 million or 80.1% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBoosters administered: 1,449,230 or 58.9% of 2,460,402 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nFour additional deaths were reported since the last report on Sept. 22, 2022. The region’s total is 5,491.\nOf the four additional deaths, two were women and two were men. They died between Sept. 14, 2022 and Sept. 19, 2022.\nThree of the people who died were 80 years or older and one was in their 70s.\nThree were fully vaccinated and one was unvaccinated.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n2,402 COVID-19 cases were reported to the County in the past seven days (Sept. 20 to Sept. 26, 2022). The region’s total is now 922,131.\nThe 2,402 cases reported in the past week were slightly lower compared to the 2,634 infections identified the previous week (Sept. 13 through Sept. 19).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 11.84 for people fully vaccinated and boosted, 7.24 for fully vaccinated people and 25.97 for San Diegans who are not fully vaccinated.\n6,735 tests were reported to the County on Sept. 24, and the percentage of new positive cases was 4.6% (Data through Sept. 24).\nThe 14-day rolling percentage of positive cases, among tests reported through Sept. 24, is 4.1%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220929.16.52.22"}