{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "‘Tis the Season for Giving, Receiving and Recycling!", "description": "The holiday season often means there is plenty to recycle -- from gift boxes and wrapping paper to lights and even those real Christmas trees.", "datePublished": "2023-12-19T09:56:56-08:00", "url": "https://www.countynewscenter.com/tis-the-season-for-giving-receiving-and-recycling/", "keywords": ["environment", "climate action", "dpw", "lueg", "recycle", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-12-19T09:56:56-08:00", "articleType": "article", "articleContent": "\nThe holiday season often means there is plenty to recycle — from gift boxes and wrapping paper to lights and even those real Christmas trees.\nIn the holiday spirit, the County Public Works (DPW) has some handy tips “yule” love on what to recycle and how to do it properly.\nChristmas Trees\nWhen it comes time to say goodbye to that real Christmas tree, the County urges you to recycle it. When recycled in the right way, trees and wreaths can become mulch that improves soil health and helps soil retain moisture at our parks, farms and home gardens.\nCheck with your waste hauler to find out if they offer curbside pickup; many do. Another option is to visit the County’s recycling and hazardous waste database WastefreeSD.org/TreeRecycling to find Christmas tree drop-off sites near you.\nType “Christmas tree” in the “find an item” box, add your ZIP code, community and how you heard about the site, and you’ll see all the drop-off locations near you.\nDon’t leave your old, dry tree or wreaths lying in your backyard. They can become fire hazards. Meanwhile, putting them in the trash unnecessarily fills up landfills and generates unwanted greenhouse gases when they decompose.\nKnow What Packaging Can be Recycled\nBetween online shopping and gift exchanges, there’s usually a lot of stuff to recycle. Remember, not all packaging can be recycled. For example, cardboard boxes can be recycled (just break them down and put them into your recycling bin). But other items can’t — manila envelopes, padded plastic mailers and bubble-wrap, and traditional gift-wrapping materials including ribbons, bows, twine, tissue paper and cellophane. So please DO NOT put them in your blue recycling bins; consider re-using them instead. Here’s a link to learn more about how to Recycle Right, during the holidays and every day.\nChristmas and Holiday Card Recycling\nLike packaging materials, not all holiday cards should be added to your recycling. Simple paper cards and envelopes can be added to your blue bins. But cards with glitter, foil, metallic inks (made with tiny metal flakes) or other adornments can’t. Tear the cards in two if there’s a glitzy front and plain paper backing. Recycle the backs and put the glitzy fronts into the trash.\nHoliday Light Recycling\nPlease remember to not put old holiday lights in your recycling bins. They can tangle up recycling equipment and they also pose a danger to workers in those recycling centers. For recycling options, please visit WasteFreeSD.org, or contact a scrap metal or e-waste recycler.\nIt’s so easy! Remember, if you have other questions about what can and can’t be recycled, go to DPW Recycling’s webpage or to DPW Recycling’s Facebook page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231219.09.56.56"}