{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State and County Investigate Citrus Disease in Fallbrook", "description": "State agricultural inspectors have detected bacteria on an insect that can cause a plant disease that is not harmful to people or animals, but is deadly to citrus trees and is a dangerous agricultural threat in routine pest trapping in Fallbrook.", "datePublished": "2020-12-31T15:30:49-08:00", "url": "https://www.countynewscenter.com/state-and-county-investigate-citrus-disease-in-fallbrook/", "keywords": ["agriculture", "citrus", "citrus psyllids", "huanglongbing", "pests"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2020-12-31T15:44:42-08:00", "articleType": "article", "articleContent": "\nState agricultural inspectors have detected bacteria on an insect that can cause a plant disease that is not harmful to people or animals, but is deadly to citrus trees and is a dangerous agricultural threat in routine pest trapping in Fallbrook.\nA routine spot check by the California Department of Food & Agriculture (CDFA) on December 28 collected a group of four adult Asian citrus psyllids (ACP) from a citrus tree on residential property in the Fallbrook area of San Diego County carrying the bacteria Candidatus Liberibacter asiaticus. These bacteria can cause a citrus disease called Huanglongbing (HLB). At this time, the disease has not been detected in citrus trees in San Diego County. Samples from trees on that property and the surrounding area are undergoing tests for the disease, which is fatal to citrus trees and has no cure. Results should be available the week of Jan. 4. If the test results are positive on the foliage, then a 5-mile HLB quarantine will be triggered.\nThe disease is a major threat to San Diego’s $150 million annual citrus crop and can impact residential citrus tree growers with misshapen, bitter fruit and eventually kill the tree.\n“Rapidly detecting and controlling the spread of the Asian citrus psyllids that carries Huanglongbing continues to be a priority for the County.  While ACPs are frequently found in our ongoing mitigation efforts, the bacteria have never been found locally before,” said San Diego Agricultural Commissioner Ha Dang. “We are working closely with our residents, growers, and industry partners to limit any potential impact and will keep everyone informed moving forward,” she added.\nThe detection of the bacteria triggers additional sampling and testing of both citrus trees and ACP on residential properties in a 250-meter area surrounding the detection site. The County Department of Agriculture, Weights and Measures (AWM), and CDFA will work with residents in the immediate area to arrange for treatment of citrus trees, on a voluntary basis, as a protective measure against ACP and Huanglongbing infestation. AWM officials are also proactively notifying local citrus growers, plant nurseries and other related businesses. If the disease is detected in citrus trees in the area, agricultural officials will follow up with removal of the infected trees, additional treatment of nearby citrus trees, heightened trapping efforts, and a quarantine to restrict the movement of citrus trees, fruit and foliage.\nAWM has been working closely with CDFA and the United States Department of Agriculture (USDA) on this collaborative project. The first ACPs were detected in San Diego County in 2008, and surveys, insect trapping, tree sampling and other regulatory activities have been ongoing throughout the county since then. The Dec. 28 Fallbrook detection is the first time the bacteria has been found on the pests in San Diego County. It has previously been confirmed in portions of Los Angeles, Orange, San Bernardino and Riverside counties.\nACPs have been frequently found in San Diego, Imperial, Riverside, San Bernardino, Orange, Los Angeles, Santa Barbara and Ventura counties.\nCitrus trees contract the disease when the bacteria are transmitted into the tree by the ACP insects as they feed. HLB is a bacterial disease that affects the vascular system of citrus plants. HLB-infected trees bear small, asymmetrical fruit which are partially green, bitter, and not fit for sale or consumption. The disease destroys the appearance and economic value of the trees and eventually causes their death, typically within a few years. Infected trees may have areas with mottled yellow leaves, generally seen in asymmetrical patterns.\nResidents can take a number of steps to help ward off, or contain, huanglongbing disease including:\n\nNot taking or moving cuttings from backyard citrus plants from one property to another.\nBuying citrus trees only from reputable local nurseries.\nCooperating if County (or state) inspectors ask to place insect traps on their land (traps are to find and test Asian citrus psyllid, the insect that can carry citrus greening bacteria).\nReporting citrus trees and plants that seem to be sick or dying even though they also appear to be well-watered and well-maintained by contacting the San Diego Department of Agriculture, Weights, and Measures at (760) 752-4700 or visit sdcawm.org. Residents can also call CDFA’s toll-free Pest Hotline at (800) 491-1899, or visit www.cdfa.ca.gov/plant/acp.\n\nThe cooperative statewide partnership with agricultural officials and the citrus industry is maintaining its strategy of rapidly detecting and controlling the spread of the ACP and HLB while researchers work to find a cure for the disease.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201231.15.30.49"}