{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Another Record-High Number of COVID-19 Cases", "description": "After more than a week of increasing COVID-19 cases in the region, the County Health and Human Services Agency is reporting another record-high number of novel coronavirus infections today.", "datePublished": "2020-11-20T16:38:24-08:00", "url": "https://www.countynewscenter.com/county-reports-another-record-high-number-of-covid-19-cases/", "keywords": ["health", "coronavirus", "covid-19", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-11-20T16:38:24-08:00", "articleType": "article", "articleContent": "\nAfter more than a week of increasing COVID-19 cases in the region, the County Health and Human Services Agency is reporting another record-high number of novel coronavirus infections today. The County confirmed 1,091 new cases, surpassing the previous record of 1,087 cases reported last Saturday.\nCounty health officials are attributing the sharp increase in cases to a general fatigue of the pandemic and are urging San Diegans to avoid gatherings and take COVID-19 seriously.\n“The virus is widespread and every element of our community is impacted,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Now more than ever it is vital that San Diegans avoid gatherings and crowds, wear a face covering when they are out in public and stay home if they are sick.”\nLimited Stay at Home Order\nSan Diego County on Friday updated its public health order to follow the state’s new Limited Stay at Home Order which goes into effect Saturday, Nov. 21. Under the new orders:\n\nGatherings with people outside your household are not allowed between 10 p.m. and 5 a.m.\nRestaurants, bars, wineries, distilleries and breweries must close to sit-down customers from 10 p.m. to 5:00 a.m. Businesses can offer take-out, drive-thru and delivery at any time.\n\nThe measures are intended to help reverse the recent rapid increase of COVID-19 activity in the region and will be in effect for 30 days.\nThanksgiving Guidance\nThe County has issued COVID-19 guidance for Thanksgiving and other upcoming holidays.\nAnyone hosting a gathering should keep it small, short and safe.\nSmall means gatherings should be limited to a maximum of three stable households. Short means the gathering should last two hours or less. Safe means that people should stay outdoors as much as possible and wear a face covering when they are not eating or drinking.\nOther recommendations include:\n\nRemote events with family and friends, such as a virtual dinner, sharing recipes, a virtual turkey trot or online game\nTelevised or live streaming events at home with members of your own household\nOutdoor orchards, food markets, and seasonal craft fairs where state guidance is followed\n\nState Metrics:\n\nUnder the state’s system for determining COVID-19 risk, San Diego County is the Purple Tier, or Tier 1. The state uses the more restrictive measure – case rate or testing positivity – to assign tiers.\nThe County’s state-calculated, adjusted case rate is currently 10.7 cases per 100,000 residents, placing it in that metric’s Purple Tier.\nThe testing positivity percentage is 4.3%, placing it in that metric’s Tier 3 or the Orange Tier.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 7.2% and it’s in the Red Tier or Tier 2. This metric does not move counties to more restrictive tiers but is required to advance to less restrictive tiers.\nThe California Department of Public Health announced that tier assignments, typically given each Tuesday, may now occur any day of the week and may occur more than once a week.\n\nCommunity Setting Outbreaks:\n\nEleven new community outbreaks were confirmed on Nov. 19: three in business settings, three in faith-based agency settings, two in daycare/preschool/childcare settings, one in a TK-12 school setting, one in a restaurant/bar setting and one in a fitness/gym setting.\nIn the past seven days (Nov. 13 through Nov. 19), 43 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n34,021 tests were reported to the County on Nov. 19, and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 4.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 17,685.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n1,091 new cases were confirmed among San Diego County residents on Nov. 19. The region’s total is now 69,231.\n4,329 or 6.3% of all cases have required hospitalization.\n981 or 1.4% of all cases and 22.7% of hospitalized cases had to be admitted to an intensive care unit.\nThe County’s COVID-19 case rate map shows how local cities and communities are being severely impacted by the virus.\n\nDeaths:\n\nEight new deaths were reported in the County on Nov. 19. The region’s total is now 960.\nFour women and four men died between Nov. 1 and Nov. 19. Their ages ranged from early 50s to early 90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201120.16.38.24"}