{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Now Offering Pfizer’s COVID Vaccine to 12- to 15-Year-Olds", "description": "San Diegans ages 12-15 are now eligible to receive a COVID-19 vaccine.", "datePublished": "2021-05-13T08:49:36-07:00", "url": "https://www.countynewscenter.com/county-now-offering-pfizers-covid-vaccine-to-12-to-15-year-olds/", "keywords": ["health", "coronavirus", "covid-19", "vaccines for 12-15-year-olds"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-05-13T14:27:50-07:00", "articleType": "article", "articleContent": "\nSan Diegans ages 12-15 are now eligible to receive a COVID-19 vaccine.\nThe California Department of Public Health last night approved Pfizer’s COVID-19 vaccine for use in that age group and the County’s vaccine sites are prepared to start vaccinating children in this new age group today.\nParental consent is required prior to vaccination for anyone under the age of 18. In addition to parental consent, minors will have to show photo ID and proof of age, or have the parent, guardian or caregiver who accompanies the minor to the appointment verify their age and identity.\nIf a parent, legal guardian or caregiver cannot accompany the minor to the vaccination site, they will need to schedule an appointment on MyTurn.ca.gov to provide their consent in advance. If no parent, guardian or caregiver can be present, the minor will have to bring photo ID and, if under the age of 16, another adult must be present during the vaccination appointment.\nAdditional information about scheduling appointments and what types of documentation youths will need to get vaccinated is available at coronavirus-sd.com/vaccine.\n“Data from our federal and state partners shows that the Pfizer vaccine is both safe and effective for use in young people,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Getting youths 12 to 15 years old vaccinated will better protect vulnerable San Diegans and younger children who are not eligible to be vaccinated yet.”\nThe Pfizer vaccine is the only COVID-19 vaccine currently authorized for use in minors ages 12-15 and the majority of the County-operated COVID-19 vaccination sites carry it.\nState figures show San Diego County has 175,864 people ages 12-15 and the County has enough doses on hand or coming in to vaccinate all eligible youths in the coming weeks.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210513.08.49.36"}