{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Hand Spray for Mosquitoes in Oceanside Area", "description": "County Vector Control crews plan to hand-spray for mosquitoes at approximately 60 homes and a community center in Oceanside to protect public health and keep mosquitoes from potentially spreading the dengue virus based on a confirmed dengue case.", "datePublished": "2024-09-09T15:15:09-07:00", "url": "https://www.countynewscenter.com/county-to-hand-spray-for-mosquitoes-in-oceanside-area/", "keywords": ["health", "dengue", "hand-spray", "mosquitoes", "public health", "vector control"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-09-09T15:15:09-07:00", "articleType": "article", "articleContent": "\nReading Time:  3 minutesCounty Vector Control crews plan to hand-spray for mosquitoes at approximately 60 homes and a community center in Oceanside to protect public health and keep mosquitoes from potentially spreading the dengue virus based on a confirmed dengue case.\nCounty crews plan to hand-spray the area Tuesday, weather permitting. More information on the treatment can be found on Vector Control’s mosquito treatment webpage. A similar treatment was previously conducted in July of this year to help protect public health and prevent potential local spread of dengue in the Mount Hope community of San Diego.\nTrained County technicians will knock down adult mosquitoes that can spread disease by applying AquaDuet, a pesticide approved for use by the Environmental Protection Agency, using ultra-low-volume backpack sprayers.\nOver the weekend, County staff were contacting residents and leaving doorhangers at homes in the treatment area. The product used poses low risk to people and pets and dissipates in roughly 20 to 30 minutes. However, the County is instructing residents in spray areas that they can avoid or minimize their exposure to the pesticide by taking simple steps:\n\nStay inside and bring pets indoors if possible\nClose doors and windows, and turn off fans that bring outdoor air inside the home\nWash any pet food and water bowls that were left outside during the treatment\nCover fishponds to avoid direct exposure\nRinse fruits and vegetables from your garden with water as you normally would before cooking or eating\nWipe down or cover outdoor items such as toys and barbecue grills\nBeekeepers and those with insects kept outdoors are encouraged to shelter hives and habitats during treatments. Beekeepers registered with the County’s Department of Agriculture, Weights and Measures can request to receive advance notice when a pesticide that may affect bees is applied to blossoming plants in their areas.\nYou may resume normal activities 30 minutes after the treatment\n\nDengue\nDengue is a tropical viral disease that is not commonly found in the contiguous United States. Since the invasive Aedes mosquitoes were first detected in San Diego County in 2014, there have been no locally acquired cases of dengue.\nU.S. travelers can get dengue while visiting countries where dengue is common.  Dengue infections in travelers are reported each year in San Diego County. From Jan. 1, 2024, through June 30, 2024, there have been 17 travel-related cases of dengue in San Diego County residents. When positive cases are identified, County Public Health and Vector Control work closely to respond to help prevent mosquitoes from spreading the illness.\nDengue is spread by mosquitoes, when a mosquito bites an infected person and then feeds on another person.\nAccording to the Centers for Disease Control and Prevention (CDC), there are no specific medicines to treat dengue.  The most common symptoms are fever, chills and any of the following: aches and pains (eye pain, muscle, joint or bone pain), nausea, vomiting, and rash.\nSymptoms can be moderate and last two to seven days. Most people recover after about a week. However, symptoms can also become severe, be deadly, include shock and respiratory distress, and can require hospitalization.\nDengue can be determined by a blood test.\nThe CDC said the best way to protect yourself from contracting dengue is to protect yourself from mosquito bites.\nMosquitoes \nDay-biting Aedes aegypti mosquitoes, also known as “ankle-biters,” are the primary transmitter of dengue. These mosquitoes like to live and breed around people, often in yards and in small amounts of water.\nThe best way people can protect themselves is to find and dump out any standing water in and around their homes to keep them from breeding in the first place.\nPrevent Mosquito Breeding \nDump out, drain, or remove any items inside and outside of homes that can hold water, such as plant saucers, rain barrels, buckets, garbage cans, toys, old tires, and wheelbarrows. Mosquitofish, available for free at locations throughout the county, may be used to control mosquito breeding in backyard standing water sources, such as unmaintained swimming pools, ponds, fountains, and horse troughs.\nProtect Yourself from Mosquito Bites \nProtect yourself from mosquito-borne illnesses by wearing long sleeves and pants or use insect repellent when outdoors. Use insect repellent that contains EPA-approved ingredients like DEET, picaridin, oil of lemon eucalyptus, or IR3535. Make sure screens on windows and doors are in good condition and secured to keep insects out.\nFor more information about mosquitoes go to San Diego County’s “Fight the Bite”  website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240909.15.15.09"}