{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Supervisors Hear Decarbonization Workforce Study Update", "description": "County supervisors received an update Wednesday on their draft Regional Decarbonization Framework and its newest addition, a draft study of opportunities and challenges facing the local workforce resulting from climate action.", "datePublished": "2022-03-16T17:25:08-07:00", "url": "https://www.countynewscenter.com/supervisors-hear-decarbonization-workforce-study-update/", "keywords": ["environment", "decarbonization", "regional decarbonization framework", "sustainability", "sustainable communities", "workforce"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-03-16T17:25:08-07:00", "articleType": "article", "articleContent": "\nCounty supervisors received an update Wednesday on their draft Regional Decarbonization Framework and its newest addition, a draft study of opportunities and challenges facing the local workforce resulting from climate action.\n“Putting San Diego County on the High Road, Climate Workforce Recommendations for 2030 and 2050” is part of the larger three-pronged decarbonization framework that is expected to be completed and brought to the Board for consideration in August.\nThe framework also includes a science-based, data-driven technical report that outlines how the entire region could move toward zero-carbon emissions by 2045. That includes a section by the University of San Diego’s Energy Policy Initiatives Center that analyzed 17 regional climate action plan commitments to identify what else the region needs to do to reach the zero-carbon goal in an equitable manner. The third part of the framework will be the collaborative development of workable policies among area cities; environmental, business and labor groups; community members; technical consultants and the County.\nCounty officials are encouraging people to review and comment on the draft Regional Decarbonization Framework and its various reports online through May 31.\nAt Wednesday’s meeting, authors of the draft workforce study said decarbonization would create high-quality jobs and increase equitable access to them, but would require intentional policies and strategic capital investments.\nSupervisors directed County staff in July 2021 to conduct a comprehensive green jobs plan to address the local available opportunities created by climate investments and career paths for workers affected by decarbonization.\nCarol Zabin of Inclusive Economics and director of UC Berkeley Labor Center’s Green Economy program is author of both the state’s Jobs and Climate Action Plan for 2030 and the framework’s workforce study. She said Wednesday that good jobs are those that among other things, pay enough to support a family, have career pathways and allow workers to organize.\nSome of the workforce study’s specific findings included:\n\nRegional decarbonization pathways would generate an average of nearly 27,000 jobs per year in the San Diego region between 2021 and 2030.\nNo local workers in fossil fuel-based industries would face losing jobs to decarbonization before 2030, even taking into account industry contraction.\nSan Diego County and local governments should convene a “just transition task force” that includes government, business and labor to start developing a viable set of just transition policies for the workers in the community who will experience job displacement between 2031 and 2050.\nThe costs of a just transition will be much lower if the transition is able to proceed steadily rather than through a series of episodes. Under a steady transition, the proportion of workers who will retire voluntarily in any given year will be predictable, and the transition process avoids having to provide support for a much larger share of workers.\n\nFor more information, go to the County’s Regional Decarbonization Framework webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220316.17.25.08"}