{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "You Should be Flu Free", "description": "The influenza virus, or the flu, is a contagious respiratory disease that can lead to serious illness, hospitalization and in extreme cases, death. The best way to protect yourself and your loved ones against the flu is to get a flu vaccine every year.", "datePublished": "2023-10-16T11:25:16-07:00", "url": "https://www.countynewscenter.com/you-should-be-flu-free/", "keywords": ["health", "flu", "flu season", "flu vaccine", "influenza", "southeastern live well center"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-10-16T14:05:12-07:00", "articleType": "article", "articleContent": "\nThe influenza virus, or the flu, is a contagious respiratory disease that can lead to serious illness, hospitalization and in extreme cases, death. The flu circulates year-round, but infection rates typically increase during the fall and winter months.\nFlu season usually peaks between December and February but can last as late as May. The best way to protect yourself and your loved ones against the flu is to get a flu vaccine every year. The CDC recommends one each year for everyone six months and older.\nThe County has scheduled four flu vaccination events where anyone can walk in and receive a flu shot free of charge. You can also get a flu vaccine at one of our 6 Public Health Centers, local pharmacies or with your primary care provider. For information on times and locations visit Flu Vaccine Locations (sandiegocounty.gov).\nThe first flu vaccine event was held at the new Southeastern Live Well Center and a steady stream of people showed up ready to roll up their sleeve.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231016.11.25.16"}