{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Approves New Climate-Housing, Vehicle Miles Traveled Rules", "description": "County supervisors approved new Vehicle-Miles-Traveled guidelines for new development in unincorporated communities Wednesday that will fight climate change and still allow approximately 7,700 homes to be built faster and without expensive traffic studies.", "datePublished": "2022-09-28T16:14:59-07:00", "url": "https://www.countynewscenter.com/?p=209624", "keywords": ["government", "climate action", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-09-28T16:14:59-07:00", "articleType": "article", "articleContent": "\nCounty supervisors approved new Vehicle-Miles-Traveled guidelines for new development in unincorporated communities Wednesday that will fight climate change and still allow approximately 7,700 homes to be built faster and without expensive traffic studies.\nThe Board’s action to adopt a new Transportation Study Guide brings County policies into synch with the state of California’s Vehicle Miles Traveled law.\nThat law aims to reduce greenhouse gas emissions from cars and fight climate change by asking proposed developments how many miles the people living in them would have to drive on average ― to reach jobs, amenities or transit.\nThe Board’s vote means housing proposed in unincorporated areas where cars would travel at least 15% fewer miles than the average of all drivers in the entire county ― including city areas ― could be built without Vehicle-Miles-Traveled studies and mitigation.\nThat would reduce the cost and streamline the review and consideration process for “infill and vehicle-mile-traveled-efficient” development in areas that have higher housing densities and are nearer to roads, jobs and transit.\nProjects proposed where drivers would have to drive 16% or more miles than the average regional driver could still be proposed, approved and built. But they would have to pay for Vehicle-Miles-Traveled studies and potential mitigation as part of their project process.\nThat could make it more expensive for developers to build in the County’s unincorporated areas that are often located farther away from jobs and amenities.\nHowever, County staff calculated the new Transportation Study Guide would allow up to 7,693 homes to be built without study and mitigation within two types of unincorporated areas ― infill areas and Vehicle-Miles-Traveled efficient areas.\nThe Vehicle Miles Traveled efficient areas are places where people would drive 15% or fewer miles than drivers within the region. Infill areas are defined as those with already dense housing development ― with a minimum of 425 houses and 128 intersections per square mile ― and within 15 miles of job centers.\nOne of the intents of the state’s Vehicle Miles Traveled law was to encourage infill development that would improve public health by encouraging people to walk and bike more and reduce car travel and greenhouse gas emissions.\nSupervisor Terra Lawson-Remer praised County staff for creating guidelines that would immediately address the “climate crisis,” create a path to build more affordable homes and withstand legal challenge.\n“We’ve come up with an approach that simultaneously gets us to more housing and protects our climate for future generations,” Lawson-Remer said.\nWith their vote Wednesday, the Board also directed County staff to work with other agencies to see if more Vehicle Miles Traveled efficient areas could be created in unincorporated communities by bringing mass transit to them.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220928.16.14.59"}