{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County COVID-19 Update – 12-7-2020", "description": "Here is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 6.", "datePublished": "2020-12-07T17:00:58-08:00", "url": "https://www.countynewscenter.com/san-diego-county-covid-19-update-12-7-2020/", "keywords": ["health", "coronavirus", "covid-19", "icu", "stay home order"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-07T17:00:58-08:00", "articleType": "article", "articleContent": "\nHere is today’s COVID-19 update from the County Health and Human Services Agency with data through Dec. 6.\nICU Capacity and Stay Home Order:\n\nThe current intensive care unit (ICU) capacity for the Southern California region is now 10.9% and will be update by the state daily.\nThe Regional Stay Home Order went into effect at 11:59 p.m. Dec. 6 and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last for at least three weeks or until the region’s ICU capacity meets or exceeds 15%. The order will be assessed by the state after the three-week period.\n\nCommunity Setting Outbreaks:\n\nSix new community outbreaks were confirmed on Dec. 6: two in business settings, two in healthcare settings, one in a private residence setting and one in a government setting.\nFive new community outbreaks were confirmed on Dec. 5: three in business settings, one in an emergency services setting and one in a food/beverage processing setting.\nIn the past seven days (Nov. 30 through Dec. 6), 87 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n21,195 tests were reported to the County on Dec. 6, and the percentage of new laboratory-confirmed cases was 9%.\nThe 14-day rolling average percentage of positive cases is 7.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 23,042.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n1,998 new cases were reported to the County on Dec 6. The region’s total is now 94,169.\n4,921 or 5.2% of all cases have required hospitalization.\n1,077 or 1.1% of all cases and 21.9% of hospitalized cases had to be admitted to an intensive care unit.\nA COVID-19 case rate mapshows how local cities and communities are being impacted by the virus.\n\nDeaths:\n\nNo new COVID-19 deaths were reported to the County on Dec. 6. The region’s total is now 1,062.\nSeven new deaths were reported to the County on Dec. 5.\nFour women and three men died between Nov. 11 and Nov. 29, and their ages ranged from late 40s to early 90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201207.17.00.58"}