{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Annual Flag Raising Honors Victims of Child Abuse and Neglect", "description": "On the fourth Friday of April every year, a special flag is raised at the County’s Polinsky Children’s Center.  The blue and red banner, which displays figures of kids, honors the approximately 1,800 children nationwide who lose their lives annually due to abuse and neglect. ", "datePublished": "2023-04-28T17:05:41-07:00", "url": "https://www.countynewscenter.com/annual-flag-raising-honors-victims-of-child-abuse-and-neglect/", "keywords": ["families", "child abuse prevention", "flag raising"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-04-28T17:06:27-07:00", "articleType": "article", "articleContent": "\nOn the fourth Friday of April every year, a special flag is raised at the County’s Polinsky Children’s Center.  The blue and red banner, which displays figures of kids, honors the approximately 1,800 children nationwide who lose their lives annually due to abuse and neglect. \nThe ceremony Friday morning at Polinky Children’s Center, which provides temporary emergency shelter to children, drew a crowd of representatives from local youth and family-serving community organizations, all wearing blue for Child Abuse Prevention Month.\nNationwide, 3 million cases of child abuse are reported yearly. In San Diego, the County’s Child Welfare Services (CWS) received 39,000 calls to the child abuse hotline last year that represented almost 68,000 children. \n“Child abuse and neglect are serious issues that we are working together as a community to tackle,” said Kimberly Giardina, CWS director. “Today is really an important day to raise awareness about the ongoing need for child abuse prevention and the things that each one of us can do to help children in our community.”\nChild Abuse Prevention Month, which is commemorated every April, aims to spread the word about what everyone can do to prevent child abuse including how to recognize signs of abuse and neglect and get connected to community resources.  \nIf you suspect a child is experiencing abuse or neglect, contact the County’s Child Abuse Hotline at 858-560-2191 or (800) 344-6000. You can also call 2-1-1 San Diego, or check the Child Welfare Services website for a variety of resources related to child abuse prevention. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230428.17.05.41"}