{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Home Order Extended for San Diego County", "description": "Given the low availability of intensive care unit (ICU) beds, the Regional Stay Home Order for the Southern California region, including San Diego County, has been extended until further notice.", "datePublished": "2020-12-29T16:53:01-08:00", "url": "https://www.countynewscenter.com/stay-home-order-extended-for-san-diego-county/", "keywords": ["health", "coronavirus", "covid-19", "stay home order extended"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-29T16:59:07-08:00", "articleType": "article", "articleContent": "\nGiven the low availability of intensive care unit (ICU) beds, the Regional Stay Home Order for the Southern California region, including San Diego County, has been extended until further notice.\nToday, the state announced the region’s ICU availability is 0.0%. The San Joaquin Valley region’s stay home order has also been extended.\nAn ICU availability of 0.0% does not necessarily mean there are no ICU beds available. What it indicates is that hospitals in that region are operating at surge capacities and their ability to treat other ill people – patients with heart attacks, strokes, other traumas, etc.—is limited.\nMoving forward the state will make four-week projections using the following regional indicators:\n\nCurrent ICU capacity\nCurrent 7-day average case rate\nCurrent transmission rate\nCurrent rate of ICU admission\n\nIf the four-week projection is at or above 15% of ICU availability, the region may be released from the order. If it’s below, it remains under the order.\nHowever, this does not mean that the region will be under the order for four weeks. It could be shorter if the above indicators improve prior to that timeframe and the 15% threshold is met.\nThe four-week projection will be calculated by the state daily.\nCommunity Setting Outbreaks:\n\nThree new community outbreaks were confirmed on Dec. 28: two in business settings and one in a daycare/preschool/childcare setting.\nIn the past seven days (Dec. 22 through Dec. 28), 57 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n16,944 tests were reported to the County on Dec. 28, and the percentage of new laboratory-confirmed cases was 15%.\nThe 14-day rolling average percentage of positive cases is 10.8%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 22,656.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Healthcare and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n2,534 new cases were reported to the County on Dec 28. The region’s total is now 150,064.\n5,787 or 3.9% of all cases have required hospitalization.\n1,212 or 0.8% of all cases and 20.9% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n31 new COVID-19 deaths were reported to the County on Dec. 28. The region’s total is now 1,435.\n18 women and 13 men died between Dec. 17 and Dec. 28, and their ages ranged from mid-40s to mid-90s.\n27 had underlying medical conditions and two did not. Two have medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201229.16.53.01"}