{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Interviews Interim Sheriff Applicants", "description": "Three applicants for Interim San Diego County Sheriff appeared before the Board of Supervisors Tuesday and answered questions about leading the law enforcement agency and its 4,300 employees.", "datePublished": "2022-03-16T09:12:15-07:00", "url": "https://www.countynewscenter.com/board-interviews-interim-sheriff-applicants/", "keywords": ["public safety", "board meeting", "interim sheriff"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-03-16T09:12:15-07:00", "articleType": "article", "articleContent": "\nThree applicants for Interim San Diego County Sheriff appeared before the Board of Supervisors Tuesday and answered questions about leading the law enforcement agency and its 4,300 employees.\nSupervisors heard from applicants Michael Barletta, Edwin Brock, and Anthony Ray. The Board then voted to move all the applicants forward to the finalist process. The Board will hear again from the finalists and make an appointment at a Special Meeting on March 22 at 9 a.m.\nDue to the early retirement of former Sheriff William Gore, who had served as Sheriff since 2009, the Board is appointing an Interim Sheriff to complete the current term. In November 2022, voters will elect a successor who will take office in January 2023.\nNone of the applicants considered for appointment are candidates for Sheriff in the upcoming election.\nRay is an Assistant Sheriff who began his career with the department in 1991 serving for more than 30 years. He collaterally is assigned as a co-director for the San Diego County Regional Leadership Institute.\nBarletta is a former San Diego County Sheriff’s Department commander who retired in 2015 after serving more than 29 years. He currently works for the Anti-Defamation League as a private contractor teaching law enforcement officers.\nBrock is a former San Diego County Sheriff’s lieutenant who retired after more than 30 years of service. He currently serves as police chief in Arvin, California.\nInitially, there were four applicants, but Sheriff’s Commander Hank Turner withdrew his name from consideration due to another job offer.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220316.09.12.15"}