{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Dr. Wilma Wooten Retires from the County", "description": "San Diego County’s Public Health Officer, Dr. Wilma Wooten, is retiring after 23 years of service, the last 17 as the County’s lead doctor and public face of numerous media stories, none larger than the 2020 COVID-19 pandemic.", "datePublished": "2024-06-18T12:07:33-07:00", "url": "https://www.countynewscenter.com/dr-wilma-wooten-retires-from-the-county/", "keywords": ["health", "community healthcare", "community outbreaks", "covid-19", "disease", "immunizations", "public health", "public health accreditation"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-06-18T12:07:33-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSan Diego County’s Public Health Officer, Dr. Wilma Wooten, is retiring after 23 years of service, the last 17 as the County’s lead doctor and public face of numerous media stories, none larger than the 2020 COVID-19 pandemic.\nDuring her career, Dr. Wooten has prioritized the prevention and control of infectious disease, protection from environmental hazards and promoted injury prevention. She has reinforced healthy choices and lifestyles, emergency preparedness and has fought to eliminate health disparities in traditionally underserved communities.\nWith a focus on planning and process, Dr. Wooten has put in place tools to address health and information access in special needs populations, built partnerships to improve population health and formed close relationships with local, state, federal, and binational partners to advance border health initiatives. She has been steadfast in her support of national standards for public health departments and accreditation and serves on multiple professional boards and committees to advance the field of public health.\nOver the past two decades, Dr. Wooten has skillfully provided public health guidance to the County’s 3.3 million residents with her strong leadership, data driven analysis and true professionalism. She embodies excellence in public health and is inspiring new generations of medical professionals, particularly women of color.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240618.12.07.33"}