{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Dangerous Bacteria Outbreak Reported in Local Dogs", "description": "An outbreak of leptospirosis, a contagious bacterial disease, has been reported in dogs in the region, the County Health and Human Services Agency (HHSA) announced today.", "datePublished": "2020-12-17T15:09:33-08:00", "url": "https://www.countynewscenter.com/dangerous-bacteria-outbreak-reported-in-local-dogs/", "keywords": ["health", "dog bacteria", "dogs", "leptospirosis"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-17T15:09:33-08:00", "articleType": "article", "articleContent": "\nAn outbreak of leptospirosis, a contagious bacterial disease, has been reported in dogs in the region, the County Health and Human Services Agency (HHSA) announced today.\nSince October, 34 confirmed and probable cases of leptospirosis have been documented among local dogs, primarily in the Hillcrest and Mission Hills areas. Several dogs required hospitalization and at least one was euthanized.\nBoarding at kennels that allow dog-to-dog interaction is a major risk factor, though some ill dogs only had contact with other dogs at dog parks. The kennels that were linked to cases notified the owners of all potential contacts of diagnosed cases and closed for at least two weeks for cleaning and disinfection.\nSigns of leptospirosis in dogs are varied and can include fever, muscle weakness, vomiting and diarrhea, loss of appetite, low energy, and frequent urination, which may be bloody.\nNo human cases have been linked to this outbreak in dogs, but anyone who develops fever, headache, muscle aches (especially in the back and calves), or other illness after contact with a sick dog should see their health care provider.\nThis week, HHSA sent a health advisory to local physicians and veterinarians about the outbreak.\nLeptospirosis is a disease caused by various species of spirochete bacteria called Leptospira. These bacteria can infect multiple species of mammals, including humans, dogs, rats, mice, raccoons, skunks, and opossums.  The bacteria are shed in the urine of infected animals and may contaminate food, water, soil or bedding. Dogs and people can get infected through direct contact with skin abrasions, mucous membranes, or drinking contaminated water.\n“When dogs visit kennels and parks and play, lick, and sniff each other, they are at risk of getting these bacteria,” said Wilma Wooten, M.D., M.P.H., County public health officer. “If your dog shows any signs, you should take it to your vet immediately.”\nA vaccine is available to prevent leptospirosis in dogs, especially for those boarding in kennels and frequenting dog parks.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201217.15.09.33"}