{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Adopt or Foster a Dog/Pet and Give Your Life a Higher Purpose", "description": "It’s raining doggies at the San Diego County Department of Animal Services. In August, a national Clear the Shelters campaign resulted in 142 dogs, 210 cats, and 29 other animals being adopted out from the County shelters, but as those went out, more animals continued coming in. Due to the Border 32 Fire, the County’s Bonita and Carlsbad shelters took in 67 dogs and 10 cats as well as 34 other animals.", "datePublished": "2022-09-08T15:46:31-07:00", "url": "https://www.countynewscenter.com/?p=209421", "keywords": ["animals"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-09-08T15:46:31-07:00", "articleType": "article", "articleContent": "\nIt’s raining doggies at the San Diego County Department of Animal Services. In August, a national Clear the Shelters campaign resulted in 142 dogs, 210 cats, and 29 other animals being adopted out from the County shelters, but as those went out, more animals continued coming in. Due to the Border 32 Fire, the County’s Bonita and Carlsbad shelters took in 67 dogs and 10 cats as well as 34 other animals.\nLuckily, some of those animals are just being held temporarily and will be going home soon, but not all are that fortunate.\n“We provide the best care possible to all our animals when they are in our care, but it’s not a home. Even with our efforts, the dogs and pets may heal physically, if they come to us with injuries or sickness, but they can’t truly thrive in this environment,” said Kelly Campbell, director of County Animal Services. “Our staff and the volunteers who care for the animals want these animals to have their best lives with a family or person. So, we are asking people to consider meeting and adopting or fostering one of our animals.”\nMost of the animals who are available for adoption can be adopted for no fee, including many dogs and cats that have been there for a long time.\nCaring for animals often gives people a sense of higher purpose. Dogs and cats can help reduce stress, anxiety, depression and loneliness. Sometimes, they can even improve their owner’s cardiovascular health by encouraging exercise with walks and playfulness.\nThe County Shelters have some wonderful longer-stay dogs and other pets who are still full of hope that they too will soon have a family or person of their own. Among them are these staff and volunteer favorites who would make great companions and snuggle-buddies, in some cases.\n    \n\nPeter Parker is a 2-year-old brown brindle neutered pit bull. He loves treats.\nHenry is a neutered black and white border collie mix. He has been at the shelter since April. He’s playful and like’s people’s attention as well as food!\nZeus, a 3-year-old Dalmatian and Labrador retriever mix neutered male and has been at the shelter since June.\nVenus is a black and tan 1-year-old spayed German shepherd. She is high energy and food motivated. She needs some training but would love an active family to call her own.\nMiles is a 6-year-old neutered Siberian husky. He has been at the shelter since June 2021 and he needs an active family. He’d love to be someone’s hiking partner.\nTulip is a 5-year-old spayed female pit bull and has been at the shelter since January.\nGabbie is a 5-year-old spayed Manchester terrier mix.\n\nAll of these featured dogs are at the South (Bonita) Shelter. Adopt by going to the Department of Animal Services office at 5821 Sweetwater Road, Bonita, CA 91902, (619) 767-2675. Or go online to browse and download an application for a different animal or for the North (Carlsbad) shelter.\nRemember adoption fees will be waived on most of the animals who have had longer stays.\nIf you cannot adopt but have some room at home for a temporary roommate, consider fostering a pet.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220908.15.46.31"}