{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Receives $125,000 Office of Traffic Safety Grant for Bicycle and Pedestrian Safety Program", "description": "County Health and Human Services Agency has received a $125,000 grant from  the California Office of Traffic Safety (OTS) to support its Bicycle and Pedestrian Safety Program. The program will promote safe practices for pedestrians, bicyclists and drivers’ on how to responsibly share roads and paths. The grant program runs through September 2025.", "datePublished": "2024-11-12T17:00:07-08:00", "url": "https://www.countynewscenter.com/county-receives-125000-office-of-traffic-safety-grant-for-bicycle-and-pedestrian-safety-program/", "keywords": ["health", "barbara jimenez", "bike safety", "health", "hsec"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2024-11-12T17:00:07-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Health and Human Services Agency has received a $125,000 grant from the California Office of Traffic Safety (OTS) to support its Bicycle and Pedestrian Safety Program. The program will promote safe practices for pedestrians, bicyclists, and drivers’ on how to responsibly share roads and paths. The grant program runs through September 2025.\n“We are excited to receive this grant, it will allow us to significantly expand our bicycle and pedestrian safety program,” said County Health and Human Services Agency Community Operations Officer Barbara Jiménez. “By focusing on education, awareness and promoting safe practices, we are working to reduce crashes and prevent injuries. Ultimately, we’re working to build more walkable and bike-friendly neighborhoods where everyone can travel safely and confidently.”\nGrant funds will support various activities focused on bicycle and pedestrian safety:\n\nCommunity bicycle and walk “audits” of streets with a high rate of pedestrian and/or bicyclist fatalities and serious injury crashes.\nParticipation in “Open Streets” events that encourage biking and walking.\nBicycle training courses that educate youth on safe riding behaviors.\nCommunity and school education presentations.\nCommunity bike rides that encourage and teach riders safe riding skills.\nWalking field trips with older residents and walking safety education for people who are experiencing homelessness.\nPop-up events that promote the importance of visibility on roads and encourage usage of safety equipment such as reflective armbands/leg bands and bicycle headlights/taillights.\n\n“The safety of people walking and biking on our roads is a top priority for our office,” OTS Director Barbara Rooney said. “Everyone moves, and not always by car. It’s important that we invest in efforts to protect people walking, biking and rolling that helps establish a strong traffic safety culture where everyone on California roads can travel to and from places safely.”\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241112.17.00.07"}