{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Sitting, Sunbathing at Beaches Can Start Next Week", "description": "Starting June 2, people will be allowed to sit and lounge at local beaches provided they maintain physical distancing or wear a face covering when close to others, the County Health and Human Services Agency announced today.", "datePublished": "2020-05-28T17:28:33-07:00", "url": "https://www.countynewscenter.com/sitting-sunbathing-at-beaches-can-start-next-week/", "keywords": ["health", "beaches", "coronavirus", "covid-19", "plasma"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-01T15:18:14-07:00", "articleType": "article", "articleContent": "\nStarting June 2, people will be allowed to sit and lounge at local beaches provided they maintain physical distancing or wear a face covering when close to others, the County Health and Human Services Agency announced today.\nSitting on the beach will be allowed for sunbathing and relaxing with towels and chairs if you do it with people in your own household. However, no activities such as football and volleyball will be permitted. Parking lots will remain closed.\nAll beach communities agreed to ease this restriction starting June 2, but cities can decide if they want to proceed later and how the guideline is going to be enforced.\nPlasma from Recovered COVID-19 Cases Needed\nThe San Diego Blood Bank is partnering with the County to encourage San Diegans who have recovered from COVID-19 to donate plasma. It could help treat people who are hospitalized or seriously ill from the novel virus.\nWhile currently there is no vaccine or proven treatment for COVID-19, what’s known as convalescent plasma may help patients fighting the virus because the plasma has antibodies against it. The effort supports the County’s T3 Strategy of test, trace and treat.\n“This partnership helps us to achieve one of the indicators at the federal level for treatment of COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We’re very excited about this partnership.”\nAny of the more than 7,000 people who tested positive for COVID-19 and have recovered could donate plasma.\nTo donate convalescent plasma, people must also meet the regular screening criteria for blood donation. Donor information will be kept confidential and used for screening purposes only.\n“It’s quite simple, but tremendously impactful,” said David Wellis, chief executive officer of the San Diego Blood Bank.\nWellis said 377 doses of convalescent plasma have been distributed across Southern California, especially San Diego County, but more is needed.\n“The current hospital demand for (COVID-19 convalescent plasma) is great, but we’re not meeting the demand. And that sets the stage for this very innovative partnership,” Wellis said.\nAnyone Can Get Tested for COVID-19\nCOVID-19 testing is now more widely available in the region. Testing options include calling your doctor or medical provider to schedule an appointment, signing up on the state website, or calling 2-1-1.\n“Given the testing priorities provided at the federal, state and local level, anyone who wants a test can get it,” Wooten said.\nCounty public health nurse administers a COVID-19 test.\nThe County is opening additional COVID-19 testing sites for people who are not showing symptoms of the virus. A doctor’s referral is not required, but an appointment is necessary. To make an appointment, you should call 2-1-1.\nPeople who are showing symptoms of COVID-19 are encouraged to contact their health care provider and arrange for testing. If you don’t have a health care provider, you should call 2-1-1 and ask for a public health nurse who will give you a referral.\nThe new testing sites are:\nAquatica\n2052 Entertainment Circle, Chula Vista, CA 91911\nMonday to Friday (Starts May 29)\n9 a.m. to 3 p.m.\nSt. Anthony’s of Padua\n410 W 18th Street, National City, CA 91950\nSunday, Wednesday and Friday\n10 a.m. to 2 p.m.\nThe San Diego LGBT Community Center\n3909 Centre St. San Diego, CA 92103\nMondays (Starts June 1)\n11 a.m. to 5 p.m.\nUniversity of San Diego – Parking Lot\n5998 Alcala Park, San Diego, CA 92110\nMonday to Friday (Starts May 29)\n9 a.m. to 3 p.m.\nNorth Coastal Live Well Center\n1701 Mission Ave., Oceanside, CA 92058\nMonday to Friday (Starts May 29)\n10 a.m. to 2 p.m.\nTesting in Rural Communities\nCAL FIRE and the San Diego County Fire Authority announced six more dates when testing will be offered in rural communities.\nDrive-up testing sites will be available from 9 a.m. to 2 p.m. in five communities. An appointment is necessary, and you can make one by calling 2-1-1. The sites will be on:\nJune 1 & 2:  San Diego County Library, 1275 Main St., Ramona, CA 92065\nJune 3:        San Diego County Library: 31466 Hwy 94, Campo, CA 91906\nJune 4:        Pauma Valley School, 33158 Cole Grade Rd., Pauma Valley, CA 92061\nJune 5:        San Diego County Library, 3407 Hwy 78, Julian, CA 92036\nJune 6:        CAL FIRE Monte Vista HQ, 2249 Jamacha Rd., El Cajon, CA 92019\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,699 tests were reported to the County on May 27 and 117 or 3% were positive.\n3.1% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n117 new cases were reported for a San Diego County total of 7,100.\n1,285 or 18.1% of the total cases have required hospitalization.\n377 or 5.3% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nFive COVID-19 deaths were reported today, bringing the region’s total to 260.\nFour women and one man died between May 14 and 25, and their age ranged from 64 to 97 years.\nAll had underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases are:\n\n79 active outbreaks (two new ones since yesterday), 55 at congregate living facilities and 24 in community settings.\n1,550 cases, including 127 deaths in congregate living facilities.\n328 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200528.17.28.33"}