{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Experts to Predict Future at 40th Annual Economic Roundtable", "description": "Recession, inflation, housing prices and more. No one really knows what to expect from the economy in 2024. But federal, state and local experts will make their best educated guesses at the 40th Annual Economic Roundtable.", "datePublished": "2024-01-16T14:19:16-08:00", "url": "https://www.countynewscenter.com/local-experts-to-predict-future-at-40th-annual-economic-roundtable/", "keywords": ["government", "40th annual economic roundtable", "chairwoman nora vargas", "economy"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-01-16T14:47:01-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteRecession, inflation, housing prices and more. No one really knows what to expect from the economy in 2024. But federal, state and local experts will make their best educated guesses at the 40th Annual Economic Roundtable.\nThe free event takes place from 12:30 to 4:30 p.m. on Friday, Jan. 19. You can attend in person at the Joan B. Kroc Institute for Peace and Justice at the University of San Diego or watch it virtually.\nIf you plan to attend in person, you can RSVP online. You’ll find directions on how to get to the event and parking information.\nIf you plan to watch virtually, a livestream link will be available a few days before the event.\nCounty Board Chairwoman Nora Vargas will make opening remarks. Additional opening speakers include Timothy Keane, Dean, USD Knauss School of Business, A.J. Moyer, President and CEO, C3 Bank and Tony Young, Interim President & CEO, San Diego Workforce Partnership.\nAfterward, a fireside chat will take place with Mary Daly, the President and CEO of the San Francisco Federal Reserve and Daniel Enemark, Chief Economist of the San Diego Regional Policy & Innovation Center.\nA panel discussion on the local economy will wrap up the event:\n\nModerator: Kyra Green, Executive Director, Center on Policy Initiatives\nPanelists:\n\nJerry Sanders, President & CEO, San Diego Regional Chamber of Commerce\nCarol Kim, CEO, San Diego County Building Trades Council Family Housing Corp.\n\n\n\nThe 40th Economic Roundtable is sponsored by the County of San Diego, USD Knauss School of Business, the San Diego Workforce Partnership, San Diego Regional Policy and Innovation Center and C3 Bank.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240116.14.19.16"}