{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Regional Monoclonal Antibody Treatment Centers Closing as Demand Decreases", "description": "Regional Monoclonal Antibody Treatment operations are winding down as fewer San Diegans are in need of this service at this stage of the pandemic.", "datePublished": "2022-09-22T17:10:26-07:00", "url": "https://www.countynewscenter.com/?p=209578", "keywords": ["health", "coronavirus", "covid-19", "covid-19 treatment", "marc", "monoclonal antibody treatment"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-09-23T08:05:24-07:00", "articleType": "article", "articleContent": "\nRegional Monoclonal Antibody Treatment operations are winding down as fewer San Diegans are in need of this service at this stage of the pandemic.\nAs the summer surge is decreasing and healthcare systems have built capacity for providing COVID-19 treatment to their patients, three of the four operating Monoclonal Antibody Regional Centers (MARCs) will close by the end of this month. Family Health Centers of San Diego will continue to provide monoclonal antibodies for prevention and for treatment, by appointment only.\nSince the MARCs opened in February of 2021, nearly 15,000 patients have been treated with monoclonal antibodies at 10 locations across the region, including sites at Palomar Health, Vista Community Clinic, San Ysidro Health, Neighborhood Healthcare, Family Health Centers of San Diego, and the cities of San Diego and Chula Vista.\nThe development of the MARCs, prior to the availability of antiviral COVID-19 medications in pill-form, was a novel collaboration among federal, state, county, and local partners, and has received statewide recognition.\n“The demand for monoclonal antibody treatment has been steadily decreasing in recent months as COVID-19 treatments, including Paxlovid, have become readily available at medical providers’ offices and other locations,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “County Public Health will continue to monitor the pandemic to ensure the community’s treatment needs are met.”\nSan Diegans testing positive for COVID-19 should discuss treatment options with their health care provider, especially if they are at high risk for developing severe symptoms. Individuals without a primary care provider can schedule a no-cost telehealth visit online, or call 1-800-232-0233 to find a nearby COVID Test to Treat location.\nIn addition to treatment, COVID vaccines are widely available across the region and offer the best protection from infection with the virus. Medical providers and County sites offer both the primary series of the COVID-19 vaccines, as well as the new bivalent boosters.\nThe new bivalent boosters generate an immune response from the original COVID-19 virus, as well as the BA.4 and BA.5 Omicron subvariants. The Omicron subvariants are responsible for the majority of new infections in the region and across the globe.\nAnyone who is interested in getting the bivalent booster must have completed the primary series of the COVID-19 vaccine first, meaning they must have received the two-dose primary series of Pfizer, Moderna, or Novavax. Also eligible for the bivalent booster are those who received at least one shot of the Janssen vaccine.\nThe new bivalent boosters can be given two months after the completion of the primary vaccine series, or two months after the last monovalent booster dose. Like all COVID-19 vaccines, the bivalent booster can be given simultaneously with the flu vaccine.\nThe bivalent boosters have not yet been authorized for children under the age of 12. Youth ages 5-11 years can get boosted with the previous version of the monovalent Pfizer vaccine.\nVaccination Progress:\n\nFully vaccinated: More than 2.68 million or 80.0% of San Diegans received the primary series of one of the approved COVID-19 vaccines.\nBoosters administered: 1,448,515 or 58.9% of 2,458,117 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nFour additional deaths were reported since the last report on Sept. 15, 2022. The region’s total is 5,487.\nOf the four additional deaths, two were women and two were men. They died between Sept. 11, 2022 and Sept. 15, 2022.\nThree of the people who died were 80 years or older and one was in their 70s.\nAll were fully vaccinated.\nAll had underlying medical conditions.\n\nCases, Case Rates and Testing:\n\n2,634 COVID-19 cases were reported to the County in the past seven days (Sept. 13 to Sept. 19, 2022). The region’s total is now 919,938.\nThe 2,634 cases reported in the past week were slightly lower compared to the 2,840 infections identified the previous week (Sept. 8 through Sept. 14).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 14.65 for people fully vaccinated and boosted, 9.25 for fully vaccinated people and 29.59 for not fully vaccinated San Diegans.\n10,411 tests were reported to the County on Sept. 17, and the percentage of new positive cases was 3.4% (Data through Sept. 17).\nThe 14-day rolling percentage of positive cases, among tests reported through Sept. 17, is 4.6%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Thursdays around 5 p.m., with the exception of holidays.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220922.17.10.26"}