{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Unveils New Affordable Housing Mapping Tool ", "description": "The County has a new tool to help people find affordable housing.  An interactive website and map is now available to search for affordable housing developments built with the help of County funds. ", "datePublished": "2024-08-26T15:50:54-07:00", "url": "https://www.countynewscenter.com/county-unveils-new-affordable-housing-mapping-tool/", "keywords": ["housing", "affordable housing", "foster youth", "housing map", "older adults", "veterans"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-08-26T15:50:54-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe County has a new tool to help people find affordable housing.  \nAn interactive website and map is now available to search for affordable housing developments built with the help of County funds. \nThe County-Restricted Affordable Housing Map shows existing developments and those under construction. \nPeople can search by location and learn details about each property like income limits and the eligible population served by each property such as veterans, older adults, families and individuals or transitional-age youth like those who were in foster care.  \nThe website also covers specifics about affordable housing developments like size and types of units available including number of bedrooms per unit. \nListings include direct links to the websites of each developer or organization that operates the property along with contact information. People searching for affordable housing should contact each property directly about availability, how to apply and other requirements. Many of the listings include links to waiting lists. \n“We are excited to make this new interactive tool available to county residents looking for housing,” said David Estrella, County Housing and Community Development Services Director. “Bringing all County-funded options together under one resource helps our community members navigate this often-stressful search.” \nThe new map aligns with the County’s Housing Blueprint, the County’s guide and ongoing response to the regional housing crisis. \nSince 2017, the County has invested $310 million into affordable housing, using excess land, its Innovative Housing Trust Fund and other state, federal and local funding sources administered by the County. Those funds helped open 2,100 units with 3,300 more on the way. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240826.15.50.54"}