{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "How the Recall Election Works", "description": "Get answers to some of the common questions voters have about casting ballots in the Sept. 14 election.", "datePublished": "2021-08-25T14:59:39-07:00", "url": "https://www.countynewscenter.com/how-the-recall-election-works/", "keywords": ["elections", "gubernatorial recall election", "recall"], "author": [{"type": "@Person", "name": "Tegan Glasheen", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tegan", "familyName": "Glasheen"}], "dateModified": "2021-08-25T15:19:51-07:00", "articleType": "article", "articleContent": "\nCalifornia is holding a gubernatorial recall election on Sept. 14, 2021. Anyone registered to vote in California can vote in the election. The recall is the only thing on the San Diego County ballot.\nThe recall ballot will ask voters two questions:\n\nDo you want to recall the governor? A “yes” vote means remove the governor. A “no” vote means keep the current governor.\nIf recalled, who do you want to replace him?\n\nYou can vote on either one or both parts of the recall ballot. You can choose to vote for a replacement candidate, even if you voted “no” on the recall in the first question. The questions are counted separately and your response to one question does not affect the other.\nThe current governor is not listed among the replacement candidates. Under state law, a person whose recall is being sought cannot be a candidate to succeed themselves at a recall election. This also applies to write-in candidates. Only certified write-in candidates are counted. A certified list of write-in candidates will be available on Sept. 3.\nIf more than 50% of voters vote “yes” to recall the governor, then the replacement candidate with the most votes is elected. There is no minimum required for a replacement candidate to win, and there is no runoff election. The winner serves the remainder of the term, through Jan. 2, 2023. If 50% or more vote “no” on the first question, then the current governor will remain in office.\nMail ballots were sent to all registered California voters. You can vote in person now at the Registrar’s office, Monday – Friday, from 8 a.m. to 5 p.m. or at hundreds of voting locations from Sept. 11-14.\nCheck your registration status\nRegister to vote\nFind a mail ballot drop-off location near you\nMore election info at SDVote.com\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210825.14.59.39"}