{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "McDonald’s, County Team up for COVID-19 Vaccinations", "description": "Yes! Now you can even get fries with that COVID-19 vaccination — at eight McDonald’s restaurants in San Diego County. The County and McDonald's are teaming up to offer free shots at special one-day events starting Monday at McDonald’s, in Chula Vista, El Cajon, Escondido, National City, Oceanside, Ramona, San Diego and Vista.", "datePublished": "2021-06-19T10:12:39-07:00", "url": "https://www.countynewscenter.com/mcdonalds-county-team-up-for-covid-19-vaccinations/", "keywords": ["health", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-06-21T11:57:44-07:00", "articleType": "article", "articleContent": "\nYes! Now you can even get fries with that COVID-19 vaccination — at eight McDonald’s restaurants in San Diego County.\nTo help make it easier for people to get vaccinated, local McDonald’s franchises and the County of San Diego are teaming up to offer free shots at special one-day events starting Monday, June 21 at eight McDonald’s restaurants in Chula Vista, El Cajon, Escondido, National City, Oceanside, Ramona, San Diego and Vista.\nTo thank them for doing their part in building protection against the virus, everyone who receives a free shot will also get a coupon for one free McDonald’s menu item. Maybe a Big Mac? An Egg McMuffin? Or yes, even McDonald’s french fries!\nIn addition, everyone who receives a vaccination at the McDonald’s events will be automatically entered into a drawing to win a free pair of San Diego Padre tickets!\nThe one-day, pop-up clinics are open to the public, McDonald’s employees and their family members. No appointments are necessary, walk-ups are welcome. If you’d prefer to make an appointment, some of the sites are offering pre-registration.\nThe local McDonald’s events are just one of several incentive events the County and local businesses have created to make it easier — and more fun — to get vaccinated. McDonald’s is also working with the state of California to offer the vaccination incentives at more than 70 franchises statewide, including the eight San Diego restaurants.\nThe times, dates, locations and vaccines available at the local McDonald’s pop-up COVID-19 vaccination clinics are:\nRamona McDonald’s: 1550 Main St., Ramona, CA 92065\n\nJune 21: 9 a.m. to 5 p.m. Johnson & Johnson/Janssen and Pfizer (for children 12 and up and second doses)\n\nVista McDonald’s: 827 S. Santa Fe Ave., Vista, CA 92083\n\nJune 21: 9:30 a.m. to 3:30 p.m., ; Johnson & Johnson/Janssen and Pfizer (for children 12 and up and second doses)\n\nEl Cajon McDonald’s: 281 N. 2nd Street, El Cajon, CA 92021\n\nJune 22: 9:30 a.m. to 3:30 p.m., Johnson & Johnson/Janssen and Pfizer (for children 12 and up and second doses)\n\nOceanside McDonald’s: 1701 Oceanside Blvd., Oceanside, CA 92054\n\nJune 23: 9 a.m. to 2 p.m., Pfizer\n\nSan Diego McDonald’s: 2320 Roll Drive, San Diego CA 92154\n\nJune 23: 9 a.m. to 2 p.m., Pfizer\n\nEscondido McDonald’s: 340 W Mission Ave, Escondido CA 92025\n\nJune 24: 9:30 a.m. to 3:30 p.m., Johnson & Johnson/Janssen and Pfizer (for children 12 and up and second doses)\n\nNational City McDonald’s: 2140 Plaza Blvd., National City CA 92050\n\nJune 24: 9:30 a.m. to 3:30 p.m., Johnson & Johnson/Janssen and Pfizer (for children 12 and up and second doses)\n\nChula Vista McDonald’s: 619 Broadway, Chula Vista, CA, 91910\n\nDate to be Determined\n\nThe McDonald’s one-day clinics and other vaccination times and locations can be found at County’s Find a Vaccine website and by following the County of San Diego on social media.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210619.10.12.39"}