{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Cases Reported at Mission Bay High School and Montgomery High School", "description": "The San Diego County Health and Human Services Agency is working in close collaboration with officials at San Diego Unified School District and Sweetwater Union School District to notify people who were possibly exposed to tuberculosis under separate circumstances at two different area high schools.", "datePublished": "2022-11-02T09:39:34-07:00", "url": "https://www.countynewscenter.com/tuberculosis-cases-reported-at-mission-bay-high-school-and-montgomery-high-school/", "keywords": ["health", "public health", "tuberculosis"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-11-02T09:39:34-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Health and Human Services Agency (HHSA) is working in close collaboration with officials at San Diego Unified School District (SDUSD) and Sweetwater Union School District (SUHSD) to notify people who were possibly exposed to tuberculosis (TB) under separate circumstances at two different area high schools.\nSDUSD, SUHSD, and HHSA have notified individuals who have a higher risk of exposure to TB, and are arranging no-cost TB screening for those who are at increased risk of infection. While students and staff with increased risk for exposure have been identified, other students and staff may also have been exposed. The period of potential exposures are as follows:\n\nApril 2, 2022 to Sept. 16, 2022 at Montgomery High School\nJune 17, 2022 to July 10, 2022 at Mission Bay High School\n\nTuberculosis is an airborne disease that is transmitted from person to person through inhalation of the bacteria from the air. Chances of infection are higher for people with frequent and prolonged indoor exposure to a person who is sick with TB.\n“Symptoms of active tuberculosis most commonly include persistent cough, fever, night sweats and unexplained weight loss,” said County Public Health Officer Dr. Wilma J. Wooten, M.D., M.P.H. “Most people who become infected after exposure to tuberculosis do not get sick right away. Some who become infected with TB will become ill at some point in the future, sometimes even years later. Blood tests and skin tests are effective to determine whether someone has been infected.”\nTreatments are available that are effective in preventing people infected with tuberculosis from getting sick and in curing people who are sick. It is especially important for individuals with symptoms of TB and those who are immune-compromised to see their medical provider to rule-out an active case and to discuss treatment.\nIndividuals who would like more information on this potential exposure should call the San Diego County TB Control Program at (619) 692-8621.\nThe number of annual tuberculosis cases in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 201 cases reported in 2021. Through September, 126 cases have been reported to date in 2022.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221102.09.39.34"}