{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Now Offering Free Graffiti Removal for Property Owners in the Unincorporated Area", "description": "A new County program now in place allows San Diegans in the county's unincorporated area to remove unwanted graffiti from their property free of charge.", "datePublished": "2023-03-30T10:30:57-07:00", "url": "https://www.countynewscenter.com/county-now-offering-free-graffiti-removal-for-property-owners-in-the-unincorporated-area/", "keywords": ["consumer", "graffiti abatement", "graffiti removal", "pds"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2023-04-03T15:50:37-07:00", "articleType": "article", "articleContent": "\nA new County program now in place allows San Diegans in the county’s unincorporated area to remove unwanted graffiti from their property free of charge.\nThe Board approved the initiative in January. The first graffiti abatement occurred last week when contractors removed extensive graffiti damage from the side of a building along Campo Rd. in Spring Valley.\nThe previous policy required the property owner to pay graffiti removal costs. Under the new program, residents in the unincorporated area can schedule the graffiti removal through the County, and a contractor will remove the unwanted graffiti free of charge.\nThe initiative aims to beautify the region without placing a financial burden on property owners. Close to 90 percent of graffiti cases are reported in areas of the region where residents often struggle to pay the removal cost.\nIf you want to report a graffiti issue in the unincorporated area, there are several ways to do so:\n\nDownload the Tell Us Now App from the Google Play Store or Apple Store\nCall the 24/7 hotline at (858) 694-2705\nEmail PDS.CodeCompliance@sdcounty.ca.gov\nReport the issue in person at the County Operations Center – 5510 Overland Ave., Suite 300\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230330.10.30.57"}