{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Postcards Go Out to Registered Voters for Nov. 7 Elections", "description": "More than 430,000 postcards have been mailed to registered voters in the Fourth Supervisorial District, Fallbrook Public Utility District and Rainbow Municipal Water District listing their voting options for the Nov. 7 special election.", "datePublished": "2023-09-07T10:04:40-07:00", "url": "https://www.countynewscenter.com/postcards-go-out-to-registered-voters-for-nov-7-elections/", "keywords": ["elections", "district 4", "fallbrook public utility district", "fgg", "fourth supervisorial district", "nov. 7 election", "rainbow municipal water district", "registrar of voters", "runoff election nov. 7"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-09-07T10:59:25-07:00", "articleType": "article", "articleContent": "\nMore than 430,000 postcards have been mailed to registered voters in the Fourth Supervisorial District, Fallbrook Public Utility District and Rainbow Municipal Water District listing their voting options for the Nov. 7 special election. Only the voters who live in each of those districts can vote in their respective elections.\nThe special runoff election for the Fourth Supervisorial District will fill the vacant seat for the remainder of the current term ending in January 2027.\nVoters who live in the Fallbrook Public Utility District and Rainbow Municipal Water District will vote on a ballot measure.\nRegistered voters in these districts will receive a ballot in the mail the week of Oct. 8. The official ballot packet will also include an “I Voted” sticker, voting instructions and other important election information.\nEarly voting begins Monday, Oct. 9, at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nYou can vote at home and return your voted ballot through the mail – no postage needed – or to any of the Registrar’s official ballot drop boxes around the county starting Tuesday, Oct. 10 through the final day of voting, Nov. 7.\nRemember to sign and date your ballot return envelope. You must sign the envelope for your vote to count.\nVoters who return their ballot through the U.S. Postal Service can track it by signing up for “Where’s My Ballot?”.\nIf you want to vote in person and avoid long lines, select vote centers will also offer early voting starting on Saturday, Oct. 28. The vote centers will be open daily from 8 a.m. to 5 p.m. until the final day of voting on Tuesday, Nov. 7, when all vote centers will open from 7 a.m. to 8 p.m.\nLearn more about voting in the Nov. 7 special election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230907.10.04.40"}