{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, City Thank Public For Tropical Cyclone Hilary Preparations", "description": "County Board Chairwoman Nora Vargas, City of San Diego Mayor Todd Gloria, emergency services officials and others said Monday that significant preparations and the willingness of the public to heed warnings, stay home and off roads helped reduce the impact of Tropical Cyclone Hilary.", "datePublished": "2023-08-21T14:46:50-07:00", "url": "https://www.countynewscenter.com/county-city-thank-public-for-tropical-cyclone-hilary-preparations/", "keywords": ["government", "county update", "emergency", "emergency operations center", "preparedness", "tropical cyclone hilary"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-08-21T15:07:56-07:00", "articleType": "article", "articleContent": "\nCounty Board Chairwoman Nora Vargas, City of San Diego Mayor Todd Gloria, emergency services officials and others said Monday that significant preparations and the willingness of the public to heed warnings, stay home and off roads helped reduce the impact of Tropical Cyclone Hilary.\n“I want to thank the public,” Vargas said. “You listened to the warnings. You prepared. You stayed off the roads. You helped us keep our residents safe and we are grateful.”\nOfficials and media gathered at the County’s Emergency Operations Center Monday morning for an update on the storm. The National Weather Service reported it was first tropical cyclone to hit San Diego County in more than 100 years.\nThe state of California, the County and cities of San Diego, Chula Vista and San Marcos, and two tribal nations―the La Jolla Band of Luiseño Indians and the Los Coyotes Band of Cahuilla Mission Indians―all proclaimed states of emergency as the storm was forming over the weekend. Weather forecasters predicted record rains and winds to hit all of Southern California and parts of the southwest.\nAt Monday’s press conference, officials said there were no reported major catastrophes or damage to infrastructure in the county.\nPart of the reason for that, officials said, was the impressive, collective preparation by the County, local cities and the public.\nVargas said that although County Public Works crews work year-round to keep culverts and road drainage clear, they also worked hard as the storm approached to double-check those systems. The County also sent numerous notifications to the public, from its Emergency Operations Center, by emails, a Wireless Emergency Alert (WEA) notification Saturday afternoon, and by emergency updates and public notifications on its AlertSanDiego.org website. The site includes information about emergency preparedness, response and recovery.\nSome of the other actions included:\n\nThe County of San Diego alone distributed more than 100,000 sandbags to help the public prepare and defend their properties.\nThe County worked with the American Red Cross of San Diego and Imperial Counties to open two overnight shelters Saturday, at the Corky Smith Gymnasium in San Marcos and Southwestern College’s Jaguar Aquatics Wellness & Sports.\nNearly 50,000 new people signed up for notifications from AlertSanDiego.org.\nAnother 33,000 new users downloaded the County’s emergency website app.\nMore than 350,000 viewers visited the emergency website in the four days leading up to the Tropical Cyclone Hilary’s arrival, including 301.9k on Saturday and Sunday alone.\n160,000 people visited the County’s Ready San Diego webpage that offers information about how to prepare for emergencies.\n\nFor additional information about emergency preparedness, visit AlertSanDiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230821.14.46.50"}