{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pet Preparedness Month Reminds Residents to Make Plans for Furry Family Member", "description": "June is National Pet Preparedness Month, and the County of San Diego’s Office of Emergency Services and Department of Animal Services are reminding residents to make sure their family disaster preparedness plan includes provisions for their household pets.", "datePublished": "2021-06-01T09:48:41-07:00", "url": "https://www.countynewscenter.com/pet-preparedness-month-reminds-residents-to-make-plans-for-furry-family-member/", "keywords": ["public safety", "animal evacuations", "animals", "emergency", "emergency preparedness", "evacuation", "preparedness"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-06-01T09:48:41-07:00", "articleType": "article", "articleContent": "\nJune is National Pet Preparedness Month, and the County of San Diego’s Office of Emergency Services and Department of Animal Services are reminding residents to make sure their family disaster preparedness plan includes provisions for their household pets.\nJust like other family members, pets require their own disaster preparedness kit that includes an ample supply of food and water. The kit should also include items such as a crate or travel carrier, required medications, veterinary records, grooming items, and sanitation needs like kitty litter and plastic pet waste bags.\nPets should always have a collar with an ID tag that lists the contact number for the owner. An even better way to help protect your furry family member is to have your pets microchipped. In the event pets are ever separated from their owner, many veterinarians and animal shelters have the capability to scan the microchip to obtain contact information.\nCounty residents should never leave their pets at home during an emergency that requires evacuation. More than likely, it will take several hours or even days before residents can return to their homes. Pets might also be trapped in structures if wildfires approach, or damage to structures could allow pets to escape or to fall victim to predators.\nIt is also important to have recent photographs of your pet. These are important if the pet is lost, and you need to post a “missing animal” notice, and they even help to prove ownership in some circumstances. Photos should be stored on a mobile device or cloud-type storage system for easy access from remote locations.\nDuring an ordered evacuation, the Department of Animal Services typically provides shelter at a county shelter or other location for displaced pets who cannot stay with their owners. While this is a valuable resource, pet owners are also encouraged to have a list of pet-friendly hotels and local animal boarding facilities in case they are needed.\nThe Department of Animal Services provides residents with an easy-to-use Pet Preparedness Plan. The Office of Emergency Services also provides information on how to prepare pets for potential emergency situations, including a helpful video on the Ready San Diego website.\nMicrochipping is available at both Department of Animal Service locations by appointment only. To schedule an appointment, call (619) 767-2675.\nCounty residents who own livestock are also encouraged to have an emergency plan to evacuate animals in a timely manner. The Department of Animal Services has published a Disaster Preparedness for Livestock Guide that is full of valuable information.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210601.09.48.41"}