{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "2 More COVID-19 Deaths Reported; Cases Increase by 43", "description": "Two additional COVID-19 deaths have been reported, bringing the region’s total to 47, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-13T18:32:10-07:00", "url": "https://www.countynewscenter.com/2-more-covid-19-deaths-reported-cases-jump-by-43/", "keywords": ["health", "2 covid-19 deaths", "coronavirus", "homeless and covid-19", "stayhomesd"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-14T14:12:42-07:00", "articleType": "article", "articleContent": "\nTwo additional COVID-19 deaths have been reported, bringing the region’s total to 47, the County Health and Human Services Agency announced today.\nThe two new deaths are a woman in her late 90s and a 100-year-old woman. Both had underlying medical conditions.\n“COVID-19 significantly impacts our older adults and people with underlying medical conditions, such as heart disease, chronic lung disease, asthma and diabetes, as well as compromised immune systems,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Our vulnerable populations matter and we want to keep them safe.\nThat is why we must continue to stay home and take other preventive measures to protect those who are most vulnerable.”\nThe age, gender and race and ethnic breakdown of the 47 COVID-19 deaths reported is:\nAge:\n\n80 and older: 24\n70 to 79: 13\n60 to 69: 4\n50 to 59: 4\n20 to 29: 2\n\nGender:\n\n26 Men\n21 Women\n\nRace and Ethnicity:\n\n22 White\n12 Hispanic\n2 Asian\n1 Multiple races\n10 Unknown\n\nCounty COVID-19 Cases Now at 1,847\nForty-three new COVID-19 cases were announced today, bringing San Diego County’s total to 1,847. Thirteen of the positive cases were reported in people who are homeless—nine were unsheltered and four came from existing shelters.\nOf San Diego County’s cases, 937 (50.7%) were men and 905 (49.0%) were women. The gender of five people is unknown. Of the reported cases, 420 (22.7%) have required hospitalization and 156 (8.4%) of the total number of cases had to be placed in intensive care. Forty-seven (2.5%) have died.\nOther measures and resources to deal with COVID-19 include:\n\nMore than 26,000 tests have been administered to San Diegans.\nThe County has distributed nearly 2.0 million personal protective equipment items to local health care providers, including over 801,000 N-95 respirators, about 390,000 surgical face masks and nearly 740,000 gloves.\nA total of 2,029 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,582 rooms for County Public Health Services use, 199 are occupied by 222 guests.\nOf the 447 rooms assigned to the Regional Task Force on the Homeless, 193 are being occupied by 320 people who are at higher risk of developing complications from COVID-19.\n\nSubmit Your #StayHomeSD Sign\nCounty officials are encouraging San Diegans to join the #StayHomeSD campaign by staying at home, maintaining a physical distance and wearing a facial covering.\nHundreds of people from across the region have submitted their photos indicating the reasons why they’re staying at home. To join, submit a picture holding a sign that shows the reason why you are staying home. Your picture could be featured as one of the faces of our community in the campaign as we work together to flatten the curve and slow the spread of COVID-19.\nYou too can submit your sign for the County’s #StayHomeSD campaign.\nThose submitting a photo are encouraged to share it on their social media pages with the hashtags #StayHomeSD and #InThisTogetherSD.\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data is also broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200413.18.32.10"}