{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pets Bring True Love Beyond Valentine’s Day", "description": "February is Valentine’s season and if you’re looking for true love, the San Diego County Department of Animal Services has lots of cuddly and cute contenders for your heart.", "datePublished": "2024-02-05T09:18:17-08:00", "url": "https://www.countynewscenter.com/pets-bring-true-love-beyond-valentines-day/", "keywords": ["animals", "adopt pets", "das"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-02-05T09:18:17-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesFebruary is Valentine’s season and if you’re looking for true love, the San Diego County Department of Animal Services has lots of cuddly and cute contenders for your heart.\nIn the department’s “You Make My Heart Spin” campaign, you just let love take the wheel! Spin the department’s Wheel of Love to discover your adoption fee at the Bonita and Carlsbad shelters from now through Wednesday, Feb. 14. All adoptions are $20 or less\nHelp give these wonderful dogs, cats, guinea pigs, rabbits, pigs or turtles a forever home filled with hugs, kisses, purrs, and wagging tails. Don’t miss this pawsitively sweet opportunity to make a difference in both your life and theirs.\nFind your furry (or scaly) valentine from the available pets on the Animal Services website.\nAll adoption fees include spaying or neutering, a microchip, updated vaccinations and a one-year dog license for those in the service area. Adoption fees are waived for any pet that has been in shelter care for more than 30 days.\nIf you’re interested, in adopting one of the County’s wonderful pets, walk-in hours are from 1 to 4 p.m. Tuesday through Friday and 10 a.m. to 4 p.m. Saturday and Sunday at the South Shelter, 5821 Sweetwater Road in Bonita and the North Shelter, 2481 Palomar Airport Road in Carlsbad. To adopt, you just need a photo identification card. Adoptions are on a first-come, first-served basis.\nIf adoption is not currently an option, fostering is always free. Please consider joining the County’s foster program. Even short breaks of a few days away from the shelter environment significantly improves the health and well-being of pets. All basic care supplies such as food, leash and bedding are included as part of the program.\nFor more information on fostering animals, making pet food donations, or volunteering for the shelter, call (619) 767-2675 or visit the Animal Services main website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240205.09.18.17"}