{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "TB Exposure Reported at SDSU", "description": "The Tuberculosis Program in the Public Health Services department, of the County of San Diego Health and Human Services Agency, in collaboration with San Diego State University and Aztec Shops are working closely to notify employees potentially exposed to tuberculosis on the SDSU campus, primarily at the Charles B. Bell Jr., Pavilion. Exposures to the general public, SDSU students and faculty, and to other employees are considered to be limited.", "datePublished": "2023-09-14T14:01:27-07:00", "url": "https://www.countynewscenter.com/tb-exposure-reported-at-sdsu/", "keywords": ["health", "sdsu", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-09-18T12:33:31-07:00", "articleType": "article", "articleContent": "\nThe Tuberculosis Program in the Public Health Services (PHS) department, of the County of San Diego Health and Human Services Agency, in collaboration with San Diego State University (SDSU) and Aztec Shops are working closely to notify employees potentially exposed to tuberculosis (TB) on the SDSU campus, primarily at the Charles B. Bell Jr., Pavilion. Exposures to the general public, SDSU students and faculty, and to other employees are considered to be limited.\nThe dates of potential exposure are from Feb. 16, 2023 to June 22, 2023. Those known to have been potentially exposed have been directly notified and have been provided direction from health officials. People sick with TB may be sick for many months before they are diagnosed, and as such, exposure periods can be long.\nTB is an airborne disease that is transmitted from person-to-person through inhalation of the bacteria from the air. The chance of infection is higher for people with prolonged indoor exposure to a person who is sick with TB.\n“Symptoms of active TB include persistent cough, fever, night sweats and unexplained weight loss,” said Wilma Wooten, M.D., M.P.H., County Public Health Officer. “Most people who become infected after exposure to tuberculosis do not get sick right away. This is called latent TB infection. Some who become infected with TB will become ill in the future, sometimes even years later, if their latent TB infection is not treated. Blood tests and skin tests are effective to determine whether someone has been infected.”\nPeople who test positive for TB but who don’t have symptoms of active TB should get a chest x-ray and talk to a medical provider, as they may have a latent TB infection. People in this situation are infected with TB, but the infection is essentially dormant or “sleeping.” Taking medicines for latent TB infection can cure the infection and keep these people from ever getting sick.\nIt is important for individuals with symptoms of active TB and those who are immune-compromised to see a medical provider to rule-out active tuberculosis and to discuss treatment.\nIndividuals who would like more information on this potential exposure should call the County TB Control Program at (619) 692-5565.\nThe number of people diagnosed with active TB in San Diego County has decreased since the early 1990s and has stabilized in recent years. There were 192 cases in 2020 and 201 people reported with active disease in 2021. In 2022, 208 people were reported with active TB disease in San Diego County.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230914.14.01.27"}