{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "All Delayed COVID-19 Vaccine Expected Next Week", "description": "The federal government today announced it is ramping up efforts to get all delayed doses of COVID-19 vaccine to their destined locations by the end of next week. County health officials say the region is prepared to administer however many doses arrive locally.", "datePublished": "2021-02-19T15:59:42-08:00", "url": "https://www.countynewscenter.com/all-delayed-covid-19-vaccine-expected-next-week/", "keywords": ["health", "coronavirus", "covid-19", "delayed vaccines", "vaccines"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-02-19T15:59:42-08:00", "articleType": "article", "articleContent": "\nThe federal government today announced it is ramping up efforts to get all delayed doses of COVID-19 vaccine to their destined locations by the end of next week.\nCounty health officials say the region is prepared to administer however many doses arrive locally.\n“We have the mechanism in place to be able to administer all the doses we get in San Diego County,” said Wilma Wooten, M.D., M.P.H., County public health officer. “In the meantime, we’re asking San Diegans to be patient. As the delayed doses arrive, we will administer them to everyone who has an appointment and release new time slots.”\nA COVID-19 vaccination is administered at the Grossmont Center Vaccination Super Station.\nNotification of Changed Appointments\nCurrently, all County COVID-19 vaccination points of dispensing, or PODs, and the North County Super Station in San Marcos are only offering appointments for second doses.\nAppointments for first doses at these sites are being rescheduled into next week. You should be notified of your new appointment date and time by the MyTurn appointment system or via email.\nIn addition, the vaccination super station at Petco Park is pausing all appointments through Saturday. The site could remain closed Sunday and Monday, depending on when more vaccine doses arrive.\nIf your appointment got cancelled, you should be notified via your UC San Diego Health MyChart account. You should also check your email.\nThe Sharp HealthCare vaccination super station sites at Chula Vista Center and Grossmont Center are still offering first and second dose appointments with Pfizer vaccine.\nShould appointments need to be changed at the Sharp Sites, you will be notified by PrepMod, their appointment system or via email. If you have questions about vaccination at these two sites you can email sharpcovidvaccineclinic@sharp.com.\nIf you have received your first dose, you should not be concerned about the minor delays in second dose appointments. The Centers for Disease Control and Prevention has advised that people can wait up to 42 days between doses and still achieve maximum immunity.\nMore information about the COVID-19 vaccine is available at www.vaccinationsuperstationsd.com.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 22.2 cases per 100,000 residents and the region is in Purple Tier or Tier 1.\nThe testing positivity percentage is 6.4%, placing the County in Tier 2 or the Red Tier. While the testing positivity rate for the County qualifies it for the Red Tier, the state uses the most restrictive metric – in this case the adjusted case rate – and assigns counties to that tier. Therefore, the County remains in the Purple Tier or Tier 1.\nThe County’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, is 9.7% and it’s in the Purple Tier or Tier 1. This metric does not move counties to more restrictive tiers but is required to advance to a less restrictive tier.\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Feb. 23.\n\nCommunity Setting Outbreaks:\n\nFour new community outbreaks were confirmed Feb. 18: two in business settings, one in a daycare/preschool/childcare setting and one in a retail setting.\nIn the past seven days (Feb. 12 through Feb 18), 30 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n14,822 tests were reported to the County on Feb. 18, and the percentage of new positive cases was 5%.\nThe 14-day rolling average percentage of positive cases is 5.1%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 14,227.\n\nCases, Hospitalizations and ICU Admissions:\n\n812 cases were reported to the County on Feb. 18. The region’s total is now 255,802.\n12,467 or 4.9% of all cases have required hospitalization.\n1,552 or 0.6% of all cases and 12.4% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n34 new COVID-19 deaths were reported on Feb. 18. The region’s total is now 3,169.\n19 men and 15 women died between Dec. 25. and Feb. 18.\nOf the 34 deaths reported today, 16 people who passed away were 80 years or older, six people were in their 70s, five were in their 60s, four were in their 50s, one was in their 40s and two were in their 30s.\n30 had underlying medical conditions, two did not and two had medical history pending.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210219.15.59.42"}