{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Residents Asked to Take Public Safety Power Shutoff Survey", "description": "The San Diego County Office of Emergency Services is asking all County residents to fill out a survey about the Public Safety Power Shutoff (PSPS) program.", "datePublished": "2021-06-30T09:04:46-07:00", "url": "https://www.countynewscenter.com/county-residents-asked-to-take-public-safety-power-shutoff-survey/", "keywords": ["public safety", "emergency", "fire preparedness", "office of emergency services", "sdg&e", "survey"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-06-30T09:04:46-07:00", "articleType": "article", "articleContent": "\nThe San Diego County Office of Emergency Services is asking all County residents to fill out a survey about the Public Safety Power Shutoff (PSPS) program.\nPSPS is a prevention program sponsored by San Diego Gas and Electric (SDG&E) to reduce the potential for utility-related wildfires. SDG&E will temporarily shut off power to customers in specific areas when wind speed, vegetative moisture, temperature and humidity create a high risk for wildfires.\nStakeholder and community feedback on PSPS is critical to advancing public safety throughout the County.\nOver the past few years, surveys and public workshops have yielded new ideas on how to keep communities and customers safe from wildfires and other disasters, and how to mitigate the impacts of PSPS events.\nThose who choose to include their email address in the survey will be invited to attend a virtual PSPS workshop later this year. The workshop will include a review of the survey results, and an opportunity to provide additional feedback on current efforts.\nThe PSPS survey will be available until July 13, 2021, and all County residents are encouraged to provide feedback and ideas on how to mitigate the impacts of PSPS events.\nAdditional information on how to prepare for and deal with a power outage is available at Ready San Diego.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210630.09.04.46"}