{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Pet Adoption Fees Waived for Clear the Shelter Month", "description": "Make a difference in a homeless pet’s life by giving them a home, family, and love in August for Clear the Shelters, a monthlong national effort to find caring homes for animals in shelters.", "datePublished": "2023-07-31T10:30:39-07:00", "url": "https://www.countynewscenter.com/pet-adoption-fees-waived-for-clear-the-shelter-month/", "keywords": ["animals", "adopt pets", "clear the shelters", "das", "free pet adoptions"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-07-31T10:30:39-07:00", "articleType": "article", "articleContent": "\nMake a difference in a homeless pet’s life by giving them a home, family, and love in August for Clear the Shelters, a monthlong national effort to find caring homes for animals in shelters.\nThe San Diego County Department of Animal Services will be waiving pet adoption fees throughout the month of August to help to make the dream of a forever home come true for all the pets in their care. Shelters in the County are nearly full of animals and the public’s help is needed to meet this goal. The department has participated in the campaign since 2016 and has adopted out 644 pets, including 302 last year.\nNationally, the Clear the Shelters campaign has helped more than 860,000 pets find new homes since 2015. Last year’s campaign set a new single-year record with more than 161,000 adoptions, while also raising more than $540,000. Clear the Shelters is part of a campaign by NBC-owned television stations and Telemundo to find loving homes for the millions of pets who end up in the nation’s shelters each year. Cities across the country take part in the event.\nAll animals adopted from County shelters will be spayed or neutered, have vaccinations, a microchip and a one-year license for dogs in the service area.\nPlease visit County Animal Services’ Adoptions page and browse the beautiful and lovable animals from cats to dogs to turtles and guinea pigs available now. Animal Services staff recommend that people pick out a second and third choice too, just in case your first choice is already chosen by another person. Walk-in hours are from 1 to 4 p.m. Tuesday through Friday and from from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad. Fill out an application online to print or pick one up at the shelter.\nThe County Department of Animal Services’ top priority is providing excellent care in its shelters while finding good homes for every healthy and treatable animal. While the goal is to find the right fit for animals and their permanent adopter to form a lasting and loving bond, animal fostering is another opportunity for animals to learn how to be in a home and socialize with people and other animals.\nThe Department of Animal Services protects the health, safety and welfare of people and animals. Animal Services envisions a safe, thriving community where all people and animals in San Diego County have access to essential animal care and support services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230731.10.30.39"}