{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Celebrating The Work of County Health Nurses", "description": "It is National Nurses Month, and the County would like to recognize the hundreds of County nurses who are devoted to caring for people throughout the region’s hospitals, neighborhoods and homes. County nurses deliver compassionate, trauma-informed care, often in challenging circumstances.", "datePublished": "2022-05-12T14:39:48-07:00", "url": "https://www.countynewscenter.com/?p=208491", "keywords": [], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2022-05-12T14:39:48-07:00", "articleType": "video.other", "articleContent": "\nIt is National Nurses Month, and the County would like to recognize the hundreds of County nurses who are devoted to caring for people throughout the region’s hospitals, neighborhoods and homes.\nCounty nurses deliver compassionate, trauma-informed care, often in challenging circumstances. They meet people where they are to provide person-centered service with special attention to inclusion, diversity and equity.\nThroughout the pandemic, County nurses committed countless hours to the frontlines of the COVID-19 response, offering exceptional care and courageous leadership. They interacted with vulnerable populations including older adults, children and people experiencing homelessness. They ensured a rapid and equitable response in high-risk communities. They adapted to changing protocols and solved problems with innovation and perseverance.\nThe efforts of County nurses played a big part in the region reaching nearly 94% of its population having received at least one COVID-19 vaccination, placing San Diego among the top 10 counties in California.\nThe County thanks its nurses for their unwavering commitment to the public’s health and well-being, for their hard work and compassion for all, and for their mission to ensure a healthier tomorrow.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220512.14.39.48"}