{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuesday is Last Day to Vote in Statewide General Election", "description": "Tuesday, Nov. 8 is the final day to cast your ballot in the Statewide General Election.", "datePublished": "2022-11-07T08:00:27-08:00", "url": "https://www.countynewscenter.com/tuesday-is-last-day-to-vote-in-statewide-general-election/", "keywords": ["elections", "nov. 8 statewide general election", "official ballot drop-off boxes", "san diego county registrar of voters", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-11-07T08:14:15-08:00", "articleType": "article", "articleContent": "\nTuesday, Nov. 8 is the final day to cast your ballot in the Statewide General Election. Voters can do so at any one of 218 vote centers or 141 official ballot drop box locations around the county.\nAll will be open on Election Day, Nov. 8, from 7 a.m. to 8 p.m. Any voter who is in line at a vote center or an official ballot drop box location at 8 p.m. will be allowed to vote. However, no one can join the line after the 8 p.m. deadline.\nIf you’re not registered to vote and want to participate in the election, you may visit any vote center to conditionally register and vote provisionally through Election Day.\nOnce the voter registration is processed and the Registrar’s office confirms the voter did not vote elsewhere in the state, the voter registration becomes active, and the provisional ballot is counted.\nVote centers replace polling places and provide more services. Vote center services include:\n\nVote in person or drop off a mail-in ballot\nVote using an accessible ballot marking device\nReceive assistance and voting materials in multiple languages\nRegister to vote or update your voter registration and vote on the same day\n\nVoters can use a touch screen to make their selections on the ballot marking device. When finished, the voter will print out the official ballot with their selections. The voter can review the ballot and then it is placed in the ballot box to be counted at the Registrar’s office. The ballot marking device does not store, tabulate or count any votes.\nRemember that campaigning or electioneering within 100 feet of a vote center or official ballot drop box location is not allowed. This includes the visible display or audible dissemination of information that advocates for or against any candidate or measure on the ballot. Additionally, an individual may not circulate any petitions, including for initiatives, referenda, recall, or candidate nominations.\nLearn more about voting in the Nov. Statewide General Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221107.08.00.27"}