{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Case Rate Lands County in First Week of Purple Tier", "description": "After weeks of being on the edge of entering the Purple Tier, the County’s adjusted case rate rose above 7.0 cases per 100,000, landing the region for one week in the state’s most restrictive COVID-19 level.", "datePublished": "2020-11-04T16:32:49-08:00", "url": "https://www.countynewscenter.com/covid-19-case-rate-lands-county-in-first-week-of-purple-tier/", "keywords": ["health", "coronavirus", "covid-19", "purple tier"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-11-04T16:42:17-08:00", "articleType": "article", "articleContent": "\nAfter weeks of being on the edge of entering the Purple Tier, the County’s adjusted case rate rose above 7.0 cases per 100,000, landing the region for one week in the state’s most restrictive COVID-19 level.\nWhile the adjusted case rate increased from 6.5 to 7.4 in the past week, the County remains for now in the Red Tier, or Tier 2, of activity restrictions. Should the rate continue to be above 7.0 cases per 100,000 residents for a second week in a row, restaurants, gyms, churches, theaters and other locations will need to end indoor operations under state guidance.\n“The region now is in greater danger of moving into the most restrictive tier, which would mean that indoor activities would cease,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nThe state’s health equity metric, which looks at the testing positivity for areas with the lowest healthy conditions, increased slightly from 5.1% to 5.3% which is in the Red Tier. This metric does not on its own allow counties to advance a tier or move to one more restrictive level.\nThe testing positivity percentage dropped from 3.5% to 3.2%, keeping this metric in the Orange Tier or Tier 3.\nWooten urged San Diegans to follow the local health guidance to slow the spread of COVID-19. That includes:\n\nWashing your hands\nKeeping six feet apart from others\nWearing a face covering\nAvoiding crowds and large gatherings\nStaying home if you’re sick\n\n“San Diegans need to be more dedicated to taking preventing measures to get the region out of the Purple Tier should the County fall into it,” Wooten said. “We know these measures work to prevent COVID-19 and to slow the pandemic.”\nThe California Department of Public Health assesses counties on a weekly basis. The next report is scheduled for Tuesday, Nov. 10.\nTesting Site Opens in Lemon Grove, Imperial Beach Site Moves\nA new COVID-19 testing site is now open at the Lemon Grove Community Center, located 3146 School Lane. The no-appointment site is open every day from 8:30 a.m. to 5:30 p.m.\nAlso, the testing site at Mar Vista High School has closed and will be moving to the Imperial Beach Sports Park Recreation Center, 425 Imperial Beach Boulevard. When it opens Nov. 12, it will be a no-appointment, walk-in site. Free testing will be offered from 8:30 a.m. to 3:30 p.m. Monday through Friday.\nHealth plans are required to cover COVID-19 tests at no cost.\nIf you are unable to get a test from your healthcare provider, the County has coordinated free diagnostic COVID-19 testing at many locations. These tests take about 5-10 minutes. Results generally come back in approximately 3 days.\nCommunity Setting Outbreaks:\n\nSeven new community outbreaks were confirmed on Nov. 3: three in restaurant/bar settings, two in business settings, one in grocery setting and one in a health care setting.\nIn the past seven days (Oct. 28 through Nov. 3), 25 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n15,345 tests were reported to the County on Nov. 3, and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 12,073.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Health care and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n404 new cases were confirmed among San Diego County residents on Nov. 3. The region’s total is now 58,106.\n3,983 or 6.9% of all cases have required hospitalization.\n921 or 1.6% of all cases and 23.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nThree new deaths were reported in the County on Nov. 3. The region’s total is now 904.\nTwo women and one man died between Oct. 28 and Nov. 1. Their ages ranged from late 50s to late 80s.\nAll but one had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201104.16.32.49"}