{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Satellite Voting Locations to Open Saturday", "description": "The Registrar of Voters will open four satellite voting locations this weekend to add to options for early voting and to help those who haven’t registered to vote but still want to take part in the March 3 Presidential Primary Election.  ", "datePublished": "2020-02-25T13:30:24-08:00", "url": "https://www.countynewscenter.com/satellite-voting-locations-to-open-saturday/", "keywords": ["elections", "ballot marking devices", "fgg", "march 3 2020 election", "presidential primary election", "satellite voting locations", "touch screen"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-27T08:01:39-08:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters will open four satellite voting locations this weekend to add to options for early voting and to help those who haven’t registered to vote but still want to take part in the March 3 Presidential Primary Election.\nDuring the last election, voters could conditionally register and vote on Election Day but only at the Registrar’s office. Long lines wrapped around the building and those registering endured hours-long waits.\nThis election, voters can register and vote at the Registrar’s office and every polling place. That may result in long waits at polling places.\nTo offset an expected rush of late registrants this year, Registrar of Voters Michael Vu announced the availability of four satellite voting locations Tuesday.\n“The satellite voting locations will give voters the opportunity to register and vote before Election Day,” said Vu. “The earlier you register and vote, the less likely you will run into long delays. Waiting until Election Day almost guarantees you’ll run into long lines.”\nThe satellite locations will act as an arm of the Registrar’s office and Registrar personnel will have access to the status of all registered voters in the county. Staff can help with the registration process and give voters the ballot specific to their residence address.\nThe ballots will be provisional, meaning voters will need a little extra time to fill out information on the provisional envelope and seal their ballot inside after voting. The Registrar’s office can’t count it until it checks to see if you’re eligible to vote and you have not voted elsewhere in the state.\nVoters who visit the satellite locations will also have access to new ballot marking devices. The devices allow voters to mark their choices using a touch screen and print out their selections on a paper ballot. The touch screen is used only to generate the paper ballot, not record the vote electronically. The voter can review the paper ballot before putting it into an envelope, and then the ballot box.\nThe Registrar’s office is now open to serve voters each day from 8 a.m. to 5 p.m. Then satellite voting locations and the Registrar’s office will be open Saturday, Feb. 29 through Monday, March 2 from 8 a.m. to 5 p.m. All will again be open on Election Day when the voting hours will change to 7 a.m. to 8 p.m. to reflect the hours at the polls.\nThe satellite voting locations and Registrar’s office are listed below:  \n\nSan Marcos Community Center\n3 Civic Center Drive\nSan Marcos, CA 92069\n\n\nCarmel Mountain Ranch Community Park\n10152 Rancho Carmel Drive\nSan Diego, CA 92128\n\n\nSpring Valley Community Center\n8735 Jamacha Blvd.\nSpring Valley, CA 91977\n\n\nSouth Region Live Well Center\n690 Oxford Street\nChula Vista, CA 91911\n\n\nRegistrar of Voters Office\n5600 Overland Avenue\nSan Diego, CA, 92123\n\nFor more information, visit www.sdvote.com or call 858-565-5800.\n\n\n\n\nYou can also check out this video on how to use the new ballot marking devices that you’ll find at any of the four satellite locations.\n\n\n\n\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200225.13.30.24"}