{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar Introduces New Secure, Stand-alone Ballot Drop Boxes", "description": "Registered voters who received their ballot for the Nov. 8 Statewide General Election can begin returning them Monday at one of the Registrar’s new official stand-alone drop boxes.   ", "datePublished": "2022-10-10T15:10:32-07:00", "url": "https://www.countynewscenter.com/?p=209724", "keywords": ["elections", "county registrar of voters", "fgg", "mail ballots", "new ballot drop-off boxes", "nov. 8 statewide general election", "official ballot drop-off boxes"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2022-10-10T15:45:25-07:00", "articleType": "article", "articleContent": "\nRegistered voters who received their ballot for the Nov. 8 Statewide General Election can begin returning them Monday at one of the Registrar’s new official stand-alone drop boxes.\nMail ballots are enroute to San Diego County’s 1.9 million registered voters for the Nov. 8 Statewide General Election and some voters may have received theirs as early as Saturday.\nVoters who choose to return their ballot at one of the Registrar’s official ballot drop box locations will see newly designed, secure, stand-alone boxes.\nWhat do the Registrar’s official ballot drop boxes look like?\nThe Registrar’s official ballot drop boxes are red, white, and blue and feature the Registrar’s logo along with the County seal. All boxes are labeled “Official Ballot Drop Box” and constructed from high grade, heavy gauge stainless steel.\nEach ballot drop box is designed to prevent physical damage and unauthorized access to mail ballots. The boxes feature double-locking access doors, anti-pry door jambs, and other anti-theft construction measures. The Registrar’s ballot retrieval team is responsible for collecting ballots inside the box.\nHow do I return my ballot to an official ballot drop box?\nMark your ballot in the comfort of your home, seal your completed ballot inside your return envelope, date and sign your name on the return envelope, and return it in the mail or to one of the Registrar’s 141 official ballot drop box locations around the county. Remember, your signature is required for your vote to count.\nSelect drop boxes will be located outside and available 24-hours a day up until 8 p.m. on Election Day, Nov. 8. All the rest are located inside and access to those is available during the individual facility’s hours of operation.\nWith that in mind, voters should check each location’s hours of operation before heading out to return their ballot. Find the closest one to you by visiting the Registrar’s online locator tool.\nOn Election Day, Nov. 8, all of the Registrar’s official ballot drop box locations will be open from 7 a.m. to 8 p.m.\nEarly voting also began Monday at the Registrar of Voters office in Kearny Mesa. Hours run from 8 a.m. to 5 p.m. Monday through Friday. However, the Registrar encourages voters to take advantage of the convenience of voting by mail.\nIf you prefer voting in-person, you may do so at any vote center in the county.\n\nStarting Saturday, Oct. 29, 39 vote centers will be open daily from 8 a.m. to 5 p.m. Then starting Saturday, Nov. 5, over 200 vote centers will be open daily from 8 a.m. to 5 p.m.\nAll vote center locations will be open again on Election Day, Nov. 8, when voting hours change to 7 a.m. to 8 p.m.\n\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online at sdvote.com.\nLearn more about voting in the Nov. General Election at sdvote.com, call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221010.15.10.32"}