{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Public Defender, Probation Celebrate 10 Years of Veterans Treatment Court", "description": "This month the San Diego County Office of the Public Defender and Probation Department have been celebrating the 10-year anniversary of the local Veterans Treatment Court, a program that has helped more than 140 veterans and active-duty service members get specialized treatment instead of time in jail.", "datePublished": "2021-02-24T07:56:55-08:00", "url": "https://www.countynewscenter.com/public-defender-probation-celebrate-10-years-of-veterans-treatment-court/", "keywords": ["public safety", "courts", "district attorney", "probation", "public defender s office"], "author": [{"type": "@Person", "name": "Donnie Ryan", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donnie", "familyName": "Ryan"}], "dateModified": "2021-02-24T08:29:08-08:00", "articleType": "article", "articleContent": "\nThis month the San Diego County Office of the Public Defender and Probation Department have been celebrating the 10-year anniversary of the local Veterans Treatment Court, a program that has helped more than 140 veterans and active-duty service members get specialized treatment instead of time in jail.\nEstablished in February 2011, Veterans Treatment Court is a specialty court that considers treatment in place of incarceration when sentencing a defendant who has served in the military and shows symptoms of post-traumatic stress disorder, traumatic brain injury, military sexual trauma, depression, anxiety disorder, or other mental health conditions.\nAccording to information provided by the San Diego Superior Court, Veterans Court participants take part in a three-phase treatment program that lasts between 15 and 60 months. Each phase consists of a set of requirements, including treatment specific to the individual’s needs and a project that gives back to the community. After a participant successfully completes the program, a judge can waive fees, commute felonies, or even expunge the charges entirely.\nAngela Bartosik, the Chief Deputy Public Defender for San Diego County, said that since its inception Veterans Court has been a major asset to local veterans, many of whom have service-connected trauma and have found themselves involved in the criminal justice system.\n“For the past 10 years, eligible clients have been provided much needed therapeutic treatment in lieu of lengthy incarceration,” said Bartosik, a retired Navy commander who served more than 20 years in the U.S. Navy and Navy Reserve.  “This rigorous recovery milieu includes treatment, mentorship by veterans, and accountability to the court.”\nBartosik said each graduate has been provided support for PTSD, substance abuse, physical trauma, and other health issues through program partnerships with the Veterans Administration and local nonprofits that specialize in care for former service members.\n“This program has truly been a miracle in action, returning countless veterans to productive citizenship,” added Bartosik.  “We are grateful for the support of our justice partners – the district attorney, superior court, and probation department – in this amazing and transformative program.”\nDenise Huffhines, San Diego County Probation Department Deputy Chief, said she agrees that it is the collaborative effort between all the local partner agencies that makes the program so successful.\n“In the past 10 years, Veterans Court has helped quite a few individuals in San Diego County get the help they need while still meeting the requirements of their probation period,” said Huffhines. “The counseling and support these veterans receive as part of Veterans Court helps to lower crime, reduce recidivism, rebuild lives, and ultimately helps them to complete their probation period as part of sentencing.”\nAccording to data from the U.S. Census Bureau, San Diego County is home to the largest population of Afghanistan and Iraq war veterans in the country, and second only to Los Angeles County for total overall veteran population.\n“Veterans Treatment Court is a great example of a criminal justice reform approach that holds offenders accountable but also addresses the particular challenges faced by our returning veterans, including PTSD, to help get them treatment for the underlying cause that has led them to criminal behavior so we can stop the revolving door to prison,” said San Diego District Attorney Summer Stephan.\nPart of the month-long observance included a virtual celebration on Feb. 23 that included speakers from many of the participating agencies as well as stories from program graduates and their mentors.\nMore information on the San Diego Veterans Treatment Court can be found on the District Attorney’s website at Veterans Court.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210224.07.56.55"}