{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegan Dies from Rocky Mountain Spotted Fever – How to Protect Yourself and Your Pets", "description": "San Diego County public health officials are raising awareness of a disease known as Rocky Mountain Spotted Fever following the death of a San Diego resident who traveled to the Baja California region before becoming ill.  ", "datePublished": "2023-11-21T13:21:30-08:00", "url": "https://www.countynewscenter.com/san-diegan-dies-from-rocky-mountain-spotted-fever-how-to-protect-yourself-and-your-pets/", "keywords": ["health", "rocky mountain spotted fever", "ticks"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2023-11-21T13:49:15-08:00", "articleType": "article", "articleContent": "\nSan Diego County public health officials are raising awareness of a disease known as Rocky Mountain Spotted Fever following the death of a San Diego resident who traveled to the Baja California region before becoming ill.  \nRocky Mountain Spotted Fever is a disease spread by ticks to humans and dogs. Some areas where these ticks may bite people and animals are hiking trails and grassy or wooded areas, typically during the wetter months of winter and spring. However, travel to places where stray dogs are common, like Baja California, is a year-round risk, because strays often carry infected ticks. \nPeople can protect themselves by wearing insect repellent and proper clothing and using insect control products on their pets that kill fleas and ticks. \nRocky Mountain Spotted Fever is best treated with antibiotics when diagnosed in the first week of illness. The disease gets its name from a spotted red rash that may appear. Early symptoms may only include fever, headaches, and stomach upset, so it is important to report any insect bites and recent travel or outdoor activities, when speaking to a doctor.  \nWhile Rocky Mountain Spotted Fever is a year-round risk in the Baja California region, San Diego County will typically have one to three cases each year. All three cases in county residents reported so far this year had traveled to areas where Rocky Mountain Spotted Fever is more common. The last local death from this disease was an Imperial County resident who died in a San Diego hospital in 2014.\nThe County’s Vector Control Program monitors the population of vectors—animals like ticks, rodents, and mosquitoes—that can transmit diseases to people. \nTicks are tiny, eight-legged insects related to spiders. They wait on the tops of bushes and branches for passing animals and people to bite. While they take their blood meal, any germs they are carrying can be spread. In addition to Rocky Mountain Spotted Fever, ticks carry other diseases including Lyme disease and tularemia.  \nHealth officials recommend checking yourself and your pets for ticks as soon as possible after outdoor activities like hiking to reduce the chance of infection from tick bites. Anyone who is bitten by a tick should not panic, but carefully remove it with tweezers. You may save the tick for identification because only certain ticks carry Rocky Mountain Spotted Fever.  \nIf a person develops a rash or fever after being bitten, they should see a doctor, tell them about the tick bite, when they were bitten, and where they think it happened.  \nFor more information about protecting yourself and pets from ticks and how to best remove ticks visit, Ticks (sandiegocounty.gov). \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231121.13.21.30"}