{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Receives Grant for Child Safety Seat Education Program", "description": "The County Health and Human Services Agency (HHSA) has received a state grant to educate parents and caregivers on how to properly secure children in a safety seat.", "datePublished": "2021-11-15T13:17:50-08:00", "url": "https://www.countynewscenter.com/county-receives-grant-for-child-safety-seat-education-program/", "keywords": ["public safety", "child car seat", "child safety", "public safety"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-11-15T13:17:50-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency (HHSA) has received a state grant to educate parents and caregivers on how to properly secure children in a safety seat.\nThe $249,999 grant from the California Office of Traffic Safety (OTS) will pay for a variety of community outreach events, education classes and training on the installation and use of child safety seats.\nThe car seat safety program includes:\n\nChild safety seat inspection events and education classes.\nChild safety seats at no-cost to low-income families following education classes.\nChild Passenger Safety Technician (CPST) training, CPST certification courses.\nWork with community partners to promote child passenger safety education.\nCollaborate with law enforcement to increase occupant protection awareness.\nPartnering with local organizations on car seat safety community outreach efforts in underserved communities.\n\nThe program runs through September 2022.\n“Helping families, caregivers and education professionals to keep children safe is critical,” said Barbara Jiménez Barbara Jiménez, chief operations officer for HHSA’s Department of Homeless Solutions and Equitable Communities. “Protecting San Diego children is one of our top priorities, and properly secured car seats are are the best way to prevent harm to them in the event of a crash.”\n“Like seat belts for teens and adults, correctly installed car seats are the best protection for children while they are traveling,” OTS Director Barbara Rooney said. “Car seat programs are an important traffic safety ally.”\nThis safety campaign aligns with Live Well San Diego, the County’s vision for healthy, safe and thriving residents and communities.\nFunding for this program was provided by a grant from the California Office of Traffic Safety, through the National Highway Traffic Safety Administration.\nFor more information, contact Noemi Dueñas, 858-621-2313 ext. 114, at Pacific Safety Center.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211115.13.17.50"}