{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Vaccine for San Diegans 65+ Coming Soon", "description": "San Diegans 65 years of age and older are the next priority group for COVID-19 vaccination. However, due to the limited supply of doses in the region, only a few health care providers have vaccine available for their patients in this group.", "datePublished": "2021-01-15T14:15:32-08:00", "url": "https://www.countynewscenter.com/covid-19-vaccine-for-san-diegans-65-coming-soon/", "keywords": ["health", "65 and older", "coronavirus", "covid-19", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-01-15T14:38:35-08:00", "articleType": "article", "articleContent": "\nSan Diegans 65 years of age and older are the next priority group for COVID-19 vaccination. However, due to the limited supply of doses in the region, only a few health care providers have vaccine available for their patients in this group.\nSan Diegans in this age group might be able to get vaccinated if their health care providers have doses available.\nThe County is planning to make the vaccine available to more people when more doses are delivered to the region.\nCurrently, the only people who are being vaccinated are the 620,000 health care professionals and other priority groups in Phase 1A. Vaccinations to the more than 600,000 people in Phase 1B, which includes those 65 and up, will begin to be available later this month, provided there are COVID-19 vaccination doses available.\n“We understand older San Diegans want to get vaccinated, but right now there is a very limited number of doses for people 65 and older,” said Eric McDonald, M.D., M.P.H., medical director of Epidemiology and Immunization Services at the County Health and Human Services Agency. “We’re asking San Diegans to be patient, more vaccine is expected in the region soon.”\nWhen County sites begin vaccinating San Diegans 65 years and older, the public will be informed in a number of ways, including on coronavirus-sd.com/vaccine.\nThe region is expecting the arrival of more COVID-19 vaccine doses, but a figure and a date have not been released by the California Department of Public Health and Centers for Disease Control and Prevention.\nThe “Vaccination Super Station” that opened at Petco Park this week is currently open only to health care workers and requires an appointment.\nStarting in February, the County plans to open three more vaccination super stations in other parts of the region and people in Phase 1B are expected to be able to start making appointments in late January.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210115.14.15.32"}