{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Receives Its First Shipment of Moderna COVID-19 Vaccine", "description": "The County of San Diego on Monday received its first deliveries of the second COVID-19 vaccine approved by the Food and Drug Administration.", "datePublished": "2020-12-21T17:56:22-08:00", "url": "https://www.countynewscenter.com/county-receives-its-first-shipment-of-moderna-covid-19-vaccine/", "keywords": ["health", "coronavirus", "coronavirus vaccine", "covid-19", "moderna vaccine", "update"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-12-21T17:56:22-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego on Monday received its first deliveries of the second COVID-19 vaccine approved by the Food and Drug Administration.\nThe Moderna vaccine was approved by the FDA for emergency use late last week and by the Advisory Committee to the Director of the Centers for Disease Control and Prevention this weekend.\nThe County received 20,000 doses in this first shipment of the first allocation of 43,700 Moderna vaccines to the region. Some local health care systems had vaccines shipped directly to them.\nThese 43,700 doses of Moderna’s vaccine are in addition to the roughly 28,000 doses of Pfizer vaccine that started arriving in San Diego County last week.\nLike the Pfizer vaccine, the Moderna vaccine requires two doses for each recipient. Healthcare providers will ensure that recipients receive both doses from the same manufacturer, appropriately spaced apart.\nModerna’s vaccines are administered 28 days apart, while Pfizer’s vaccine is given 21 days apart. The initial doses of both vaccines will be distributed based on Phase 1A – Tier 1 guidelines.\n“The arrival of the Moderna vaccine gives us another vital tool in fighting COVID-19 and protecting those who are at the highest risk of contracting the virus,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “While the arrival of more COVID-19 vaccines is good news, it will take months until the general public will get vaccinated.”\nUntil vaccines are more widely available and herd immunity is achieved, Wooten is urging San Diegans to follow the public health guidelines that have been proven to slow the spread of the novel coronavirus. These strategies include:\n\nWashing your hands properly and regularly or using hand sanitizer.\nMaintaining social distance from others.\nWearing facial coverings.\nAvoiding crowded places to decrease your risk of exposure.\nStaying home and isolating yourself from others if you are sick and get tested.\n\nICU Capacity and Stay Home Order:\n\nThe current ICU capacity for the Southern California region is 0.0% and will be updated by the state daily.\nThe Regional Stay Home Order is now in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last for at least three weeks or until the region’s ICU capacity meets or exceeds 15%. The order will be assessed by the state after the three-week period.\n\nCommunity Setting Outbreaks:\n\nOne new community outbreak was confirmed on Dec. 20 in a daycare/preschool/childcare setting.\nSeven new community outbreaks were confirmed on Dec. 19: three in business settings, one in a hotel/resort/spa setting, one in a residence, one in an emergency services setting and one in a retail setting.\nEight new community outbreaks were confirmed on Dec. 18: two in distribution warehouse settings, two in business settings, one in a faith-based agency setting, one in a TK-12 school, one in an emergency services setting and one in a daycare/preschool/childcare setting.\nIn the past seven days (Dec. 14 through Dec. 20), 40 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n28,383 tests were reported to the County on Dec. 20, and the percentage of new laboratory-confirmed cases was 11%.\nThe 14-day rolling average percentage of positive cases is 9.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 28,506.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n3,252 new cases were reported to the County on Dec 20. The region’s total is now 129,717.\n5,457 or 4.2% of all cases have required hospitalization.\n1,149 or 0.9% of all cases and 21.1% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nThree new COVID-19 deaths were reported to the County on Dec. 20. The region’s total is now 1,283.\nOne woman and two men died between Dec. 8 and Dec. 17, and their ages ranged from early 60s to early 90s.\nAll had underlying medical conditions.\nTwenty-seven new COVID-19 deaths were reported to the County on Dec. 18.\nTen women and 17 men died between Dec. 10 and Dec. 18, and their ages ranged from late 40s to late 90s.\nTwenty-six had underlying medical conditions, confirmation of potential medical conditions of one of the deceased is pending at this time.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201221.17.56.22"}