{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Urged to Take Precautions from Heat", "description": "Higher than normal temperatures are coming to the coast and inland valleys of San Diego County over the next two days. County health officials are urging residents to take precautions to avoid heatstroke and other heat-related illnesses.", "datePublished": "2022-04-06T17:42:46-07:00", "url": "https://www.countynewscenter.com/san-diegans-urged-to-take-precautions-from-heat/", "keywords": ["health", "cool zones", "heat", "heat wave", "heatstroke"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-04-07T13:58:27-07:00", "articleType": "article", "articleContent": "\nHigher than normal temperatures are coming to the coast and inland valleys of San Diego County over the next two days.\nThe National Weather Service in San Diego has issued a heat advisory that is expected to last through 6 p.m., Friday, April 8.\nCounty health officials are urging residents to take precautions to avoid heatstroke and other heat-related illnesses. San Diegans should also make sure vulnerable populations, especially children, older adults and pets, are protected.\n“Older adults, infants and children, and people with chronic medical conditions are more prone to heat stress,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “People with elderly neighbors should check on the well-being of the older persons.”\nWhile the cool zones are not technically open, libraries, community centers and other buildings are open, and people can go cool there. Click here to see hours and locations for County libraries. The Borrego Library’s community room will be open from 12 to 5 p.m. Sat., April 9. Given the ongoing COVID-19 pandemic, masks are strongly recommended indoors.\nPet owners should exercise their pets in early morning hours or late afternoon and early evening to avoid prolonged exposure to the heat.\nEven a few hours spent in air conditioning can help your body stay cooler. Do not rely on electric fans for cooling if temperatures exceed 90 degrees.\nTo avoid heat-related problems, health officials recommend the following:\n\nStay in an air-conditioned area during the hottest hours of the day\nWear light, loose-fitting clothing\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty\nTake cool showers\nNever leave a child, elderly person, or pet unattended in a car\nAvoid unnecessary hard work or activities outside during the hottest part of the day\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun\nAvoid using the oven to cook\n\nSigns of heatstroke or exhaustion include an extremely high body temperature (103 or higher), dizziness, nausea, confusion and headache. If someone shows these signs, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature, and continuing cooling efforts\nDo not give the victim fluids to drink\n\nMore information about the signs and symptoms of emergencies like heat exhaustion and heatstroke, visit the County Health and Human Services Agency Extreme Heat webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220406.17.42.46"}