{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mouse Tests Positive for Hantavirus in Guatay", "description": "A deer mouse collected in routine monitoring from an open area in Guatay near Pine Valley has tested positive for the potentially deadly hantavirus. Remember, never sweep up or vacuum up after wild rodents if you find them in living spaces; use wet-cleaning methods instead.", "datePublished": "2022-09-30T14:22:48-07:00", "url": "https://www.countynewscenter.com/?p=209649", "keywords": ["health", "dehq", "hantavirus", "lueg", "vector control"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-09-30T14:22:48-07:00", "articleType": "article", "articleContent": "\nA deer mouse collected in routine monitoring from an open area in Guatay near Pine Valley has tested positive for the potentially deadly hantavirus.\nCounty officials are reminding people to never sweep up or vacuum up after wild rodents if they find them in living spaces, including homes, sheds, garages and cabins.\nInstead, people should use “wet-cleaning” methods to keep from breathing in the virus and getting sick.\nFinding hantavirus in wild rodents is common in San Diego County. However, people rarely come into contact with hantavirus — which has no vaccine or cure — because wild rodents naturally want to avoid people.\nPeople can be exposed to hantavirus when wild rodents invade people’s spaces. Infected rodents shed the virus in their urine, feces and saliva. That matter dries and can be stirred into the air where people can breathe it in.\nIf people find wild rodents, nests or signs of them in their living spaces and must clean, they should always use “wet cleaning” methods — using bleach or other disinfectants, rubber gloves and bags. They should NOT sweep or vacuum, which could stir hantavirus into the air where it could be inhaled.\nHere are tips for people to prevent being exposed to wild rodents and hantavirus, and how to use wet-cleaning methods.\nAvoid Exposure to Hantavirus\n\nSeal up all external holes in homes, garages and sheds larger than a dime to keep rodents from getting in.\nEliminate rodent infestations immediately.\nAvoid rodent-infested areas and do not stir up dust or materials that may be contaminated with rodent droppings and urine.\nClean up rodent droppings and urine using the wet cleaning method described below.\n\nUse “Wet-cleaning” Methods to Prevent Inhaling the Virus\n\nDo not sweep or vacuum infested areas.\nVentilate affected area by opening doors and windows for at least 30 minutes.\nUse rubber gloves. Spray a 10 percent bleach solution or other disinfectants onto dead rodents, rodent droppings, nests, contaminated traps, and surrounding areas and let the disinfectant stand for at least 15 minutes before cleaning.\nClean with a sponge or a mop that has been soaked in disinfectant.\nPlace disinfected rodents and debris into two plastic bags, seal them and discard in the trash.\nWash gloves in a bleach solution, then soap and water, and dispose of them using the same double-bag method.\nThoroughly wash your hands with soap and water.\n\nFor more information, contact the County Department of Environmental Health and Quality (DEHQ) at (858) 694-2888 or visit the DEHQ hantavirus web page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220930.14.22.48"}