{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Releases Recommended Budget to Public", "description": "The County released a balanced, $8.62 billion recommended budget Thursday that prioritizes vital services and the region’s needs while addressing funding challenges.", "datePublished": "2025-05-01T08:20:44-07:00", "url": "https://www.countynewscenter.com/county-releases-recommended-budget-to-public/", "keywords": ["government", "2025-27 recommended budget", "2025-27 recommended operational plan", "budget priorities", "engage san diego", "feedback"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2025-05-02T10:04:01-07:00", "articleType": "article", "articleContent": "\nReading Time:  6 minutesThe County released a balanced, $8.62 billion recommended budget Thursday that prioritizes vital services and the region’s needs while addressing funding challenges.\nIt is an increase of $85.8 million or 1% over the Fiscal Year 2024-25 Adopted Budget.\nOngoing challenges include slowing tax revenues, rising costs, uncertainties about the economy and unknown changes in upcoming state and federal funding.\nDespite these uncertainties, the recommended budget is designed to protect core services for residents in the region and continues investments in issues important to San Diegans.\nThe balanced budget limits spending compared to recent years and prioritizes mandated programs as well responsibilities in the unincorporated area where the County delivers services similar to a city.\nThe operational plan shows a decrease in recommended staffing, 190 fewer positions or 0.9% less than last fiscal year for a total recommended staff of 20,281.25. The County reduced staffing through attrition, eliminating some vacant positions and streamlining some operations.\nThe budget continues to invest in housing, homeless solutions and behavioral health.\nIt leverages new funding opportunities to invest more than $100 million in behavioral health resources, supporting long-term recovery through community-based treatment, prevention and alternatives to jail and emergency rooms.\nAnd it helps more than 1 million San Diegans who need access to safety net programs that are critical to ensuring people and families have the food and support they need, programs such as CalWORKs, Medi-Cal and CalFresh.\nIt increases investments in public safety, with additional funding to provide care for youth and adults in our custody, deploy more ambulances and to support programs such as Alternatives to Incarceration and job training, mental health and substance use disorder treatment. It also establishes a Community Engagement Unit in the Office of Emergency Services.\nThe budget shows the County’s commitment to environmental sustainability. And the current recommended budget protects current hours and locations at parks and libraries.\nThe County budget touches nearly everyone in the region in some way and is shaped by public input throughout the year.\n\n \n \n \n \nRegionally, County government provides services like: \n\nSocial services and health programs\nCriminal prosecution, detention facilities and emergency preparedness\nFood and restaurant inspections, and beach and bay water monitoring\nElections\n\nIn the unincorporated area, County government provides things a city government would typically do like:\n\nLaw enforcement and fire protection\nRoads, parks and libraries\nBuilding permits\nAnimal shelters and protection\n\nSome cities also contract with the County to provide services.\nNearly half of the County’s funding comes from the state and federal government but that money must be used for certain programs. The rest comes from property taxes, fees for services and other sources.\nYou can learn more about the recommended plan by reviewing an executive summary or the full recommended budget plan.\nYou can also give your feedback in person and online. An in-person open house is scheduled for 5 p.m. on Thursday, May 22 at the County Operations Center. A virtual open house will take place at 5:30 p.m. on Wednesday, May 28. To find out more and register, visit Engage San Diego County.\nYou can also leave comments now and until 5 p.m. on June 12 at Engage San Diego County.\nYou can watch, listen and participate in budget presentations, hearings, deliberations and adoption at upcoming Board of Supervisors meetings. Visit the Clerk of the Board’s website or call 619-531-5434 to get additional details about hearings and request translation services.\nBudget hearings take place at 9 a.m. on June 3 and 5:30 p.m. on June 9. Budget deliberations and adoption are scheduled for June 24. The adopted budget takes effect July 1.\nBelow are funding highlights in several priority areas – housing and homelessness, behavioral health, public safety, infrastructure, support for vulnerable populations and environmental sustainability:\nHousing and Homelessness\n\n$132.1 million to help house vulnerable populations, develop affordable and supportive housing and achieve self sufficiency for families.\n$29.4 million for 40,000 building inspections, plan reviews, mobile home safety and streamlining the development process to advance new housing.\n$15 million for the Regional Homeless Assistance Program.\nOver $6 million in grant funds remain available to help those experiencing homelessness in the San Diego Riverbed and Plaza Bonita areas.\n$3.6 million to help youth who are homeless or at risk of homelessness get into permanent housing.\n$2.6 million for homeless encampment cleanup and assistance in the unincorporated area and on County property.\n$1.6 million to operate Bancroft and Magnolia Safe Parking Programs for people sleeping in their cars. A third safe parking site is planned to open temporarily in Grantville in summer 2025.\nStarting construction on 60 Troy Street Sleeping Cabins to provide emergency shelter and services to an estimated 140 people each year in the unincorporated communities.\n16 affordable housing developments partially funded by the County are under construction regionwide. Another 18 developments are in the works.\n$500-a-month rental subsidy for nearly 400 low-income, rent-burdened older adults.\n$13.1 million increase to provide housing, including short-term rental assistance, for people with serious behavioral health conditions.\n\nBehavioral Health\n\n$26.2 million increase for substance use outpatient services.\n$24 million increase for mental health case management, residential services, subacute care services, and new partial hospitalization and intensive outpatient hospitalization services for children and adults.\n$22.9 million increase for capital improvements to improve, expand and preserve licensed board and care facilities for adults and seniors.\n$17.2 million increase for substance use and mental health treatment programs.\n$15 million to expand the behavioral health workforce and develop a new training and tuition program.\n$14.6 million increase for two new Crisis Stabilization Units in El Cajon and Chula Vista.\n$6.9 million for a major renovation at the Polinsky Children’s Center for a new 16-bed children’s mental health crisis residential facility that will provide short-term, individualized stabilization services.\n\nPublic Safety\n\n$3.5 million to enhance fire and emergency medical services in Dulzura, Pauma Valley and East Otay Mesa areas.\n$3 million for a biometric health monitoring system to detect medical distress in youth in custody.\n$3 million to improve a temporary space during the construction of a new Sheriff’s substation in Ramona.\n$840,000 and five employees to the Office of Emergency Services to further support disaster recovery efforts and community engagement.\n$2.2 million invested in Probation’s Less Restrictive Placement program, a community-based program to support justice-involved youth in a less restrictive environment, helping them safely and successfully reintegrate into society.\n$14.3 million toward the purchase of a helicopter for expanded firefighting and search and rescue missions.\n$1.2 million to buy two ambulances for the unincorporated area.\n$1.9 million for the Medical Examiner’s decedent transportation services and toxicology equipment.\n$5.7 million to support the Sheriff’s medical and mental health services contracts.\n$9 million for services to Probation clients, primarily to support contract cost increases related to youth health care services.\nSix Probation employees including an additional canine officer to support Probation youth.\nA new Resource and Reentry Hub is planned to help formerly incarcerated people get the resources and support they need to successfully reenter the community.\n\nInfrastructure\n\n$48.3 million for road safety including traffic signals, curb ramps, pedestrian crossings, guardrails and new sidewalks and bike lanes.\n$47.8 million to operate 33 branch libraries, four electric vehicle outreach vans, five automated book kiosks and the e-Library.\n$35.9 million to operate 158 park facilities, 58,459 acres of parkland and 389 miles of trails.\n$29 million to improve Sheriff’s jails, including upgrades to fire alarm systems, security equipment and additional technology to support safety, security and code compliance.\n$9 million to update the East Mesa Juvenile Detention Facility.\n$5.7 million increase for a total of $71.3 million to maintain 2,000 miles of County roads.\nAn increase of $145,000 for a total of $4.8 million to clean culverts, channels and storm drains to help prevent storm flooding.\n$1.5 million to build a fire training tower.\nRebuilding of the Mira Mesa Epicentre into a County-operated community center scheduled to open in fall 2026.\nNew Casa de Oro Library to open in spring 2026.\nA new mobile veterinary surgical unit to begin delivering spay/neuter and basic pet wellness services to unincorporated areas with the highest need.\n\nVulnerable Populations\n\n$843.5 million to help more than a million people with no other means of support get access to CalFresh food assistance, Medi-Cal health coverage, CalWORKs and other public assistance.\n$489.1 million to strengthen and keep at-risk families and children together.\n$154.9 million to help families who support foster and adopted children.\n$11.5 million increase for a total of $223.5 million for In-Home Supportive Services for vulnerable adults and persons living with disabilities.\nThe South County Family Justice Center opens in 2025 and will offer comprehensive trauma recovery services to those who need it. The one-stop shop will be like the North County Family Justice Center in San Marcos.\nContinued funding to provide 1.5 million meals to older adults at community spaces and for pickup or home delivery.\nTwo community gardens are being developed for Spring Valley and Ramona to increase food security for low-income communities.\n\n Environmental Sustainability\n\n$23.6 million to protect the region’s watershed and for new green infrastructure projects.\n$4.1 million to install new electric vehicle charging stations for the public and for fast electric vehicle chargers for County vehicles in rural areas.\n$1.6 million increase for a total of $4.1 million to implement the Climate Action Plan.\n$1.7 million to monitor and report beach and bay water quality.\n$1.6 million to reduce greenhouse gases.\n$1.3 million to improve the Tijuana River Valley through dredging and habitat restoration.\n$1 million to plant 2,000 trees on County property to lower greenhouse gases.\n\nAdditional Priorities\n\n$267.3 million to prevent epidemics and the spread of disease and ensure access for all through public health centers, home visiting programs and pharmaceutical services.\nFunding to operate a new $93 million state-of-the-art public health lab that will protect the public by testing for infectious diseases.\n$1 million to operate Safe Destination Nights, an after-school program serving 8,000 youths.\n$15.6 million to help protect public health by monitoring and treating 1,600 known mosquito breeding sites.\n\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250501.08.20.44"}