{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Election Workers Still Needed for Sept. 14 Recall Election", "description": "The Registrar of Voters still needs temporary election workers for the California Gubernatorial Recall Election on Tuesday, Sept. 14. Election workers can earn up to $20 an hour.", "datePublished": "2021-07-28T11:50:02-07:00", "url": "https://www.countynewscenter.com/election-workers-still-needed-for-sept-14-recall-election/", "keywords": ["elections", "covid precautions", "election workers", "gubernatorial recall election", "registrar of voters", "san diego county registrar of voters", "sept. 14 election"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-07-28T11:50:02-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters still needs temporary election workers for the California Gubernatorial Recall Election on Tuesday, Sept. 14. Election workers can earn up to $20 an hour.\nThere is a particular need for election workers to manage the operations of mail ballot drop-off locations and site managers for in-person voting locations around the county.\nThe mail ballot drop-off locations will be open for nearly a month and in-person voting locations will be open for four days instead of one. The Registrar’s office will hire election workers rather than use volunteer poll workers because training is more extensive for the expanded time period.\nThe Registrar is seeking people who are team players, exhibit strong leadership skills and display flexibility, patience, and the highest level of integrity at all times. Election workers must represent the Registrar of Voters in a professional, nonpartisan manner.\nEnglish speakers who are bilingual in Spanish, Filipino, Vietnamese or Chinese are also needed. If you are fluent in one of these languages, be sure to indicate it on your application.\nThe Registrar’s office is working with Public Health Services to ensure the health and safety of election workers and voters. Recommended personal protective equipment and sanitation supplies will be provided to workers so they can conduct the election process safely.\nApplications are available online. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210728.11.50.02"}