{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Prepare for Wildfires Before One Ignites to Protect Your Family, Friends and Property", "description": "With the deadly firestorm in Maui and the Bunnie Fire in Ramona that scorched nearly 200 acres and resulted in evacuations Wednesday, wildfires are at the top of mind for most of San Diegans. The fires should remind people to be prepared to evacuate and to take steps to minimize damage to their property in case a wildfire starts in their community.", "datePublished": "2023-08-11T11:51:45-07:00", "url": "https://www.countynewscenter.com/prepare-for-wildfires-before-one-ignites-to-protect-your-family-friends-and-property/", "keywords": ["public safety", "alertsandiego", "emergency", "emergency preparedness", "fire preparedness", "sdemergency app"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2023-08-11T14:20:26-07:00", "articleType": "article", "articleContent": "\nWith the deadly firestorm in Maui and the Bunnie Fire in Ramona that scorched nearly 200 acres and resulted in evacuations Wednesday, wildfires are at the top of mind for most of San Diegans. The fires should remind people to be prepared to evacuate and to take steps to minimize damage to their property in case a wildfire starts in their community.\nPlease note that during hot, dry conditions, such as when a red flag warning is issued, people should not attempt to use power tools to clear or reduce brush, as this could spark a fire that can spread to grass and other brush.\nAssess your personal disaster plan and readiness now rather than in the middle of an emergency.\n\nRegister cell phones ­–yours and other family members–with AlertSanDiego so that you will all be notified of an emergency affecting your community. This is especially important if you no longer have a landline at your home.\nIf you own an iOS or Android phone, download the SDEmergency .  It is a great resource for a wide variety of preparedness tips.\nReview your disaster plan, or create one if you don’t have one yet.\nBe prepared to evacuate with only minutes’ notice. Practice evacuating with your family at least twice a year. Make contingency plans for different times of the day, such as a fire breaking out while some family members are at work or school.\nCheck that you have all the necessary items handy to take with you if you had to evacuate. Make sure food, water and medications have not expired and that every family member’s dietary or medical needs are represented.\nCheck with schools or childcare providers to make sure you are aware of emergency plans and how you will be contacted.\nDiscuss where to reunite in case you are separated from your family during a disaster. Phone service may not be reliable during a disaster.\nMake sure your pets are microchipped you have evacuation items for them as well – including crates for small pets – and evacuation plans for larger animals such as horses or livestock.\nMake sure your homeowner’s insurance policy is up to date, covers wildfires and insures all the contents of your home.\nTake a walk around your property and ensure that you have a minimum of 100 feet of defensible space and have no overhanging tree branches on your roof.  Move any wood piles or combustible items that could catch fire a safe distance away from your home. The goal is to remove items that would catch your home on fire if a burning ember landed on them. Remove any dead or dying trees or plants or leaves that could spread fire.\n\nIf possible, reach out to friends and family members, especially older adults or people with disabilities, and review their plans and supplies with them.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230811.11.51.45"}