{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Sleigh Bells Ring; You Recycling?", "description": "Santa Claus, jingle bells, gifts, packages and — recycling? Yes! The holidays are a great time of the year to put your recycling skills to work, from all that wrapping paper to gift boxes and even our Christmas trees—if you are using a real tree.", "datePublished": "2022-12-15T08:35:03-08:00", "url": "https://www.countynewscenter.com/sleigh-bells-ring-you-recycling/", "keywords": ["environment", "climate action", "dpw", "lueg", "recycle", "recycling", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-12-15T09:13:06-08:00", "articleType": "article", "articleContent": "\nSanta Claus, jingle bells, gifts, packages and — recycling?\nYes! The holidays are a great time of the year to put your recycling skills to work, from all that wrapping paper to gift boxes and even our Christmas trees—if you are using a real tree.\nAnd, in the holiday spirit of giving, the County Department of Public Works would like to give you some tips on what to recycle and how to do it properly. That way you can even give something back to Mother Earth in this season of giving.\nChristmas Trees\nWe all love our beautiful Christmas trees. But if you’re using a real tree, there eventually comes a time to say goodbye. The County is here to let you know how to recycle it the right way.\nProperly recycled trees and wreaths can be turned into mulch that will improve soil health and help soil retain moisture at our parks, farms, home gardens and landscapes. Recycling them also keeps them from going into the trash where they can unnecessarily fill up landfills and generate unwanted climate-changing greenhouse gases as they decompose.\nSo, check with your waste hauler to find out if they offer curbside pickup. Many of them do.  Or go to the County’s recycling and hazardous waste database, WastefreeSD.org, to find Christmas tree drop-off sites near you. It’s easy.\nType “Christmas tree” in the “find an item” box, add your ZIP code, community and how you heard about the site, and you’ll see all the drop-off locations near you.\nFinally, remember, never leave your old dry tree or wreaths lying in the backyard where they can become dangerous fire hazards.\nKnow What Packaging Can — and Can NOT — be Recycled\nOnline shopping and gift-giving typically means lots of packaging, and a lot of stuff to recycle. But not all packaging can be recycled. For example, cardboard boxes and kraft paper can be recycled (just break them down and put them in your blue recycling bin). But other items can’t — manila envelopes, padded plastic mailers, bubble-wrap and traditional gift-wrapping materials including metallic wrapping paper, wrapping paper with glitter, ribbons, bows, twine, tissue paper and cellophane. So please DO NOT put them in your blue recycling bins; consider re-using them instead. Here’s a link to learn more about how to Recycle Right, during the holidays and every day.\nChristmas and Holiday Card Recycling\nLike packaging materials, not all holiday cards should be added to your recycling. Simple paper cards and envelopes can be added to your blue bins. But cards that have glitter, foil, metallic inks (inks made with tiny metal flakes) or other adornments can’t. If there’s a glitzy front and plain paper backing, tear the cards in two. Recycle the backs and put the glitzy fronts into the trash.\nHoliday Light Recycling\nPlease — don’t put old holiday lights in your recycling bins. They can tangle up recycling equipment and they also pose a danger to workers in those recycling centers. For recycling options, please visit WasteFreeSD.org, or contact a scrap metal or e-waste recycler.\nSo there you have it. Remember, if you have other questions about what can and can’t be recycled, go to DPW Recycling’s webpage or to DPW Recycling’s Facebook page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221215.08.35.03"}