{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County To Host Virtual Monkeypox Townhall", "description": "San Diegans are invited to learn about monkeypox, the risks and the County’s response to the local health emergency at a virtual monkeypox townhall on Thursday, Aug. 11 from 6 to 7:30 p.m.", "datePublished": "2022-08-09T11:25:56-07:00", "url": "https://www.countynewscenter.com/?p=209176", "keywords": ["government"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2022-08-10T09:04:34-07:00", "articleType": "article", "articleContent": "\nSan Diegans are invited to learn about monkeypox, the risks, and the County’s response to the local health emergency at a virtual monkeypox townhall from 6 p.m. to 7:30 p.m. on Thursday, Aug. 11.\nThe event is hosted by County Board of Supervisors Chair Nathan Fletcher and the County of San Diego Health and Human Services Agency. County Chief Medical Officer, Eric McDonald, M.D. will moderate the conversation, which will cover the County’s monkeypox education efforts, the risk to the public, along with prevention methods and treatment options.\nJoining McDonald will be public health and community leaders, including San Diego mayor Todd Gloria, Nick Macchione, Health and Human Services Agency Director, Wilma J. Wooten, M.D., M.P.H., County Public Health Officer, Ankita Kadakia, M.D., Deputy County Public Health Officer, Winston Tilghman, M.D., County HIV, STD & Hepatitis Branch Medical Director and Patrick Loose, Branch Chief. San Diego HIV Planning Group Chair, Mikie Lochner, will speak on the impacts of monkeypox on the LBGTQ community.\nThose interested in joining the virtual webinar can do so confidentially. Questions can be submitted in advance via an online portal on the County’s monkeypox webpage. In addition, there will be an option to submit questions via private chat during the session.\nThe event will be recorded and will be available shortly after the event on the County’s monkeypox website.\nTo receive the latest information about the local monkeypox outbreak on your phone, text COSD MONKEYPOX to 468-311. More details about monkeypox including how to prevent it, who should get vaccinated and a current case count is available on the County’s monkeypox website.\nVirtual Monkeypox Townhall\nThursday, August 11 from 6 to 7:30 p.m.\ntinyurl.com/MonkeypoxTownhall\nUS: +1 669 900 6833\nWebinar ID: 840 2176 3751\nPasscode: 576964\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220809.11.25.56"}