{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Event to Celebrate Recovery, Connect San Diegans to Resources", "description": "September is National Recovery Month and the County and its partners are once again putting on a special event to help support individuals in recovery, those exploring recovery options, and the loved ones who support them.", "datePublished": "2022-09-14T10:21:27-07:00", "url": "https://www.countynewscenter.com/?p=209511", "keywords": ["health", "behavioral health", "national recovery month", "recovery happens"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-09-14T10:21:27-07:00", "articleType": "article", "articleContent": "\nSeptember is National Recovery Month and the County and its partners are once again putting on a special event to help support individuals in recovery, those exploring recovery options, and the loved ones who support them.\nThe 32nd annual Recovery Happens event takes place from 10 a.m. to 1 p.m. on Saturday, Sept. 17. The free, family-friendly event is back in person this year after a virtual stint due to the pandemic. It will be held at Liberty Station.\nThis year’s theme is Join the Voices for Recovery: Together We Are Stronger. The theme focuses on the need to share resources and build networks across the country to support recovery.\n“Whether you are in recovery, thinking about recovery, or looking to help someone you know, this event has something for everyone,” said Luke Bergmann, director of HHSA Behavioral Health Services. “Mental health and substance use conditions impact a large percentage of the population and this event is just one way for San Diegans to be part of the solution.”\nIn addition to celebrating recovery journeys and sharing inspirational stories, Recovery Happens 2022 will offer a resource fair with education information, employment support, veteran’s services, financial and legal services, free HIV and Hepatitis C screenings, prevention and treatment information, community resources, and more. The event will also feature music, shared stories, and other fun activities.\nRecovery Happens aligns with the County’s Comprehensive Harm Reduction Strategy, which recognizes the  harms related to substance abuse are part of overall health concerns. Responding to them requires collaborative efforts, evidence-based programming, and data-informed approaches that address community needs for recovery as we work toward a region free of substance use related harms.\nBehavioral health is an essential part of overall health and wellness. It is a key component of the regional Live Well San Diego vision to ensure residents are building better health, living safely, and thriving by cultivating opportunities for all people and communities to grow, connect, and enjoy the highest quality of life.\nIf you or someone you care about is in crisis or would like behavioral health resources or support, including accessing Mobile Crisis Response Teams (MCRT), please call the Access and Crisis Line at (888) 724-7240 (24 hours a day, 7 days a week). Calls are answered by experienced counselors, with assistance available in over 200 languages.\n \n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220914.10.21.27"}