{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New Affordable Housing Opens in the Heart of City Heights", "description": "A new affordable housing community serving City Heights families celebrated an exciting grand opening today.  City Heights Place and City Heights Plaza Del Sol are neighboring buildings and together, provide 135 new single-bedroom, 2- bedroom, and 3-bedroom apartment homes in the heart of City Heights.", "datePublished": "2024-03-22T17:09:43-07:00", "url": "https://www.countynewscenter.com/new-affordable-housing-opens-in-the-heart-of-city-heights/", "keywords": ["health", "affordable housing", "city heights", "family apartments", "innovative housing trust fund", "low income"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2024-03-25T08:51:23-07:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteA new affordable housing community serving City Heights families celebrated an exciting grand opening today.  \nCity Heights Place and City Heights Plaza Del Sol are neighboring buildings in the heart of City Heights. Together, they provide 135 new single-bedroom, 2- bedroom, and 3-bedroom apartment homes. Public transportation, groceries, restaurants, and the local YMCA are all within walking distance. \nThis much needed housing will offer affordable rents for families making 30-60 percent of the area median income. Two-bedroom apartments will rent for between $930-1,861 and three-bedroom apartments will rent for between $1,075 to $2,150, depending on the household income level.  \nThe project was made possible through public and private partnerships, including the County, the City of San Diego, Wakeland Housing, Price Philanthropies, and others. The County contributed $3 million from the Innovative Housing Trust Fund toward City Heights Place.  \nCity Heights Place is five-stories with residential units on all floors, most with attached balconies. It features a large community room with a full kitchen, public gathering area and computer lab. The second floor has an open-air landscaped community deck, with a children’s play structure, BBQ area and seating. The 53-spot parking garage includes bike storage and a bike repair station. \nFor more information visit City Heights Place.  \nSince 2017, the County has invested more than $305 million in affordable housing, including using County excess property and its Innovative Housing Trust Fund, and over 2,100 units have opened. There are an additional 3,286 units on the way. \n When all the developments in the pipeline are complete, the total number of affordable units supported by the County will reach over 9,500. This is expected to provide homes to nearly 21,000 people. \nThe development plans align with the County’s Housing Blueprint, the County’s guide and ongoing response to the regional housing crisis. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240322.17.09.43"}