{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Agriculture Flourishes in New Crop Report, Nears $1.8 Billion", "description": "San Diego’s new Crop Report covering the County’s 2022 growing season shows production was higher than last year at $1.78 billion in value, making it the seventh year in the past 10 years in which the region has seen an increase.", "datePublished": "2023-10-23T09:19:14-07:00", "url": "https://www.countynewscenter.com/agriculture-flourishes-in-new-crop-report-nears-1-8-billion/", "keywords": ["agriculture", "agriculture", "crop report", "crops", "lueg", "sustainability"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-10-23T09:19:14-07:00", "articleType": "article", "articleContent": "\nSan Diego’s new Crop Report covering the County’s 2022 growing season shows production was higher than last year at $1.78 billion in value, making it the seventh year in the past 10 years in which the region has seen an increase.\nThe report showed total crop and commodity values increased by about $24 million or 1.4% from last year, which is beginning to show recovery from decreases attributed to the COVID-19 pandemic.\nSan Diego County ranks No. 1 in Nursery & Cut Flower products in California and No. 1 in the number of organic producers in the state.\nThis was a good year for “Fruit & Nut” crops which increased by 29% from roughly $237 million in 2021 to $306 million.\nAvocados, San Diego County’s most well-known crop, earned the biggest spike in value of any crop from 2021 to 2022, with a 48% increase from roughly $82.8 million to $123 million. This was driven by better weather, according to the report.\nHowever, “Bedding Plants, Color & Perennials, Cacti & Succulents” reign supreme again this year as the top crop in the county, bringing in a total of $445,359,543, which is 25% of the total value of agriculture production in the county!\nOrnamental Trees & Shrubs decreased from $382 million in 2021 to $375 million, but still ranked No. 2 on the annual Top 10 crops grown in San Diego.\nNursery & Cut Flower Products, Apiary Products and Field Crops dropped in value partially due to less acreage and demand for the products. Despite this decrease, San Diego retains its No. 1 ranking in Nursery & Cut Flower products in California.\nThe overall acreage devoted to commercial agriculture went from 219,874 acres in 2021 to 214,438 acres in 2022; a decrease of about 5,000 acres or 2.5%.\nThe report provides a yearly snapshot of agriculture’s contribution to the region’s economy, despite new challenges like the COVID pandemic and longstanding ones like the region’s inclement weather, rising water costs, wildfires, freezes and pests.\nThe County conducts about 1,500 inspections annually where pesticides used, whether it’s a farm, business park or a residential location. As a result, the County has seen a compliance rate of about 90% for pesticide inspections conducted in 2022.\nSupervisor Jim Desmond serves as the representative for the Fifth Supervisorial District in the County, a region abundant with the agricultural resources.\nSupervisor Desmond emphasized the County’s strong commitment to safeguarding pesticide usage across all communities by allocating approximately $5 million from the County’s Department of Agriculture, Weights and Measures’ (AWM) annual budget for this vital endeavor.\n“It is truly an honor to hold the position of District Five Supervisor and it is immensely gratifying to witness the thriving agricultural landscape within our district,” Desmond remarked.\nOther notable information from the report includes:\n\n“Honey & Beeswax” saw the greatest percentage increase in value from 2021 to 2022, rising 724%, from $79,023 to $651,295, as the apiary industry recovered from the impacts of drought. Honey production increased likely due to favorable weather conditions and increased forage.\n“Livestock & Poultry” products saw the second largest value increase in 2022 of $39 million.\n“Indoor Flowering & Foliage plants” remained third in the Top 10, however, value decreased by 13%, from roughly $356 million in 2021 to $311 million.\nThe overall value of Citrus increased by 20% compared to last year, despite a 5% decrease in acreage, due to a spike in price and better weather.\n\nAWM compiles the Crop Report each year and publishes it online.\nThis is the first year that the County’s Crop Report will feature an interactive version for the public to engage with the report in new ways, including an integrated Google Translate feature to read the report in multiple languages.\nHere is a look at the 2022 Top 10 Crops:\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231023.09.19.14"}