{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Long-awaited Estrella Park Opens in Casa de Oro", "description": "The County’s long-awaited, newly improved Estrella Park in the Casa de Oro neighborhood in Spring Valley is open.", "datePublished": "2020-12-22T14:23:50-08:00", "url": "https://www.countynewscenter.com/countys-long-awaited-estrella-park-opens-in-casa-de-oro/", "keywords": ["parks and rec", "casa de oro", "county parks", "spring valley"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-12-22T15:40:09-08:00", "articleType": "article", "articleContent": "\nThe County’s long-awaited, newly improved Estrella Park in the Casa de Oro neighborhood in Spring Valley is open.\nCounty Supervisor Dianne Jacob and a handful of socially distanced County officials gathered at Estrella, which Jacob called “incredible,” late last week to celebrate the opening of the park.\nThe County spent $1.4 million to turn the one-time 6.6-acre vacant lot into a community park that mirrors the local landscape and creates a nature play area. The park features hills, trees and boulders, rope bridges, a river bridge, slides, picnic area, a “sand beach,” a butterfly canyon, log benches, dog path, trail and amphitheater.\nJacob said Estrella was a great example of the success of the “Green Light for Parks” initiative she and Supervisor Greg Cox introduced and the Board of Supervisors approved in 2017. The initiative led the Board to approve the creation of a $13 million commitment in the County general fund to help overcome maintenance hurdles that stymied some park development, including Estrella.\n“Before those actions were in place, we didn’t have the resources we needed to build and maintain this park,” Jacob said. “Parks like Estrella benefit everyone — supporting regional health and safety, and a better quality of life.”\nParks officials said it took about a year to build the park improvements. Construction started in late 2019. They said the park’s features, including the amphitheater, were built into the land’s natural landscape and use those natural features to create unique play spaces, such as balance beams made out of eucalyptus trees, steppers made from tree stumps and logs stacked up a hill for children to clamber up. New, native and drought tolerant plants and trees were also added.\nEstrella park also features educational signs that explain resource conservation, point out sustainable landscaping and local wildlife so visitors can learn about and appreciate the plants and animals in the park.\nCounty Parks officials said the County was excited to open Estrella quickly so that the people and families of Casa de Oro could immediately begin enjoying the park they’ve been waiting for.\nEstrella Park is scheduled to be open daily from sunrise to sunset and will be patrolled by County Park rangers and local volunteers.\nFor more information about County parks, visit sdparks.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201222.14.23.50"}