{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Vaccinations Urged for People at Higher Risk from Influenza", "description": "An additional 157 lab-confirmed influenza cases were reported in the region last week, the County Health and Human Services Agency announced today.", "datePublished": "2022-04-06T10:18:14-07:00", "url": "https://www.countynewscenter.com/vaccinations-urged-for-people-at-higher-risk-from-influenza/", "keywords": ["health", "flu", "flu shot", "flu vaccine", "influenza"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-04-06T10:18:59-07:00", "articleType": "article", "articleContent": "\nAn additional 157 lab-confirmed influenza cases were reported in the region last week, the County Health and Human Services Agency announced today.\nThat is up from 121 reported the previous week. To date, 2,098 infections have been reported in San Diego County, compared to 752 at the same time last season. In comparison, the prior five-year average was 11,218 cases by the same week.\n“While overall cases remain low despite the increase, influenza can result in serious illness, especially for older adults and the very young,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “If you have not gotten a flu vaccine this season, it’s not too late to do it.”\nThe flu vaccine is especially important for people at higher risk of having serious complications from the virus.\nThey include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe latest Influenza Watch Report from the County Health and Human Services Agency shows the following for the week ending April 2, 2022:\n\nEmergency department visits for influenza-like illness: 3% of all visits (compared with 3% the previous week).\nLab-confirmed influenza cases for the week: 157 (compared to 121 the previous week).\nTotal lab-confirmed cases to date: 2,098 (compared to 752 at the same time last season and a 11,218 prior 5-year average during the same week).\nInfluenza-related deaths reported to date: 4 (compared to 2 at the same time last year).\n\nTips to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often;\nUse hand sanitizers, if unable to wash hands;\nStay away from sick people;\nAvoid touching your eyes, nose, and mouth;\nClean commonly touched surfaces; and\nIf you are sick, stay home and avoid contact with others.\n\nDuring the 2020-2021 flu season, a total of 848 influenza cases were reported in San Diego, including two deaths. During the 2019-2020 flu season, more than 20,700 flu cases were reported and 108 San Diegans died from influenza.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220406.10.18.14"}