{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board of Supervisors Approves New Gun Storage and Safety Law", "description": "The San Diego County Board of Supervisors voted Tuesday to enact a new ordinance to set standards for safe storage of firearms and to put restrictions on non-serialized guns commonly called “ghost guns.”", "datePublished": "2022-01-11T13:38:27-08:00", "url": "https://www.countynewscenter.com/board-of-supervisors-approves-new-gun-storage-and-safety-law/", "keywords": ["public safety", "ghost guns", "gun storage", "non-serialized firearms", "psg", "public safety group"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2022-01-11T16:13:08-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Board of Supervisors voted Tuesday to enact a new ordinance to set standards for safe storage of firearms and to put restrictions on non-serialized guns commonly called “ghost guns.”\nA key component of the County ordinance is the requirement that all guns in homes be stored in a locked container or disabled with a trigger lock.\nAnother element of the new ordinance regulates the possession and distribution of guns and gun parts built or purchased without serial numbers. The so-called “ghost guns” are a problem in the community because they can’t be traced and are often sold to people restricted from owning a weapon.\nThe new ordinance prohibits possessing, purchasing, selling, transferring, receiving, or transporting non-serialized firearms or non-serialized parts for guns such as frames and receivers.\nBoard Chair Nathan Fletcher expanded on a suggestion by Supervisor Jim Desmond to collect data on gun violence in an annual report. Supervisors Joel Anderson and Desmond voted against the ordinance.\nIf a second reading of the ordinance is approved on January 25, the new law would take effect in February 2022, but several sections of the ordinance may not be immediately enforced to allow time for people with existing items to dispose of those guns and parts.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220111.13.38.27"}