{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Top Executive Helen Robbins-Meyer Announces Retirement", "description": "After 25 years of dedicated leadership at the County of San Diego, Chief Administrative Officer Helen Robbins-Meyer announced Wednesday she will retire and welcome a new generation to guide the County into the future.", "datePublished": "2022-10-12T16:27:58-07:00", "url": "https://www.countynewscenter.com/county-top-executive-helen-robbins-meyer-announces-retirement/", "keywords": ["government", "helen robbins-meyer", "retirement"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2022-10-12T16:51:13-07:00", "articleType": "article", "articleContent": "\nAfter 25 years of dedicated leadership at the County of San Diego, Chief Administrative Officer Helen Robbins-Meyer announced Wednesday she will retire and welcome a new generation to guide the County into the future.\nThe exact date of her departure was left open to allow the County time to conduct a search for her successor and ensure a smooth transition. The process is expected to run into 2023.\nRobbins-Meyer began at the County as a deputy chief administrative officer following a career in private industry. She rose to assistant CAO, then took over the top executive position in 2012. She informed the Board of Supervisors during the closed session after their Wednesday meeting of her intention to end her time at the County.\n“The people of San Diego County are incredibly fortunate to have had Helen’s talents, energy and devotion to improving their lives all these years,” said Board Chair Nathan Fletcher. “She leaves not just an impressive list of accomplishments but a foundation for us to move toward greater achievements. My colleagues and I, and all San Diegans, owe her our gratitude.”\nRobbins-Meyer oversees an annual budget of over $7 billion, more than 40 departments that provide a diverse variety of services, and a workforce of 18,000 employees.\n“Helen has embraced big ideas and pushed ahead, all while never losing sight of the individual lives of the people we serve,” said Vice Chair Nora Vargas. “She has worked tirelessly to create a government that works for all, and she hands a brilliant torch to the next generation of leaders.”\nWith a complete changeover of board membership firmly in place, community partnerships and staff levels strengthened, and the County in sound fiscal shape, Robbins-Meyer felt the time was right to let a new CAO move the County forward.\n“It’s been an honor and a privilege to serve the San Diego region,” Robbins-Meyer said. “With the vision of our Board, the support of our wonderfully dedicated employees, and our work with the community, we have truly made a difference in the lives of our residents, visitors, refugees and migrant guests.”\nAmong the achievements of Robbins-Meyer’s tenure:\n\nThe creation of eight new libraries, 33 parks and 55 miles of trails in her time as CAO. During her leadership career at the County, a total of 33 libraries opened.\nAssisting more than 1 million residents annually with access to Cal Fresh, CalWORKS, Medi-Cal and other safety net programs.\nOverseeing large new investments in behavioral health, including deployment of Mobile Crisis Response Teams and Homeless Assistance Resource Teams, the addition of crisis stabilization units, and medically assisted drug treatment options.\nLeading response during the COVID-19 pandemic and ensuring continuity of County services.\nIncreasing the number of affordable housing units, including over 4,000 added through creation of the Innovative Housing Trust Fund Program and its public/private partnerships.\nThe transformation of the foster care system to strengthen and restore families, resulting in a large decrease in the number of foster children.\nA culture shift around juvenile justice from punitive incarceration to a model that provides youth life skills and support, including last year’s opening of the Youth Transition Center.\nThe opening of San Pasqual Academy, giving more than 1,000 youths an on-campus residence with a 90% high school graduation rate.\nReconstruction of the Edgemoor Skilled Nursing Facility, giving a best-in-class medical home to people with severe disabilities. It currently has the capacity to serve nearly 200 residents.\nThe transformation of a patchwork of volunteer fire departments into a unified, professional firefighting and emergency medical response agency.\nOverseeing the County response to wildfires and making sure those impacted have immediate and ongoing support to recover.\nCreation of the Waterfront Park around the County Administration Center, turning acres of asphalt into a picturesque focal point for residents and visitors.\n\nIn the coming weeks, the Board of Supervisors will develop a process to find the next Chief Administrative Officer.\nThe chief administrative officer is appointed by the Board of Supervisors to implement policies and direct the County’s daily operations. County services touch the lives of all San Diegans, from health and human services, property taxes, elections, disaster preparedness and justice services for the entire region to functions including roads, parks and libraries, planning and animal services for the unincorporated area.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221012.16.27.58"}