{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tijuana River Valley Health Assessment in Partnership with CDC Begins ", "description": "The Centers for Disease Control and Prevention (CDC) is in San Diego working with County public health staff and volunteers to interview people who live near the Tijuana River Valley about their experiences with sewage pollution in the area.  ", "datePublished": "2024-10-17T07:04:15-07:00", "url": "https://www.countynewscenter.com/tijuana-river-valley-health-assessment-in-partnership-with-cdc-begins/", "keywords": ["health", "casper", "cdc", "interviews", "public health", "sewage", "south county sewage", "tijuana river valley", "water contamination"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-10-17T07:05:34-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe Centers for Disease Control and Prevention (CDC) is in San Diego working with County public health staff and volunteers to interview people who live near the Tijuana River Valley about their experiences with sewage pollution in the area.  \nThe County and CDC are partnering to complete a survey called a Community Assessment for Public Health Emergency Response or CASPER.  \nToday through Saturday, staff and volunteers will interview people who live in 210 randomly selected households chosen from a bigger 30-block sample of homes. Interviewers will pick seven households from each block to be surveyed. \nCounty health officials encourage community members to share their experiences if their household is randomly selected to do the survey.   \n“It is important to hear directly from people who live near the Tijuana River Valley,” said Dr. Ankita Kadakia, County interim public health officer. “If you get a knock on your door in the next couple of days from a CASPER interview team, please speak with interviewers and provide your honest answers.” \nThe responses from the assessment on how living in close proximity to pollution in the Tijuana River Valley has affected people’s lives will be analyzed and used by the County to make future decisions. The results can help determine what additional actions to take, find gaps in information, what resources are needed, and understand new or changing needs within the community.  \n “The CDC has supported our partners in using the CASPER method for decades to quickly gather household-based information about community health concerns,” said Dr. Aaron Bernstein, director of the CDC’s National Center for Environmental Health (NCEH) and Agency for Toxic Substances and Disease Registry (ATSDR). “These interviews will provide firsthand insights into how the sewage contamination is impacting the daily lives of residents, helping to inform solutions.” \nCounty public health has spent the last few weeks informing community members about the upcoming health assessment through door-hangers and social media videos including on NextDoor in specific communities.  \nThe work to bring the CDC to San Diego started back in May 2024 when the County contacted the California Department of Public Health requesting support in addressing the Tijuana River Valley pollution situation. Additionally, a formal request to the CDC’s National Center for Environmental Health (NCEH) requesting an Epi-Aid investigation into the Tijuana River Valley was submitted on June 25, 2024.  The Epi-Aid was verbally approved on July 31, 2024.    \nThis is the first CASPER to take place in the County of San Diego. It has provided valuable insight in other communities where it was conducted.  \nAbout the CASPER Interviews\nCounty public health and CDC teams will conduct household interviews during the following dates and times:  \n\nThursday, Oct. 17, 2024, from 2 p.m. to 7 p.m. \n\n\nFriday, Oct. 18, 2024, from 2 p.m. to 7 p.m. \n\n\nSaturday, Oct. 19, 2024, from 10 a.m. to 7 p.m.     \n\nInterview teams, who will be bilingual in English and Spanish, will be wearing identifying badges and white reflective vests. Interviews will take about 15 minutes to complete and are anonymous. Participating households will not be asked identifying information including about immigration status.  \nTo learn more about health concerns and impacts from sewage and pollution in the Tijuana River Valley and the CASPER survey, visit sandiegocounty.gov/southregionhealth.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241017.07.04.15"}