{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Announces Winners of Youth Vaccine Challenge", "description": "Seven San Diego young people are winners of the County’s 2021 Our Health is Worth a Shot! Youth Challenge.", "datePublished": "2021-07-16T14:49:16-07:00", "url": "https://www.countynewscenter.com/county-announces-winners-of-youth-vaccine-challenge/", "keywords": ["health", "coronavirus", "covid-19", "vaccines", "youth contest"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-07-16T14:49:16-07:00", "articleType": "article", "articleContent": "\nSeven San Diego young people are winners of the County’s 2021 Our Health is Worth a Shot! Youth Challenge.\nThe goal of the challenge was for youth and young adults to raise awareness about the importance of getting vaccinated against COVID-19.\nThe Platinum winner is 18-year-old Bill Chen from Spring Valley whose animated The Perks of Getting Vaccinated earned him a $1,200 gift card.\nGold prize winners received $400 gift cards. They are:\n\nArthi S. Chandra, 13, Carmel Valley, VAX FACTS: Stay COVID SAFE\nChristian Z. Kerbein, 16, Escondido, Stop the Spread, Save the World\nSylvia Paredes, 19, Chula Vista,There will be no third eye!\n\nSilver prize recipients received $100 each. They are:\n\nMarshall J. Gerber, 12, Scripps Ranch, The Defeat of Coronavirus\nViviana S. Lasley, 16, Fallbrook, mRNA for the Win\nHope J. Golden, 23, San Marcos, How mRNA Vaccines for COVID-19 Work\n\nThe $2,700 in gift cards were provided by San Diego County Credit Union. Additionally, each Category Winner was recognized with a Certificate of Achievement.\n“Their work is very creative and highlights the importance of getting vaccinated against COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We’ll be using their  submissions to promote COVID-19 vaccinations among youth and young adults.”\nThe winners were chosen from 137 video and visual art entries submitted by young people between 12 and 24 years of age. The judging criteria included accuracy of information, appeal to youth, originality, creativity and inspiration.\nThe winners will be featured on the County’s Live Well San Diego website and promoted on social media. Their work will also be used to support vaccines at County public health centers.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210716.14.49.16"}