{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Hold Week of Action to Promote Workers’ Rights and Foster Business Empowerment", "description": "The County of San Diego’s Labor Standards and Enforcement is holding its third annual César Chávez Week of Action from March 25-29. This weeklong series honors labor rights activist César Chávez by educating workers, employers and community members about labor rights and fair workplace practic...", "datePublished": "2025-03-21T16:43:48-07:00", "url": "https://www.countynewscenter.com/county-to-hold-week-of-action-to-promote-workers-rights-and-foster-business-empowerment/", "keywords": ["consumer", "cesar chavez", "district attorney summer stephan", "labor laws", "olse", "vice chair terra lawson-remer", "wage theft"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2025-03-21T16:43:48-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County of San Diego’s Labor Standards and Enforcement is holding its third annual César Chávez Week of Action from March 25-29.\nThis weeklong series honors labor rights activist César Chávez by educating workers, employers and community members about labor rights and fair workplace practices. The theme of this year’s week of action is “Building Stronger Workplaces Together.”\nThe series is a collaborative effort between the County and the Employee Rights Center to:\n\nAdvocate for fair labor standards.\nBridge gaps between workers, employers, and community resources.\nInspire action and collaboration for healthier and more just workplaces.\nAcknowledge businesses and individuals committed to upholding equitable employment practices.\n\nCésar Chávez Week of Action Events\nFair Chance Workshop and Job Fair \n\nMarch 25, 10 a.m. – 4 p.m., Southeastern Live Well Center, 5101 Market St., San Diego, CA 92114.\nLearn about your rights during the Fair Chance Hiring Workshop (10 a.m. – 2 p.m.).\nMeet employers and participate in on-site job interviews (1p.m – 4 p.m.).\nRSVP here.\n\nCommunity Breakfast: Honoring Our Workforce \n\nMarch 26, 9 a.m. – 11:30 a.m., Employee Rights Center, 4161 Home Ave., San Diego, CA 92105.\nPublic officials and community advocates will honor local workers and their families over a complimentary breakfast and community connection.\nTo RSVP, call 619-521-1372.\n\nVirtual Small Business Compliance Workshop \n\nMarch 27, 9 a.m.– 11:30 a.m. (Virtual).\nShaw Law Group will teach employers ten ways to stay out of court and answer questions about labor standards.\nRSVP here.\n\nHigh Road Employer Recognition\n\nMarch 27.\nThroughout the day, OLSE will spotlight businesses from each County Supervisorial District who take the “high road to profitability” by going above and beyond for their workers.\nFollow along on Facebook, Instagram or LinkedIn.\n\nVista Business District Walk \n\nMarch 28, 10 a.m. – noon.\nOLSE and local partners will visit businesses throughout Vista to share resources and answer employers’ questions about labor standards and best practices. ​\nFor more information, email michael.knab@sdcounty.ca.gov.\n\nHealth and Resource Clinic \n\nMarch 29, 9 a.m. – 2 p.m., Employee Rights Center, 4161 Home Ave., San Diego, CA 92105.\nAttendees can receive legal information, immigration support, workers’ rights training, pet microchipping and more.​\n\nEmployers and workers who want more information about workers’ rights or wage theft can contact Labor Standards and Enforcement at olse@sdcounty.ca.gov or 619-531-5129.\nFor more information about the Week of Action events, email stephanie.hernandez@sdcounty.ca.gov\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250321.16.43.48"}