{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local Mom Who Survived Cardiac Arrest for 86 Minutes Celebrates One Year Anniversary", "description": "A year ago, Michelle Alvarado faced death, only to be saved by an extraordinary medical procedure. Recently, she celebrated that one-year anniversary with Nick Black, the National City Fire Department paramedic who made the right call at the right time and helped save her life.", "datePublished": "2025-05-09T14:37:13-07:00", "url": "https://www.countynewscenter.com/local-mom-who-survived-cardiac-arrest-for-86-minutes-celebrates-one-year-anniversary/", "keywords": ["health", "cpr", "ecmo", "national city fire department", "paramedic", "sudden cardiac arrest"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2025-05-12T14:27:37-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesA year ago, Michelle Alvarado faced death, only to be saved by an extraordinary medical procedure.\nRecently, she celebrated that one-year anniversary with Nick Black, the National City Fire Department paramedic who made the right call at the right time and helped save her life.\nLast May, Michelle experienced sudden cardiac arrest.\nNick made the critical decision to have her ambulance bypass the nearest hospitals and take Michelle instead to Sharp Memorial Hospital. There, she was treated with an established medical procedure as part of an innovative County of San Diego pilot project used to treat patients in cardiac arrest.\nFor 86 minutes, Michelle received CPR by Nick, multiple first responders, and the Emergency Department team to keep her blood pumping until she could be placed on ECMO.\n\nECMO, or extracorporeal membrane oxygenation, is a medical procedure for critical patients with life-threatening heart or lung failure. An ECMO machine is used to pump blood out of a patient’s body, add oxygen, remove carbon dioxide, and then pump the blood back into the body.\nECMO saved Michelle’s life and was available to her because of a unique program that can be found in only a few locations around the world. In 2022, San Diego County brought together local medical leaders to create the San Diego Resuscitation Consortium (SDRC), with the goal of saving more lives using ECMO. A new system of care was established, and in 2023, the County launched the “Extracorporeal Cardiopulmonary Resuscitation (ECPR)” pilot program.\nAs part of the pilot program, paramedics identify eligible cardiac arrest patients in the community and transport them to one of three participating local hospitals, Sharp Memorial, Scripps La Jolla and Sharp Grossmont.  Emergency physicians are available around the clock to immediately initiate life-saving treatment.\nOn November 7, 2024, UCSD Medical Center Hillcrest joined the pilot program, becoming the fourth approved ECPR Receiving Center in San Diego County. The program is setting a new standard and transforming cardiac arrest care worldwide.\nNot all patients suffering sudden cardiac arrest are good candidates for the program. For those who are, ECMO can bring them back from certain death. Patients like Michelle Alvarado are living proof.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250509.14.37.13"}