{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Trail Named after Longtime Ramona Resident", "description": "In a surprise ceremony, a trail at the Luelf Pond County Preserve was named for a nearby and long-time resident who has spent decades championing trails and the community of Ramona.", "datePublished": "2024-11-04T15:45:38-08:00", "url": "https://www.countynewscenter.com/trail-named-after-longtime-ramona-resident/", "keywords": ["parks and rec", "county parks", "degenfelder trail", "john degenfelder", "lueg", "luelf pond county preserve", "parks", "trail"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2024-11-04T17:35:00-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesIn a surprise ceremony, a trail at the Luelf Pond County Preserve was named for a nearby and long-time resident who has spent decades championing trails and the community of Ramona.\nCounty Parks and the Ramona Trails Association dedicated a trail to John Degenfelder during a ribbon-cutting Tuesday.\nMembers of his family and members of the Ramona Trails Association were on hand and spoke during the ceremony. A representative from County Supervisor Joel Anderson also attended.\nAfterward, park rangers took some attendees for a short hike on the newly named trail.\nNow in his mid-nineties, Degenfelder and his late wife founded the Ramona Trails Association in the 1980s.\nAnd that is just one of his many accomplishments. He founded and rode with the Mounted Patrol in Ramona. He created the Ramona Community Foundation which recently won Non-Profit of the Year.\nDegenfelder served on and chaired the Ramona Community Planning Group, and he helped the “Welcome to Ramona” sign become a reality.\nHe worked with former County Supervisor Dianne Jacob on the Santa Maria Creek Staging Area that was dedicated in June 2014. He still holds monthly meetings on future trail projects like the Santa Maria Creek Greenway. Degenfelder has also led multiple creek cleanup efforts.\nAnd there’s more. He was a founding member of the Ramona United Methodist Church and just recently, Degenfelder turned over his many duties as Ramona’s honorary mayor to a successor. The nonagenarian had served in that position for the last six years.\nThe Degenfelder Trail was formerly the Luelf Pond Trail. It is open to hikers, cyclists and equestrians with parking at Holly Oaks County Park. The one-mile-long shaded trail features towering coast live oaks and beautiful views.\nThe path is one of nearly two miles of trails on the 90-acre preserve. For more information on the many parks, reserves, camping sites, trails and more, visit sdparks.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241104.15.45.38"}