{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mask Mandate for Fully Vaccinated People Ends Feb. 15", "description": "Given that COVID-19 Omicron cases and hospitalizations have significantly decreased across the state, including San Diego County, the indoor mask mandate established by the California Department of Public Health nearly two months ago will expire Feb. 15.", "datePublished": "2022-02-09T17:02:14-08:00", "url": "https://www.countynewscenter.com/mask-mandate-for-fully-vaccinated-people-ends-feb-15/", "keywords": ["health", "coronavirus", "covid-19", "mask mandate ending", "masks"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-02-09T17:02:14-08:00", "articleType": "article", "articleContent": "\nGiven that COVID-19 Omicron cases and hospitalizations have significantly decreased across the state, including San Diego County, the indoor mask mandate established by the California Department of Public Health nearly two months ago will expire Feb. 15.\nThe County follows CDPH’s recommendations; therefore, the mask requirement will also expire locally.\nWell-fitted masks will still be required indoors for people who are not fully vaccinated. A person is considered fully vaccinated two weeks after receiving two doses of the Pfizer or Moderna vaccines or one shot of the Johnson and Johnson immunization.\n“People who are not fully vaccinated are more likely to become infected compared to people who have received all the recommended doses of the COVID-19 vaccine, including the booster,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “The vaccines are the best protection there is to prevent people from getting seriously ill, ending in the hospital or, worse, dying.”\nMasks will still be required in schools and in certain settings regardless of vaccination status.\nThe County Board of Supervisors voted Feb. 8 to ask CDPH to phase out masking in schools in a “safe and responsible” manner.\nOn Feb. 7, CDPH announced that “the state is continuing to work with education, public health and community leaders to update masking requirements at schools to adapt to changing conditions and ensure the safety of kids, teachers and staff.”\nThe County Office of Education is the entity responsible for providing guidance to the county’s 42 school districts.\nWhere to Get COVID-19 Vaccines\nThe region has plenty of COVID-19 vaccines and booster doses, which now exceed 1.1 million in the region. The county has more than 400 vaccination sites including pharmacies, medical providers, clinics, and County locations. You can also make an appointment or find a site near you by calling (833) 422-4255 or visiting the MyTurn or coronavirus-sd.com websites.\nVaccination Progress:\n\nDoses administered: More than 6.74 million.\nReceived at least one shot: Over 2.89 million or 91.9% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: More than 2.54 million or 80.8%.\nBoosters administered: 1,111,400 or 53.2% of 2,090,923 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n119 new deaths were reported since the last report on Feb. 2, 2022. The region’s total is 4,854.\n72 men and 47 women died between Jan. 2, 2022 and Feb. 4, 2022.\n55 were age 80 or older, 26 were in their 70s, 20 were in their 60s, 13 were in their 50s, three were in their 40s and two were in their 30s.\n55 of the people who died were fully vaccinated and 64 were not fully vaccinated.\n112 had underlying medical conditions, one did not and six had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n2,394 COVID-19 cases were reported to the County on Feb. 8, 2022. The region’s total is now 719,068.\n16,257 cases were reported last week (Feb. 2 through Feb. 8), 2022) compared to 29,508 COVID-19 infections identified the previous week (Jan. 26 through Feb. 1, 2022).\nDuring the 30-day period between Dec. 28, 2021 to Jan. 26, 2022, there were 1,644 COVID-19 hospitalizations; 909 people were not fully vaccinated, 548 were fully vaccinated and 187 were fully vaccinated and boosted.\nSan Diego County’s case rate per 100,000 residents is 118.3 for people fully vaccinated and boosted, 186.3 for fully vaccinated people and 353.0 for not fully vaccinated San Diegans.\n12,085 tests were reported to the County on Feb. 6, 2022, and the percentage of new positive cases was 10.9%.\nThe 14-day rolling percentage of positive cases among tests reported through Feb. 6, 2022 is 13.2%.\n\nCommunity Setting Outbreaks:\n\n43 new community outbreaks were confirmed in the past seven days (Feb. 2, 2022 through Feb. 8, 2022): 15 in daycare/preschool/childcare settings, six in TK-12th grade school settings, six in business settings, five in health care settings, two in college/university settings, two in distribution warehouse settings, two in hotel/resort/spa settings, one in a food/beverage setting, one in an adult daycare setting, one in a retail setting, one in a construction setting and one in a restaurant/bar setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published Monday through Friday around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220209.17.02.14"}