{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Aging Roadmap Highlights Needs of Growing Population", "description": "The County’s Board of Supervisors recently received an update on the Aging Roadmap, which serves as the County’s framework for creating supportive and inclusive communities where people of all ages and abilities have broad and equitable opportunities to thrive. ", "datePublished": "2024-10-04T13:38:14-07:00", "url": "https://www.countynewscenter.com/countys-aging-roadmap-highlights-needs-of-growing-population/", "keywords": ["health", "aging and independence services", "aging roadmap", "alzheimer s", "elders", "san diego county", "seniors", "services for seniors"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-10-04T13:43:16-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s Board of Supervisors recently received an update on the Aging Roadmap, which serves as the County’s framework for creating supportive and inclusive communities where people of all ages and abilities have broad and equitable opportunities to thrive. \nToday, more than 710,000 people 60 years of age and older live in San Diego County and that number is expected to grow to 820,000 over the next five years.  \nOriginally released in 2019, the Aging Roadmap is updated yearly using feedback from community members, surveys and those who work with or serve the aging population. \n“The feedback we get from the community is really important to us,” said Jennifer Bransford-Koons, County Aging & Independence Services (AIS) Director. “It tells us whether we are reaching people with the right services in a way that is accessible to them so that they can age well and thrive.” \nThe 2024 Aging Roadmap Annual Update covers program highlights including: \n\nIn-Home Supportive Services (IHSS), AIS’ largest program provides help with personal care and household chores for older adults and adults and children living with disabilities. Last fiscal year, from July 2023 to July 2024, the program grew by almost nine percent to 42,000 people due a growing population of older adults and more outreach efforts to promote the program.   \n\n\nThe Tech2Connect program helped more than 600 IHSS participants stay connected with others and find mental health resources during the last fiscal year. The program offers participants tablets with internet connection and training on how to use the technology. Similarly, the Digital Inclusion Program also provided 340 older adults with tablets and education.  \n\n\nTo increase access to social opportunities to more older adults, AIS worked with County Parks and Recreation to host intergenerational activities like pickleball, cooking classes and holiday festivals for more than 1,350 people. Nine intergenerational gardens are also being created across the county.  \n\n\nThe San Diego County No-Cost Transportation Program for Older Adults provided more than 20,500 one-way trips to older adults last fiscal year. Access to safe, affordable and reliable transportation is crucial for older adults to maintain independence, be able to get to the services they need and stay socially connected. \n\n\nOverall, the County has provided training to thousands of area doctors on dementia best practices. There are more than 98,600 residents in the region older than 55 years old living with Alzheimer’s disease and related dementias. More patients are being screened for cognitive impairments than ever before.  \n\n\nThe Caregiver Support Program helps people who care for a family member or loved one. It provided 466 training workshops to teach family caregivers new skills. Additionally, the program provided 11,500 hours of respite care that allowed caregivers to tend to other life needs.  \n\n\nTo promote the safety of older adults and people with disabilities, Adult Protective Services (APS) did more than 20,000 investigations. APS also continues a media campaign to increase awareness of elder abuse and where to report it. \n\n\nTo prevent falls and injuries, the Dignity at Home Fall Prevention Program gave out more than 320 fall prevention kits with home safety items. \n\nPeople with questions or those who want to learn more about the programs and services available for older adults can call the AIS Call Center at 1-800-339-4661 or visit the AIS website. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241004.13.38.14"}