{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Makes Home Cooking Program Permanent, Expands Economic Opportunities", "description": "The Board of Supervisors voted to continue a temporary program set to expire in 2024 that supports home cooking as a small business. It also expanded the earning potential for its participants.", "datePublished": "2023-11-09T10:42:44-08:00", "url": "https://www.countynewscenter.com/county-makes-home-cooking-program-permanent-expands-economic-opportunities/", "keywords": ["consumer", "consumers", "equity and access", "health inspections", "home kitchen", "lueg"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2023-11-09T11:04:55-08:00", "articleType": "article", "articleContent": "\nThe Board of Supervisors voted to continue a temporary program set to expire in 2024 that supports home cooking as a small business. It also expanded the earning potential for its participants.   \n \nThis follows the 2022 adoption of a two-year trial of the Microenterprise Home Kitchen Operations program (MEHKO). Now, there are 61 permitted home kitchens in operation, offering new ways for people to earn a living doing what they love – cooking for others.\n \nThe Board also increased the number of meals a permittee can sell if they add food carts to their operation. These actions further remove barriers for small, food-based entrepreneurs County-wide. It also increases the ability for people to grow their business and contribute to the local economy. \n \nMEHKOs are home kitchens that operate as mini restaurants. The opportunity to run a business without the overhead costs and infrastructure required of a traditional brick-and-mortar restaurant facility is a game-changer for the existing MEHKOs participants.  \n \n“There are so many people that have been able to enter the food industry and fulfill lifelong dreams about business ownership and provide food to the community that previously were unable to,” said Executive Director of the COOK Alliance Roya Bagheri, Esq. \n \nIn San Diego County, 58% of MEKHOs are women-owned, and 70% are minority-owned. According to the U.S. Census for the region, women or minorities own less than 25% of businesses. \n \nThe program supports equitable access to self-employment. High start-up costs such as $275,000 for a leased building make it too expensive for many underrepresented groups, such as women, immigrants and people of color, to use their skills to generate income through a traditional restaurant space.\n \nThe expanded MEHKOs program including use of a food cart now allows permitted home chefs to serve up to 80 meals a day for a maximum of 200 a week with gross annual sales of $150,000.\n  \nThe County’s Department of Environmental Health and Quality (DEHQ) oversees the MEHKOs program and ensures food safety through inspections, permitting and oversight of the rules of the program.  \n \nDEHQ is committed to supporting San Diego’s home cooks and offers several resources to support those interested in the MEKHOs program. Visit the Home Kitchen Operations webpage to learn more.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231109.10.42.44"}