{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Free Summer Movies in the Park Season Starts Friday at Waterfront Park", "description": "The County Department of Parks and Recreation kicks off its “Sweet 16” season of “Summer Movies in the Park” on Memorial Day weekend with evening showings on Friday, May 26 and Saturday, May 27.  ", "datePublished": "2023-05-23T14:22:00-07:00", "url": "https://www.countynewscenter.com/countys-free-summer-movies-in-the-park-season-starts-friday-at-waterfront-park/", "keywords": ["parks and rec", "county parks", "lueg", "summer movies in the park", "waterfront park"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2023-05-23T14:22:00-07:00", "articleType": "article", "articleContent": "\nParty location? Check. Hot box-office movie? Check. Snacks? Check. The County Department of Parks and Recreation kicks off its “Sweet 16” season of “Summer Movies in the Park” on Memorial Day weekend with evening showings on Friday, May 26 and Saturday, May 27.\nThe celebration will start with Friday’s showing of the animated comedy “Puss in Boots: The Last Wish” at the Waterfront Park. Although the movie starts at dusk, about 15 minutes past sunset, a host of free activities are expected to begin at 6 p.m. Make sure to bring a chair and blankets to cozy up for a night under the stars.\nThis year’s schedule includes 150 movies at dozens of parks across the County. Theme weekends have also been scheduled, including Juneteenth (June 16 and 17), Comic-Con (July 21-22), Ladies Night (Aug. 12), International Dog Day (Aug. 25 and 26), Hispanic Heritage Month (Sept. 15 – Oct. 15) and Halloween (late October).\nAction fans will love outdoor showings of “Top Gun: Maverick;” “Black Panther: Wakanda Forever;” and “Ant-man and The Wasp: Quantumania.” If cartoon heroes and villains are preferred, you won’t want to miss “The Super Mario Bros. Movie,” “DC League of Super Pets;” “The Incredibles;” or “Minions: The Rise of Gru.”\nIf you’re a fan of modern-day classics, “Angels in the Outfield;” “The Goonies;” “The Sandlot;” “Cool Runnings;” “Free Willy;” “Hook;” and “ET the Extra-Terrestrial” may spark your interest. You can even go back in time to see the 1951 version of “Alice in Wonderland!”\nThe line-up has something for everyone to enjoy. View the complete schedule and plan to attend movies near you as the Department of Parks and Recreation celebrates 16 years of taking back parks, after dark, through safe and fun nighttime activities.\nMovies, dates and locations are subject to change. For more information, visit summermoviesinthepark.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230523.14.22.00"}