{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "80% Of Eligible San Diegans Fully Vaccinated Against COVID-19", "description": "A total of 2,242,203 San Diegans, 80% of those eligible, are now fully vaccinated against COVID-19, the County Health and Human Services Agency announced today.", "datePublished": "2021-10-13T16:31:02-07:00", "url": "https://www.countynewscenter.com/80-of-eligible-san-diegans-fully-vaccinated-against-covid-19/", "keywords": ["health", "80 percent", "coronavirus", "covid-19", "fully vaccinated", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2021-10-13T16:31:02-07:00", "articleType": "article", "articleContent": "\nA total of 2,242,203 San Diegans, 80% of those eligible, are now fully vaccinated against COVID-19, the County Health and Human Services Agency announced today.\nThe milestone places San Diego among the most vaccinated counties in the state and the nation.\n“San Diegans have done a great job getting vaccinated against COVID-19,” said Seema Shah, M.D., medical director for HHSA’s Epidemiology and Immunization Services branch. “However, we should not get complacent. The COVID-19 pandemic is not over and those who are immunocompromised, ineligible or otherwise vulnerable need our collective protection. Eligible residents should continue getting vaccinated and get their booster shot when it’s their turn.”\nMore than 400 locations countywide offer no-cost COVID-19 vaccinations. They include doctors’ offices, retail pharmacies (Rite Aid, Walgreens, CVS, etc.), community clinics and County public health centers.\n“Local health care providers and many other County partners have made a tremendous effort to encourage San Diegans to get vaccinated and to make the vaccine available to anyone who wants it,” Shah said.\nVaccine supplies remain plentiful, both for those seeking initial doses and boosters for those who received the Pfizer vaccine and meet the criteria. A complete list of locations and booster eligibility details are at coronavirus-sd.com.\nVaccination Progress:\n\nDoses administered: Over 4.87 million.\nReceived at least one shot: More than 2.5 million or 89.2% of San Diegans 12 and older are partially vaccinated.\nFully vaccinated: Over 2.24 million or 80%.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\n37 new deaths were reported since the last report on Oct. 6, 2021. The region’s total is 4,141.\n27 men and 10 women between Aug. 22 and Oct. 10, 2021.\nSeven were 80 years of age or older, nine were in their 70s, eight were in their 60s, six were in their 50s, five were in their 40s and two were in their 30s.\nSix of the people who died were fully vaccinated and 31 were not fully vaccinated.\n35 had underlying medical conditions, one did not, and one had medical history pending.\n\nCases, Hospitalizations, Case Rates and Testing:\n\n333 COVID-19 cases were reported to the County on Oct. 12. The region’s total is now 362,618.\n3,241 cases were reported in the past week (Oct. 6 through Oct. 12) compared to 3,631 cases the previous week (Sept. 29 through Oct. 5).\nIn the past 30 days (Sept. 13 to Oct. 12), there were 263 COVID-19 hospitalizations; 258 people were not fully vaccinated and five were fully vaccinated.\nSan Diego County’s case rate per 100,000 residents is 15.4 overall, 8.3 for fully vaccinated people and 25.8 for not fully vaccinated San Diegans.\n15,149 tests were reported to the County on Oct. 12, and the percentage of new positive cases was 2.2%.\nThe 14-day rolling percentage of positive cases among tests is 2.3%.\n\nCommunity Setting Outbreaks:\n\n21 new community outbreaks were confirmed in the past seven days (Oct. 6 through Oct. 12): 11 in TK-12 grade school settings, four in daycare/preschool/childcare settings, two in business settings, two in restaurant/bar settings, one in a government setting and one in a hotel/resort/spa setting.\nThe community outbreaks trigger is more than seven in a 7-day period.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website are published around 5 p.m.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211013.16.31.02"}