{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Encouraged to Unite for Day of Service Wednesday", "description": "County Chairwoman Nora Vargas is encouraging San Diegans who want to help people and families impacted by last week’s devastating storms to participate in a “Day of Service” Wednesday, Jan. 31. Donate your time or goods to help rain and flood survivors.", "datePublished": "2024-01-29T16:45:24-08:00", "url": "https://www.countynewscenter.com/community-encouraged-to-unite-for-day-of-service-wednesday/", "keywords": ["government", "day of service", "disaster recovery", "flood recovery"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2024-01-29T16:52:50-08:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty Chairwoman Nora Vargas is encouraging San Diegans who want to help people and families impacted by last week’s devastating storms to participate in a “Day of Service” Wednesday, Jan. 31.\nNine separate community groups are joining with County representatives at three locations to collect much-needed donations. The public can help in a few ways.\nThey can sign up to help in person to collect and sort donations and put together kits to distribute to flood survivors. They can drop off donations to help people and families recovering from the rains and floods―items ranging from rain boots, towels, and plastic storage bins to laundry detergent, bottled water, diapers and pet food.\nAll donated items should be new and unused. See the full list of needed items below.\nIn addition to the Day of Service people can also support rain and flood victims by making financial donations to the flood response fund that County and San Diego Foundation created. The foundation will match donations up to $100,000.\nThe community groups working with the County include Pillars of the Community; the Jackie Robinson YMCA; The Positive Movement Foundation; the Hip Hop Health and Wellness 5K and Festival; the Harvey Family Foundation; the Urban Collaborative Project; the Emo Brown Foundation; the Sherman Heights Community Center; and Exhaling Justice.\nThree community sites will accept donations Wednesday from 8 a.m. to 2 p.m.\n\nThe Jackie Robinson Family YMCA\n151 YMCA Way\nSan Diego, CA 92102\n\n\nSherman Heights Community Center\n2258 Island Ave.\nSan Diego, CA. 92102\n\n\nNational City Family Resource Center\n401 Mile of Cars Way\nNational City, CA. 91950\n\nJan. 31 was scheduled to be the day Vargas delivered her second State of the County address. But after last week’s devastating rains and flooding, Vargas put it on hold indefinitely and called for a day of service, where organizations and the public can help those whose homes and lives were damaged.\n“I’m asking all of you to help us and give your time to our day of service,” Vargas said. “We need to do what we do best as San Diegans. And that is to come together to really help each other during a very difficult time. When communities are in need, San Diegans show up for each other – that’s just who we are.”\nVargas said she would reschedule the annual State of the County speech that provides updates on the County’s priorities for 2024.\nFor now, as Vargas, community groups and the County help those who lost homes, property and possessions, they also reminded the public that more rain is expected and people need to continue to prepare.\nHere’s a complete list of items officials hope can be donated to help those in need.\nBedding\n\nInflatable mattresses\nPillows\n\nCleaning Materials \n\nBleach\nLatex gloves\nTrash containers\nGarden gloves\nLysol wipes\nAerosol spray\nLaundry detergent\nLaundry services\nPaper towels\nTrash bags\nScrubbers, sponges\nDish detergent\n\nClothing\n\nDiabetic Socks\nSports bras\nUnderwear (men, women, and children)\n\nEquipment \n\nPlastic storage bins\nPower washers\nWet/dry vacs\nShovels\nSandbags with sand\nBlower fans\nAir purifiers\nConstruction materials\nHeavy duty storage\n\nFood and nutrition \n\nBottled water\nSnacks\nBaby formula\nNepro shakes (Ensure)\n\nHousehold items\n\nBlankets\nTowels\nLinens\nPlastic fold up chairs\nStorage bins\n\nPersonal hygiene\n\nDiapers (Child & Adult)\nToiletries\nTampons\nSanitary pads\nHand sanitizer\n\nPet supplies \n\nDog food, cat food\n\nWork gear\n\nWhite personal protective equipment suits\nRain boots\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240129.16.45.24"}