{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Make Shelter Animals Wishes Come True with a Forever Home", "description": "Dear Santa Paws, my biggest wish for the holiday season is for a kind and loving person to be my family.", "datePublished": "2022-12-08T13:43:07-08:00", "url": "https://www.countynewscenter.com/make-shelter-animals-wishes-come-true-with-a-forever-home/", "keywords": ["animals", "adopt pets", "das"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-12-15T14:06:31-08:00", "articleType": "article", "articleContent": "\nDear Santa Paws, my biggest wish for the holiday season is for a kind and loving person to be my family.\nThe San Diego County Department of Animal Services would love to find forever homes for every animal in their care and they are offering a Santa Paws adoption special of $12 per pet in December. All animals will be spayed or neutered, have vaccinations, a microchip and a one-year license for dogs in the service area.\n“Make a real difference in the life of an animal by giving one or two a caring home,” said Animal Services Director Kelly Campbell. “You can be an angel to one of our region’s homeless pets.”\nOn the subject of giving, it is quite possible that you know someone who would love a pet. If after careful thought, you have decided to give an animal as a gift, why not give a gift certificate from a County shelter and let the recipient pick out their lifetime family member? That ensures a good match for both human and animal.\nThis is Pine, now renamed Goku, whose wish came true this week when he was adopted at the Carlsbad shelter. His new dad is showing him where to sleep and is helping him feel safe and loved.\nThe first step to finding a new best friend is browsing all the lovable animals from cats to dogs to chickens and pigs available now on the  Adoptions page.  Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already chosen by another person.\nWalk-in hours are from 1 to 4 p.m. Tuesday through Friday and from 10 a.m. to 4 p.m. Saturday and Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad.\nFill out an application online to print or pick one up at the shelter. Applications can also be emailed but it is quicker to go in person.\nIf you cannot adopt, consider fostering or volunteering.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221208.13.43.07"}