{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on Three Affordable Housing Developments on Excess County Land in Clairemont", "description": "The County of San Diego’s Housing and Community Development Services (HCDS) joined Chelsea Development Corp. and other partners to break ground on the first three of four developments that will be situated on a property in Clairemont. The three developments will provide more than 300 affordable homes for low-income families, seniors and those with developmentally disabled relatives. The total number of new affordable apartment homes will on the site will total more than 400 with the completion of the fourth development.", "datePublished": "2023-06-29T16:58:28-07:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-three-affordable-housing-developments-on-excess-county-land-in-clairemont/", "keywords": ["housing", "affordable housing", "breaking ground", "hcds"], "author": [{"type": "@Person", "name": "Cassie N. Saunders", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie N.", "familyName": "Saunders"}], "dateModified": "2023-06-30T17:44:33-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego’s Housing and Community Development Services (HCDS) joined Chelsea Development Corp. and other partners to break ground on the first three of four developments that will be situated on a property in Clairemont. The three developments will provide more than 300 affordable homes for low-income families, seniors and those with developmentally disabled relatives. The total number of new affordable apartment homes will on the site will total more than 400 with the completion of the fourth development.  \nThe Mt. Etna development is located on the property where the County’s former Crime Lab once sat. It is the second County property this year to host an affordable housing groundbreaking. \n“Although the title of the Agency doesn’t have housing in it, housing is fundamental to what we do. We strongly believe housing is health and it is an essential human service,” said Dr. Eric McDonald, interim director of the County Health and Human Services Agency. “It is also important to note that the new homes will remain affordable for 99 years.” \nThe size of the investment was also significant. \n“The County invested more than $39 million in land and capital funding in this project,” said David Estrella, director of Housing and Community Development Services. “It is our largest affordable housing investment to date, and we are excited for the people and future generations who will call this home.”  \nMore information about the development and availability of homes at the Mt. Etna site is online at the Chelsea Development Corp. website.  \nSince the integration of HCDS Services in 2017 into the Health and Human Services Agency, the department has supported the construction of more than 1,300 new units using County Innovative Housing Trust Fund dollars, excess county property, and other funds leveraged through partnerships. An additional 2,900 units are on the way over the next five years, which collectively will be home to nearly 17,000 San Diegans each night when complete. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230629.16.58.28"}