{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Registrar Reminds Voters to Vote Early for Nov. 7 Special Election", "description": "If you’re a registered voter who lives in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District or Rainbow Municipal Water District, you’ll soon get a reminder from the Registrar’s office that you have just over one week to cast your ballot for the Nov. 7 special election.", "datePublished": "2023-10-25T12:04:20-07:00", "url": "https://www.countynewscenter.com/registrar-reminds-voters-to-vote-early-for-nov-7-special-election/", "keywords": ["elections", "chula vista city attorney election", "district 4", "fallbrook public utility district", "fgg", "nov. 7 special election", "rainbow municipal water district", "registrar of voters", "runoff election nov. 7", "san diego county registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-10-25T12:04:20-07:00", "articleType": "article", "articleContent": "\nIf you’re a registered voter who lives in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District or Rainbow Municipal Water District, you’ll soon get a reminder from the Registrar’s office that you have just over one week to cast your ballot for the Nov. 7 special election.\nThe Registrar sent nearly 550,000 reminder postcards to registered voters who had not voted as of Oct. 18.\nOnly the voters who live in the above-mentioned districts can vote in their respective elections. If you’re not sure whether you reside in one of the districts, you can look it up at sdvote.com.\nThe special runoff election for the Fourth Supervisorial District will fill the vacant seat for the remainder of the current term ending in January 2027.\nThe special election for the City of Chula Vista will fill the vacant seat for city attorney for the remainder of the current term ending in December 2026.\nVoters who live in the Fallbrook Public Utility District and Rainbow Municipal Water District will vote on a ballot measure.\nDon’t delay! You can vote from home and return your ballot through the mail – no postage needed. Remember to sign and date your return ballot envelope. You must sign the return ballot envelope for your vote to count.\nYou also have the option to use one of the Registrar’s official ballot drop boxes. The secure stand-alone boxes feature the Registrar’s logo along with the County seal and are labeled “Official Ballot Drop Box.” Find one close to you through the Registrar’s online locator tool or inside your voter information pamphlet. Check each location’s hours of operation before heading out at sdvote.com.\nThe sooner the Registrar’s office receives your ballot, the sooner it is processed for the first release of election night results.\nIf you want to vote in person and avoid lines, select vote centers offer early voting starting on Saturday, Oct. 28. The vote centers will be open daily from 8 a.m. to 5 p.m. until the final day of voting on Tuesday, Nov. 7, when all vote centers will open from 7 a.m. to 8 p.m.\nEarly voting is already underway at the Registrar’s office from 8 a.m. to 5 p.m. Monday through Friday.\nYou can find an official ballot drop box or vote center near you inside your voter information pamphlet, or you can look it up online at sdvote.com. You can also contact the Registrar of Voters at (858) 565-5800 or toll free at (800) 696-0136.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231025.12.04.20"}