{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Give a Shelter Pet a Snuggly Summer", "description": "County shelters are waiving adoption and microchip fees through July 7 in order to give some lucky pets a new life of liberty and the ability to pursue  happiness.", "datePublished": "2024-06-18T12:19:01-07:00", "url": "https://www.countynewscenter.com/give-a-shelter-pet-a-snuggly-summer/", "keywords": ["animals", "adopt pets", "pet adoption waiver"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-06-18T12:19:01-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty shelters are waiving adoption and microchip fees through July 7 in order to give some lucky pets a new life of liberty and the ability to pursue  happiness.\nThe Department of Animal Services’ Stars, Stripes and Snuggles promotion began June 16 in anticipation of the Fourth of July holiday when shelters traditionally see an influx of animals due to fireworks which cause some pets to run away.\nCounty’s shelters and shelters throughout the United States continue to be affected by overcrowding. The community’s support is urgently needed to make a lifesaving impact on the homeless pet population.\nIf you live in the County service area, microchips are also available to help reunite lost pets because no one should have their family broken up, even temporarily due to startling noises.\nOnce a pet is in panic mode, they may bolt and are then at risk for running into traffic, getting lost, or even being attacked by other animals.\nMake sure pets are wearing their collars with identifying information on them in case they manage to escape. If they are microchipped, they will be reunited more quickly, once a microchip is scanned.\nBring pets inside in a quiet, secure room. Don’t take a chance that your pet will stay in a yard, even if they have never escaped before. White noise or sleep machines, even televisions or radios can be a helpful distraction to noise outside.\nFor pets that are particularly distressed by loud noises, stay home with your pets or have them stay with someone they like to help them feel safe. Veterinarians may even suggest anxiety-relieving medication for those pets who are especially terrified.\nFind your new best friend by browsing the County shelters’ online animal listings. You will find loveable cats, dogs, bunnies, a tortoise, a guinea pig, fowl and pigs available on the Adoptions page.  Due to the popularity of this adoption special, Animal Services staff recommend picking out a second and third choice too, just in case your first choice is already adopted.\nAdoption fees are always waived for senior adopters, senior pets and pets that have been waiting for their forever home for 30 days or more.\nWalk-in hours are from 10 a.m. to 4 p.m. Tuesday through Sunday at both the South Shelter, 5821 Sweetwater Road in Bonita, or the North Shelter, 2481 Palomar Airport Road in Carlsbad. Please note that the shelter will be closed June 19 for the Juneteenth holiday.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240618.12.19.01"}