{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Reminded to Celebrate Halloween Safely During COVID-19", "description": "County health officials are reminding the public that traditional Halloween celebrations are not advised, and large gatherings are not allowed, under the state or local health guidance.", "datePublished": "2020-10-28T17:27:35-07:00", "url": "https://www.countynewscenter.com/san-diegans-reminded-to-celebrate-halloween-safely-during-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "halloween"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-10-29T15:53:33-07:00", "articleType": "article", "articleContent": "\nCounty health officials are reminding the public that traditional Halloween celebrations are not advised, and large gatherings are not allowed, under the state or local health guidance.\nHalloween celebrations – such as parties and in-person, door-to-door trick-or-treating – pose a high risk of spreading COVID-19 and are strongly discouraged.\n“These activities involve face-to-face interactions with people from different households,” said Wilma Wooten, M.D., M.P.H., County public health officer. “If a COVID-19 infection is detected among a participant, it will be very difficult to find and notify those who may have been exposed.”\nWooten recommends the following safe Halloween activities to make sure children have a fun and safe celebration:\n\nOnline parties/contests such as costume or pumpkin carving\nDrive-through events and car parades\nDressing up homes and yards with Halloween-themed decorations\nMovie nights with your own household or at a drive-in theater\nPumpkin patches where people use hand sanitizer and maintain 6-feet of distance from others\n\n“Please be safe and stay healthy this Halloween weekend,” Wooten said. “A boo and a cackle can be great fun, but COVID is definitely not.”\nA list of what’s not allowed or recommended as well as other alternatives to celebrate Halloween is found here.\nState Metrics:\n\nSan Diego County’s state-calculated, adjusted case rate is currently 6.5 per 100,000 residents. Limit for Tier 2, the Red Tier, is 7.0.\nThe testing positivity percentage is 3.5%, placing it in Tier 3 or the Orange Tier.\nThe state’s health equity metric looks at the testing positivity for areas with the lowest healthy conditions.\nThe County’s health equity testing positivity percentage is 5.1. This metric does not move counties to more restrictive tiers but is required to advance.\nThe California Department of Public Health will assess counties on a weekly basis, with the next report scheduled for Tuesday, Nov. 3.\n\nCommunity Setting Outbreaks:\n\n13 new community outbreaks were confirmed on Oct. 27: four in grocery settings, three in restaurant settings, two in business settings, two in health care settings, one in a day care setting and one in a government setting.\nIn the past seven days (Oct. 21 through Oct. 27), 31 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n11,116 tests were reported to the County on Oct. 27, and the percentage of new laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 2.7%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 11,268.\nPeople with and without symptoms who are at higher risk for COVID-19 should be tested. Healthcare and essential workers should also get a test, as well as people who had close contact to a positive case or live in communities that are being highly impacted.\n\nCases:\n\n330 new cases were confirmed among San Diego County residents on Oct. 27. The region’s total is now 55,540.\n3,883 or 7.0% of all cases have required hospitalization.\n905 or 1.6% of all cases and 23.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nFour new deaths were reported in the County on Oct. 27. The region’s total is now 881.\nThree women and one man died between Oct. 22 and Oct. 26. Their ages ranged from early 70s to mid-80s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated around 5 p.m. today.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201028.17.27.35"}