{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Homeless Solutions and Equitable Communities Gives Board Update", "description": "A new County department reported Tuesday that in its first year it secured $30 million to address homelessness; provided housing options for over 4,400 people; held or took part in hundreds of community events to create equitable communities; and worked to support immigrants and refugees.", "datePublished": "2022-08-30T16:39:05-07:00", "url": "https://www.countynewscenter.com/?p=209330", "keywords": ["health"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-08-30T16:39:05-07:00", "articleType": "article", "articleContent": "\nA new County department reported Tuesday that in its first year it secured $30 million to address homelessness; provided housing options for over 4,400 people; held or took part in hundreds of community events to create equitable communities; and worked to support immigrants and refugees.\nOfficials from the County’s Department of Homeless Solutions and Equitable Communities updated County supervisors on the department’s progress at Tuesday’s Board of Supervisors meeting. The department, created in July 2021 as part of the County Health and Human Services Agency, is comprised of three separate offices, homeless solutions, equitable communities and immigrant and refugee affairs.\nOfficials said Tuesday that the department continues collaborative efforts to secure additional funding to support vulnerable populations including people experiencing homelessness, underserved communities, immigrants, migrants and refugees in the region.\nThe Department shared its first-year accomplishments, which included creating the County’s first Safe Parking site for people experiencing homelessness in East County. The Department worked with the City of San Diego and the Lucky Duck Foundation to create the 150 emergency-bed Rosecrans Shelter that will provide behavioral health services onsite.\nThe Department also has new programs that offer housing options and supportive services for people with disabilities, justice-involved people with behavioral health and physical health needs, veterans, elderly and young people.\nThe department’s Office of Immigrant and Refugee Affairs created a task force to support Afghan evacuees in San Diego. And the Department’s Community Health and Engagement Teams took part in more than 240 community events and connected more than 12,300 people to County resources. The department also added Community Health Workers as permanent department staff to provide essential linkages to County services in underserved communities.\n“Following a reorganization of resources and with support from the Board of Supervisors, the new Department of Homeless Solution and Equitable Communities was able over the last year to make a positive impact, ensure equity and connect thousands of San Diegans to housing and other essential resources” said Barbara Jiménez, the department’s Community Operations Officer. “While much remains to be done, we are confident that our team is poised to continue its efforts to ensure equity in delivering necessary services and help to underserved communities.”\nIn receiving the report Tuesday, County Supervisors also voted unanimously to direct the department to take action to accept a $2 million allocation of Afghan refugee supplemental funding from the California Department of Social Services. Officials said San Diego County is one of only four counties to receive the allocation.\nSome of the additional accomplishments the department reported Tuesday included:\n\nReceived $8 million for the Housing Disability Advocacy Program to provide help, housing and legal support to people with disabilities who are experiencing homelessness.\nWorked with the County’s Public Safety Group to secure $6 million under Prop. 47 to provide care coordination services to recently released justice-involved people who have mental health or substance use disorders and are at risk of homelessness.\nCommunity Health Workers participated in close to 100 events and connected over 4,600 people to County services.\nOffice of Immigrant and Refugee Affairs worked with First 5 San Diego to successfully apply for a $423,000 First 5 California Refugee Family Support Grant.\nWorked to engage and connect migrants, immigrants, asylum seekers and refugees from all places, including Afghanistan and the Ukraine, with legal, medical, academic and food resources.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220830.16.39.05"}