{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Study Advances Ways to Close Digital Divide in Unincorporated Area", "description": "A recent analysis of census data as part of the County Comprehensive Broadband Plan showed that approximately 37,000 households in the unincorporated area of San Diego don’t have a broadband internet subscription.", "datePublished": "2023-01-19T10:35:18-08:00", "url": "https://www.countynewscenter.com/?p=210553", "keywords": ["government", "affordable internet", "comprehensive broadband plan", "internet access"], "author": [{"type": "@Person", "name": "Donna Durckel", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Donna", "familyName": "Durckel"}], "dateModified": "2023-01-19T11:21:00-08:00", "articleType": "article", "articleContent": "\nA recent analysis of census data as part of the County Comprehensive Broadband Plan showed that approximately 37,000 households in the unincorporated area of San Diego don’t have a broadband internet subscription. This places them at a disadvantage when it comes to things such as online education, healthcare services or emergency notifications.\nThe report is the latest effort by the County to address inadequate broadband infrastructure and access in its communities.\nReliable and affordable internet access is a basic need in today’s connected world. Just ask Warner Springs resident and emergency volunteer Melissa Krogh, who recently signed up for Starlink internet after years of suffering with less than stellar service.\n“Having a reliable way to communicate can very literally be a matter of life or death for us in the rural communities,” Krogh said. “Whether it is the need to check on our elderly, call 911 in an emergency, or for educational purposes, being connected is an important aspect of modern life and all of my neighbors in the rural communities should be able to procure reliable internet for themselves and their families.”\nThe Plan supports the County’s efforts in attempting to close the digital divide in the unincorporated area by identifying problem areas and the partnerships, infrastructure and education needed to change that. The report helps the County’s expansion of its own infrastructure and identifies the need to work with the private sector, other public agencies and local stakeholders to deliver needed changes, including necessary funding.\nWe surveyed residents in the unincorporated area and here’s what they had to say:\n\n92% of surveyed residents in the unincorporated area did not maintain an at-home internet subscription as a result of availability, reliability, or affordability concerns\n58% of these residents say internet access is not available in their area\n19% say internet access is too expensive\n15% say internet speeds are too slow\nAreas in need of infrastructure tend to be located in rural, desert, mountainous areas in north and east county (e.g., Valley Center, Mountain Empire).\nThese “internet deserts” are typically more rural, more mountainous, and lower income than their suburban peers. Residents within these communities often pay higher prices for lower speed internet access.\nCommunities with low access in the region tend to be more rural and have populations with non-English speakers, lower education levels, and more poverty than average in the county.\nIncome influences access to quality internet speed.\n\n\nActions the County has already taken to improve internet access\n\nThanks to a $4.3M federal grant, the County Library was already able to create the Tech Connect program which puts laptops and Mi-Fi hot spots into the hands of 7,000 people in its service area who lack access to the internet and a computer. Library card holders can check out a laptop and air card for one year, free of charge.\n\n\nThe County has also partnered with SANDAG on its Get Connected Campaign to advance affordable internet service and digital literacy programs.\n\n\nThrough a partnership with Caltrans, we have identified opportunities to leverage already planned roadway projects to deploy fiber and expand high-speed broadband service to our underserved communities at the same time.\n\nWhat’s Next\nThe Plan identifies areas with connectivity gaps and prioritizes them by greatest need, including lack of access and affordable options. The County will use the Plan to identify the type of infrastructure projects to increase connectivity in these areas, such as installing more fiber optic cables in certain areas. The Plan will also help the County determine how it can best collaborate with others. By implementing the Plan’s strategy, the County will continue to build regional partnerships and engage public and private entities to work together to expand broadband access to all residents.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230119.10.35.18"}