{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Lower COVID-19 Vaccination Rates Seen for Children, Teens", "description": "Fewer San Diego County children and teens are getting vaccinated against COVID-19 compared to the overall eligible population, the County Health and Human Services Agency announced today.", "datePublished": "2022-06-30T18:24:59-07:00", "url": "https://www.countynewscenter.com/?p=208909", "keywords": ["health", "children vaccinations", "coronavirus", "covid-19", "teen vaccinations", "vaccinations"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-06-30T18:24:59-07:00", "articleType": "article", "articleContent": "\nFewer San Diego County children and teens are getting vaccinated against COVID-19 compared to the overall eligible population, the County Health and Human Services Agency announced today.\nLocal data through June 29, 2022, shows the following:\n\n182,035 or 76% of the 239,401 San Diegans ages 12 through 17 have completed a primary vaccine series.\n114,748 or 36.9% of the 310,643 children between 5 and 11 years of age have received the primary vaccine series.\nOf the 207,723 children 6 months through 4 years of age, only 3,323 or 1.6% are partially vaccinated. The percentage is expected to be lower because COVID-19 vaccines for this age group were only recently recommended.\n\nIn comparison, 83.8% of the overall population eligible for COVID-19 vaccines has completed a primary vaccine series.\n“COVID-19 vaccines not only protect the people who get them, but also those around them,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Children are not immune to COVID-19 and they can still develop serious complications. Parents should make sure their children get all the recommended doses of the vaccine.”\nWhen it comes to COVID-19 boosters, percentages are even lower in children and teens ages 5 through 17.\nA total of 161,561 San Diegans ages 12 through 17 are eligible for a booster, but only 64,147 or 39.7% have received one. Only 12.2% or 10,365 of local children ages 5 through 11 have received a booster, although 84,970 now qualify for the extra dose. In comparison, 57.3% of 2,394,907 eligible San Diegans has received a booster. Boosters have not been yet recommended for children 6 months through 4 years of age.\n“COVID-19 vaccinations and boosters help to prevent severe illness. If you have not gotten all the recommended doses of the vaccine, do it now,” Wooten said.\nVaccination Progress:\n\nReceived at least one shot: Over 2.98 million or 94.7% of San Diegans age 5 and older are at least partially vaccinated.\nFully vaccinated: Over 2.63 million or 83.8%.\nBoosters administered: 1,372,612 or 57.3% of 2,394,907 eligible San Diegans.\nMore vaccination information can be found at coronavirus-sd.com/vaccine.\n\nDeaths:\n\nNine additional deaths were reported since the last report on June 23. The region’s total is 5,341.\nOf the nine additional deaths, five were women and four were men. They died between Jan. 31 and June 22, 2022; two deaths occurred in the past two weeks.\nFour of the people who died were 80 years or older, three were in their 70s and two were in their 60s.\nSix were fully vaccinated and three were not.\nEight had underlying medical conditions and one had medical history pending.\n\nCases, Case Rates, Hospitalizations and Testing:\n\n5,096 COVID-19 cases were reported to the County in the past three days (June 27 to June 29, 2022). The region’s total is now 834,049.\n11,019 cases were reported in the past week (June 23 through June 29) compared to 9,673 infections identified the previous week (June 16 through June 22).\nSan Diego County’s case rate per 100,000 residents 12 years of age and older is 42.01 for people fully vaccinated and boosted, 25.06 for fully vaccinated people and 88.53 for not fully vaccinated San Diegans.\n8,332 tests were reported to the County on June 25, and the percentage of new positive cases was 12.7% (Data through June 25).\nThe 14-day rolling percentage of positive cases, among tests reported through June 25, is 12%.\n\nMore Information:\nData updates to the County’s coronavirus-sd.com website will be published Mondays and Thursdays around 5 p.m., with the exception of holidays.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220630.18.24.59"}