{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Results of Household Tijuana River Valley Health Assessment Are In ", "description": "The results of the first federal health survey in San Diego County looking into the effects of Tijuana River sewage contamination are in.  ", "datePublished": "2025-01-16T16:01:11-08:00", "url": "https://www.countynewscenter.com/results-of-household-tijuana-river-valley-health-assessment-are-in/", "keywords": ["health", "casper survey", "cdc", "sewage", "sewage pollution", "south bay health", "tijuana river"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2025-01-16T16:01:11-08:00", "articleType": "article", "articleContent": "\nReading Time:  4 minutesThe results of the first federal health survey in San Diego County looking into the effects of Tijuana River sewage contamination are in.  \nThe Community Assessment for Public Health Emergency Response, or CASPER, survey brought the Centers for Disease Control and Prevention (CDC) to the County’s South Bay and Nestor communities the weekend of Oct. 17, 2024.  \nThe results from the in-person household interviews showed that most people living in the area have health concerns, symptoms and quality-of-life issues they associate with the Tijuana River Valley sewage crisis.   \n“We are grateful to all the residents who took part in the CASPER survey and for the partnership with the CDC in getting this done,” said Dr. Ankita Kadakia, County Interim Public Health Officer. “These results validate the concerns residents of the South Bay have been voicing and the real impacts the sewage contamination is having on people’s lives, physical and mental health. Collecting this information represents an important step forward in strengthening our collaboration with local, state and federal partners.”   \nAbout the CASPER survey \nOver three days starting on Oct. 17, 2024, surveyors went to 480 homes where 333 households answered the door and 189 agreed to be interviewed. The homes were in selected clusters designed to represent the 40,911 households in South Bay and Nestor communities.   \nThe assessment covered household experiences, health symptoms related to sewage contamination and household concerns over air and water quality. Participants also were asked how they get their information and what resources they need.  \nWhat did the results say? \nThe complete assessment is available to the public on an interactive dashboard on the County’s website (sandiegocounty.gov/southregionhealth). Some highlights include: \n\n81 percent said their household’s health was among their top concern  \n\n\n67 percent believed their health has gotten worse  \n\n\n69 percent said one or more household member has health symptoms from the sewage crisis\n\n\nSymptoms most frequently reported were headache, nausea or upset stomach, cough and irritated throat \n\n\n18 percent sought medical care as a result of the sewage crisis \n\nRegarding impacts of the sewage crisis on daily life: \n\n80 percent said their quality of life has been negatively impacted   \n\n\n65 percent took extra steps to avoid certain areas like river water and beach water \n\n\n71 percent said they could smell sewage inside their home, outside their home and in their neighborhood  \n\n\nOf those that could smell sewage, nearly 70 percent said the sewage smell was strongest at night \n\n\n72 percent said they closed their windows to reduce the smell \n\n\n59 percent made some or many changes to their daily activities and routines due to the sewage crisis  \n\n\nMore than half decreased their time spent at beaches, outside or at parks  \n\n\n70 percent said the sewage crisis caused one or more disruptions to their household’s lives.  \n\nEffects on mental health: \n\n38 percent said their anxiety and worry increased \n\n\n59 percent said their overall stress increased  \n\nThe CASPER also revealed that 67 percent of households use bottled water or water from another source and 28 percent said they changed their drinking water source since the sewage crisis began. Another 71 percent said they do not believe tap water is safe. \nRegarding how people are receiving information, 55 percent said their most trusted source was the County health department followed by friends and family and their doctor. Social media was identified as the most useful source of information, at 57 percent. \nOngoing collaboration and actions \nThe County is leading collaboration with multiple agencies and bringing them together for regular meetings to address air and water issues related to the Tijuana River Valley crisis.  \nBased on assessment results, the County has identified the following priority actions to address with collaborating partners.  \n\nCommunication: Share health and resource information in multiple formats including social media and via community outreach workers.   \n\n\nDrinking Water: Educate the community about how drinking water is tested and kept safe.   \n\n\nMental Health Concerns: Promote mental health services and resources. \n\n\nHealthcare Providers: Update providers on surveillance activities and ongoing projects.  \n\nPet Concerns: Engage with vets, hospitals and area animal organizations.  \n\nMore actions around the crisis \nThe CASPER survey is not the only assessment addressing sewage contamination in the County’s south region.  \nThe federal Assessment of Chemical Exposure (ACE) survey from the CDC’s Agency for Toxic Substances and Disease Registry (ATSDR) was completed in November 2024. It asked 2,150 San Diegans who live, work or play around the Tijuana River Valley and South San Diego County about the effects of being near the sewage contamination. ACE survey results should be available in the next couple of months. \nFollowing formal requests from local congressional delegations, and months of discussions with the County, the ATSDR agreed to add another assessment, this time to monitor and analyze hydrogen sulfide in the air and its effects on people’s health.  This additional assessment could take about two years.  \nTo learn more about health concerns and impacts from sewage and pollution in the Tijuana River Valley and the CASPER survey, visit sandiegocounty.gov/southregionhealth.   \nMental health resources are available for anyone feeling emotionally affected by the Tijuana River Valley sewage crisis through the San Diego Access Crisis Line by calling 1-888-724-7240 or 988.   \nThe CASPER survey came after a County request in May 2024 to the California Department of Public Health asking for support in addressing Tijuana River Valley pollution. The County also formally reached out in June 2024 to the CDC’s National Center for Environmental Health requesting an investigation called an Epi-Aid into the Tijuana River Valley.  The Epi-Aid was verbally approved July 2024. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250116.16.01.11"}