{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Top County News Center Stories of 2024", "description": "Big elections, unprecedented floods, continued efforts to end homelessness and create housing, new public health challenges and a new County Chief Administrative Officer—there was a lot going on in San Diego County in 2024. Here’s a look at just a few of the most read and viewed topics and stories over the past year from our County News Center website.", "datePublished": "2025-01-03T11:15:26-08:00", "url": "https://www.countynewscenter.com/top-county-news-center-stories-of-2024/", "keywords": ["government", "emergency response", "floods"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2025-01-03T16:43:23-08:00", "articleType": "article", "articleContent": "\nReading Time:  4 minutesBig elections, unprecedented floods, continued efforts to end homelessness and create housing, new public health challenges and a new County Chief Administrative Officer—there was a lot going on in San Diego County in 2024.\nHere’s a look at just a few of the most read and viewed topics and stories over the past year from our County News Center website, which keeps you up to date on the big issues the County deals with. This is the news that caught your eyes and attention.\nElections\nPresidential elections are always big news. And they always generate lots of information from the County Registrar of Voters—and lots of readers and viewers.\nBetween the Presidential Primary elections in March, and the Presidential General elections in November, the County published more than 30 County News Center stories and videos. They ranged from letting voters know when voter pamphlets and then ballots were being mailed to their homes; to information about how to register; information about when and where Vote Centers were open; the locations of hundreds of secure ballot drop-off boxes; reminders to vote early; invitations to act as poll workers; and even a behind-the-scene video explaining what happens to voters’ ballots when they’re collected.\nNot surprisingly, the stories that racked up the most views and ranked among the most read stories of the year were about when voters could expect to see the presidential election results—in both the primary and general elections.\nTwo other election stories that caught readers’ eyes happened in October. The first story was about the County placing more than 150 red-white-and-blue ballot drop-off boxes, and posting their locations, around the county. The second was about the County opening the first 39 Vote Centers—a number than swelled to more than 200 in the days before the Nov. 5 general election.\nEmergency Response\nOn Jan. 22, 2024, the county was drenched by torrential rains that led to unprecedented flooding in San Diego County. From the time the rains were just starting through the early weeks of June, the County produced more than 40 stories and videos to help residents and those who suffered from the floods. Just some of the things those stories covered were to update the public on the latest information they needed.\nThose included: proclaiming a local emergency; inspecting damage and providing residents with surveys to assess their damage; letting people know where and when the Local Assistance Center was opening; where people could get sandbags and how to stay safe as new rains approached; and how the County was collecting hazardous waste and helping remove debris.\nThey also included stories as recovery kicked in about how the County was extending expanded help; about how the County’s Emergency Temporary Lodging provided hotel rooms; how CalFresh was providing food and the Local Assistance Center helped mental health support; and about how the County had qualified for state relief funds to help them.\nHomelessness and Housing\nHomelessness and housing have been big issues for the County for the past several years. That continued in 2024. The County worked to create more affordable housing, keep people from becoming homeless and help those who were experiencing it find permanent shelter. Those efforts worked to help especially the most vulnerable: families with low incomes, the elderly, foster youth, veterans and people with disabilities.\nTwo of the most viewed stories on the County News Center last year included innovative programs to address these important issues, the County’s new affordable housing mapping tool and a program to help first-time homebuyers.\nIn August, the County’s Housing and Community Development Services opened applications for seniors, families with low-incomes and disabled people living through homelessness who wanted to rent in three new affordable housing developments; in Escondido, San Marcos and Vista. In May, the County reached a milestone in finding new ways to address the housing crisis. It celebrated the grand opening of affordable senior housing built on excess County-owned land in Linda Vista—the Levant Senior Cottages. The project is scheduled to be the first of 11 such projects on excess County property.\nThe County also broke ground in February to create a new, long-term affordable housing development—the SkyLINE development—in Rancho Bernardo. And the County expanded the pilot Shallow Rental Subsidy Program it created in 2023 to help some low-income older adults avoid homelessness. The program pays $500-a-month subsidies directly to landlords to help keep these seniors in their homes.\nHealth\nPublic health issues always seem to be in the news and 2024 was no exception. The County warned and informed the public about numerous issues—stories that you made some of the most-read last year. They ranged from environmental to health warnings. There was the state-ordered citrus quarantine in Fallbrook in September. And there were health warnings about listeria in dairy products, surprising cases of travel-related measles, E. coli in walnuts and illnesses related to imported oysters.\nA couple of the most widely read stories last year involved the County’s first-ever—then second—case of “locally acquired” dengue fever. There have been cases of tropical dengue fever in San Diego County for years. But people always got sick while traveling outside the U.S. and returning to the County. They never got infected here, “locally.” That was because we didn’t have the kinds of mosquitoes in San Diego County that could transmit the disease by first biting an infected person and then biting someone else. That changed in 2014 when invasive Aedes mosquitoes arrived in San Diego County. And last year, for the first time, Aedes mosquitoes in San Diego County bit people who had returned home after traveling and getting infected outside the U.S. And those mosquitoes then spread dengue to three other people here locally. That prompted County Vector Control to conduct spraying to knock down mosquito populations Vista and Escondido to keep dengue from spreading near those local cases. Vector Control also conducted hand-spraying in Oceanside and Mt. Hope neighborhoods after people who got dengue traveling out of the U.S. were found near Aedes mosquitoes there.\nEbony Shelton Chosen as new County of San Diego Chief Administrative Officer\nThe County itself made news last year when it chose a new permanent Chief Administrative Officer for the first time in 12 years. In October 2022, Helen Robbins-Meyer, who had led the County as CAO for 10 years, announced she planned to retire, but would stay while a search was conducted for her successor.\nIn January 2024 the County Board of Supervisors chose Sarah Aghassi, the general manager of the County’s Land Use and Environment Group, to serve as interim Chief Administrative Officer.\nThen, in June the Board voted unanimously to hire Ebony Shelton, who had served as the County’s Chief Financial Officer for the previous four years, to become the County’s new permanent Chief Administrative Officer. Shelton, who has been with the County for nearly 30 years, became the first Afro-Latina in County history to become Chief Administrative Officer.\nFor more information about everything the County of San Diego is doing—and keep up with all the big news in 2025—go to the County News Center.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250103.11.15.26"}