{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Approves Plan to Offer Alternatives to Incarceration", "description": "People accused of low-level, non-violent crimes will be redirected away from jails. The County Board of Supervisors approved this major shift in direction with the Alternatives to Incarceration plan.", "datePublished": "2023-05-26T09:27:48-07:00", "url": "https://www.countynewscenter.com/county-approves-plan-to-offer-alternatives-to-incarceration/", "keywords": ["government", "alternatives to incarceration", "crisis stabilization unit", "housing connections", "mental health", "mobile crisis response teams", "public safety group", "safety through services", "sobering services", "substance use disorder"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-05-26T09:27:48-07:00", "articleType": "article", "articleContent": "\nPeople accused of low-level, non-violent crimes will be redirected away from jails. The County Board of Supervisors approved this major shift in direction with the Alternatives to Incarceration plan. It addresses those with mental health issues, substance use disorder, and homelessness by working to meet the needs of at-risk individuals with services instead of sending them to jail.\nThe San Diego Association of Governments (SANDAG) released a final report outlining “A Data-Driven Approach to Protecting Public Safety,” which looked at booking trends in County jails, analyzed data to answer questions about why jail populations dropped during the pandemic and used information from the community to assess how to better meet the needs of this group.\n“I appreciate the work that went into studying alternatives to incarceration and programs that provide for public safety while reducing returns to custody for individuals who commit low-level offenses,” said Sheriff Kelly Martinez. “I am committed to keeping our communities safe and dedicated to working with regional and county partners on best practices, balancing incarceration, reentry programs, substance use and mental health treatment in ways that make sense.”\n“Dangerous criminals should be in jail, homeless people should be in homes, and sick people should be in treatment,” said Board of Supervisors Vice-Chair Terra Lawson-Remer. “This is about breaking the cycle between the streets and incarceration, and this approach will help us do a better job of getting people off the streets and keeping them off for good.”\nActions approved by the Board of Supervisors this week include:\n\nInvesting in existing mental health programs: Expanding the Mobile Crisis Response Team, Crisis Stabilization Units, and sobering services and evaluating the data from these programs\nMeeting the immediate needs of people leaving jail: Launching a “Connections Points” pilot program which includes support like food, clothing, phones, and transportation\nProviding ongoing support with case management, care coordination, and housing to meet the medium-term needs of those exiting detention\nKeeping a roof over people’s heads: Expanding housing options that are easy to attain, and providing transportation to ongoing care\nStarting housing connections early: Adding housing-focused correctional counselors in jails\nLaunching a re-entry to job market  employer and applicant outreach program\nProactively connecting to services: Enrolling justice-involved individuals in benefits for which they are eligible\nMonitoring to increase effectiveness: Creating a collaborative and ongoing structure to monitor, evaluate, and support alternatives to incarceration services\n\nYou can read the entire Alternatives to Incarceration final report here.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230526.09.27.48"}