{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Annual Report Shows We Are Better Together", "description": "The County released an Annual Report Monday that listed numerous accomplishments and stated that the County, the public it serves, local cities, community groups and organizations are better when they work together.", "datePublished": "2023-10-02T15:16:13-07:00", "url": "https://www.countynewscenter.com/san-diego-county-annual-report-shows-we-are-better-together/", "keywords": ["government", "annual report", "climate action", "community engagement", "enhancing communities", "equity", "healthy and safe communities", "homelessness and affordable housing", "housing", "investing in working families", "justice reform", "mental health and substance use support", "sustainability", "sustainability and addressing climate change"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-10-02T15:16:13-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego released an Annual Report Monday that listed numerous accomplishments and stated that the County, the public it serves, local cities, community groups and organizations are better when they work together.\n“In San Diego County we are better together,” County Chief Administrative Officer Helen Robbins-Meyer stated in the report. “This collective dedication to strengthening San Diego County has led us to take on the region’s most pressing issues together. From affordable housing and climate change to sustainability, public and behavioral health, justice reform and homelessness, our collaboration and your input are at the critical center of any success.”\nThe Annual Report provides a snapshot of what the County has accomplished in the past year and the goals it hopes to attain. And it cited numerous achievements.\nThe County added more funding to the millions of dollars it had already spent to add new affordable housing and working with cities to break ground on new projects. It found new ways to challenge homelessness, like creating Safe Parking sites and launching a pilot Shallow Subsidy program to pay subsidies to keep older adults in their homes. It improved emergency medical services in rural areas and continued to add firefighting resources to protect San Diegans.\nIt continued to improve behavioral health by expanding Mobile Crisis Response Teams and Crisis Stabilization Units. And it continued to act to improve justice reform. It increased alternatives to incarceration through substance use disorder programs and job training. And it built a “One Safe Place” justice center in North County for survivors of abuse and trauma, with plans to build another in South County in the coming year.\nThe County of San Diego provides services and programs that touch the lives of nearly every person in the region.\nSome of those include law enforcement through the Sheriff’s Department, health and social services, public health services, and land use in the unincorporated areas. The County also runs elections regionwide, monitors beach water quality and operates County parks and 33 public libraries.\nThe Annual Report broke the County’s accomplishments and goals into six categories. Those were: Healthy and Safe Communities; Homelessness and Affordable Housing; Investing in Working Families; Justice Reform; Mental Health and Substance Use Support; and Sustainability and Addressing Climate Change.\nOther highlights from the Annual Report include: \n\nIn the past year, the County worked with cities, companies, groups and communities to complete, open or break ground on more than 1,400 new affordable homes and living spaces. Those included grand openings in San Marcos, Chula Vista and San Diego’s City Heights, Linda Vista and Valencia Park neighborhoods. And the County broke ground in Oceanside, San Marcos and Carlsbad, along with Clairemont Mesa, Nestor, Little Italy and other San Diego neighborhoods.\nIn July, the County approved using $44.3 million in state Behavioral Health Bridge Housing Program funds to provide more housing for San Diegans who have serious behavioral health conditions and are experiencing homelessness.\nThe County continued to work on a Housing Blueprint. It will aim to curb the region’s housing crisis by finding ways to build more housing overall, and housing around transit hubs; build and retain affordable housing; reduce housing prices overall; and help people stay in their existing homes.\nTo help bridge the “digital divide,” the County’s 33 branch libraries, using a $4.3 million federal grant, added something new to the books, movies and music they lend to children and families—7,000 Chromebook computers and hotspots to provide internet access. The County also gave free computers to some local families who open their homes to foster children, continuing a program it started in 1999.\nCountywide, the County Sheriff’s department introduced a new “Hi-Low” siren system in patrol cars to make it easier to warn residents when they need to evacuate because of an emergency like a wildfire.\nCounty Fire and CAL FIRE added a new Type 1 firefighting helicopter that can drop about seven times more water than existing County fire choppers to the firefighting fleet.\nThe County broke ground on a new East Otay Mesa fire station. And it added water tanks and backcountry helicopter hydrants in Fallbrook, San Marcos, Julian and El Cajon, with plans to add them in Fallbrook, and Warner Springs, to give firefighting helicopters more water sources to use when fighting rural wildfires.\nTo help people successfully reenter society, County Probation used $1.2 million from the state to create two mobile probation centers. Those centers can deliver case management, outreach and links to care and assistance to vulnerable clients wherever they may be.\nThe County also dedicated $10 million to expand support and services to help justice-involved people return to their communities. The money aims to help people who have a history of behavioral health needs, are homeless or at risk of becoming homeless.\nTo help prevent overdose deaths, particularly the scourge of fentanyl deaths, the County expanded giving naloxone-treatment kits to sheriff’s deputies, first responders and people who may be at risk of overdose or know someone who is. The County also put up its first naloxone vending machines in facilities around the county, making it available to anyone who wants the overdose-reversing medicine for free.\nThe County continues working on a regional decarbonization framework. That effort could potentially help cities, communities, Native American tribes, businesses, community groups and others achieve zero-carbon emissions by mid-century.\nTo reduce greenhouse gases, the County will spend $2.5 million to design a new Zero Carbon Portfolio Plan for County operations. The plan’s goal is to reduce greenhouse gas emissions in County facilities by 90% by 2030.\nThe County will spend $2.7 million to restore land and improve water quality in the Tijuana River Valley.\nThe County also plans to plant more than 5,000 more trees on County properties and another 5,000 throughout the county to help naturally remove carbon dioxide from the air and lower temperatures.\n\nTo see the full Annual Report, go to the County’s Annual Report webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231002.15.16.13"}