{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Avoid Holiday Scams and Thieves at Home", "description": "Don’t let your guard down during the holiday rush. Protect yourself from the real-life Grinches – burglars and fraudsters – looking to ruin your presents and plans. The San Diego Sheriff’s Department and District Attorney’s Fraud Division are reminding people of important safety tips as you make your final holiday preparations.  ", "datePublished": "2022-12-16T15:13:07-08:00", "url": "https://www.countynewscenter.com/avoid-holiday-scams-and-thieves-at-home/", "keywords": ["public safety", "crime prevention", "san diego county sheriff s department", "san diego district attorney s office"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-12-16T15:14:17-08:00", "articleType": "article", "articleContent": "\nDon’t let your guard down during the holiday rush. Protect yourself from the real-life Grinches – burglars and fraudsters – looking to ruin your presents and plans. The San Diego Sheriff’s Department and District Attorney’s Fraud Division are reminding people of important safety tips as you make your final holiday preparations.\nAt Home\n\nAlways lock your doors and windows especially at night and when you’re away.\nAvoid opening doors to strangers.\nPlace gifts where they cannot be seen from outside your home.\nAfter opening presents, don’t pile up empty gift boxes outside. This gives burglars a hint of expensive items in your home. Instead, fold the boxes and break them up flat inside the recycling bin.\nIf you see someone casing your alley or neighborhood, report suspicious activity to the Sheriff’s non‐emergency line at (858) 565‐5200.\n\nOnline Shopping \n\nUse one credit card for all online purchases to avoid exposing other cards.\nDo NOT click on links from unsolicited emails. Go to the website instead.\nMake sure the website is legitimate and secure. Check for the lock icon in the address bar, and make sure the address begins with https.\nMake sure the computer you are using has an updated anti-virus protection.\nAvoid using a public computer.\nAvoid using open Wi-Fi for financial transactions.\nDo not trust sellers who ask you to pay with a wire transfer or prepaid debit cards.\nNever email personal information, legitimate online marketplaces will not ask you for personal information via email.\nIf buying or selling items online which require you to meet in person at some point, make sure to meet in a public, well-lit space during normal business hours.\nBe careful of online deals that are too good to be true. They often are.\n\n\nPackage delivery\nSchedule package deliveries when you are going to be home, but if it is not possible, consider the following suggestions:\n\nLeave special instructions to the delivery person to put the package in a backyard, or somewhere where it’s not visible from the street.\nRequire that the delivery driver get a signature for the package (from a trusted neighbor).\nTrack the package.\nSign up for email or text message alerts with estimated delivery times.\nHave the postal services or shipping service hold your package at their pick-up facility so you can pick it up in person at your convenience.\nIf purchasing from a large retailer, request that your package be delivered to a local branch or store so you can pick it up in person.\nGet to know your carriers.  If there’s been a problem of thefts in the past, tell them about it.\nInsure your packages.\nAsk a neighbor or retired relative (who is home) if they will accept your package for you at their home.\nHave the package delivered to your workplace if it is permitted.\nBuy a locking mailbox big enough for packages.\nConsider installing a camera security system that photographs people who come to your door and allows you to communicate with them without opening the door or being home.\n\nWhen Going on Vacation\n\nLock up your home and activate your alarm.\nDon’t share your plans on social media.\nSign up for a free vacation check by Sheriff’s Senior Volunteer Patrol (SVP) members who can keep an eye on your home. Visit sdsheriff.net/patrol for a Sheriff’s Station and Substation near you.\nHold the delivery of your mail and newspaper or ask a trusted friend to pick them up for you.\nAsk a neighbor to occasionally park in your driveway.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221216.15.13.07"}