{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Kicks Off 2022 Cool Zones Program", "description": "The County of San Diego on Wednesday kicked of its 2022 Cool Zones program to help San Diegans beat the heat this summer.", "datePublished": "2022-06-01T17:04:58-07:00", "url": "https://www.countynewscenter.com/?p=208679", "keywords": ["health", "cool zones", "extreme heat"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-06-02T16:03:13-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego on Wednesday kicked off its 2022 Cool Zones program to help San Diegans beat the heat this summer. Cool Zones are free, air-conditioned locations, available throughout the region, where people can go to escape extreme temperatures.\nA list of Cool Zones locations is available online. People can enter their address once they navigate to the map and it will show locations near them. Residents can also call 2-1-1 to find a location.\nExcessive heat can be particularly dangerous for seniors and children, and they are advised to seek shelter in cool locations when temperatures rise. Working or exercising outside on a hot day, or staying in an overheated place for too long can cause heat-related illnesses, including cramps, exhaustion and heatstroke.\nAn extremely high body temperature (103 degrees or higher), dizziness, nausea, confusion, and headache are signs of heatstroke or exhaustion. If someone shows these signs, call 9-1-1 and begin cooling the person immediately.\nSan Diegans who are unable to get to a Cool Zone on their own can call 2-1-1 to request transportation to a location free of charge.\nIn addition to Cool Zones, the County, in partnership with San Diego Gas & Electric, provides free electric fans to San Diegans who are living on limited incomes.\nTo be eligible for the fan program, a county resident must not have access to an air-conditioned space at their home or apartment building. To learn more about the Cool Zones Fan Program or to request a fan, call 2-1-1.\nFor more information on the Cool Zones program as well as tips to stay cool at home, visit www.coolzones.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220601.17.04.58"}