{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Engage With Us About Gun Violence Reduction", "description": "The County of San Diego is seeking input from residents and community partners to better understand the impact of gun violence on our communities. ", "datePublished": "2023-01-17T14:04:00-08:00", "url": "https://www.countynewscenter.com/engage-with-us-about-gun-violence-reduction/", "keywords": ["public safety", "engage san diego county", "gun violence reduction", "public safety group", "survey"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-01-17T15:01:16-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego is seeking input from residents and community partners to better understand the impact of gun violence on our communities.  The Gun Violence Reduction Advisory Group is conducting a survey to:\n\nBetter understand the scope of gun violence in the region and the communities most affected\nIdentify resources within our communities and best practices in gun violence prevention, intervention, and aftercare\nIdentify gaps and challenges to reducing gun violence and community concerns\nExplore potential solutions our communities would like to see to reduce gun violence\n\nThe survey was designed to gather the community’s thoughts, experiences and perspectives around gun violence. For context, gun violence refers to all types of gun violence, including suicide; family, domestic partner, and intimate partner violence; and community violence.\nTo complete the Gun Violence Reduction Survey, visit the Engage San Diego County site and click on the orange gun violence reduction project logo. You can also go directly to the survey here.\nThe Gun Violence Reduction Project is already listening to feedback.  Seven Community Listening Sessions have been hosted throughout the County.  Two additional sessions were held in partnership with youth-serving organizations. Sessions were attended by more than 300 people wanting to discuss gun violence in their communities.\nFor more information about the Gun Violence Reduction Project, visit https://www.sandiegocounty.gov/content/sdc/public_safety/gun-violence-reduction-project.html.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230117.14.04.00"}