{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Parks Fees to Increase Slightly Next Month", "description": "Some user fees at County Parks will increase slightly for camping, parking, fishing permits, boating rentals, and sport facilities starting Feb. 18. ", "datePublished": "2025-01-17T15:47:18-08:00", "url": "https://www.countynewscenter.com/parks-fees-to-increase-slightly-next-month/", "keywords": ["parks and rec", "county parks", "county parks and recreation", "fees"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2025-01-17T16:13:39-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteSome user fees at County Parks will increase slightly for camping, parking, fishing permits, boating rentals, and sport facilities starting Feb. 18.  It’s been a decade since fees were raised at County parks. \nThe increase helps Parks keep pace with rising costs while continuing to deliver best-in-nation outdoor and recreation spaces at a good value when compared to similar park systems. \nMost of the fee increases are a few dollars. For example, Day Use Parking will increase from $3.00 per day to $5.00 per day and an RV partial hook-up campsite will increase from $29 to $35. Revising the fees will also make things simpler by including up to two pets and one extra vehicle as part of your camping reservation.\nIn addition, Parks has programs to expand access to the outdoors and reduce financial barriers, including veteran, senior and group discounts as well as scholarships and the free First Time Camping Program. \nCounty Parks & Recreation services enhance the quality of life for County residents and visitors. They promote health and wellness and safe communities through thousands of programs for all ages and abilities, including 158 facilities across more than 58,000 acres of land and 389 miles of trails.\nFor more information, please visit the Q&A on the Department of Parks & Recreation website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250117.15.47.18"}