{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches Electric Vehicle Consumer Guide", "description": "Looking to help County residents who are thinking about buying an electric vehicle, the County of San Diego has created a new Electric Vehicle Consumer Guide website with information about benefits, costs, incentives — even a link to start shopping for vehicles.", "datePublished": "2021-07-06T14:07:19-07:00", "url": "https://www.countynewscenter.com/county-launches-electric-vehicle-consumer-guide/", "keywords": ["environment", "charging stations", "consumers", "electric vehicles", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-07-06T14:52:06-07:00", "articleType": "article", "articleContent": "\nLooking to help County residents who are thinking about buying an electric vehicle, the County of San Diego has created a new consumer guide website with information about benefits, costs, incentives — even a link to start shopping for vehicles.\nThe County’s Electric Vehicle (EV) Consumer Guide is the latest product of the EV Roadmap that the County’s Board of Supervisors approved in 2019 to build charging stations, encourage people to buy electric vehicles, and reduce greenhouse gas emissions. The County Board of Supervisors also voted in January to work with UC San Diego to create a strategy to move the region to zero-carbon emissions by 2035.\n“Electric vehicles could help our region move toward that zero-emission goal,” County Board of Supervisors Chair Nathan Fletcher said. “And electric vehicles are not science fiction, they’re a viable option for people. This EV Consumer Guide website has all the information people need to help them decide if driving an electric car is the right option for them.”\nThe website gives people a single spot where they can get a wealth of information about a wide range of topics, including:\n\nThe environmental and financial benefits of owning a “zero-emission” vehicle, specific to the San Diego region.\nThe different types of zero-emission vehicles, which include all-electric vehicles powered by on-board batteries; plug-in hybrid-electric vehicles like Ford’s Escape PHEV that run primarily on electricity but have backup gas-powered systems; and hydrogen-cell vehicles.\nInformation about pre-owned electric vehicles.\nA fuel-cost comparison calculator.\nLocations of EV charging stations.\nPermit requirements and information for installing charging stations for homes, apartments, condominiums, and businesses.\nLinks to financial incentives for buying a zero-emission vehicle.\nResources to understand vehicle models and different types of charging systems\nA link to an interactive tool through Plugstar, a website created by the nonprofit Plug In America, to help consumers identify the zero-emission vehicle options that fit their needs — to match their budget, the number of miles they need to drive between charges, number of seats, etc.\nAnswers to frequently asked questions about electric vehicles.\nA link to a vehicle search and comparison tool, also from Plugstar, where people can find the cars they want and the local dealers who carry them.\n\nThe County’s Department of Planning & Development Services developed the website to support the County’s commitment to increasing the numbers of electric cars on the road, to protect the public’s health and safety, sustain the environment in its climate action work and improve residents’ and visitors’ quality of life.\nThe EV Consumer Guide gives people one spot where they can find everything they need to know about buying an electric vehicle — without ever having to leave their garage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210706.14.07.19"}