{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Increase in Mpox Cases", "description": "County public health officials are reporting seven new Mpox cases in May and June and encouraging vaccinations ahead of summer festivals and events.    ", "datePublished": "2024-06-25T12:26:56-07:00", "url": "https://www.countynewscenter.com/county-reports-increase-in-mpox-cases/", "keywords": ["health", "jynneos", "mpox", "mpox vaccines"], "author": [{"type": "@Person", "name": "Fernanda Lopez Halvorson", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Fernanda Lopez", "familyName": "Halvorson"}], "dateModified": "2024-06-25T12:26:56-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesCounty public health officials are reporting seven new Mpox cases in May and June and encouraging vaccinations ahead of summer festivals and events. \nThe rise in cases mirrors increases in Los Angeles which recently reported 10 new cases.  \nSo far this year, the County has reported an average of one to two new Mpox cases per month. Four of the recent cases were among people who had not been vaccinated against Mpox.  \n“It’s important for people to get both doses of the JYNNEOS vaccine to protect themselves against the Mpox virus,” said County Interim Public Health Officer Dr. Ankita Kadakia, M.D. “We know the summer brings more opportunities for events and festivals that could increase the spread of Mpox, so now is a great time to get the vaccine or finish both doses and encourage friends to do the same.” \nThe global Mpox outbreak in 2022 mostly affected people within the LGBTQ+ community but anyone can get Mpox as it is a virus that is spread through close physical contact with someone who has Mpox.  \nMpox infections usually cause rashes or sores throughout the body that can last for two to four weeks. Rashes can happen in sensitive areas and can be extremely painful. Often, but not always, people with Mpox experience flu-like symptoms before the rash or sores appear.  \nThe JYNNEOS vaccine provides protection against Mpox and is available at County public health clinics. People can also talk to their healthcare provider, visit myturn.ca.gov or call 211 for help finding the vaccine.  \nPeople who have received only one dose of the JYNNEOS vaccine should get their second dose 28 days later for maximum protection. If past the 28 days, people should get the second dose as soon as possible. \nOther Ways to Protect Yourself From Mpox: \n\nAvoid close skin-to-skin contact with others who have a rash, blisters or scabs. \nAvoid objects or materials used by a person who has Mpox. \nWash your hands often with soap and water especially before eating or touching your face. \nWatch for symptoms for 21 days after exposure and visit a healthcare provider.  \n\nFor more information about Mpox including resources, local cases and more, visit sandiegocounty.gov/mpox. You can also sign up to receive weekly updates by texting COSD MPOX to 468-311. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240625.12.26.56"}