{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "International Overdose Awareness Day", "description": "The 1,300 purple flags placed in the Waterfront Park’s lawn illustrate a grim reality. Today, Aug. 31, is International Overdose Awareness Day. Each flag represents a life that was lost in 2022 to an overdose death here in San Diego County.", "datePublished": "2023-08-31T15:48:04-07:00", "url": "https://www.countynewscenter.com/international-overdose-awareness-day-2/", "keywords": ["health", "fentanyl", "international overdose awareness day", "naloxone", "opioids", "overdose deaths"], "author": [{"type": "@Person", "name": "Anita Lightfoot", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Anita", "familyName": "Lightfoot"}], "dateModified": "2023-08-31T16:42:57-07:00", "articleType": "article", "articleContent": "\nThe 1,300 purple flags placed in the Waterfront Park’s lawn illustrate a grim reality. Today, August 31, is International Overdose Awareness Day. Each flag represents a life that was lost in 2022 to an overdose death here in San Diego County. The deaths are across all socio-economic levels and most age groups, with the youngest being 15 years old and the oldest 72.\nIn observance of the day, County leaders, behavioral health and public health professionals, emergency department personnel and public safety experts joined families of overdose victims to reinforce the message that overdose deaths are preventable and the disparaging stigma associated with drug-related deaths needs to be eliminated.\nThe County offers numerous prevention and treatment programs across the region. People seeking help should call the San Diego County Access and Crisis Line 888-724-7240 or the national Suicide and Crisis Lifeline at 988. These resources are available 24 hours a day, seven days a week and can provide help in up to 200 different languages.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230831.15.48.04"}