{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Invites Public to Events Celebrating Pollinator Week", "description": "Birds do it, bees do it, and without them and all the other pollinators in our world, life as we know it wouldn’t exist ― no flowers, no food, no terrestrial ecosystems. That’s why the County of San Diego's Department of Agriculture, Weights and Measures (AWM) wants to help people celebrate National Pollinator Week!", "datePublished": "2022-06-21T12:37:31-07:00", "url": "https://www.countynewscenter.com/?p=208796", "keywords": ["environment", "beekeeper", "beekeeping", "lueg", "national pollinator week", "pollinators", "sustainability", "sustainable communities"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2022-06-21T16:11:28-07:00", "articleType": "article", "articleContent": "\nBirds do it, bees do it, and without them and all the other pollinators in our world, life as we know it wouldn’t exist ― no flowers, no food, no terrestrial ecosystems.\nThat’s why the County of San Diego and its Department of Agriculture, Weights and Measures (AWM) want to help the public celebrate National Pollinator Week through June 26!\nStarting Tuesday, AWM will have an interactive display up for visitors from 8 a.m. to 5 p.m. in their office lobby, located at 9325 Hazard Way in San Diego, where people can learn more about pollinators.\nAt 10 a.m. Friday June 24, the department and master gardeners from the University of California Cooperative Extension will host a pollinator presentation for the public at the Demonstration Garden at the County Operations Center.\nAnd Friday night, the County Administration Center will be lit to honor the most famous pollinators of all ― bees ― and their keepers!\nNational Pollinator Week is held every year the world over to support pollinator health. The U.S. Senate’s unanimous approval and designation of a week in June as National Pollinator Week was a needed step to addressing the issue of declining pollinator populations. The week gives scientists and the public a special week to celebrate pollinators and spread the word about what we all can do to protect them.\nRoughly 75% of all flowering plant species need animal pollinators to reproduce.\nAWM supports local farmers and the County’s $1.8 billion agriculture industry by protecting native plant habitat for pollinators including bees, butterflies, bats, moths and flies through programs that help prevent the introduction of invasive plants, pests and diseases.\nIn addition, AWM’s Apiary Program helps ensure the health and safety of managed bee colonies by inspecting apiaries and providing outreach about the importance of pollinators.\nYou can help pollinators by sharing Pollinator Week on your social media, building native bee houses, planting pollinator habitat in your yard and many other ways. For more information about how you can help, please visit pollinator.org, UC Cooperative Extension and AWM’s Apiary Program, or call AWM’s Bee Hotline at 1-800-200-BEES (2337).\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220621.12.37.31"}