{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Begins Improvements to Lakeside’s Lindo Lake County Park", "description": "The County has broken ground on $11.2 million of work to rejuvenate and improve Lakeside’s popular Lindo Lake County Park, including removing more than 200,000 tons of built-up sediment from the lake's east basin.", "datePublished": "2020-10-30T10:02:04-07:00", "url": "https://www.countynewscenter.com/county-begins-improvements-to-lakesides-lindo-lake-county-park/", "keywords": ["parks and rec", "county parks", "lindo lake", "lueg"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-10-30T10:04:02-07:00", "articleType": "article", "articleContent": "\nThe County has broken ground on $11.2 million of work to rejuvenate and improve Lakeside’s popular Lindo Lake County Park.\nImprovements at the 55-acre park will include building a new fishing pier and birdwatching stations, planting hundreds of native trees and improving water quality in the lake’s east basin by removing more than 200,000 tons of sediment — enough to cover nearly five football fields 12 feet high — that has built up over decades.\nCounty Supervisor Dianne Jacob and County Parks officials kicked off the start of construction last week with a socially distanced groundbreaking. Jacob, who is retiring in January after serving 27 years, has long championed efforts to rejuvenate the park.\n“Lindo Lake is a centerpiece for the Lakeside community,” Jacob said. “And this project has been worked on for many, many years, probably over 20 years … so this is a big, big project for Lakeside.”\nThe $11.2 Million in improvements are expected to be completed in spring of 2022 and are the first of what are expected to be two phases of improvements for Lindo Lake County Park.\nIn addition to the new fishing pier and two birdwatching stations, the first phase will add new walking paths and three new lake-viewing areas with seating, all accessible to people with disabilities.\nThe project will also restore roughly 12 acres of native terrestrial habitat surrounding the park’s east basin, in part by planting more than 260 trees.\nHowever, the largest piece of the park’s restoration will be the work to rejuvenate the east basin of Lindo Lake itself. That will include removing hundreds of tons of sediment to deepen it, adding more water and installing aeration systems to keep the water oxygenated and healthy, and adding nearly 100 fish habitat and spawning systems to the basin’s bottom.\nLindo Lake is the only natural lake in San Diego County, and Lakeside was built around it in the 1800s. However, it was cut off from its natural source of replenishment in 1961 when a dam was built upstream on Quail Creek to create Lake Jennings. Over time, that has shrunk Lindo Lake in size, split it into two basins, west and east, and deteriorated their water quality forcing it to rely upon urban and stormwater runoff from surrounding hillsides and groundwater.\nA second phase of improvements for the park is anticipated to start in the summer of 2022, pending approval of the County Parks department’s funding request in the next County budget.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201030.10.02.04"}