{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Closing Some Testing Sites, Still Plenty Testing, Treatment Available", "description": "Two state COVID-19 testing and treatment sites in San Diego County are scheduled to close in the next two weeks, and the state plans to close the remaining four here by Feb. 25 because of declining demand. However, County public health officials said there are still plenty of places and options for San Diegans to get testing and treatment. ", "datePublished": "2023-01-12T18:32:13-08:00", "url": "https://www.countynewscenter.com/?p=210495", "keywords": ["health", "coronavirus", "covid-19", "covid-19 testing", "flu", "influenza", "respiratory surveillance report", "rsv"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2023-01-13T08:13:05-08:00", "articleType": "article", "articleContent": "\nTwo state COVID-19 testing and treatment sites in San Diego County are scheduled to close in the next two weeks, and the state plans to close the remaining four here by Feb. 25 because of declining demand. \nHowever, County public health officials said there are still plenty of places and options for San Diegans to get testing and treatment. \nThe state-supported testing/treatment site in Escondido is scheduled to close this week and the one in El Cajon is scheduled to close the following week, both because so few people are going to them for tests. The state closed its National City testing site last week for the same reasons. San Diegans can still get tested at three County-contracted sites, local pharmacies and their healthcare providers, as well as at the four remaining local state sites until they close Feb. 25. \nPeople can also get free COVID-19 home tests at the County’s six Public Health Centers, many local libraries—check with your library to see if they have them—and from the federal government by mail. \n“We want all San Diegans to know that there are lots of options to get tests, be tested, get treatment, and get vaccinated, no matter where you are in the county,” said County Public Health Officer Wilma Wooten, M.D., M.P.H. “If you feel symptoms and want to get tested for COVID-19 and find treatment, if you are positive, or if you just want to have COVID-19 home tests available as a precaution, access is available and you have options.”\nCOVID-19 cases decreased slightly this week. However, health officials are still monitoring wastewater testing and say they are seeing increasing levels of the virus, which may be a sign of a possible surge in cases. Flu cases and Respiratory Syncytial Virus infections both continue to decline. \nCounty health officials continue to urge people to get vaccinated and boosted if they haven’t already to protect themselves. COVID-19 vaccines, including bivalent boosters, and flu vaccines are widely available at local medical providers and pharmacies. The County continues to offer vaccinations throughout the region.  Check online  for the days and hours sites will be open. \nPreventive Measures  \nIn addition to staying up to date with COVID vaccination, especially receiving a bivalent booster, and staying home when ill, San Diegans can take other precautions to protect themselves against COVID-19, as well as seasonal illnesses like the flu. These measures include: \n\nWashing hands thoroughly and often. \nStaying away from sick people. \nWearing a facial covering, especially in crowded indoor settings. \nRegularly cleaning commonly touched surfaces. \nConducting home testing when exposed or when ill. The federal government is providing free at-home COVID-19 tests available again through the winter for a limited time. Households can  order one pack of four free tests  through the U.S. Postal Service.  For more information about testing, go to the County of San Diego  COVID-19 testing webpage. \n\nCOVID-19 Vaccination Progress  \n\nMore than 2.69 million or 80.5% of San Diegans have received the primary series of one of the approved COVID-19 vaccines.  \nBivalent boosters administered: 538,060 or 21.6% of 2,496,758 eligible San Diegans.  \nMore vaccination information can be found at coronavirus-sd.com/vaccine. \n\nThe County Health and Human Services Agency now publishes the  Respiratory Virus Surveillance Report  weekly. The report is published each Thursday and tracks key respiratory illness indicators.  \n COVID-19 Data  \nFor the week ending Jan. 7, 2023, the report shows:  \n\n3,344 COVID-19 cases were reported to the County in the past seven days. The region’s total is now 970,479.  \nThe 3,344 cases reported in the past week were lower compared to the 4,684 infections identified the previous week.  \nTwenty-one additional deaths were reported were reported in the week ending  Jan. 7, 2023. The region’s total is 5,662.  \nSeventeen of the people who died were 65 or older.   \nFourteen of the people had been vaccinated and seven were unvaccinated or had not completed the primary vaccine series.  \nNineteen had underlying medical conditions. Two determinations of underlying medical conditions are pending.  \n\nInfluenza Data  \nFor the week ending Jan. 7, 2023, the report shows the following:  \n\nThree additional flu deaths; the season’s total is now 33.  \nAll had underlying medical conditions.  \nEmergency department visits for influenza-like illness: 4% of all visits (compared with 6% the previous week).  \nLab-confirmed influenza cases for the week: 338 (compared to 646 the previous week).  \nTotal lab-confirmed cases to date: 20,379 (compared to 1,389 at the same time last season and a 4,317  prior 5-year average during the same week).  \n\n More Information \nData updates to the  County’s coronavirus-sd.com website  will be published Thursdays around 5 p.m., with the exception of holidays. More information about the flu is available on the County’s influenza website.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230112.18.32.13"}