{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County-Funded Developments Benefit From New State Affordable Housing Grants ", "description": "Four affordable housing developments with $29 million in County funding have secured an additional $24.5 million through California’s Multifamily Finance Super Notice of Funding Availability program. ", "datePublished": "2023-02-17T13:18:14-08:00", "url": "https://www.countynewscenter.com/county-funded-developments-benefit-from-new-state-affordable-housing-grants/", "keywords": ["government", "affordable housing", "grant", "housing", "state funding"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-02-17T13:19:17-08:00", "articleType": "article", "articleContent": "\nFour affordable housing developments with $29 million in County funding have secured an additional $24.5 million through California’s Multifamily Finance Super Notice of Funding Availability program. \nThe $24.5 million in new funds were announced by Gov. Gavin Newsom as part of more than $825 million in grants to accelerate affordable housing production across the state. \n“This is such an exciting opportunity to expand the work we have already been doing to support more of our vulnerable San Diego neighbors and families,” said David Estrella, Director of County Housing and Community Development Services. “We continue to focus on building opportunity for the next generation and fulfilling the Board of Supervisor’s goal to produce 10,000 units by 2030.” \nThe four County-funded developments in the planning stages that are supported through the program will result in 359 units of affordable housing. The developments are Union Tower, The Iris at San Ysidro, Serenade on 43rd, and Rancho Bernardo Transit Village.  \n\nUnion Tower will be a 94-unit building serving low-income families in National City. It was awarded $11.5 million through the new program. \n\n\n\nThe Iris at San Ysidro will be a 100-unit development serving people experiencing homelessness with serious mental illness and low-income families. It was awarded an additional $5 million. \n\n\n\nSerenade on 43rd will provide 65 units for people experiencing homelessness, with and without a serious mental illness. This development was awarded another $3.7 million through the new program. \n\n\n\nRancho Bernardo Transit Village will provide 100 units for low-income families. It received an additional $4.4 million. \n\n\nSan Diego County Housing and Community Development Services helps more than 35,500 people live in safe affordable housing. As part of that housing, the department maintains nearly 7,600 affordable units in 109 developments throughout the County. More than 16,700 people call those units home. Currently, HCDS is helping fund 14 developments under construction, totaling 1,084 units, and 21 developments on the horizon, totaling 2,060 units. \nThese and other efforts are part of the County’s ongoing response to the region’s housing affordability crisis. Efforts are underway to create a roadmap, or Housing Blueprint, to guide our ongoing response. Community input has been vital to the County’s efforts to address the crisis to date and is encouraged to help inform final recommendations for the Blueprint’s goals and objectives and be presented to the Board of Supervisors.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230217.13.18.14"}