{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Monkeypox Vaccine: Who Is Eligible & Where They Can Get Vaccinated", "description": "The global monkeypox outbreak is occurring primarily in the gay, bisexual and other men who have sex with men. For the general public, the current risk of contracting monkeypox remains very low.", "datePublished": "2022-08-08T19:30:22-07:00", "url": "https://www.countynewscenter.com/?p=209184", "keywords": ["health", "monkeypox", "monkeypox vaccine", "monkeypox virus", "vaccine availability"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-08-10T14:06:07-07:00", "articleType": "article", "articleContent": "\n(Editor’s Note: A prior version of this article was updated on August 9, to clarify monkeypox vaccine eligibility and which medical providers received allotments.)\nThe global monkeypox outbreak is occurring primarily in gay, bisexual and other men who have sex with men. For the general public, the current risk of contracting monkeypox remains very low.\nWhile vaccination is an important component in containing the outbreak, the demand currently outweighs supply. The region receives monkeypox vaccine from the California Department of Public Health based on a statewide allocation formula.\nWho Is Eligible?\nGiven the limited vaccine supply at this time, the Centers for Disease Control and Prevention recommends the monkeypox vaccine for the population most at risk. These are people exposed to someone who has already been diagnosed with confirmed or probable monkeypox infection and those with immunocompromising conditions who are at greater risk of developing severe disease or complications if they contract the virus.\nWhere Did Recent Vaccine Allocation Go?\nThis week 1,550 vaccine doses were allocated to the region and have been sent to designated healthcare systems, federally qualified health centers and clinics in the region. For those eligible and who also have a referral from a healthcare provider, vaccines are available by appointment only:\n\nUC San Diego – Owen Clinic (200 doses)\nAIDS Healthcare Foundation Healthcare Center San Diego (200 doses)\nVista Community Clinic (200 doses)\nSan Ysidro Health Center (150 doses)\nFamily Health Centers of San Diego (100 doses).\n\nCounty Public Health Centers also have about 300 doses of vaccine available by appointment only and based on the eligibility criteria detailed above.\nWhere Is Testing Available?\nTesting is widely available through healthcare providers and involves using a swab to sample suspect skin lesions. People with no healthcare provider, who need testing, can call 2-1-1 to be referred to a provider. 2-1-1 is not presently providing vaccination appointments.\nWhat About Second Doses?\nThe monkeypox vaccine is a two-dose series, administered 28 days apart. Following guidance from the California Department of Public Health, given the low supply of vaccine, the County is presently recommending that first doses be administered to as many eligible people as possible. One dose of the monkeypox vaccine is 80% effective. Second doses will be administered when more vaccine is available.\n“Our goal is to get one dose into as many people’s eligible arms as possible,” said Wilma Wooten, M.D., M.P.H., County public health officer. “When we get more vaccine, we can start giving second doses for even higher efficacy.”\nSince late May, the County has received 4,687 doses of monkeypox vaccine. Of those, 3,251 have been distributed and 2,267 have been administered. The number administered might be higher because it takes a few days for the vaccine registry to be updated. As more doses are allotted to the region, the County will expand distribution.\nFor more information about monkeypox, including risk-reduction measures that those at risk can take, visit the County’s monkeypox website, which is updated at about 4 p.m. each weekday afternoon. To receive text messages about monkeypox, text COSD MONKEYPOX to 468-311.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220808.19.30.22"}