{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "FEMA Major Disaster Designation Made for San Diego County ", "description": "The Federal Emergency Management Agency has issued a Major Disaster Declaration for San Diego County due to the impact of the Jan. 22 storm. ", "datePublished": "2024-02-21T14:22:53-08:00", "url": "https://www.countynewscenter.com/fema-major-disaster-designation-made-for-san-diego-county/", "keywords": ["government", "1/22/24 rainstorm", "alertsandiego", "fema", "flood recovery"], "author": [{"type": "@Person", "name": "Sir Milo Loftin", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Sir Milo", "familyName": "Loftin"}], "dateModified": "2024-02-23T13:04:30-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteThe Federal Emergency Management Agency (FEMA) has issued a Major Disaster Declaration for San Diego County due to the impact of the Jan. 22 storm. \nFEMA will offer individual assistance to qualifying residents and businesses who were affected by the flooding from the storm. \nThe declaration comes after the County, several local cities and the State of California all declared local emergencies and asked FEMA for assistance. \nFEMA will offer Individuals and Households Program Assistance. The program provides financial assistance and direct services to eligible individuals and households who have uninsured or underinsured necessary expenses and serious needs. The financial assistance is intended to help meet basic needs and supplement disaster recovery efforts.\nLow interest loans will also be offered for households and small businesses through the Small Business Administration.\nIf you were impacted by the Jan. 22 flooding, you can apply for FEMA assistance by visiting disasterassistance.gov and clicking “Let’s Get Started.” \nYou can also call FEMA’s phone helpline at 1-800-621-3362 daily from 7 a.m. to 10 p.m. \nFEMA will also be opening a Disaster Recovery Center where San Diegans can get in-person assistance. Crews may also go door-to-door to help reach impacted residents. \nWhen you fill out the application you will be asked to confirm: \n\nYour zip code or state and city \nIf you had damage from the Jan. 22 severe storm and flooding \nYour area/county \n\nThe FEMA online application will have three sections: \n\nYou will confirm what damages or expenses you had from the flooding and what assistance you need. \nYou will be taken to login.gov where you can create a new account or sign into an existing account. \nYou will be returned to disasterassisstance.gov to complete your application and send it to FEMA. \n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20240221.14.22.53"}