{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Approves Move to Vote Center Model", "description": "The Board of Supervisors Tuesday unanimously approved having San Diego join 25 other counties statewide in implementing a vote center model, beginning with the June 2022 gubernatorial primary election.  ", "datePublished": "2021-10-19T18:27:14-07:00", "url": "https://www.countynewscenter.com/county-approves-move-to-vote-center-model/", "keywords": ["elections", "board of supervisiors", "california voter s choice act", "registrar of voters", "vote center model", "vote centers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2021-10-20T11:08:56-07:00", "articleType": "article", "articleContent": "\nThe Board of Supervisors Tuesday unanimously approved having San Diego join 25 other counties statewide in implementing a vote center model, beginning with the June 2022 gubernatorial primary election.\nThe California Voter’s Choice Act paved the way for counties to move from traditional polling places to vote centers when it was enacted in 2016.\nUnder the act, every active registered voter will automatically receive a ballot in the mail and will have options for how to return their ballot: by mail, to a secure ballot drop box, or vote in person at any vote center.\nThe concept won’t be entirely new to local voters. The Registrar of Voters used a similar format for the November 2020 presidential general and September 2021 gubernatorial recall elections. More than 200 voting locations opened throughout San Diego County and allowed voters four days to cast their ballot in person.\nThe vote-by-mail trend in California has reduced the use of traditional polling places, driving counties to the vote center model. Nearly 80% of the County’s 1.97 million registered voters are permanent vote-by-mail voters.\n“When the June 2022 election cycle rolls around, more than 13 million registered voters in California – nearly 62% of the state’s voters – will be using the vote center model,” said Interim Registrar of Voters Cynthia Paes. “Tuesday’s Board action will add San Diego County’s nearly 2 million registered voters to the mix.”\nThe number of vote centers is based on total voter registration. The law requires one for every 50,000 voters for 11 days and one for every 10,000 voters for four days.\nIn San Diego County, current registration figures mean a minimum of 197 vote centers would open for four days including election day. Forty of the 197 would open an additional seven days for a total of 11 days.\nThe County will ask for public input on the locations and will consider a variety of factors to ensure registered voters have equal opportunities to cast their ballot.\nThe new model also streamlines the election process for the Registrar’s office. Voters will no longer have an assigned polling place and can visit any voter center. Election workers at the vote centers will use state-certified electronic poll books to look up the same information available at the Registrar’s office. Polling places did not have this capability, requiring some voters to cast provisional ballots. Verifying provisional ballots can take two weeks or more after election day.\nVote center services will include:\n\nTouchscreen ballot marking devices with every ballot type\nVoting assistance, including assistance in multiple languages\nVoter registration allowing voters to cast a ballot the same day\nVoter registration updates\nRequest a replacement ballot\n\nThe Board also voted to fund secure mail ballot drop boxes throughout the County. Based on the number of current registered voters, the Registrar must provide 132 ballot drop-off sites starting 29 days before the election. Vote centers would also act as drop-off sites.\nFor additional information, visit sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211019.18.27.14"}