{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Flu Activity Slows with COVID-19 Preventative Measures in Place", "description": "While influenza activity in the region is currently lower compared to other recent seasons, cases for this season are higher than last, and County health officials continue to urge San Diegans to get vaccinated to prevent getting sick with the flu.", "datePublished": "2022-01-05T12:07:10-08:00", "url": "https://www.countynewscenter.com/flu-activity-slows-with-covid-19-preventative-measures-in-place/", "keywords": ["health", "flu", "flu vaccine", "influenza", "influenza vaccine"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-01-05T12:07:10-08:00", "articleType": "article", "articleContent": "\nWhile influenza activity in the region is currently lower compared to other recent seasons, cases for this season are higher than last, and County health officials continue to urge San Diegans to get vaccinated to prevent getting sick with the flu.\nThe County Health and Human Services Agency is reporting 139 lab-confirmed influenza cases for the week ending Jan. 1, a decrease from the previous week when 185 flu infections were reported.\nFlu numbers can vary week to week, but County health officials believe lower influenza case counts may be the result of state COVID-19 mask mandates and other preventive measures San Diegans are taking to fight the spread of COVID-19.\n“We’re seeing record numbers of COVID-19 infections in our community right now, and you don’t want to get the flu and COVID at the same time,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Get vaccinated against the flu as soon as you can. Every flu case prevented makes more resources available to defeat COVID-19, and means you’re not getting sick – or worse.”\nThe County Health and Human Services Agency publishes the weekly Influenza Watch report, which tracks key flu indicators and summarizes influenza surveillance in the region.\nFor the week ending Jan. 1, 2022, the report shows the following:\n\nEmergency department visits for influenza-like illness: 7% of all visits (compared with 5% the previous week)\nLab-confirmed influenza cases for the week: 139 (compared to 185 the previous week)\nTotal lab-confirmed cases to date: 1,185 (compared to 224 at the same time last season and a 2,820 prior 5-year average during the same week)\n\nHow to Prevent the Flu\nThe Centers for Disease Control and Prevention (CDC) recommends that everyone 6 months and older get a flu shot every year. It takes about two weeks for immunity to develop. The CDC also indicates you can get a flu and COVID-19 vaccination at the same time, including a booster dose. The coronavirus vaccine does not work against influenza and vice versa.\nThe flu vaccine is especially important for people at higher risk of having serious complications from the virus.\nThey include:\n\nPeople with chronic medical conditions like asthma, diabetes, and lung disease, even if symptoms are under control\nPregnant women\nPeople aged 65 years and older\nPeople who live with or care for others who are at higher risk\n\nThe influenza vaccine is available at doctors’ offices and retail pharmacies and is covered by medical insurance. People with no health care coverage can get vaccinated at one of the County’s six public health centers or a local community clinic. To find the nearest location, visit the County’s Flu Vaccine Locations page or call 2-1-1 San Diego.\nIn addition to getting vaccinated, people should also do the following to avoid getting sick:\n\nWash hands thoroughly and often\nUse hand sanitizers\nStay away from sick people\nAvoid touching your eyes, nose, and mouth\nClean commonly touched surfaces\nIf you are sick, stay home and avoid contact with others\n\nIn 2020, a total of 848 influenza cases were reported in San Diego, including two deaths. In 2019, a total of 108 San Diegans died from influenza and more than 20,700 flu cases were reported.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220105.12.07.10"}