{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: Flag Raising Ceremony Honors Abused and Neglected Children", "description": "A special flag is flying over the Polinsky Children’s Center to honor children who have died due to abuse, violence and neglect. ", "datePublished": "2021-04-23T17:08:22-07:00", "url": "https://www.countynewscenter.com/flag-raising-ceremony-honors-abused-and-neglected-children/", "keywords": [], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2021-04-23T17:08:22-07:00", "articleType": "video.other", "articleContent": "\nA special flag is flying over the Polinsky Children’s Center to honor children who have died due to abuse, violence and neglect.\nEach year, more than three million cases of child abuse are reported in the U.S. and more than 1,700 children die as a result of abuse and neglect. That’s an average of five children per day and the numbers have steadily increased over the last two decades.\nTo raise awareness about this issue, the County’s Polinsky Children’s Center, which provides temporary emergency shelter to children who must be separated from their families for their own safety, hosted a Children’s Memorial Day ceremony Friday morning. Attendees honored the victims of child abuse and neglect with a moment of silence.\nThe annual flag raising event is part of National Child Abuse Prevention Month, which provides the community with tools that help recognize the warning signs of abuse and neglect.\n“Everyone has a role to play in making sure our community is a safe place for children to thrive,” said Kimberly Giardina, Child Welfare Services director. “Even small gestures can make a big difference, including words of encouragement to a struggling parent or offering empathy and support instead of judgment.”\nIf you have reason to believe a child you know is experiencing abuse or neglect, contact the County’s Child Abuse Hotline at 858-560-2191 or (800) 344-6000. You can also call 2-1-1 San Diego, or check this website for a variety of resources related to child abuse prevention.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20210423.17.08.22"}