{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Voter Information Pamphlets Go Out to Registered Voters for Nov. 7 Elections", "description": "Voter information pamphlets are on their way to registered voters in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District and Rainbow Municipal Water District for the Nov. 7 special election.", "datePublished": "2023-09-29T12:12:28-07:00", "url": "https://www.countynewscenter.com/voter-information-pamphlets-go-out-to-registered-voters-for-nov-7-elections/", "keywords": ["elections", "county registrar of voters", "fgg", "nov. 7 election", "nov. 7 special election", "registrar of voters", "voter information packets"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2023-09-29T14:03:21-07:00", "articleType": "article", "articleContent": "\nVoter information pamphlets are on their way to registered voters in the Fourth Supervisorial District, City of Chula Vista, Fallbrook Public Utility District and Rainbow Municipal Water District for the Nov. 7 special election. Voters who live in those districts may also view their pamphlet online at sdvote.com.\nThe pamphlet contains important election information such as voting options, election deadlines, candidate statements, ballot measure text and more. It also includes a sample of your official ballot. You may use the sample ballot to practice making your selection before marking your official ballot.\nThe special runoff election for the Fourth Supervisorial District will fill the vacant seat for the remainder of the current term ending in January 2027.\nThe special election for the City of Chula Vista will fill the vacant seat for city attorney for the remainder of the current term ending in December 2026.\nVoters who live in the Fallbrook Public Utility District and Rainbow Municipal Water District will vote on a ballot measure.\nOnly the voters who live in each of those districts can vote in their respective elections. Ballots will begin arriving in the mail the week of Oct. 8. The official ballot packet will also include an “I Voted” sticker, voting instructions and other important election information.\nVoters can find a list of official ballot drop boxes and vote centers inside their voter information pamphlet. Voters can also find a complete list and locator map on the election information page at sdvote.com.\nIf you signed up to get your voter information pamphlet electronically, you should have received an email giving you the same information and a link to your pamphlet.\nVoters who want to be among the first to see their pamphlet every election can sign up to receive all future pamphlets electronically. Voters who take this option will no longer receive a paper copy in the mail but will get an email notification when the pamphlet becomes available online.\nLearn more about voting in the Nov. 7 special election at sdvote.com, or call (858) 565-5800 or toll free at (800) 696-0136.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230929.12.12.28"}