{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community to be Served by New East Otay Mesa Fire Station", "description": "Chairwoman Nora Vargas cut the ribbon to open a new fire station in East Otay Mesa. This new, state-of-the-art fire station will reduce response times in East Otay Mesa, which includes medical calls to construction workers, traffic accidents, warehouse workers, incarcerated persons, and any calls related to the border crossing. The community surrounding the new fire station includes industrial and commercial businesses, several correctional facilities, and the Otay Mountain open space to the east.", "datePublished": "2023-10-17T15:23:29-07:00", "url": "https://www.countynewscenter.com/community-to-be-served-by-new-east-otay-mesa-fire-station/", "keywords": ["public safety", "cal fire", "cal fire unit chief tony mecham", "chairwoman nora vargas", "county department of general services director marko medved", "county fire", "county fire director jeff collins", "east otay mesa", "embodied carbon reduction", "fire station 38", "forest stewardship council certified", "leed gold certification", "zero net energy"], "author": [{"type": "@Person", "name": "Chuck Westerheide", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Chuck", "familyName": "Westerheide"}], "dateModified": "2023-10-19T10:41:03-07:00", "articleType": "article", "articleContent": "\nChairwoman Nora Vargas cut the ribbon to open a new fire station in East Otay Mesa. This new, state-of-the-art fire station will reduce response times in East Otay Mesa, which includes medical calls to construction workers, traffic accidents, warehouse workers, incarcerated persons, and any calls related to the border crossing. The community surrounding the new fire station includes industrial and commercial businesses, several correctional facilities, and the Otay Mountain open space to the east.\n\n“This is a big win for fire protection, critical incident response and emergency medical services,” said Chairwoman Nora Vargas. “The new East Otay Mesa Fire Station is essential for the economic growth of this area.”\n\nCAL FIRE Chief Tony Mecham thanked partners at the City of San Diego for housing CAL FIRE crews and apparatus at the City’s Brown Field Fire Station for more than five years, while this new County Fire Station 38 was being built.\n\nThe new 4-bay fire station will house a ladder truck, a fire engine, and two ambulances.  It has 12 bedrooms, a full kitchen, a large gym, and a living area. The County Department of General Services designed the station to be Zero Net Energy with roof solar panels, meaning it will produce more energy than it uses.  It also will achieve LEED Gold certification.  The East Otay Mesa Fire Station is also the County’s first building to achieve a 30% Embodied Carbon Reduction goal. That means at each step of the building process, materials lower in carbon emissions like low carbon concrete, steel from local sources, and wood from Forest Stewardship Council certified sources were used.\n\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20231017.15.23.29"}