{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Urges Residents to Get Disaster Ready, 10 Steps to Get Started", "description": "Due to the high winds forecast and wildfire potential, County Emergency Services offers this quick checklist of things to do in preparation for any emergency or disaster.", "datePublished": "2024-11-05T18:46:41-08:00", "url": "https://www.countynewscenter.com/county-urges-residents-to-get-disaster-ready-10-steps-to-get-started/", "keywords": ["public safety", "alertsandiego", "animal evacuations", "disaster preparedness", "emergency", "evacuation", "family disaster plan", "oes"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2024-11-05T18:46:41-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteDue to the high winds forecast and wildfire potential, County Emergency Services offers this quick checklist of things to do in preparation for any emergency or disaster.\n\nDo not attempt to use power tools to clear away brush during a red flag warning because it could spark a fire. Instead, clear away flammable debris by raking or trimming vegetation with hand tools only.\nIn the event of a wildfire, just evacuate if conditions worsen and you feel unsafe. Do not wait for an official notification.\nBe ready to evacuate in 15 minutes or less. This means you should have a bag pre-packed that you can grab on your way out the door.\nCheck on elderly or neighbors who might require assistance evacuating.\nHave a plan to shelter large animals or livestock and if possible, evacuate them early. And take household pets with you whenever possible.\nBe sure your cell phone is registered with AlertSanDiego, the county’s regional notification system to receive the warnings directly to your mobile phone. People may also register their VoIP phone numbers or emails as well.\nYou may also download the County’s SDEmergencyApp which also provides emergency information such as incident updates, shelter locations, evacuation areas and hazard perimeters.\nReview or create a personal disaster plan in English, Spanish or 10 other languages. The guide includes disaster preparedness and immediate safety tips that can be used in any emergency. Among the tips are what you need to know about evacuations and suggestions on what you can take with you. You may also consider various routes to take to leave the community, know more than one in case one is not safe to use due to the emergency.\nIf you have a life-threatening emergency, call 9-1-1.\nVisit County Emergency Services’ preparedness website AlertSanDiego.org.\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241105.18.46.41"}