{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "82K San Diegans Are First in Line to Get COVID-19 Vaccine", "description": "About 82,600 San Diegans who work at acute health care settings will be the first to get vaccinated against the novel coronavirus.", "datePublished": "2020-12-16T17:46:34-08:00", "url": "https://www.countynewscenter.com/82k-san-diegans-are-first-in-line-to-get-covid-19-vaccine/", "keywords": ["health", "coronavirus", "coronavirus vaccine", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-12-17T10:21:18-08:00", "articleType": "article", "articleContent": "\nAbout 82,600 San Diegans who work at acute health care settings will be the first to get vaccinated against the novel coronavirus.\nThe initial 28,000 doses being delivered to the region are being used to vaccinate 72% of the nearly 40,000 people working in acute care, psychiatric and correctional facility hospitals and are at highest risk of contracting COVID-19. This group includes about 180 employees at the County Psychiatric Hospital.\n“We first have to vaccinate our acute health care personnel who are at highest risk,” said Wilma Wooten, M.D., M.P.H., County public health officer. “After everyone in that group has gotten their first dose, we will move into our next priority group.”\nAfter this first group is vaccinated, additional doses coming into the region will also be used to immunize more personnel in acute health care settings, including 14,000 employees at high risk of getting COVID-19, followed by 14,000 employees at medium risk and another 14,000 employees who are lower risk.\nEach health care system is responsible for how it prioritizes and administers the vaccines to its employees in the Phase 1A – Tier 1 guidelines. All 28,000 recipients in the initial group will get their second dose when more Pfizer vaccine arrives in the region.\nAn employee at the County Psychiatric Hospital gets her first dose of COVID-19 vaccine.\nThe County is still in the process of determining how many people fall into the Phase 1A-Tier 1 priority group, as well as the number of San Diegans who are part of Tier 2 and Tier 3.\nResidents and employees of skilled nursing facilities are also part of the first priority group. The majority will be vaccinated under federal contracts by staff from local CVS and Walgreens pharmacies.\nAs other pharmaceutical companies receive emergency use authorization from the U.S. Food and Drug Administration, more vaccines will arrive in the region.\nWhen the vaccine is available to the general public, which is expected to happen in spring 2021, people will be able to get the vaccine from their health care provider, local pharmacies, community clinics or County vaccination sites. In some cases, employers may provide them to employees.\nFor more information about the COVID-19 vaccine, vaccination phases and priority groups, visit coronavirus-sd.com.\nICU Capacity and Stay Home Order:\n\nThe current ICU capacity for the Southern California region is now 0.5% and will be updated by the state daily.\nThe Regional Stay Home Order is now in effect and prohibits gatherings of any size with people from other households and adds restrictions for multiple sectors.\nThe order will last for at least three weeks or until the region’s ICU capacity meets or exceeds 15%. The order will be assessed by the state after the three-week period.\n\nCommunity Setting Outbreaks:\n\nSix new community outbreaks were confirmed on Dec. 15: four in daycare/preschool/childcare settings, one in a health care setting and one in business setting.\nIn the past seven days (Dec. 9 through Dec. 15), 43 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households over the past 14 days.\n\nTesting:\n\n29,477 tests were reported to the County on Dec. 15, and the percentage of new laboratory-confirmed cases was 10%.\nThe 14-day rolling average percentage of positive cases is 8.4%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 25,850.\nPeople at higher risk for COVID-19 who are with or without symptoms should be tested. People with any symptoms should get tested. Health care and essential workers should also get a test, as well as people who have had close contact to a positive case or live in communities that are being highly impacted. Those recently returned from travel, or who participated in holiday gatherings, are also urged to get tested.\n\nCases:\n\n2,807 new cases were reported to the County on Dec 15. The region’s total is now 114,248.\n5,251 or 4.6% of all cases have required hospitalization.\n1,123 or 1.0% of all cases and 21.4% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\n23 new COVID-19 deaths were reported to the County on Dec. 15. The region’s total is now 1,217.\n14 men and nine women died between Dec. 3 and Dec. 15, and their ages ranged from late 50s to mid-90s.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website are updated around 5 p.m. daily.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20201216.17.46.34"}