{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Tuberculosis Case Reported at Patrick Henry High School", "description": "A person at Patrick Henry High School was recently diagnosed with tuberculosis (TB) and may have exposed students and staff according to the San Diego County Health and Human Services Agency.", "datePublished": "2020-07-13T11:44:38-07:00", "url": "https://www.countynewscenter.com/tuberculosis-case-reported-at-patrick-henry-high-school/", "keywords": ["health", "patrick henry high school", "tb", "tuberculosis"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-13T17:49:25-07:00", "articleType": "article", "articleContent": "\nA person at Patrick Henry High School was recently diagnosed with tuberculosis (TB) and may have exposed students and staff according to the San Diego County Health and Human Services Agency (HHSA).\nThe dates of exposure are from August 26, 2019 to March 13, 2020. HHSA is working with San Diego Unified School District officials to notify those who were potentially exposed and provide TB testing.\nPatrick Henry High School is currently participating in social distancing protocols and onsite TB screening will not be available at the school. Students identified to have been exposed to TB can get tested with their primary care provider. Students who do not have a medical provider may contact HHSA staff to arrange for free testing by appointment only. Identified staff will be provided testing by the San Diego Unified School District.\nTuberculosis is transmitted from person to person through indoor air during prolonged contact with an infectious person. Most people who are exposed do not become infected.\n“Testing is recommended for everyone who was determined to have been exposed to make sure they are not infected since initial infection typically has no symptoms,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Early diagnosis is important so that people can get treatment and prevent them from developing the infectious form of the disease.”\nSymptoms of infectious tuberculosis include persistent cough, fever, night sweats and unexplained weight loss. People with symptoms of TB, or who are immune-compromised and may not show symptoms, should consult their medical provider to be evaluated for the bacteria. Tuberculosis can be cured with antibiotics.\nPeople who would like more information on this potential exposure should contact:\n\nPatrick Henry High School at:\n\nsdusdnursing@sandi.net\n(619) 725-5501\n\n\nCounty TB Control Program at (619) 692-8621\n\nTuberculosis in not uncommon in the San Diego region but has been decreasing since the early 1990s and has stabilized in recent years.\nThere were 237 tuberculosis cases reported in 2017 and 226 in 2018. Last year, 265 San Diego County residents were diagnosed with TB. To date, 67 cases have been reported in 2020.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200713.11.44.38"}