{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Aging & Independence Services Offers In-Person and Virtual Chronic Disease Classes ", "description": "San Diego County’s Aging & Independence Services (AIS) is offering free in-person classes focused on helping San Diegans cope with chronic disease. The classes were virtual during the pandemic but are officially back in public gathering places with a new series serving the community. Virtual classes will also continue. ", "datePublished": "2023-05-04T16:05:56-07:00", "url": "https://www.countynewscenter.com/aging-independence-services-offers-in-person-and-virtual-chronic-disease-classes/", "keywords": ["health", "aging and independence services", "chronic disease class", "health"], "author": [{"type": "@Person", "name": "Cassie Klapp", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Cassie", "familyName": "Klapp"}], "dateModified": "2023-05-04T16:15:28-07:00", "articleType": "article", "articleContent": "\nSan Diego County’s Aging & Independence Services (AIS) is offering free in-person classes focused on helping San Diegans cope with chronic disease. The classes were virtual during the pandemic but are officially back in public gathering places with a new series serving the community. Virtual classes will also continue. \n“These classes were designed to empower people living with chronic conditions such as heart disease, diabetes, depression and arthritis and are proven to increase positive health outcomes and reduce healthcare spending,” Kim Gallo, director of AIS said. \nFor over 10 years, Keith Donahou has taught many of these classes and is driven by his desire to help others succeed. His class teaches skills like understanding food labels, decision-making and prioritizing.  \n“I want to encourage people to enroll to increase your knowledge and change your way of thinking,” he said. “Knowledge is power, and these skills are truly life changing.”  \nOver his years of teaching, Donahou had participants drop bad habits like smoking, improve their self-esteem, and gain confidence. “This brings positivity into your life. Being successful and able to work through problems and decisions is a hugely positive and important part of life,” he said.  \nBefore Donahou was a teacher, he was a student. He took the class himself when he was faced with a Type 2 Diabetes diagnosis. He went to his physician and a dietician who both suggested he attend the chronic disease class. Donahou said attending this class changed his life and he wants to pay it forward. “I am working to one day be a Master Trainer so I can train others to lead these classes, to help others like me,” he said.   \nThe classes are six weeks long, offered virtually and in-person and free educational materials are provided. There is a CD that teaches relaxation techniques and other methods to increase decision-making and critical thinking skills that help people better manage their health.  \nTo learn more or sign up, visit www.healthierlivingsd.org or call (858) 495-5500.  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20230504.16.05.56"}