{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Breaks Ground on Affordable Housing Complex in Escondido", "description": "The County today broke ground on a new 50-unit apartment complex for low-income seniors and older people who are homeless and have a serious mental illness.", "datePublished": "2022-01-10T14:16:25-08:00", "url": "https://www.countynewscenter.com/county-breaks-ground-on-affordable-housing-complex-in-escondido/", "keywords": ["housing", "affordable housing", "housing and mental illness", "innovative housing trust fund", "valley senior village"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2022-01-10T14:16:25-08:00", "articleType": "article", "articleContent": "\nThe County today broke ground on a new 50-unit apartment complex for low-income seniors and older people who are homeless and have a serious mental illness.\nThe Valley Senior Village in downtown Escondido will be an affordable community for adults 62 and older. The complex is being built by the County in partnership with National CORE and San Diego Community Housing Corporation.\n“Now more than ever, it’s very important that the County take significant steps to preserve and create affordable housing opportunities throughout the region,” said David Estrella, director of Housing and Community Development Services for the County Health and Human Services Agency. “Valley Senior Village is a significant step in this effort.”\nValley Senior Village is expected to be completed by summer 2023.\nValley Senior Village will offer residents an array of medical and mental health programs and services, including case management, designed to promote stability and independence. The services will be provided by the Hope through Housing Foundation, San Ysidro Health, and Interfaith Community Services through a contract with County Behavioral Health Services.\nThe $24 million complex includes about $10 million from the County’s Innovative Housing Trust Fund and No Place Like Home capital and operating funding, ensuring the development remains affordable in the community of Escondido for 99 years.\nThe Innovative Housing Trust Fund was established by the County to provide gap financing for developments that created and/or preserved affordable housing. The $50 million invested in the Trust Fund has leveraged $567 million in other public and private funds to create and preserve 1,397 permanent affordable housing units within 20 developments in 15 communities throughout San Diego County. In Aug. 2021, the Board of Supervisors increased funding by $20 million for a total of $70 million. The No Place Like Home Program provides capital and operating subsidies for permanent supportive housing. The No Place Like Home funding will total nearly $130 million for regionwide housing development.\nValley Senior Village is expected to be completed by summer 2023.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220110.14.16.25"}