{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Summer Movies in the Park Season Kicks Off Saturday at Waterfront Park", "description": "The County’s annual “Summer Movies in the Park” season kicks off this Saturday, May 24, at the Waterfront Park with a sunset showing of Disney’s “Moana 2,” and fun activities starting at 6 p.m.", "datePublished": "2025-05-20T10:20:21-07:00", "url": "https://www.countynewscenter.com/summer-movies-in-the-park-season-kicks-off-saturday-at-waterfront-park/", "keywords": ["parks and rec", "county parks", "county parks and recreation department", "lueg", "summer movies in the park"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2025-05-22T08:23:36-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesThe County’s annual “Summer Movies in the Park” season kicks off this Saturday, May 24, at the Waterfront Park with a sunset showing of Disney’s “Moana 2,” and fun activities starting at 6 p.m.\nThe movie will begin about 15 minutes after the sun sets, which is expected to be about 7:45 p.m. Families and folk are encouraged to wear warm clothes and bring blankets as the weather can turn chilly when the sun goes down.\nTo help celebrate the opening event, a variety of fun events are scheduled to start at 6 p.m. There will be lawn games, an inflatable slide, music, and even opportunities for kids to get their pictures taken with Maui and Moana—characters from the movie “Moana 2.”\nThere will also be a food truck, a dessert truck, and the Waterfront Park’s snack bar to buy refreshments.\nThis year marks the eighteenth year for the Summer Movies in the Park Program. The schedule includes 128 movie events to be held between May and early November at dozens of parks across the county—neighborhoods stretching “from the beach to the desert.”\nThe events give people a great way to enjoy County and city parks at night, under the stars when they are normally closed—and a chance to see a great movie outdoors as well.\nThis year’s list of movies includes something for everyone—animated and live-action films ranging from comedies to musicals, action-adventure, superhero, science fiction, and romance.\nThere are old-time classics including “The Wizard of Oz,” “The Sound of Music,” “Hocus Pocus,” “City Slickers” and “Goonies.” And there are dozens of recent releases, from “The Wild Robot,” to “Mufasa: The Lion King,” “Inside Out 2,” “Despicable Me 4,” “The Incredibles 2” and “Arthur the King.”\nThe list of movies can be seen on the Summer Movies in the Park website. Movies, dates and locations are subject to change.\nThe 2025 Summer Movies in the Park series is presented by San Diego Foundation and sponsored by the County of San Diego Health and Human Services Agency, Live Well San Diego, the Child and Family Well-Being Department, First 5, the San Diego County Parks Society, Bill Howe, Empower Language Academy, the San Diego Mojo Volleyball team, Project Clean Water and Rose Tausaga Realty.\nFor more information about all County of San Diego Parks and Recreation Department, its parks and events, go to sdparks.org. \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250520.10.20.21"}