{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Safe While Holiday Shopping", "description": "Criminals don’t take the holidays off. Instead, they often find more opportunities to victimize people, especially those who are distracted or alone.", "datePublished": "2022-12-06T13:32:52-08:00", "url": "https://www.countynewscenter.com/stay-safe-while-holiday-shopping/", "keywords": ["public safety", "crime prevention", "holiday shopping", "san diego county sheriff s department"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2022-12-06T13:41:30-08:00", "articleType": "article", "articleContent": "\nCriminals don’t take the holidays off. Instead, they often find more opportunities to victimize people, especially those who are distracted or alone.\nWith the holiday shopping season underway, the San Diego Sheriff’s Department will be patrolling in busy shopping centers. In Encinitas, Vista and San Marcos this will include the Sheriff SkyWatch, a lookout enclosure lifted by crane two stories above ground to give deputies a better vantage point in shopping center parking lots.\nYet, law enforcement officers can’t be everywhere, so sheriff’s crime prevention specialists remind everyone to stay alert and be cautious. This advice can help keep shoppers safe and may prevent thefts.\nMore specifically, the Sheriff’s Department also offers the following crime prevention tips for shopping centers this season and throughout the year:\n\nShop during the day when possible and shop with a friend.\nBe aware of your surroundings.\nDon’t overload your arms with packages and bags while shopping.\nPark in a well‐lit area.\nHave your keys out and ready when approaching your car.\nBe aware of how you carry your purse or wallet. Don’t make it easy for someone to grab.\nWhen parking, lock your car doors and take valuables with you.\nIf you absolutely must drop purchases off at your car and continue shopping, consider moving your car to another parking spot in case there are criminal spotters who might have seen you loading up your car with bags. This extra step could make a criminal think you are leaving.\n\nIf you see a crime in progress, always call 9-1-1. To report suspicious activity, call the Sheriff’s Department non-emergency line at (858) 565-5200.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20221206.13.32.52"}