{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Celebrates Butterfield Trails County Park at Open House", "description": "County officials and community members gathered last week to kick off a new park project in Valley Center at Butterfield Trails County Park.", "datePublished": "2024-11-25T09:26:57-08:00", "url": "https://www.countynewscenter.com/community-celebrates-butterfield-trails-county-park-at-open-house/", "keywords": ["parks and rec", "county parks", "county parks and recreation department", "environment", "sustainability", "trails"], "author": [{"type": "@Person", "name": "Shauni Lyles", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Shauni", "familyName": "Lyles"}], "dateModified": "2024-11-25T09:26:57-08:00", "articleType": "article", "articleContent": "\nReading Time:  < 1 minuteCounty officials and community members gathered last week to kick off a new park project in Valley Center at Butterfield Trails County Park.\nThe community took a tour of the 60-acre property, located at 27765 Valley Center Road, planted trees and engaged in activities.\nLast year, the County Board of Supervisors approved the purchase of the Butterfield Trails Ranch to create a public park for the Valley Center community. The land is now managed by the County’s Department of Parks and Recreation.\nEarlier this year, funds were set aside for site inspection and community outreach to decide the future use of the park and meet the needs of the community.\n“The County of San Diego builds parks in the vision of the community. We take pride in building parks that reflect the essence of each community,” said Jake Enriquez, Region Manager at County of San Diego.\nThe sale of this park land was also made possible in part with a $2 million donation from The Manuel Arango Foundation.\n“We thank you for investing in this charming Valley Center community that will last for generations. Valley Center families are forever blessed with your kindness,” said Laurie Gonzalez, Rincon Tribal Council Member.\nIn the coming months, Parks and Recreation will be reaching out to the community with invitations to public meetings, surveys and other events where you can learn more about the park project, suggest amenities and share feedback on proposed designs. For more information, visit sdparks.org.\nWatch: Video of Butterfield Trails County Park:\n\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20241125.09.26.57"}