{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Moves to Energize Grid, Battery Storage Projects", "description": "Looking to energize solar electricity projects in unincorporated areas, the San Diego County Board of Supervisors voted unanimously Wednesday to shorten the approval process for battery storage projects located in industrial areas.", "datePublished": "2021-11-03T16:03:48-07:00", "url": "https://www.countynewscenter.com/county-moves-to-energize-grid-battery-storage-projects/", "keywords": ["government", "lueg", "renewable energy", "solar power", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2021-11-03T16:03:48-07:00", "articleType": "article", "articleContent": "\nLooking to energize solar electricity projects in unincorporated areas, the San Diego County Board of Supervisors voted unanimously Wednesday to shorten the approval process for battery storage projects located in industrial areas.\nBattery storage projects can help pave the way for San Diego County’ s electrical distribution grid to take on more renewable electricity, like from solar electricity generated by solar panels on homes and businesses during daylight hours.\nThe Board voted to direct County staff to draft and bring back Zoning Ordinance changes for it to consider that would ease permitting and shorten approval time by two to four months for battery storage projects. The changes would apply to battery projects located in areas that fall within two of the County’s industrial zone classifications, where they would be situated with other industrial/commercial businesses.\nBoard Chair Nathan Fletcher said the County has set an aggressive, lofty goal of generating 100% renewable energy in the unincorporated area by 2030 and that this move was just one of “a lot of things” the County was doing to try to reach that goal.\nThe changes will be included in a cleanup of the County Zoning Ordinance that is scheduled to begin in July 2022 and completed by July 2023.\nThe Board also directed Planning & Development Services staff to bring additional information back to it for consideration, including:\n\nOptions in the permitting process that would continue to allow public involvement and input in the review of applications for battery storage projects\nAn evaluation of whether the County could use additional personnel to process renewable energy projects\n\nThe Board also directed County staff to continue working with stakeholders on how to properly decommission used solar batteries.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20211103.16.03.48"}