{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Defender Takes Part in Binational Training in Baja", "description": "San Diego County public defenders teamed up with the Baja Public Defender’s Office to provide a two-day training and guidance on delivering oral arguments in court.", "datePublished": "2025-04-04T09:54:19-07:00", "url": "https://www.countynewscenter.com/county-public-defender-takes-part-in-binational-training-in-baja/", "keywords": ["public safety", "binational", "public defender", "public defender s office"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2025-04-04T09:54:19-07:00", "articleType": "article", "articleContent": "\nReading Time:  2 minutesSan Diego County public defenders teamed up with the Baja Public Defender’s Office to provide a two-day training and guidance on delivering oral arguments in court.\nPublic Defender Paul Rodriguez said in March, his team served as a panel of three judges and advisors for a group of advanced Baja attorneys who will be helping train other Baja attorneys.\nRodriguez also met with the Baja Public Defender Maria Teresa Sierras Suquilvide.\n“We are both committed to ensuring the continued success of the collaboration,” Rodriguez said.\nRodriguez, Michael Ruiz and contract attorney Jesus Romero evaluated presentations by Baja attorneys on topics like direct examination of a witness and closing arguments. The next day, they conducted simulated trials where the Baja attorneys prepared opening statements, conducted direct and cross examination of witnesses, and delivered closing arguments. Rodriguez and the two other attorneys provided constructive feedback.\n“They are certainly making positive strides and improving their skills every day,” said Rodriguez. “They are all very prepared, professional and eager to provide a zealous defense on behalf of their clients.  We are grateful for their collaboration.”\nIn return for helping train their attorneys, Rodriguez said the Baja Public Defender helps the County office locate necessary information and documents in Mexico to defend San Diego clients. This partnership is essential because there is a constant need in San Diego to find important case-related information in Mexico, he said..\nSeveral years ago, Mexico transitioned to an adversarial system which uses a panel of judges instead of juries to determine a verdict in a public forum. Previously, lawyers submitted only written evidence and testimony to judges in a private forum.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20250404.09.54.19"}