{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Cool in the Ongoing Heat Wave", "description": "The hot temperatures are here to stay for a few more days and the County is reminding San Diegans that close to 100 Cool Zones are available throughout the region.", "datePublished": "2022-09-06T12:51:15-07:00", "url": "https://www.countynewscenter.com/?p=209398", "keywords": ["health", "cool zones", "extreme heat", "heat warning"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2022-09-06T12:51:15-07:00", "articleType": "article", "articleContent": "\nThe hot temperatures are here to stay for a few more days and the County is reminding San Diegans that close to 100 Cool Zones are available throughout the region.\nThe National Weather Service just extended an excessive heat warning through Friday and triple digit temperatures are expected in some inland areas and the deserts.\nTo help San Diegans stay cool during the heat wave, the County and its partners have opened 97 Cool Zones throughout the region. People can enter their address once they navigate to the map and it will show locations near them.\nResidents can also call 2-1-1 to request information about Cool Zones, or schedule a free ride to a Cool Zone near them if they don’t have access to transportation.\n“Extreme heat poses a risk to individuals of all ages, especially seniors, young children and people with disabilities, so check on family members who are at higher risk of heat-related illness,” said Cameron Kaiser, M.D., M.P.H., County deputy public health officer. “Familiarize yourself with the signs of heat exhaustion and make a plan for yourself and your loved ones.”\nCounty health officials offer the following tips to stay cool:\n\nStay in an air-conditioned area during the hottest hours of the day.\nWear light, loose-fitting clothing.\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty.\nTake cool showers.\nNever leave a child, elderly person, or pet unattended in a car.\nAvoid unnecessary hard work or activities outside during the hottest part of the day.\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun.\nAvoid using the oven to cook.\nAvoid being out during peak heat hours.\nPet owners can exercise their pets in early morning hours or early evening to avoid prolonged exposure to the heat. Make sure they have shade throughout the day and plenty of water.\nEven a few hours spent in air conditioning can help your body stay cooler.\nDo not rely on electric fans for cooling if temperatures exceed 90 degrees.\n\nIf someone is showing signs of heat-related illness, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature, and continuing cooling efforts, and\nDo not give the victim fluids to drink\n\nMore information about the signs and symptoms of emergencies like heat exhaustion and heatstroke, visit the County Health and Human Services Agency Extreme Heat webpage.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20220906.12.51.15"}