{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Testing Trends Up in San Diego County", "description": "Testing for the novel coronavirus which causes COVID-19 has been increasing in San Diego County.", "datePublished": "2020-05-11T17:43:36-07:00", "url": "https://www.countynewscenter.com/covid-19-testing-trends-up-in-san-diego-county/", "keywords": ["health", "coronavirus", "covid testing", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-11T17:57:08-07:00", "articleType": "article", "articleContent": "\nTesting for the novel coronavirus which causes COVID-19 has been increasing in San Diego County.\nThe number of daily total tests in the region exceeded 3,300 in four of the past five days. Yesterday, there was a decrease in the number of tests reported – 2,638 tests. Testing dips typically occur on Sundays. The decrease may be more pronounced with the three state sites, which have a capacity of nearly 800 daily tests, being closed on Sundays and Mondays.\nOverall, the number of tests is expected to continue to climb toward the goal of 5,200 in the region daily. The County remains on the right trajectory with testing and contact tracing and should be ready to continue reopening the local economy when the state moves to lift more restrictions.\nCounty officials said they are following guidance from the state and will continue to reopen the local economy in a way that protects public health and allows for a sustained recovery.\n\nCOVID-19 testing is also available at local hospitals, medical groups, some community clinics and private labs.\nThe state’s three testing sites – currently in Escondido, El Cajon and Chula Vista –are offering free testing by appointment Tuesday through Saturday. You can schedule an appointment online or by calling (888) 634-1123.\nThe County’s Live Well Mobile Office has provided local testing in Southeastern San Diego. The County Library’s bookmobiles and other County vehicles will be deployed to offer testing throughout the region, especially where hot spots of the novel virus are detected.\nFace Coverings Mandatory in Public \nLocal health officials reiterated the importance of wearing a facial covering when in public, especially when within six feet or less of someone who is not a member of the same household.\n“We encourage people who are not wearing a face covering in public to do so,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The face coverings help to protect the public and prevent the spread of COVID-19.”\nTo make sure everyone has access to a face covering, local law enforcement agencies and the Metropolitan Transit System have been distributing some to the public.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n2,638 tests were reported to the County May 10 and 139 or 5% were positive.\n3% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n139 new cases were reported for a San Diego County total of 5,065.\n973 or 19.2% of cases have required hospitalization.\n302 or 6% of all cases had to be placed in intensive care.\n\nDeaths:\n\nNo COVID-19 deaths were reported today. The region’s total remains at 175.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n63 active outbreaks, 41 at congregate living facilities and 22 in community settings\n1,144 cases, including 89 deaths in congregate living facilities\n232 cases, including five deaths in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200511.17.43.36", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": "diseaseSpreadStatistics"}]}