{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County’s First Positive COVID-19 Case Reported", "description": "A San Diego County woman in her 50s is the first presumptive positive case of COVID-19 in the region, the Health and Human Services Agency announced today.", "datePublished": "2020-03-09T19:19:23-07:00", "url": "https://www.countynewscenter.com/san-diego-countys-first-positive-covid-19-case-reported/", "keywords": ["health", "coronavirus", "covid-19", "novel", "novel coronavirus"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-09T19:32:33-07:00", "articleType": "article", "articleContent": "\nA San Diego County woman in her 50s is the first presumptive positive case of COVID-19 in the region, the Health and Human Services Agency announced today.\nThe woman developed symptoms after traveling overseas. The woman was hospitalized and remains at a local hospital in isolation with serious symptoms.\nHer test results came back positive late this afternoon at the County Public Health Laboratory, which is sending specimens to the Centers for Disease Control and Prevention for final confirmation.\nHHSA is aggressively working to find out where she had been prior to being hospitalized and how many people had close contact with her. The appropriate people will be placed under self-quarantine and monitored for possible symptoms of COVID-19.\n“We knew we would see cases in San Diego County and were prepared for them,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The public should be assured that we are following CDC guidance and continue taking appropriate steps to keep the novel coronavirus from spreading.”\nSymptoms of COVID-19\nPatients with confirmed COVID-19 infection have reported symptoms ranging from mild to severe respiratory illness. Symptoms generally include:\n\nfever\ncough\nshortness of breath/difficulty breathing\n\nAt this time, the CDC believes that symptoms of COVID-19 may appear in as few as two days, or as long as 14 days, after exposure.\nThrough March 9, HHSA had placed 76 patients under investigation. Fifty-six have tested negative and 19 are pending. A total 464 people have been placed under self-quarantine at home, 376 have finished their quarantine and 82 are currently being monitored. Six people ended up developing symptoms and became patients under investigation.\n“We are monitoring these people daily and taking appropriate actions when they develop symptoms,” Wooten said. “It’s important to remember that if you did not have close contact\nto the patient with COVID-19 or someone who’s traveled to an impacted country or region, the risk of infection is still low.”\nWhat Residents Can Do to Prepare for COVID-19\nIt’s important for the public to be prepared should a COVID-19 outbreak occur in San Diego County. To limit the spread of infection, you should:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nResidents should also follow these important tips to help prepare to respond to this public health threat.\n\nStore a two-week supply of food, beverages and water, including food for family pets. Ensure an adequate supply of prescribed and routine medications are on hand.\nPlan ways to care for those who are at greater risk for serious complications and who will take care of sick family members.\nIf you have family members with increased risk of getting seriously sick, check with your medical providers about symptoms and treatment.\nCreate an emergency contact list of family and friends, teachers and employers.\nHave a plan in case your school, child care, or employer closes temporarily.\nTalk with your children, family, and friends about what to do if an outbreak occurs and what each person would need.\n\nPlanning now helps you act more effectively to protect you and your family if COVID-19 does spread locally.\nIf you have individual questions, please talk to your health care provider. For community resources, please call 2-1-1 San Diego or visit 211sandiego.org. or coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200309.19.19.23", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["testResult", "diseasePreventionInfo", "preparation"]}]}