{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Offer COVID-19 Testing in Rural Communities, Other Areas", "description": "As part of efforts to expand COVID-19 testing, the County will be opening sites in rural communities and other areas of the region.", "datePublished": "2020-05-22T10:53:04-07:00", "url": "https://www.countynewscenter.com/county-to-offer-covid-19-testing-in-rural-communities-other-areas/", "keywords": ["health", "coronavirus", "covid-19", "covid-19 testing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-28T11:14:28-07:00", "articleType": "article", "articleContent": "\nAs part of efforts to expand COVID-19 testing, the County will be opening sites in rural communities and other areas of the region. New locations, starting Tuesday, will be staffed with first responders from CAL FIRE and the San Diego County Fire Authority.\n“This virus knows no boundaries, so it is critical that we extend testing into our backcountry, including Julian, Pine Valley and other communities,” said District 2 Supervisor Dianne Jacob, who represents East County. “This initiative is part of our regional test, trace and treat strategy that is allowing us to track the course of the illness and help clear the way to safely restarting more of our economy.”\nFree testing will be set up outside several County Library branches throughout the region’s backcountry.\n“San Diego County is vast covering over 4,500 miles, which is why it’s so important to make testing available in our rural areas, like Valley Center and Borrego Springs,” said District 5 Supervisor Jim Desmond. “In order to get more people back to work and overcome the virus, we need to provide an ample amount of testing for all San Diegans.”\nDrive-up testing sites will be available from 9 a.m. to 2 p.m. in five rural communities. An appointment is necessary, and you can make one by calling 2-1-1. The sites will be on:\nMay 26:           Julian Library, 1850 Highway 78, Julian, CA 92036\nMay 27:           Pine Valley Fire Station 44 (OLD), 28850 Old Highway 80, Pine Valley, CA 91962\nMay 28:           Valley Center Library, 29200 Cole Grade Road, Valley Center, CA 92082\nMay 29:           Borrego Springs Library, 2580 Country Club Road, Borrego Springs, CA 92004\nMay 30:           Potrero Library, 24883 Potrero Valley Road, Potrero, CA 91963\n“Partnering to protect our communities is critical to reducing the spread of Covid-19,” says CAL FIRE/San Diego County Fire Authority Chief Tony Mecham. “We are committed to working with our county health department to ensure all San Diego County residents, including those in the rural communities, are as safe as possible.”\nOther County Testing Sites\nIn the past few weeks, COVID-19 testing in the region has been made more widely available and the region is now regularly surpassing more than 4,000 tests a day. Appointments are required at all County sites and can be made by calling 2-1-1 and asking for the Nurse Triage Line.\nStarting Sunday, May 24, testing will take place for the next two weeks on Sunday, Wednesday and Friday, from 10 a.m. to 2 p.m., at St. Anthony of Padua, at 410 W 18th Street, in partnership with National City Mayor Alejandra Sotelo-Solis.\nThe County’s Live Well on Wheels Mobile Office is offering testing in Hillcrest on Mondays from 11 a.m. to 5 p.m. starting June 1 at The San Diego LGBT Community Center, 3909 Centre St, San Diego, CA 92103.\nA County testing site is now re-opened at San Diego County Credit Union Stadium in Mission Valley, operating Monday to Saturday. The hours are from 9 a.m. to 3 p.m., except on Saturday’s when they change to 11 a.m. to 5 p.m. to avoid conflicting with the weekly food drive. This site can test up to 180 people daily.\nOn Saturdays, the County’s Live Well on Wheels Mobile Office will offer COVID-19 testing from 9 a.m. to 3 p.m. at the Euclid Health Center, located at 292 Euclid Ave.\nState Testing Sites\nTwo state-run walk-up test sites are now open in Southeastern San Diego and El Cajon. One is located at the Tubman-Chavez Center at 415 Euclid Avenue and the other at the former San Diego County Assessor Office at 200 S. Magnolia Avenue in El Cajon.\nThese two sites are in addition to those already operating in Escondido and Chula Vista. All the state-run locations require appointments, which can be made at  www.lhi.care/covidtesting or by calling (888) 634-1123.\nCOVID-19 testing options include calling your doctor or medical provider to schedule an appointment, signing up on the state website, or calling 2-1-1.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200522.10.53.04", "about": [{"@type": "EventInfo", "name": "rural communities testing", "eventAccess": "specific", "eventType": "appointment-based testing/screening", "hasVirtualReplacement": "unclear", "effectiveDate": "2020-05-26", "location": ["Julian", "Valley Center", "Borrego Springs", "Portero"]}, {"@type": "PhysicalAccessInfo", "name": "More testing sites", "changeType": "open", "locationAccessType": "specific", "locationType": "testing sites", "hasVirtualReplacement": "unclear", "physicalAccessChangeType": "testing availability", "location": ["San Diego", "El Cajon", "Chula Vista", "Escondido"]}]}