{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "No Customers Inside When Businesses Reopen", "description": "As more San Diego County businesses prepare to reopen, it is important to remember that only curbside pick-up will be allowed, and no customers should be inside the premises.", "datePublished": "2020-05-06T17:34:43-07:00", "url": "https://www.countynewscenter.com/no-customers-inside-when-businesses-reopen/", "keywords": ["health", "business reopenings", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-07T11:05:35-07:00", "articleType": "article", "articleContent": "\nAs more San Diego County businesses prepare to reopen, it is important to remember that only curbside pick-up will be allowed, and no customers should be inside the premises.\nGov. Gavin Newsom is expected to announce modifications to his order later this week and allow more businesses to safely open.\nBut before businesses can reopen, they need to create a Safe Reopening Plan, which ensures the safety of employees and customers. A template is available now that businesses will need to complete, print and post the plan at their entrance. The plan, which also ensures proper sanitation, physical distancing and general business practices, may need to be updated, and displayed again, depending on direction from the state.\nThe governor announced that retail and manufacturing businesses with curbside pick-up will be allowed to reopen because they represent a lower risk of spreading COVID-19. Among them:\n\nBookstores\nClothing stores\nToy stores\nFlorists\nSporting goods\n\nThe County recognizes that business owners and the public are anxious for more businesses to reopen, but their reopening is aligned with the easing of the governor’s order and must be done safely.\nWhen they open their doors, businesses must ensure that social distancing and the face covering guidelines are being followed to prevent or slow the spread of the virus.\nCounty health officials believe San Diegans will continue to do the right thing.\n“We have confidence in our residents and businesses,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Everyone has done a great job and that is why numbers are trending in the right direction.”\nCOVID-19 Testing \nCOVID-19 testing is more widely available in the region. It is available at local hospitals, medical groups, some community clinics and private labs.\nThe state has also opened three testing sites – in Escondido, El Cajon and Chula Vista – that are offering free testing by appointment. If you have no Internet access, call 888-634-1123, Monday through Friday, 7 a.m. to 7 p.m. to get tested.\nWhile appointments at the state sites have been filled for this week, San Diegans are encouraged to regularly visit the site to register for a spot for next week.\nThe new Live Well Mobile Office, as well as the County Library’s bookmobiles and other County vehicles will be deployed for testing throughout the region. A doctor’s referral is requested for appointments through 2-1-1 testing at County sites, although nurses handling the calls can connect individuals without a doctor to a medical provider.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n2,260 tests were reported to the County May 5 and 159 or 7% were positive.\n6.2% was yesterday’s 14-day, rolling average percentage of positive tests.\n\n Cases:\n\n159 new cases were reported for a San Diego County total of 4,319.\n882 or 20.4% of cases have required hospitalization.\n281 or 6.5% of all cases had to be placed in intensive care.\n\nDeaths:\n\nEight more COVID-19 deaths have been reported, bringing the region’s total to 158.\nThe new deaths were five men and three women between the ages of 45 and 87. Seven of the eight had existing medical conditions.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n58 active outbreaks; 38 at congregate living facilities and 20 in community settings (One new outbreak reported)\n82 deaths and 971 cases in congregate living facilities\n5 deaths and 175 cases in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200506.17.34.43", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PhysicalAccessInfo", "name": "COVID-19 Testing sites open", "changeType": "open", "locationAccessType": "public", "locationType": "testing sites", "hasVirtualReplacement": "none", "physicalAccessChangeType": "testing availability", "location": ["Escondido", "El Cajon", "Chula Vista"]}, {"@type": "PhysicalAccessInfo", "name": "businesses allowed to reopen", "changeType": ["open", "take out option"], "locationAccessType": "public", "locationType": ["bookstores", "clothing retailers", "toy  retailers", "florists", "sporting goods retailers"], "hasVirtualReplacement": "unclear", "physicalAccessChangeType": ["take out/delivery service availability", "additional measures in place"]}]}