{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Cactus Mice Test Positive for Hantavirus, First Local Detection of 2020", "description": "Two cactus mice collected separately in routine monitoring in Santee and Valley Center have tested positive for hantavirus, marking the first appearance in San Diego County in 2020 of the potentially deadly virus.", "datePublished": "2020-01-15T13:07:38-08:00", "url": "https://www.countynewscenter.com/cactus-mice-test-positive-for-hantavirus-first-local-detection-of-2020/", "keywords": ["health", "hantavirus", "vector control"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-01-15T14:54:47-08:00", "articleType": "article", "articleContent": "\nTwo cactus mice collected separately in routine monitoring in Santee and Valley Center have tested positive for hantavirus, marking the first appearance in San Diego County in 2020 of the potentially deadly virus.\nCounty officials said people should never sweep up or vacuum, but use “wet cleaning” methods instead, to clean up rodent droppings or signs of rodent infestation if they find them in their living spaces — homes, garages, sheds, cabins and outbuildings.\nInfected rodents shed hantavirus in their urine, feces and saliva. If people stir that dry matter into the air by sweeping or vacuuming, they can inhale the virus and get sick.\nHantavirus is common in San Diego County. In 2019, 42 rodents collected in routine trapping tested positive for hantavirus. There is no cure or vaccine for hantavirus and it can cause deadly infections in people.\nHowever, people are unlikely to be exposed to the virus because its main carriers — wild rodents and particularly wild mice — prefer to live away from people.\nStill, County officials said people should be careful to use wet cleaning methods if they find rodent droppings or evidence that wild rodents have gotten into homes, garages, sheds, cabins and other living spaces, and must clean.\nHere are tips for people to prevent being exposed to wild rodents and hantavirus, and instructions for how to use wet-cleaning methods.\nAvoid Exposure to Hantavirus\n\nSeal up all external holes in homes, garages and sheds larger than a dime to keep rodents from getting in.\nEliminate rodent infestations immediately.\nAvoid rodent-infested areas and do not stir up dust or materials that may be contaminated with rodent droppings and urine.\nClean up rodent droppings and urine using the wet cleaning method described below.\n\nUse “Wet-cleaning” Methods to Prevent Inhaling the Virus\n\nDo not sweep or vacuum infested areas.\nVentilate affected area by opening doors and windows for at least 30 minutes.\nUse rubber gloves. Spray a 10 percent bleach solution or other disinfectants onto dead rodents, rodent droppings, nests, contaminated traps, and surrounding areas and let the disinfectant stand for at least 15 minutes before cleaning.\nClean with a sponge or a mop that has been soaked in disinfectant.\nPlace disinfected rodents and debris into two plastic bags, seal them and discard in the trash.\nWash gloves in a bleach solution, then soap and water, and dispose of them using the same double-bag method.\nThoroughly wash your hands with soap and water.\n\nFor more information, contact the County Department of Environmental Health (DEH) at (858) 694-2888 or visit the DEH hantavirus web page.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200115.13.07.38", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "Hantavirus", "url": "http://purl.obolibrary.org/obo/NCIT_C14213", "identifier": "NCIT_C14213"}, "infectiousDisease": {"name": "hantavirus infectious disease", "url": "http://purl.obolibrary.org/obo/MONDO_0005780", "identifier": "MONDO_0005780"}, "noticeType": ["testResult", "diseasePreventionInfo"]}]}