{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "As Region Takes Steps to Reopen, Gatherings Still Not Allowed", "description": "Most San Diegans have followed the recommendations in the local Health Officer Order, allowing for the local economy to steadily reopen in sync with the state.", "datePublished": "2020-05-13T18:47:10-07:00", "url": "https://www.countynewscenter.com/as-region-takes-steps-to-reopen-gatherings-still-not-allowed/", "keywords": ["health", "coronavirus", "covid-19", "gatherings"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-14T10:19:27-07:00", "articleType": "article", "articleContent": "\nMost San Diegans have followed the recommendations in the Health Officer Order, allowing for the local economy to steadily reopen in sync with the state.\nWhile some businesses have been allowed to reopen and recreational activities are occurring with some restrictions, there is one rule that remains in place: gatherings are still prohibited.\n“Stage Two does not allow gatherings,” said Wilma Wooten, M.D., M.P.H., County public health officer. “If people get together and they are not members of the same household, they are putting people at risk.”\nCounty officials continue to ask San Diegans to be patient and to follow the local health officer recommendations to prevent the spread COVID-19.\nBy continuing to practice physical distancing and using face coverings in public, San Diegans will greatly contribute to the continued reopening of the region’s economy.\nDrive-thru Celebrations\nSince graduations are right around the corner, County officials indicated that drive-thru celebrations are permitted, provided they follow the local health guidance. That means:\n\nNo exiting vehicles\nNo open snack stands\nNo open bathrooms\nNo spectators\nNo people in the vehicle who are not part of the same household\n\n Where to Get a COVID-19 Test \nCOVID-19 testing is available through your medical provider, at local hospitals, some community clinics and private labs. If you don’t have a medical provider, call 2-1-1 and they’ll connect you to one.\nThe state’s three testing sites – currently in Escondido, El Cajon and Chula Vista –are offering free testing by appointment Tuesday through Saturday. You can schedule an appointment online or by calling (888) 634-1123.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,541 tests were reported to the County May 12 and 117 or 3% were positive.\n4.9% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n117 new cases were reported for a San Diego County total of 5,278.\n1,019 or 19.3% of the total cases have required hospitalization.\n316 or 6% of all cases had to be placed in intensive care.\n\nDeaths:\n\nFive COVID-19 deaths were reported today, bringing the region’s total to 194. A death reported earlier was dropped because it was a duplicate case.\nFour men and one woman died between May 9-12. Their ages ranged between 56 and 97 years.\nAll the people who died had existing chronic conditions.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n64 active outbreaks, 42 at congregate living facilities and 22 in community settings\n1,214 cases, including 92 deaths in congregate living facilities\n241 cases, including five deaths in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200513.18.47.10", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "Guidelines for Drive-thru celebrations", "policyType": "public guidelines", "subject": ["no vendors","stay in vehicles"], "policyStatus": "approved"}]}