{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Shape San Diego County’s Future – Serve on Redistricting Commission", "description": "The opportunity only comes once every 10 years – a chance to redraw the boundaries of the County’s five supervisorial districts.  ", "datePublished": "2020-05-18T08:33:46-07:00", "url": "https://www.countynewscenter.com/shape-san-diego-countys-future-serve-on-redistricting-commission/", "keywords": ["government", "boundaries", "clerk of the board", "fgg", "redistricting", "redistricting commission", "redraw lines", "shape san diego county s future"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-05-18T09:15:32-07:00", "articleType": "article", "articleContent": "\nThe opportunity only comes once every 10 years – a chance to redraw the boundaries of the County’s five supervisorial districts.\nThe County is taking applications now for people who can serve on its Independent Redistricting Commission. Members will redraw the district lines to reflect the new numbers in the federal census.\nWhy is that important? District lines can shape a community’s ability to elect the representative of their choice.\n\nThe 2020 census numbers will reveal new data on residents and whether one district is more populated than the others. Each supervisor should represent a diverse population of about 650,000 residents.\nRedistricting Commission members will re-shape the district boundaries to meet community needs. The commission will act independently from the Board of Supervisors.\nThe County’s Clerk of the Board will take Redistricting Commission applications through July 31.\nTo qualify, volunteers must be San Diego County residents who were registered to vote with the same political party or listed as no party preference for the last five years. And they must have voted in at least one of the last three statewide elections. Applicants must not have been active in political circles for the last 10 years. They must be impartial and demonstrate analytical skills.\nApplications will be screened for the 60 most qualified applicants. One commissioner for each of the five districts will be picked during a random drawing at the Oct. 13 Board of Supervisors meeting. A second random drawing that day will select three additional commissioners for a total of eight.\nThose commissioners will meet to decide on six more to round out a 14-member commission.\nOnce formed, the Redistricting Commission must hold at least seven public hearings in 30 days with at least one hearing in each supervisorial district. Other meetings, dates and times are at the discretion of the commission.\nThe group will review the new census data when it’s released and start the process on redrawing new maps for the five supervisorial districts. The maps must be completed by Aug. 15, 2021.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200518.08.33.46", "about": [{"@type": "PersonnelChangeInfo", "personnelType": "Person", "changeType": "recruiting", "relevantCategory": "Redistricting Commission"}]}