{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Poll Workers Still Needed for March 3 Election", "description": "Time is running short, and poll workers, especially those who are bilingual in any one of six specific languages, are still needed for the March 3 Presidential Primary Election.", "datePublished": "2020-02-07T11:21:24-08:00", "url": "https://www.countynewscenter.com/poll-workers-still-needed-for-march-3-election/", "keywords": ["elections", "bilingual poll workers", "march 2020 election", "poll workers", "presidential primary election", "registrar of voters", "san diego county registrar of voters", "standby poll workers"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-07T12:00:31-08:00", "articleType": "article", "articleContent": "\nTime is running short, and poll workers, especially those who are bilingual in any one of six specific languages, are still needed for the March 3 Presidential Primary Election. The Registrar’s office is required by federal law to provide bilingual speakers and voting materials to voters who speak Spanish, Filipino, Vietnamese and Chinese. A survey by the University of California, Berkeley showed a need for speakers of Arabic and Korean at about 90 precincts, so the Registrar’s office is also recruiting bilingual poll workers in those languages for the March 3 election.\nIn addition, the Registrar needs standby poll workers who can be assigned on short notice. Standbys who can also speak a second language are in demand, too. Poll workers receive a stipend ranging from $100 to $175 depending on the assignment, and those who are bilingual receive an additional $15 if they are assigned specifically to provide language assistance to voters. Poll workers must be registered voters in the state of California or must be permanent residents in the United States and have transportation to their assigned polling location. They will also need access to the internet to complete an online training and attend a 2- or 3-hour in-person class depending on their assignment.\nVolunteers can be poll workers for any neighborhood that needs them. Bilingual poll workers fluent in English and one or more of the following languages are needed in the cities and neighborhoods below.\nArabic: Clairemont, El Cajon, Rancho Santa Fe \nChinese: Carlsbad, Chula Vista, Clairemont, Downtown San Diego, Mira Mesa, Normal Heights, Poway, Rancho Bernardo, Rancho Peñasquitos, Santee, Scripps/Pomerado, Serra Mesa, University City\nFilipino: 4s Ranch, Downtown San Diego, Chula Vista, Lemon Grove, Mira Mesa, National City, Nestor, Otay, Paradise Hills, Poway, Rancho Bernardo, Rancho Peñasquitos, San Ysidro\nEnglish: 4S Ranch, Carlsbad, Del Dios, Eastlake, Eastern El Cajon, Escondido, Fairbanks Ranch, Fallbrook, Lakeside, Encinitas, Mission Hills, Ocean Beach, Oceanside, Otay Ranch, Poway, Rancho Santa Fe, San Marcos, Solana Beach, Valley Center, Vista\nKorean: Carmel Valley, UCSD, University City\nSpanish: Downtown San Diego, Chula Vista, City Heights, Clairemont, Del Mar, Eastern El Cajon, Encinitas, Escondido, Hillcrest, La Mesa, Lemon Grove, Nestor, Oceanside, Otay, Pacific Beach, Paradise Hills, Poway, Rolando, San Ysidro, Santee, Southeastern San Diego, South Park\nVietnamese: 4s Ranch, Carmel Valley, Chula Vista, Clairemont, Del Mar, El Cajon, La Mesa, Lemon Grove, Linda Vista, Mira Mesa, National City, Normal Heights, Paradise Hills, Poway, Rancho Bernardo, Rancho Peñasquitos, Rolando, San Carlos, Santee, Scripps/Pomerado, Southeastern San Diego, Serra Mesa, University City\nProspective poll workers can apply online at sdvote.com. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov. The Registrar of Voters office is located at 5600 Overland Ave., San Diego, 92123 on the County Operations Center campus.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200207.11.21.24", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}