{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Private School Student First Meningococcal Disease Case in 2020", "description": "A student at Nazareth School San Diego tested positive for meningococcal disease, the County Health and Human Services Agency announced today.", "datePublished": "2020-01-10T15:12:52-08:00", "url": "https://www.countynewscenter.com/private-school-student-first-meningococcal-disease-case-in-2020/", "keywords": ["health", "meningococcal", "meningococcal disease", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-10T15:12:52-08:00", "articleType": "article", "articleContent": "\nA student at Nazareth School San Diego tested positive for meningococcal disease, the County Health and Human Services Agency (HHSA) announced today.\nThe previously healthy child is currently undergoing treatment at a local hospital. HHSA worked with school officials to identify all close contacts of the ill student to determine if they needed preventive antibiotics. Antibiotics are not being recommended for anyone at the K through eighth grade school who were not close contacts.\n“While meningococcal disease can be serious and deadly, it is not spread through casual contact. Therefore, the risk to those who were not in close, direct contact is minimal,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We want to make sure students are up to date on immunizations and are asking people in the school community to look for the signs and symptoms of the disease.”\nSymptoms of meningococcal disease may include fever, intense headache, sensitivity to light and noise, stiff neck and/or a rash that does not blanch under pressure. Anyone who develops any of these symptoms should seek medical attention immediately for possible meningococcal disease.\nMeningococcal disease is caused by a bacterium called Neisseria meningitidis. It is spread from person to person by close contact. In most people, the bacteria can exist in the mouth and nose and cause no symptoms. However, the bacteria can cause serious and potentially life-threatening disease, generally causing meningitis (an inflammation of the tissues covering the brain) and/or bloodstream infection.\nThe meningococcal bacteria can be spread through close contact with the ill person, such as living in the same household or sharing oral secretions, such as kissing or sharing drinking glasses, eating utensils, smoking materials or vaping equipment, water bottles, lip balm, lipstick, etc. To reduce the spread of the bacteria, it is recommended that people avoid sharing these items.\nEight meningococcal disease cases were reported in San Diego County in 2019. This is the first confirmed case in 2020.\nVaccines are available to prevent some strains of meningococcal disease. There are two types of meningococcal vaccines available in the United States. Meningococcal conjugate vaccines protect against the serogroups A, C, W and Y strains, while the recombinant vaccine protects against meningococcal B. Both vaccines are a two-dose series.\nMore information about the meningococcal disease vaccines can be found at the Centers for Disease Control and Prevention website. The CDC website also has additional information on meningococcal disease.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200110.15.12.52", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name":"Neisseria meningitidis", "url":"http://purl.obolibrary.org/obo/NCIT_C86605"}, "infectiousDisease": {"name":"Meningitis", "url":"http://purl.obolibrary.org/obo/NCIT_C26828"}, "noticeType": ["testResult"]}]}