{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Health Lab Now Able to Test for New Coronavirus", "description": "The County Public Health Laboratory is now able to test for the novel coronavirus, the cause of the respiratory disease COVID-19, the Health and Human Services Agency announced today.", "datePublished": "2020-02-27T16:58:43-08:00", "url": "https://www.countynewscenter.com/county-public-health-lab-now-able-to-test-for-new-coronavirus/", "keywords": ["health", "coronavirus", "covid-19", "public health lab"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-15T18:12:18-07:00", "articleType": "article", "articleContent": "\nThe County Public Health Laboratory is now able to test for the novel coronavirus, the cause of the respiratory disease COVID-19, the Health and Human Services Agency announced today.\nHaving that capability means that HHSA will no longer have to send all specimens to the Centers for Disease Control and Prevention, substantially reducing the time it takes for results.\n“This is great news for San Diego County and will help with our ongoing efforts to contain COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Being able to test locally means that when we have patients under investigation, we can more rapidly remove unneeded restrictions from those without infection.  Should someone test positive, we will continue to keep them isolated.”\nThe County Public Health Lab now has the capability to do up to 40 tests in one run. The lab is one of dozens across the nation certified by the CDC to test for the new coronavirus.\n“The number of specimens we’ve been getting for testing is currently low, but we expect the need to increase,” said Brett Austin, director of HHSA’s Public Health Lab. “We are ready to increase capacity as required.”\nPrior to getting the testing kit, the County Public Health Lab had to send specimens to CDC and results took several days to return. Now, those tested for potential cases of COVID-19 will know their results in 24 to 48 hours. Positive tests will still need to be confirmed by the CDC.\nCounty Microbiologist Jovan Shepherd prepares a specimen for testing for new coronavirus.\nCDC currently recommends testing patients with symptoms — fever, cough or difficulty breathing — after returning from China or other areas with community transmission of coronavirus disease or who have had known contact with a confirmed COVID-19 case.\nThe risk of COVID-19 is still very low, especially if you have not travelled to an area where the virus has been detected or had close contact with a patient who tested positive for this new coronavirus.\n“We want to assure the public that we are prepared and are conducting surveillance just like we do for any communicable disease,” Wooten said.\nHow to Protect Yourself from Coronaviruses\nIt’s important for the public to be prepared should a local COVID-19 outbreak occur. To limit the spread of infection, you should:\n\nWash your hands often to help protect you from germs.\nAvoid touching your eyes, nose or mouth.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nFor more information about COVID-19, visit the CDC’s website or HHSA’s Epidemiology Unit.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200227.16.58.43", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseasePreventionInfo", "other"]}]}