{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Chairman Cox, County Unveil Online Census Kiosks at County Libraries", "description": "County Board of Supervisors Chairman Greg Cox, California Attorney General Xavier Becerra and other officials unveiled new census laptop stations Thursday that will let the public fill out online census forms at all 33 County branch libraries.", "datePublished": "2020-03-12T16:45:48-07:00", "url": "https://www.countynewscenter.com/cox-county-unveil-online-census-kiosks-at-county-libraries/", "keywords": ["government", "census 2020"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-03-12T17:25:47-07:00", "articleType": "article", "articleContent": "\nCounty Board of Supervisors Chairman Greg Cox, California Attorney General Xavier Becerra and other officials unveiled new census laptop stations Thursday that will let the public fill out online census forms at all County of San Diego libraries.\nCox, Becerra and officials from the County library system, the San Diego Association of Governments and the Chula Vista Community Collaborative showed off the new census laptop stations at a press event at the County’s Bonita-Sunnyside branch library.\nThe census laptop stations will give people who may not have access to computers at home the ability to fill out the U.S. Census Bureau’s 2020 census questionnaire online. They will be placed at all 33 County library branches and in its two bookmobiles.\nThe 2020 census is the first that the U.S. Census Bureau is encouraging most people to answer online, although people will still be able to answer them by telephone or mail.\nCox said it’s extremely important for people to take part in the census, which is conducted every 10 years, because the federal government uses census data to distribute federal funds to local communities.\n“Because of that,” Cox said, “we are all here to urge everyone to participate in the census so that San Diego gets its share of federal funding to address issues like public transportation, services for children and funding to address homelessness.”\nCounty Board Chairman Greg Cox and California Attorney General Xavier Becerra unveil new online census kiosks to be placed at all County libraries.\nCox said the County has also placed census promotion banners in the County lobbies; is delivering census information to homebound seniors who have meals delivered by providers working with the County’s Aging and Independence program; has launched a census information webpage; and included census advertisements in the 1.8 million sample ballots the County sent to voters leading to the recent primary election.\nFor more information about the County Library, its branches, locations and operating hours, go to the Library webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200312.16.45.48", "about": [{"@type": "EventInfo", "name": "The 2020 census", "eventAccess": "public", "eventType": "community survey", "hasVirtualReplacement": "full"}]}