{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Expand Testing and Tracing Staff", "description": "The County’s Health and Human Services Agency will hire or retrain more than 500 staff to conduct COVID-19 testing and tracing as part of its efforts to fight the virus.", "datePublished": "2020-05-01T18:27:18-07:00", "url": "https://www.countynewscenter.com/county-to-expand-testing-and-tracing-staff/", "keywords": ["health", "contact tracing", "coronavirus", "covid testing", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-02T11:02:58-07:00", "articleType": "article", "articleContent": "\nThe County’s Health and Human Services Agency will hire or retrain more than 500 staff to conduct COVID-19 testing and tracing as part of its efforts to fight the virus. The testing focus will be on at-risk populations, including residents in senior living facilities and low-income communities.\n“Our commitment at the County is to keep a sharp focus on the priority populations, the vulnerable and underserved people that (Wilma Wooten, M.D., County public health officer) has identified in her recent testing guidance,” said HHSA Director Nick Macchione. “This will require us to get a little more creative in taking the testing to the places where it is needed most.”\nIn an effort to meet the region’s testing goals, the County will deploy several mobile testing sites to at-risk communities. In addition to the new Live Well Bus, the County Library’s bookmobiles and other County vehicles will also be used as mobile testing sites soon.\nNew Testing and Tracing Staff\nThe County currently has a staff of more than 120 case and contact tracers who have conducted more than 4,000 COVID-19 investigations since the beginning of the public health crisis. Each confirmed positive case generates an average of three contact investigations.\nThe County is proposing to expand the number of contact tracers to 450 in the coming months. This pool of tracers will be made up of current County employees and external applicants. The County today posted an opening for temporary contact tracers.\nThe County also plans to hire an additional 200 public health nurses to help support the area’s testing efforts. The region’s Laboratory Task Force has set a goal of testing 5,200 people a day, with that figure based on Harvard research being used by the federal and state government to set COVID-19 testing numbers.\nFace Coverings Mandatory \nAs of today, all San Diego County residents are required to wear cloth face coverings in public when within 6 feet of another person who is not a household member, or whenever entering a store or other business. The cloth facial coverings, which will be required until further notice, don’t have to be hospital grade, but should cover the nose and mouth.\nWhile local law enforcement agencies will focus on education about the new public health orders about face coverings, the County is providing 10,000 face coverings to local law enforcement entities so officers can distribute them to the public when they contact individuals.\n10 New COVID-19 Deaths and 147 New Cases Reported\nTen more COVID-19 deaths have been reported bringing the region’s total to 134. Of those who died, seven were men and three were women. Their ages range from 52 to 92 years. The ten individuals died between April 18 and 30.\nThe total COVID-19 cases in the County increased to 3,711 cases, which is 147 more cases than were reported yesterday.\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n54 active outbreaks; 36 at congregate living facilities and 18 in community settings\n64 deaths and 882 cases in congregate living facilities\n5 deaths and 149 cases in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200501.18.27.18", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": "diseaseSpreadStatistics"}, {"@type": "PoliciesAndGuidelines", "name": "Face Coverings Mandatory", "policyType": "public measures", "subject": ["mask usage", "medical resource conservation/distribution"], "policyStatus": "required"}, {"@type": "PersonnelChangeInfo", "personnelType": "Person", "changeType": "recruiting", "relevantCategory": ["Emergency Response", "contact tracing"]}]}