{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diego County Adopts New Budget", "description": "The County Board of Supervisors adopted a $6.5 billion revised budget for fiscal year 2020-21 after public deliberations on Tuesday.", "datePublished": "2020-08-26T12:32:16-07:00", "url": "https://www.countynewscenter.com/san-diego-county-adopts-new-budget/", "keywords": ["government", "coronavirus", "county budget", "county reserves", "covid-19", "fiscal year 2020-21", "new county budget"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-08-26T12:46:40-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors adopted a $6.5 billion revised budget for fiscal year 2020-21 after public deliberations on Tuesday.\nThe adopted budget addresses the unexpected COVID-19 and economic crises, and also reflects calls for social justice and racial equality.\nA $6.4 billion recommended budget was presented to the Board on Aug. 10 and called for an increase of $159 million or 2.5% over last year and $100 million to fight the COVID-19 public health crisis.\nSupervisors approved additional spending on Tuesday, adding $140.1 million to the budget.\nAs a result, the revised $6.5 billion budget calls for an increase of $299.2 million or 4.8% over last year, an additional 24 employees for a total of 17,953.5 staff years.\nThe pandemic coupled with the economic downturn are slashing revenue at a time when costs are rapidly rising. Despite these challenges, the County is required by law to balance the budget.\nTo make up the shortfalls, the County will be dipping into its reserves for $ 277.3 million, $138.8 million this year and $138.5 million for 2021-22.\nChief Administrative Officer Helen Robbins-Meyer told the Board dipping into reserves helps everyone get through the pandemic and come back on the other side with policies and programs that allow the County to bounce back stronger and better. But she cautioned the practice cannot become the norm and discipline will be required to fix the imbalance and replenish the reserves.\n“We believe this spending plan is sound and reasonable for this time,” said Robbins-Meyer. “We will adjust as necessary and collectively we will combat COVID 19, navigate the economic downturn and begin to address the social justice and racial equity issues facing our region.”\nResponding to COVID-19 remains the top priority. The new budget includes a $24 million increase for the COVID-19 Emergency Rental Assistance Program to expand the program countywide. Plus, $1 million for landlord/tenant counseling services.\nAnother $5 million will provide COVID-19 Testing, Tracing and Treatment activities for K-12 schools.\nAlso, $2 million will help families gain internet access so their children don’t fall behind in distance learning.\nNew funding sets aside $5.4 million to help the homeless at the San Diego Convention Center continue receiving on-site care after they move to new housing accommodations.\nAnother $2.5 million will go toward translation services to help the County share more information with those who do not speak English as their first language.\nAdditional funds of $5.9 million will launch a South Region Crisis Stabilization Unit at Paradise Valley Hospital and $5 million will boost countywide Mobile Crisis Response Teams.\nNearly $11 million will go toward a variety of traffic improvements including guardrails and traffic signals.\nThe revised budget also carries over proposals from the recommended budget below.\nThe Health and Human Services Agency will see an increase of $100 million to reduce the pandemic’s spread and allow for responsible reopening. The funding will go toward efforts tied to responding to COVID-19, including the Testing, Tracing and Treatment Strategy (T3), food distribution, medical supplies, personal protective equipment (PPE) and shelter.\nAnother $15 million will pay for technology needs to support behavioral health services, including: telehealth, electronic health record upgrades, outreach and engagement, workforce recruitment and retention.\nThe County is also providing a wide array of online services to customers that range from help for behavioral health issues, to permitting, to digital library books. Parks is offering virtual programs as well, including Movies in the Park.\nThe Registrar of Voters office is busy planning for the November presidential election but this time, needs to ensure it is conducted in the safest way possible during this pandemic.\nWhile COVID-19 appears to overshadow many aspects of our lives, the County is still supporting vulnerable people.\nTo strengthen children and families, the County will continue to serve over 1 million San Diegans every month with Medi-Cal, CalFresh, CalWORKs and General Relief, and also help enroll low income families and others affected by the pandemic’s economic fallout. Child Welfare Services will expand upon efforts to strengthen families and address disproportionality and disparities. Seniors will be supported through efforts such as the Geriatric Emergency Department Accreditation program and Alzheimer’s awareness.\nA $23.7 million increase will address homelessness in the unincorporated area and another $0.4 million will be used to develop a Flexible Housing Subsidy Pool in collaboration with the Regional Task Force on the Homeless to help move those experiencing homelessness into permanent housing.\nA $3 million increase will help address homelessness among youth up to the age of 24, with a focus on youth transitioning from foster care and young parents experiencing homelessness. The Sheriff’s Homeless Assistance Resource Team (HART) will see a $2.6 million increase to expand its program.\nIn the area of behavioral health, the County continues to transform the multi-sectoral system of care from one driven by crisis, to one of continuous care and prevention, by providing coordinated resources to keep people connected, stable and healthy. This includes increased investments for diversionary services, such as the expansion of Crisis Stabilization Units, and increases to help community providers expand their capacity for long–term treatment. The County will also continue its partnership with UC San Diego Health to develop a behavioral health hub on County-owned property in Hillcrest.\nNationwide conversations are driving change in public safety. De-escalation training for law enforcement agencies is a priority to strengthen community trust, equity and racial justice. By the end of the year, nearly 3,000 officers are expected to complete training through the District Attorney’s office, with an additional 1,600 through the Sheriff’s Department. The Citizens’ Law Enforcement Review Board will have increased authority and expanded resources to provide independent oversight of the Sheriff’s Department and Probation.\nThe Board of Supervisors created a new Office of Equity and Racial Justice to examine bias within the County organization, which will also work with the newly formed Human Relations Commission. The Commission will collaborate with community organizations to address disparities and create more equitable programs, services and resources for all.\nPlans are in the works to create the District Attorney North County Family Justice Center to further protect victims of crime. The County is also designing an earthquake early warning system pilot program and building two fire stations, one in Mt. Laguna and the other at Palomar Mountain.\nThe County is on track to nearly double the number of affordable housing units in its portfolio over five years to help low income, special needs and homeless residents using local, state and federal funds. Pre-approved plans, permit and impact fee waivers are available for the construction of granny flats or accessory dwelling units to help ease the affordable housing shortage.\nThe budget includes funds to protect and improve the region’s air quality, including $5.0 million for addressing vehicle emissions and $21.1 million to implement the Community Air Protection Program that continues to monitor air quality in communities most vulnerable to air pollution.\nThe capital program includes:\n\n$22.3 million to enhance and renovate the Rock Mountain Detention Facility\n$15.0 million for design and construction of Innovative Residential Rehabilitation Program\n$14.9 million for multiple facilities major maintenance capital projects\n$14 million for the Lakeside Equestrian Facility\n$7.2 million for construction of Mt. Laguna and Palomar Mountain Fire Stations and planning of the East Otay Mesa Fire Station\n$9.3 million for expansion and improvements at various County parks including Lincoln Acres Park expansion\n$1.7 million for expansion and construction at the Rancho San Diego Library and Casa de Oro Library\n$0.6 million for electric vehicle installation and improvements at County facilities\n\nThe Fiscal Year 2020-21 Capital Program also includes partial funding for the following capital projects:\n\n$14.5 million for the County Administration Center (CAC) phased renovations\n$7.5 million for North Coastal Live Well Health Center improvements\n$2.0 million for planning the Third Avenue Mental Health Inpatient Facility Hub, Hillcrest\n$2.0 million for the Edgemoor Psychiatric Unit\n$0.4 million for the San Diego Juvenile Justice Campus (Phase II)\n\nThe budget plan is part of a two-year operational plan that will help determine how the County spends its resources. The first year of the plan for Fiscal Year 2020-21 was adopted Tuesday, the second year was approved in principle.\nThe new fiscal year budget is retroactive to July 1.\nFor more information on the budget, visit the County’s budget portal.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200826.12.32.16", "about": [{"@type": "FundingRequest", "name": "$6.5 billion revised budget for fiscal year 2020-21", "fundingRequestType": "budget", "amount": "6500000000", "requestApproval": "granted"}]}