{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Places Handwashing Stations, Takes Other COVID-19 Prevention Steps", "description": "While there has not been local transmission of the novel coronavirus, in order to lower the future risk of potential spread among people who are homeless, the County is placing handwashing stations in cities and unincorporated areas of the county, the Health and Human Services Agency announced today.", "datePublished": "2020-03-09T16:28:52-07:00", "url": "https://www.countynewscenter.com/county-places-handwashing-stations-takes-other-covid-19-prevention-steps/", "keywords": ["health", "coronavirus", "covid-19", "handwashing stations", "novel coronavirus", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-09T17:52:29-07:00", "articleType": "article", "articleContent": "\nWhile there has not been local transmission of the novel coronavirus, in order to lower the future risk of potential spread among people who are homeless, the County is placing handwashing stations in cities and unincorporated areas of the county, the Health and Human Services Agency announced today.\nTo date, 66 handwashing stations have been placed in the City of San Diego, in areas where people experiencing homelessness tend to gather. Six have been placed in Carlsbad and 14 in unincorporated areas of the county, primarily Lakeside, Spring Valley, Ramona and Fallbrook.\n“Next to sequestering those who are ill, frequent and proper handwashing is one of the best ways to prevent COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We’re placing stations across the region so that people who are homeless can have a place to wash their hands with soap and water.”\nIn addition to the handwashing stations, the County is preparing to send Homeless Outreach Teams into the streets to educate people who are homeless on how to prevent the spread of the novel coronavirus and distribute supply kits that contain helpful information.\nThe County is increasing the public health nurse presence at the City of San Diego’s bridge shelters in order to screen people for symptoms of respiratory illness. It also will assess on an ongoing basis the need for support at other shelter locations. In addition, the county is preparing to enhance its ability to house people who might need to be quarantined.\nHHSA health information specialists have been trained on how to provide COVID-19 presentations in the community for businesses, community and faith-based organizations.\nOn March 3, Wooten sent letters to all city managers informing them she was installing additional handwashing stations to help prevent the spread of COVID-19 locally.\nThe County is ready to procure, pay for and place temporary handwashing stations in areas that would benefit the most from this preventive measure.\nSymptoms of COVID-19\nPatients with confirmed COVID-19 infection have reported symptoms ranging from mild to severe respiratory illness. Symptoms generally include:\n\nfever\ncough\nshortness of breath/difficulty breathing\n\nAt this time, the CDC believes that symptoms of COVID-19 may appear in as few as two days, or as long as 14 days, after exposure.\nThrough March 9, HHSA had placed 76 patients under investigation. Fifty-six have tested negative and 20 are pending. A total of 464 people have been placed under self-quarantine at home; 376 have finished their quarantine and 82 are currently being monitored. Six people ended up developing symptoms and became patients under investigation.\n“We are monitoring these people daily and taking appropriate actions when they develop symptoms,” Wooten said. “It’s important to remember that if you did not have close contact to the patient with COVID-19, the risk of infection is still low.”\nWhat Residents Can Do to Prepare for COVID-19\nIt’s important for the public to be prepared should a COVID-19 outbreak occur in San Diego County. To limit the spread of infection, you should:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nResidents should also follow these important tips to help prepare:\n\nStore a two-week supply of food, beverages and water, including food for family pets. Ensure an adequate supply of prescribed and routine medications are on hand.\nPlan ways to care for those who are at greater risk for serious complications and who will take care of sick family members.\nIf you have family members with increased risk of getting seriously sick, check with your medical providers about symptoms and treatment.\nCreate an emergency contact list of family and friends, teachers and employers.\nHave a plan in case your school, child care, or employer closes temporarily.\nTalk with your children, family, and friends about what to do if an outbreak occurs and what each person would need.\n\nPlanning now helps you act more effectively to protect you and your family if COVID-19 does occur locally.\nIf you have individual questions, please talk to your healthcare provider. For community resources, please call 2-1-1 San Diego or visit www.211sandiego.org. or www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200309.16.28.52", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult", "diseasePreventionInfo", "preparation"]}, {"@type": "PhysicalAccessInfo", "name": "Handwashing Stations", "changeType": "open", "locationAccessType": "public", "locationType": "handwash stations", "hasVirtualReplacement": "none", "physicalAccessChangeType": "", "locationNumbers": "66"}]}