{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Open Psychiatric Hub in Hillcrest, Other Communities", "description": "The County Board of Supervisors today voted to partner with UC San Diego Health to open a 60-bed psychiatric facility in Hillcrest.", "datePublished": "2020-01-28T14:25:54-08:00", "url": "https://www.countynewscenter.com/county-to-open-psychiatric-hub-in-hillcrest-other-communities/", "keywords": ["health", "behavioral heath hubs", "psychiatric hub", "uc health"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-28T15:44:59-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today voted to partner with UC San Diego Health to open a 60-bed psychiatric facility in Hillcrest.\nThe new behavioral health hub is expected to cost $115 million and will be located on a County-owned property on Third Ave. that has been vacant for years. It is one of several hubs that will be opened in the central and northern areas of the region.\n“We have something that is really incredible,” said Supervisor Nathan Fletcher who recommended that the empty County property be turned into a behavioral health hub. “The building at Third Ave. truly fills a missing need of a regional hub for the central region.”\nThe new hubs and network model were announced during the County Health and Human Services Agency quarterly update to the Board on the behavioral health continuum of care for the region. They are expected to reduce the number of emergency department visits and inpatient bed stays due to a psychiatric crisis and to reduce jail stays and homelessness.\nHubs are defined as integrated care environments designed to accelerate transition from behavioral health crisis to sustainable system of continuous chronic care management. Networks consist of a broad array of outpatient services and housing opportunities linked through a regional care coordination system designed to remain continuously connected to service recipients and to reduce episodes of crisis.\nThe 7.24-acre parcel located at the end of Third Ave. and overlooking Mission Valley has been vacant for over 10 years and used to operate as a County center for abused and neglected children. Adjacent to the property is another County-owned parcel which houses an Emergency Screening Unit that currently serves children and teens who are experiencing a mental health crisis or emergency.\n“It’s a great thing for the County of San Diego and for the people who are going to be receiving behavioral health services in the future,” said Chairman Greg Cox.  “This is a home run.”\nThe services provided at this regional facility could include crisis stabilization, inpatient, residential psychotherapeutic rehabilitation, intensive outpatient, and other related services and programs.\nUnder the new collaboration, UC San Diego Health will also take over the County’s Psychiatric Hospital for the next five years with an option to renew the lease for an additional five years.\nThe County Board of Supervisors has taken several actions to enhance, expand and innovate the array of behavioral health programs and services in the region. The actions support the County’s Live Well San Diego vision of healthy, safe and thriving residents and communities.\nThese actions have brought together justice partners, hospitals, community health centers and other community-based providers to create systemwide changes to ensure people have access to the appropriate level of psychiatric services to meet their immediate needs and support their long-term recovery.\nPeople needing immediate behavioral health help should call 9-1-1. Help is also available by calling the County’s Access and Crisis Line at (888) 724-7240 or visiting www.Up2SD.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200128.14.25.54", "about": [{"@type": "PhysicalAccessInfo", "changeType": "open", "locationAccessType": "specific", "locationType": "mental health facility", "hasVirtualReplacement": "none", "physicalAccessChangeType": "bed availability"}]}