{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board to Consider County’s Plan for Accelerated Reopening", "description": "County health officials will be presenting to the Board of Supervisors tomorrow the region’s plan that would allow it to accelerate the reopening of the local economy.", "datePublished": "2020-05-18T18:28:31-07:00", "url": "https://www.countynewscenter.com/board-to-consider-countys-plan-for-accelerated-reopening/", "keywords": ["health", "coronavirus", "covid-19", "reopening plan"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-19T10:54:01-07:00", "articleType": "article", "articleContent": "\nCounty health officials will be presenting to the Board of Supervisors tomorrow the region’s plan that would allow it to accelerate the reopening of the local economy.\nHealth officials will tell the Board they are confident the region meets new state criteria that would allow it to move further into Stage 2 of the California resiliency roadmap. The criteria include:\n\nLess than 5% of daily COVID-19 hospitalizations over a 7-day period or no more than 20 COVID hospitalizations on any single day in the past 14 days.\nFewer than 25 new cases per 100,000 residents in the past 14 days or less than 8% testing positive in the past 7 days.\nHave a capacity to be able to test 1.5 per every 1,000 residents and at least 15 staff per 100,000 county population trained and available for contact tracing.\nHospital capacity for a possible surge of 35% of hospitalizations due to COVID-19 cases in addition to providing usual care for other patients.\n\nIf the Board approves the plan, it will be immediately submitted to the California Department of Public Health for review.\n“The County meets the modified metrics that have been shared with us by the state,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We will continue to monitor other metrics to inform our further opening of local businesses, organizations and activities to strike a balance between the protection of the public health and economic viability of our region.”\nIf the plan is approved, the County will be cleared to accelerate into Stage 2, which will include in-person dining reservations and retail shopping with social distancing.\nRestaurants and retail shops are encouraged to review the state guidance for their business and complete the County’s Safe Reopening Plan, which is required to be displayed on the premises.\nMost counties in the state are expected to meet the new criteria to reopen at a faster pace.\nState Testing Sites\nIn the past few weeks, COVID-19 testing in the region has ramped up and the region is now regularly surpassing more than 4,000 a day. To date, more than 108,000 tests have been administered in the region.\nTwo state-run walk-up test sites will open Tuesday, May 19. One is located at the Tubman-Chavez Center at 415 Euclid Avenue and the other at the former San Diego County Assessor Office at 200 S. Magnolia Avenue in El Cajon.\nThese two sites are in addition to those already operating in Escondido and Chula Vista. All the state-run locations require appointments, which can be made at  www.lhi.care/covidtesting or by calling (888) 634-1123.\nCounty Testing Sites\nA County testing site is now re-opened from 9 a.m. to 3 p.m., Monday through Saturday at San Diego County Credit Union Stadium in Mission Valley. This site can test up to 180 people daily. To make an appointment at a County site, call 2-1-1.\nOn Saturdays, the County’s Live Well on Wheels Mobile Office will offer COVID-19 testing from 9 a.m. to 3 p.m. at Euclid Health Center, located at 292 Euclid Ave. An appointment is required and can be set up by calling 2-1-1.\nCOVID-19 testing options include calling your doctor or medical provider to schedule an appointment, signing up on the state website, or calling 2-1-1.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,408 tests were reported to the County May 17 and 110 or 3% were positive.\n4.1% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n110 new cases were reported for a San Diego County total of 5,946.\n1,115 or 19.8% of the total cases have required hospitalization.\n339 or 5.7% of all cases had to be placed in intensive care.\n\nDeaths:\n\nTwo additional COVID-19 deaths were reported today, bringing the region’s total to 211.\nA woman in her early 70s died April 27 and a man in his late 80s died May 4.\nBoth had underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n73 active outbreaks, 50 at congregate living facilities and 23 in community settings.\n1,318 cases, including 104 deaths in congregate living facilities.\n310 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200518.18.28.31", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "AuthorizationRequest", "name": "Regional Plan for Accelerated Reopening", "authorizationSubject": "strategy/plan", "requestApproval": "pending decision", "requestGrantorType": "county", "requestGrantor": ["San Diego County Board of Supervisors"]}]}