{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County’s Family Resource Centers, Housing and Community Development Services Office Suspending In-Person Services", "description": "Effective Thursday, March 19, the County’s Family Resource Centers, as well as the Housing and Community Development Services office are temporarily suspending in-person services.", "datePublished": "2020-03-18T17:10:32-07:00", "url": "https://www.countynewscenter.com/countys-family-resource-centers-housing-and-community-development-services-office-suspending-in-person-services/", "keywords": ["health", "coronavirus", "covid-19", "family resource center", "housing and community development services"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-03-18T17:10:32-07:00", "articleType": "article", "articleContent": "\nEffective Thursday, March 19, the County’s Family Resource Centers, as well as the Housing and Community Development Services office are temporarily suspending in-person services. The closures are intended to help county residents practice social-distancing to stop the spread of COVID-19.\nWhile these physical offices are closing, the County is committed to continue providing its services during the ongoing health emergency. Most services provided at these facilities are available online, and staff will continue to answer questions via phone or email.\nResidents looking to apply for essential services, including food and housing assistance, medical coverage and other vital support programs, can apply for benefits online. They can also call 2-1-1 San Diego and a live representative can help with the application process by phone.\nSan Diegans who are already signed up for benefits, including CalWORKs, CalFresh, Medi-Cal or General Relief benefits, can manage their case online. Existing customers can send required documents electronically via LaterDocs.\nFor those who are not able to submit forms electronically, a limited number of staff members will be available outside the County’s 13 Family Resource Centers. In addition, the Housing and Community Development Office in Kearny Mesa has a mailbox where residents drop off hard copies of documents if needed.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200318.17.10.32", "about": [{"@type": "ServiceChangeInfo", "name": "Family Resource and Housing and Community Development Services", "changeType": "virtualization", "serviceAccessType": "public", "hasVirtualReplacement": "full", "serviceChangeType": "governmentBenefitsInfo", "effectiveDate": "2020-03-19", "location": "San Diego County"}, {"@type": "PhysicalAccessInfo", "name": "Family Resource Centers and Community Development Services office", "changeType": "close", "locationAccessType": "public", "locationType": "administrative office", "hasVirtualReplacement": "full", "physicalAccessChangeType": "virtualization", "location": "San Diego County", "effectiveDate": "2020-03-19"}]}