{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Public Health Order Amended to Allow Shutdown of Beaches", "description": "The County has issued an amended COVID-19 public health order giving it the discretion to close down beaches if social distancing rules aren’t enforced. County Public Health Officer Wilma Wooten made the announcement during a news conference Monday.", "datePublished": "2020-03-23T19:46:59-07:00", "url": "https://www.countynewscenter.com/public-health-order-amended-to-allow-shutdown-of-beaches/", "keywords": ["health", "211 nurse triage line", "access and crisis line", "beaches", "coronavirus", "covid-19", "depression", "fgg", "mental health", "novel coronavirus", "public health order"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-03-23T19:54:42-07:00", "articleType": "article", "articleContent": "\nThe County has issued an amended COVID-19 public health order giving it the discretion to close down beaches if social distancing rules aren’t enforced. County Public Health Officer Wilma Wooten made the announcement during a news conference Monday.\nGatherings larger than 10 people have been seen at beaches in recent days. Wooten said if local cities and municipalities cannot enforce social gathering orders, the public health order will allow the shutdown of city parks and beaches.\nSocial distancing requires staying six feet away from others who are not in your immediate family to reduce the risk of transmission and slow the spread of the disease.\nCases Rise to 230\nThrough 5 p.m. Monday, the County total number of confirmed COVID-19 cases increased to 230, with one death of a San Diego County resident reported yesterday.\nOf the 230 cases 213 were San Diego County residents and 17 were non-residents.\nOf the 230 cases, three are between 10 and 19 years old, 156 were people between the ages of 20 and 49; 32 were between 50 and 59; and 38 were 60 or older. The County’s daily coronavirus in San Diego webpage now also breaks down the number of cases by city and unincorporated communities.\nTesting\nWhen it comes to testing, Wooten reminded residents that 80% of people who get COVID-19 will have mild to moderate symptoms. They can self-isolate and stay home. They do not need to be tested. If symptoms become worse, you should call your doctor.\n“This action, staying at home if you have mild to moderate symptoms, helps to protect our health care workers and decreases their use of personal protective equipment,” said Wooten.\nPublic Health Nurse Line \nThe County has set up a nurse triage line to help 2-1-1 callers who have coronavirus symptoms.\n“If you don’t have a medical provider, but you have some symptoms, we urge you to call 2-1-1 and ask for the nurses’ line,” said Supervisor Greg Cox. “It’ll be safer for you and others than going to a crowded emergency room or urgent care center.”\nThe Public Health Nurse Line is available seven days a week from 8 a.m. to 8 p.m. After hours, callers can leave a voice mail and a nurse will return the call within 24 hours.\nMental Health Precautions\nThe COVID-19 disease is prompting many residents to take physical precautions, but  maintaining their mental health may be another matter.\n“There’s a lot of fear, a lot of uncertainty around what’s happening right now with the COVID virus, we also have looming economic difficulties that we know is associated with increased rates of depression and substance use,” said Behavioral Health Services Director Dr. Luke Bergman. “So it’s extremely important that as people start to experience those feelings that they address them now.”\nBergman says residents can get help if they need it. If you have a medical emergency, call 911. But if you’re experiencing a mental health crisis, call the Access and Crisis Line at 888-724-7240.\nHe also outlined some ways to support your mental health:\n\nMaintain meal, exercise and bedtime routines.\nConnect with others safely using technology.\nStay informed but avoid too much news.\nShare your concerns with friends and family.\n\nMore information is available at the County’s Behavioral Health Services website.\nWhat Everyone Can Do to Minimize Chances of Getting COVID-19\nPeople can help limit the spread of infection, by taking these steps:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfectfrequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nGet COVID-19 Info Via Text\nCounty residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system. The system allows County health officials to send real-time information about COVID-19 in the region. To sign up to receive the messages, text COSD COVID19 to 468-311. The system was set up to let County public health officials issue information and instructions on changes related to COVID-19 in the region.\nIf you have individual questions, please talk to your health care provider. For community resources, please call 2-1-1 San Diego or visit 211sandiego.org or the County’s Coronavirus Disease webpage.\n \n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200323.19.46.59", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult", "diseasePreventionInfo"], "location": "San Diego County"}, {"@type": "DiseaseNotice", "medicalCondition": {"name": "mental disorder", "url": "http://purl.obolibrary.org/obo/MONDO_0005084"}, "noticeType": "diseasePreventionInfo", "location": "San Diego County"}, {"@type": "AuthorizationRequest", "name": "discretion to close down beaches and city parks if social distancing rules aren’t enforced", "authorizationSubject": "policy enforcement", "requestApproval": "granted", "requestGrantorType": "county", "requestGrantor": "San Diego County"}, {"@type": "TestingInfo", "testType": "unspecified", "symptomsRequired": "severe", "otherCriteria": "Public Health Nurse Hot Line screening", "location": "San Diego County"}]}