{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Helps to Re-open 28 Affordable Homes in Carlsbad", "description": "Twenty-eight affordable homes officially re-opened today in Carlsbad, thanks to the County Health and Human Services Agency.", "datePublished": "2020-02-07T16:22:36-08:00", "url": "https://www.countynewscenter.com/county-helps-to-re-open-28-affordable-homes-in-carlsbad/", "keywords": ["housing", "affordable housing", "home program", "vista las flores"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-02-07T16:41:20-08:00", "articleType": "article", "articleContent": "\nTwenty-eight affordable homes officially re-opened today in Carlsbad, thanks to the County Health and Human Services Agency.\nThe County invested $675,000 in HOME funds in the rehabilitation of Vista Las Flores, an apartment community that serves low-income families who make 60% or less of the Area Median Income. The homes come in two- and three-bedroom configurations with three reserved for families with at least one family member who is experiencing a developmental disability.\n“We are thrilled to be here with you all in the great city of Carlsbad celebrating the grand re-opening of Vista las Flores,” said HHSA Director Nick Macchione during the event. “Despite a record pace of openings and groundbreakings, the affordable housing crisis in San Diego and the entire state of California remains real.”\nThe property, which Wakeland Housing originally developed with San Diego Interfaith Housing Foundation in 2002, recently completed the rehabilitation project which revamped the entire property, including all 28 apartments and the community room.\nViva las Flores has new rooftop solar panels, which offset 100% of common area and 25% of residents’ energy use, a new playground and barbecue area, and two electric vehicle charging stations.\nThe County has taken a variety of recent actions to increase the number of affordable housing units in the region. They include:\nEstablishing the Innovative Housing Trust Fund to provide gap financing to developments that created and/or preserved affordable housing.\nOperating the No Place Like Home Program that provides capital and operating subsidies for permanent supportive housing.\nIdentifying excess County land to use for affordable housing.\nInvesting United States Housing and Urban Development grant funds in programs that strengthen the success of affordable housing developments.\nIn addition, the County Health and Human Services Agency has established a Housing Strategy for the next five years that supports the County’s Live Well San Diego vision of healthy, safe and thriving residents and communities.\nThe goal is to build affordable housing, develop supportive housing, create new housing resources for vulnerable populations and achieve stability and self-sufficiency for families.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200207.16.22.36", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}