{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Launches COVID-19 Text Message Alert System", "description": "County residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system.", "datePublished": "2020-03-17T16:00:35-07:00", "url": "https://www.countynewscenter.com/county-launches-covid-19-text-message-alert-system/", "keywords": ["health", "coronavirus", "covid-19", "text message", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-18T08:21:27-07:00", "articleType": "article", "articleContent": "\nCounty residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system.\nThe system allows County health officials to send real-time information about COVID-19 in the region. To sign up to receive the messages, text COSD COVID19 to 468-311.\nThe system was set up to let County public health officials issue information and instructions on changes related to COVID-19 in the region.\nFlattening the Curve\nCounty health officials are requiring residents not working and students out of school to stay at home to avoid contracting COVID-19. They should only be out to get food or other essential needs, such as caring for a relative, getting medical attention, picking up prescriptions or to go to work.\n“We all have a role to play to keep the virus from spreading in our communities,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should not be out and about, unless it’s absolutely necessary and people are not in a group.”\nWooten issued the new guidance March 16 to try to flatten the curve of the pandemic and prevent many people from getting sick at the same time.\nThe goal is to practice social distancing to slow the spread of the pandemic so that sick people don’t overwhelm the healthcare system. Should that occur, there might not be enough hospital beds or mechanical respirators for everyone who needs them.\n“People should be six feet apart when out on the street conducting essential activities,” Wooten said. “Social distancing is an effective tool to slow the spread of pandemics.”\n\n\n\n\nWe’re live at the County Operations Center with another update on the coronavirus. For updates, visit coronavirus-sd.com or text COSD COVID19 to 468-311.\nPosted by County of San Diego – Government on Tuesday, March 17, 2020\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200317.16.00.35", "about": [{"@type": "ServiceChangeInfo", "name": "COVID-19 Text Message Alert System", "changeType": "open", "serviceAccessType": "public", "hasVirtualReplacement": "full", "serviceChangeType": "pandemicInfo", "effectiveDate": "2020-03-17", "location": "San Diego County"}]}