{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Poll Workers Still Needed for March 3 Election", "description": "The Presidential Primary Election is Tuesday, March 3 and the Registrar of Voters still needs poll workers throughout the county.", "datePublished": "2020-02-20T11:00:15-08:00", "url": "https://www.countynewscenter.com/poll-workers-still-needed-for-march-3-election-2/", "keywords": ["elections", "bilingual poll workers", "fgg", "march 3 2020 election", "poll workers needed", "presidential primary election", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-20T11:00:15-08:00", "articleType": "article", "articleContent": "\nThe Presidential Primary Election is Tuesday, March 3 and the Registrar of Voters still needs poll workers throughout the county.\nIn particular, there is a need for additional poll workers in Alpine, Clairemont, Del Mar Heights, Descanso, El Cajon, Julian, La Jolla, La Mesa, Linda Vista, Mira Mesa, Rancho Bernardo, Rancho Peñasquitos, Santee, Tierrasanta, UCSD and University City.\nBilingual poll workers fluent in English and one or more of the following languages are needed in these cities and neighborhoods:\nArabic: El Cajon\nKorean: Carmel Valley, Del Mar Heights, UCSD, University City\nChinese: Carlsbad, Centre City, City Heights, Clairemont, Chula Vista, Escondido, Hillcrest, Linda Vista, Mira Mesa, Oceanside, Otay, Rancho Bernardo, Rancho Peñasquitos, Scripps/Pomerado, Serra Mesa, University City, Vista\nFilipino: Bonita, Chula Vista, Encanto, Encinitas, Escondido, Mira Mesa, National City, Nestor, Oceanside, Otay, Poway, Rancho Bernardo, Rancho Peñasquitos Scripps, San Ysidro, Spring Valley, Solana Beach\nSpanish: Chollas, Centre City, City Heights, Clairemont, El Cajon, Encanto, Encinitas, Escondido, Fallbrook, La Mesa, Lakeside, Lemon Grove, Linda Vista, Mira Mesa, Poway, Ramona, Santee, San Marcos, Southeastern San Diego, Solana Beach, Spring Valley, Rancho Peñasquitos\nVietnamese: Bonita, Carlsbad, Chollas Park, Chula Vista, El Cajon, Encanto, Encinitas, Escondido,  La Mesa, Lakeside, Lemon Grove, Linda Vista, Mira Mesa, North Park, Oceanside, Rancho Bernardo, Rancho Peñasquitos, San Marcos, Scripps Pomerado, Serra Mesa, Solana Beach, Southeastern San Diego, University City, Vista\nPoll workers receive a stipend ranging from $100 to $175 depending on the assignment. Those who are bilingual receive an additional $15 if they are assigned specifically to provide language assistance to voters. Poll workers must be registered voters in California or must be permanent residents in the United States and have transportation to their assigned polling location. They will also need access to the internet to complete an online training and attend a two-hour class.\nThe Registrar’s office is required by federal law to provide bilingual speakers and voting materials to voters who speak Spanish, Filipino, Vietnamese and Chinese. A survey by the University of California, Berkeley showed a need for speakers of Arabic and Korean at about 90 precincts, so the Registrar’s office is also recruiting poll workers bilingual in those languages for the March 3 election. If you are bilingual in any one of the six specific languages, the Registrar asks for your help in the election.\nProspective poll workers can apply online at sdvote.com. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200220.11.00.15", "about": [{"@type": "PersonnelChangeInfo", "personnelType": "Person", "changeType": "recruiting", "relevantCategory": "Poll workers"}]}