{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Receives Update on Initiative to Improve Child Abuse Hotline", "description": "The County Board of Supervisors received an update Tuesday about efforts to improve the system used to take and process calls reporting child abuse.", "datePublished": "2020-02-26T12:26:27-08:00", "url": "https://www.countynewscenter.com/board-receives-update-on-initiative-to-improve-child-abuse-hotline/", "keywords": ["families", "child abuse", "child welfare services"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-02-26T15:20:31-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors received an update Tuesday about efforts to improve the system used to take and process calls reporting child abuse.\nUnder the existing system, all calls concerning potential cases of abused and neglected minors are routed to the Child Abuse and Neglect Hotline. That hotline is staffed by social workers who determine if a report warrants an investigation by CWS.\nAnnual historical data shows that about half of the nearly 44,000 calls received by the hotline do not meet the threshold to be assigned for an investigation. However, half of the families that are not investigated after the initial report have a subsequent report to the hotline within two years.\nIn response to these numbers, CWS created a Family Strengthening and Prevention Initiative, under which it developed Review, Assess, Direct (RAD) teams, a multidisciplinary team process for its hotline. RAD teams conduct a secondary review of lower-risk referrals to ensure the social worker who reviewed the initial report made the appropriate decision. In addition to hotline social workers, RAD teams are staffed by regional emergency response social workers and community partners.\nCWS also partnered with the phone resource and referral hub 2-1-1 San Diego on a pilot program in the area’s North Central Region last month to provide additional support. If the RAD team does not find grounds for a CWS investigation, they refer families to the 2-1-1 San Diego Connect program.\nThe 2-1-1 San Diego Connect program provides community-based services that can assist with preventing child maltreatment. When a family contacts 2-1-1 San Diego Connect, they complete a comprehensive screening, which evaluates factors like their housing situation, access to food and health services, and social connections.\nOnce the family’s needs have been identified, the program connects them to community services based on their individual situation. These services include income and housing assistance, childcare and food resources.\nThe Family Strengthening and Prevention pilot program kicked off in January and will operate for six months. CWS will monitor the outcomes of the initiative and provide updates to the Child and Family Strengthening Advisory Board along the way.\nCWS plans to eventually expand the initiative to all regions of the County to reduce child maltreatment, lower the number of child welfare investigations and reduce the likelihood of subsequent referrals. The program aligns with the County’s Live Well San Diego vision to improve the health and well-being of all San Diegans, especially vulnerable area residents.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200226.12.26.27", "about": [{"@type": "ServiceChangeInfo", "name": "The Family Strengthening and Prevention pilot program", "changeType": "expansion", "serviceAccessType": "public", "hasVirtualReplacement": "partial", "serviceChangeType": "child welfare"}]}