{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: COVID-19 Deaths Now at Seven; Public Health Order Extended", "description": "Another San Diego resident, a man in his 80s with underlying medical conditions, has died from complications of COVID-19, the County Health and Human Services Agency announced today.", "datePublished": "2020-03-29T07:30:41-07:00", "url": "https://www.countynewscenter.com/covid-19-deaths-now-at-seven-public-health-order-extended/", "keywords": [], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-03-29T07:30:41-07:00", "articleType": "video.other", "articleContent": "\nAnother San Diego resident, a man in his 80s with underlying medical conditions, has died from complications of COVID-19, the County Health and Human Services Agency announced today.\nCombined with yesterday’s announcement of a local man in his 20s who died in Riverside County, this brings the total COVID-19 deaths in San Diego County to seven.\n“Just these two deaths reflect the sober reality that we are facing, that COVID-19 can affect individuals of all ages,” said Nick Yphantides, County chief medical officer.\nCounty health officials also reported an additional 71 COVID-19 cases in San Diego County, bringing the total to 488.\nOf San Diego County’s cases, 280 (57.4%) were men and 206 (42.2%) were women. Of the known cases, 96 (19.7%) have required hospitalization, 42 (8.6%) had to be placed in intensive care and seven (1.4%) have died.\nPublic Health Order Extended\nThe County also extended its existing public health order. The order was set to expire on March 31 and has been extended indefinitely. The order mandates the closures of non-essential businesses, including bars, restaurant dining areas, schools, gyms and fitness centers.\nUnder the order, San Diegans may leave their homes for essential reasons. This includes buying food, picking up medications and exercising. People are being asked to continue practicing social-distancing and keep six feet apart from individuals other than their household members.\nSocial distancing has been proven to slow the spread of pandemics so that numbers of sick people don’t overwhelm the local health care system and emergency care remains available for non-COVID patients.\nThe goal is to flatten the curve of COVID-19 and lessen the number of people who contract the virus and need hospitalization. Doing so will give the local health care system time to increase its capacity to care for the expected influx of people who become ill.\nAdditional Resources\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\nLive Well San Diego has launched Live Well at Home, a collection of free resources aimed at helping San Diegans in maintaining a healthy mind and body while staying indoors. These resources are categorized by age group and topic to match the needs of the community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200329.07.30.41", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "San Diego County Public Health Order Extended", "policyType": "public measures", "subject": ["stay at home", "physical distance", "business closures"], "policyStatus": "approved"}]}