{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "3 More COVID-19 Cases Reported in San Diego County; Healthy People Don’t Need to Be Tested", "description": "Three additional people have tested presumptive positive for COVID-19, the Health and Human Services Agency announced today.", "datePublished": "2020-03-13T18:23:02-07:00", "url": "https://www.countynewscenter.com/3-more-covid-19-cases-reported-in-san-diego-county-healthy-people-dont-need-to-be-tested/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-15T17:59:23-07:00", "articleType": "article", "articleContent": "\nThree additional people have tested presumptive positive for COVID-19, the Health and Human Services Agency (HHSA) announced today.\nThe new COVID-19 cases are:\n\nA man in his 40s who is hospitalized and in isolation and traveled to New York and Philadelphia.\nA man in his 30s who is in isolation at home and traveled to Chicago.\nA woman in her 70s who is at home in isolation.\n\nTo date, there have been 11 cases in San Diego County: eight of them local residents and three from the federal quarantine.\nHHSA is aggressively working to find out where these patients were prior to developing symptoms and testing positive for COVID-19. Any contacts determined to be at risk will be placed under self-quarantine and monitored for possible symptoms of COVID-19.\n“We anticipated that more cases would be reported. We also expect community spread of COVID-19 to occur, if it hasn’t already,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The public should be assured that we are following CDC guidance and taking aggressive measures to mitigate the impact of COVID-19.”\nNot Everyone Needs to Be Tested\nWhen it comes to testing, the County is following guidance from the Centers for Disease Control and Prevention and the California Department of Public Health. Hospital and commercial laboratories establish their own guidelines, but some doctors are consulting with County Public Health Services to determine if a patient should be tested.\nWhile the public’s desire for testing is understandable, for now, testing is primarily through health care systems, which typically involve a visit with a provider. The public is urged to work within their individual health care programs. People who are not sick don’t need to be tested.\nIf you are sick and would not normally see a health care provider, stay home until you are no longer sick.\n“If you are sick enough to consult a doctor, call them and let them know and take precautions before going in for health care,” Wooten said.\nHere’s who should be tested:\n\nPeople returning from an impacted country who develop symptoms.\nPeople who have had contact with someone who tested positive with COVID-19.\nPeople who are experiencing severe respiratory illness.\n\nTesting does not affect treatment as there is no treatment for COVID-19, except supportive care, such as fever or cough medications. Testing is used to help with very sick patients who are hospitalized.\n“People who are sick should isolate themselves and stay six feet away from healthy people,” Wooten said.\nMeasures to Slow COVID-19\nThe County has taken aggressive measures to stop or slow the spread of COVID-19, including:\n\nBanning gatherings of 250 or more people and requiring additional social distancing measures.\nEstablishing strict visitor restrictions at hospitals, long-term and skilled-nursing facilities and other residential facilities.\nIncreasing testing capacity at the County Public Health Lab and considering additional testing options.\nPlacing handwashing stations throughout the region.\nDispatching Homeless Outreach Teams with information and protocols for people who are homeless.\nSending public health nurses to homeless shelters to monitor people for respiratory illness.\nIdentifying hotel/motel rooms to house people without a home and who might need to be quarantined.\n\nThe County is actively monitoring all people under home isolation and quarantine to make sure they don’t develop symptoms of COVID-19.\n“We check on these people daily and take appropriate actions when they develop symptoms,” Wooten said. “It’s important to remember that if you did not have close contact to the patient with COVID-19 or someone who’s traveled to an impacted country or region, the risk of infection is still low.”\nWhat Residents Can Do to Prepare for COVID-19\nIt’s important for the public to be prepared should a COVID-19 outbreak occur in San Diego County. To limit the spread of infection, you should:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nResidents should also follow these important tips to help prepare to respond to this public health threat.\n\nStore a two-week supply of food, beverages and water, including food for family pets. Ensure an adequate supply of prescribed and routine medications are on hand.\nPlan ways to care for those who are at greater risk for serious complications and who will take care of sick family members.\nIf you have family members with increased risk of getting seriously sick, check with your medical providers about symptoms and treatment.\nCreate an emergency contact list of family and friends, teachers and employers.\nHave a plan in case your school, child care, or employer closes temporarily.\nTalk with your children, family, and friends about what to do if an outbreak occurs and what each person would need.\n\nPlanning now helps you act more effectively to protect you and your family if COVID-19 does occur locally.\nIf you have individual questions, please talk to your healthcare provider. For community resources, please call 2-1-1 San Diego or visit www.211sandiego.org. or www.coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200313.18.23.02", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["testResult", "diseasePreventionInfo", "preparation"]}, {"@type": "PoliciesAndGuidelines", "name": "Testing and quarantine guidelines", "policyType": ["public guidelines", "quarantineGuidelines", "public measures"], "subject": ["physical distance", "gathering size limitations"], "policyStatus": "established"}, {"@type": "TestingInfo", "testType": "unspecified", "symptomsRequired": ["severe respiratory illness"], "otherCriteria": ["returning from an impacted country who develop symptoms","have had contact with someone who tested positive with COVID-19"], "location": "San Diego County"}]}