{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Bans Groups of 10 or More People", "description": "The County is banning gatherings of 10 or more people in one room and smaller groups must stay six feet apart to slow the spread of COVID-19 in the region.", "datePublished": "2020-03-18T17:15:58-07:00", "url": "https://www.countynewscenter.com/county-bans-groups-of-10-or-more-people/", "keywords": ["health", "coronavirus", "covid-19", "gathering of 10", "wilma wooten"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-19T10:38:39-07:00", "articleType": "article", "articleContent": "\nThe County is banning gatherings of 10 or more people in one room and smaller groups must stay six feet apart to slow the spread of COVID-19 in the region.\n“We must limit the number of people coming together if we are to keep COVID-19 from spreading locally,” said Wilma Wooten, M.D., M.P.H., County public health officer. “This is a fluid situation and people should stay home to avoid getting the novel coronavirus.”\nThe new guidance also requires:\n\nAll gyms and fitness centers to close.\nDay care must be limited to groups of up to 10 children in the same room and they must remain in same group each day, with the same staff person.\n\nSocial Distancing to Flatten the Curve\nPeople who are home, working remotely and students should not be out unless it’s necessary. You can go out to:\n\nGet food and other essential needs\nCare for a family member, relative or friend\nGet medical attention\nPick up medications\nIf you’re an essential employee\n\n“If you need to be out, don’t go out in groups,” Wooten said. “We all must do everything we can to avoid getting COVID-19 and making others sick.”\nAll the guidelines being issued will help flatten the curve of the COVID-19 pandemic and prevent many people from getting sick at the same time.\nSocial distancing has been proven to slow the spread of pandemics so that sick people don’t overwhelm healthcare systems. Should that occur, there might not be enough hospital beds or mechanical respirators for everyone who needs them.\n“People should be six feet apart when conducting essential activities,” Wooten said.\nLocal COVID-19 Cases\nTo date, a total of 60 cases have been reported in the region — 51 in San Diego County residents, five from the federal quarantine and four in non-residents.\nForty-seven of the total cases are in people between the age of 18 and 64 years of age and 13 were 65 years of age or older.\nGet COVID-19 Info Via Text\nCounty residents can now receive information about the novel coronavirus via text thanks to the County COVID-19 public information text message alert system.\nThe system allows County health officials to send real-time information about COVID-19 in the region. To sign up to receive the messages, text COSD COVID19 to 468-311.\nThe system was set up to let County public health officials issue information and instructions on changes related to COVID-19 in the region.\nIf you have individual questions, please talk to your health care provider. For community resources, please call 2-1-1 San Diego or visit www.211sandiego.org. or www.coronavirus-sd.com.\n\n\n\n\nWe’re live at the County Operations Center with another update on the coronavirus. For updates, visit coronavirus-sd.com or text COSD COVID19 to 468-311.\nPosted by County of San Diego – Government on Wednesday, March 18, 2020\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200318.17.15.58", "about": [{"@type": "PoliciesAndGuidelines", "name": "County Bans Groups of 10 or More People", "policyType": ["public guidelines", "public measures"], "subject": ["stay at home", "physical distance", "physical distance", "gathering size limitations"], "policyStatus": "required"}, {"@type": "PhysicalAccessInfo", "name": "Gym closures and Day Care restrictions", "changeType": ["close", "other"], "locationAccessType": "public", "locationType": ["childcare facility", "exercise facility"], "hasVirtualReplacement": ["none"], "physicalAccessChangeType": "additional measures in place"}]}