{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Votes to Reduce Greenhouse Gases, Divert Building Debris From Landfills", "description": "The County’s Board of Supervisors voted unanimously Wednesday to reduce greenhouse gases in the county by keeping a lot more construction debris from unincorporated communities out of local landfills.", "datePublished": "2020-01-29T14:38:30-08:00", "url": "https://www.countynewscenter.com/board-votes-to-reduce-greenhouse-gases-divert-building-debris-from-landfills/", "keywords": ["government", "climate action plan", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-01-29T14:38:30-08:00", "articleType": "article", "articleContent": "\nThe County’s Board of Supervisors voted unanimously Wednesday to reduce greenhouse gases in the county by keeping a lot more construction debris from unincorporated communities out of local landfills.\nThe vote would change the County’s ordinances related to diverting construction and demolition materials and supports the County’s Climate Action Plan and its Strategic Plan to Reduce Waste.\nThe ordinance changes would keep more organic waste like wood and cardboard from rotting in local landfills and creating greenhouse gases including methane. They would also maximize local landfill space by keeping out an estimated 11 times more debris that can be recycled; and allow more demolished concrete and asphalt to be used for new construction.\nThe changes would apply to construction and grading in the County’s unincorporated communities and take effect April 1 if approved in a “second read” of the ordinance by the Board Feb. 12.\nThe County’s existing ordinance applies to construction projects at least 40,000 square feet in size. The changed ordinance would apply to projects as large as 1,000 square feet. County public works officials estimate that the change would increase the amount of construction debris kept out of landfills from 4,000 tons a year to 44,000 tons a year.\nThe County’s Department of Public Works plans to post more information about the ordinance changes on its website if the changes are approved again in the Feb. 12 second read.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200129.14.38.30", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}