{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Land Use and Environment Group’s Earth Day Celebration Goes Virtual", "description": "Our beaches, parks and trails may have limited access under physical distancing to prevent the spread of COVID-19, but the coronavirus can’t stop Earth Day 2020. And the County’s Land Use and Environment Group is helping San Diegans enjoy it —virtually — at LUEG's Earth Day webpage at www.sandiegocounty.gov/earthday.", "datePublished": "2020-04-22T11:19:11-07:00", "url": "https://www.countynewscenter.com/celebrate-earth-day-with-the-county-virtually/", "keywords": ["environment", "earth day", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-04-22T12:19:17-07:00", "articleType": "article", "articleContent": "\nOur beaches, parks and trails may have limited access under physical distancing to prevent the spread of COVID-19, but the coronavirus can’t stop Earth Day 2020. And the County’s Land Use and Environment Group is helping San Diegans enjoy it — virtually — at LUEG’s Earth Day webpage.\nSo this Earth Day, you can ask a park ranger questions via Facebook Live; color your own scenes from County parks; enjoy word searches and scrabbles, puzzles, and videos; take the County’s Earth Day pledge; learn about the County’s Climate Action Plan; and about what you can do to protect our air and water.\nWhy wait? Here’s a whole list of fun learning activities from our departments to make your Earth Day a virtual hit:\nParks and Recreation\nColoring books: Children (and adults) can go to the play section of the webpage and download and color scenes from County parks.\nWord searches, scrambles and matching games: The Earth Day webpage has fun word games that also teach about clean air and clean energy.\nFacebook Live videos – Join County park rangers to talk about topics like birds of prey, reptiles and snakes, and how to plant a tree. Learn how to protect our natural environments and the animals that live in them.\n\nAsk a Recycling Specialist: Wednesday April 22, 11:30 a.m to 12:30 p.m.\nBirds of Prey: Wednesday April 22, 1 p.m.\nHiking Essentials, Leave No Trace: Thursday April 23, 1 p.m.\nHow to Properly Plant a Tree: Friday, April 24, 10 a.m.\n\nAir Pollution Control District\nLearn How to Help the Air Pollution Control District Keep Our Air Clean. Every one of us can help protect our air, through actions like not topping off our gas tanks (if you’re driving, that is!), using a push mower or electric mower, and not using aerosol hair sprays, or other aerosols. You can even learn how to put gas in your tank the right way!\nEnvironmental Health\nPlay Environmental Health’s “household hazardous waste” word scramble — learn about what they are and the right way to store and dispose of them. You can also learn how to make a rock crystal — a geode — using an eggshell, and see a composting lesson.\nPublic Works\nThe County’s Department of Public Works has links where you can learn how to protect our watershed, make your landscape more water-efficient and sustainable, and all about recycling — for kids, teens and adults.\nRecycling Video Games (free and online)\nPlay the Schoolyard Recycling Game, Litter Critters Recycling Game, or the National Geographic Kids Recycle Roundup Game and learn how to properly sort recycling, food, and trash!\nPlay the Super Sorter Game to learn about running a Materials Recovery Facility!\nCounty Library Earth Day E-book Collection\nRead all about our Earth, earth science, nature, our place in it, how to protect it and more on the County’s Earth Day E-book collection link. Here’s just a few of the titles: The Lion in the Living Room by Abigail Tucker, the story about how cats tamed us and took over the world; The Story of My Boyhood and Youth by John Muir, naturalist and father of our national parks; Starting a Garden by Sally Roth; and How to Give up Plastic by Will McCallum.\nAgriculture, Weights and Measures\nWatch this cool video from our Agriculture, Weights and Measures to learn how to help the department trap unwanted pests like the gypsy moth and Japanese beetle. And you can learn more about AWM inspectors hunt down and “intercept” invasive pests to protect San Diego County’s $1.7 billion agricultural industry, as well as the trees and shrubs in our local environment.\nThe University of California Cooperative Extension \nHere’s a link to the University of California’s 4-H Science, Engineering Technology Activity Guide that is chock-full of fast, fun science and engineering activities to enjoy.\nPlanning & Development Services \nWhat better way to mark Earth Day than by learning more about the County’s Climate Action Plan and how it works to save the Earth’s natural environment through 26 measures in five areas — the built environment and transportation; energy efficiency; solid waste; water and wastewater; and agriculture and conservation.\nHere are some things the County’s Climate Action Plan has done or is doing to protect the Earth:\nBuilt environment and Transportation:\n\nCounty greenhouse gas reductions have saved enough energy to power 18,112 U.S. homes for a full year.\nCounty has helped install solar panels on 38,510 homes\nCounty has planted 13,390 trees\nProactive ways the County has reduced how often and how far vehicles travel on our roads: purchasing permanent 180 acres in easements from farmers, acquiring conservation land (2,202 acres), encouraging a shift to electric and alternative-fuel vehicles,\n\nEnergy Efficiency:\n\nNew or remodeled county buildings are designed in concert with USGBC’s LEED requirements\nHave upgraded existing buildings to be more efficient\nWe have increased solar generation at County facilities. Increased onsite renewable energy generation. In 2018, County facilities produced enough electric power to run 515 homes for a year\nParks and recreation facilities have renewable energy systems and electric vehicle charging stations\nIn 2018, the Ramona library received a Gold LEED certification, and 20 more other LEED certs\n\nSolid Waste/Agriculture and Water\n\nRecycling, reducing and composting has removed 60% of solid waste from landfills\nThe County is committed to diverting more organic and construction debris from landfills to extend landfill life, reduce transportation costs, avoid methane emissions and improve air quality.\nPlanning & Development Services has conducted 220 school presentations on recycling and composting, and 6,442 recycling bins supplied to 224 schools, commercial and multi-family facilities\nCollecting organic material will improve soil and make working lands more resilient to drought and wildfires\nCounty actions are reducing water use at its own facilities through water-saving designs and through outdoor landscaping requirements for new private development\nOrganic waste processed into compost can be applied to local farms and gardens to improve soil health, conserve water and reduce the need for synthetic fertilizers.\nThe County has worked with schools to plant 2,000 trees such as native oak, sycamore, cottonwood and willow. This will help reduce carbon dioxide in our environment.\nRain barrels: They capture water, but also reduce electric use involved in extracting, transporting and treating water.\nCounty actions are reducing water use at its own facilities through water-saving designs and through outdoor landscaping requirements for new private development\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200422.11.19.11", "about": [{"@type": "EventInfo", "name": "Earth Day Celebration Goes Virtual", "eventAccess": "public", "eventType": "festival", "hasVirtualReplacement": "full", "location": "limited access under physical distancing"}, {"@type": "PoliciesAndGuidelines", "policyType": "public guidelines", "subject": "physical distance", "policyStatus": "unclear"}, {"@type": "PhysicalAccessInfo", "name": "beaches, parks and trails access", "changeType": "open", "locationAccessType": "public", "locationType": "open space park", "hasVirtualReplacement": "none", "physicalAccessChangeType": "additional measures in place"}]}