{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Approves Framework for Some Businesses to Reopen", "description": "Starting Friday, some local businesses can begin to reopen if they have a plan in place to protect their employees and the public.", "datePublished": "2020-05-05T18:12:32-07:00", "url": "https://www.countynewscenter.com/county-approves-framework-for-some-businesses-to-reopen/", "keywords": ["health", "business reopening", "coronavirus", "coronavirus covid-19", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-06T16:26:32-07:00", "articleType": "article", "articleContent": "\nStarting Friday, some local businesses can begin to reopen if they have a plan in place to protect their employees and the public.\nThe San Diego County Board of Supervisors today voted to adopt the Business Safety Framework, a general outline for local businesses highlighting the things they need to prepare for and do before they could reopen. The supervisors also requested that the County’s chief administrative officer ask Gov. Gavin Newsom to provide the County with the autonomy to make region-related, COVID-19 decisions.\nThe goal of the framework is for businesses to be ready to reopen when authorized by the governor, who is expected to announce guidance on May 7.\nBut before businesses can reopen, they need to create a Safe Reopening Plan. A template is available now to review, but may be updated depending on direction from the state. Businesses will need to complete, print and post the plan at their entrance.\nThey also must ensure proper sanitation, physical distancing and general business practices and communication.\nThe governor announced that retail and manufacturing businesses with curbside pick-up will be allowed to reopen because they represent a lower risk of spreading COVID-19. Among them:\n\nBookstores\nClothing stores\nToy stores\nFlorists\nSporting goods\n\nSocial Distancing Saves Lives\nThe supervisors also received an update on the County’s efforts to mitigate the impact that COVID-19 is having in the region.\nThey heard from Dr. Natasha Martin, associate professor in the Division of Infectious Diseases and Global Public Health at the UC San Diego. Martin’s simulation models help to explain disease epidemics and to predict the impact of prevention interventions.\nHer modeling looked at the rate of infection of COVID-19 in the region, as well as the number of deaths that were potentially prevented by implementing physical distancing.\nMartin explained that with social distancing, one infected person would transmit COVID-19 to another, and that person, in turn, would infect a third individual and so on.\nWithout physical distancing, an infected person would have exposed four others and each of those four people would infect four more.\nAccording to Martin, because of physical distancing, a lot fewer San Diegans have been infected with COVID-19 or, more importantly, have died.\nWithout social distancing, Martin’s model indicated that more than 13,000 San Diegans could have died by now. But because people were required to stay home and keep their distance from others, the lives of about 6,000 to 18,000 San Diegan lives have been saved.\nPhased Reopening\nCounty Public Health Officer Wilma Wooten went over the federal criteria the County have met so that it can move forward and ease even more of the local restrictions in her health officer order.\nThe County has met four of the five federal criteria for reopening:\n\nThe County has experienced a 14-day downward trajectory in the number of people with influenza-like illness at local emergency departments.\nThe County has registered a downward trajectory of COVID-like syndromic cases reported within a 14-day period.\nThe number of positive cases of COVID-19 in comparison to the number of tests administered over a 14-day period has been in a downward trajectory.\nThe local health care system has been able to handle the number of patients needing hospitalization for COVID-19 and other illnesses and diseases.\n\nThe fifth criteria involves COVID-19 testing, an area where the County is making daily progress.\n“We are beginning to ease the local public health order and will be following state guidance so that we can move from stage one to state two,” said Wooten, adding that the guidance for the public remains the same.\nPeople should continue to stay at home, wear a face covering when in public, stay six feet away from other people and take other preventive measures, such as washing their hands and staying home when sick.\nCOVID-19 Testing and Tracing\nCounty Health and Human Services Agency Director Nick Macchione, who is spearheading the region’s T3: Test, Trace and Treat strategy, told the Board COVID-19 testing is more widely available in the region.\nTesting is available at local hospitals, medical groups, some community clinics and private labs. The state has also opened three testing sites –Escondido, El Cajon and Chula Vista – that are offering free testing by appointment. If you have no Internet access, call 888-634-1123, Monday through Friday, 7 a.m. to 7 p.m. to get tested.\nMore COVID-19 testing now offered in San Diego County.\nThe County continues to offer appointment-only COVID-19 testing at the San Diego County Credit Union Stadium and the Live Well Center at Chula Vista.\nThe new Live Well Mobile Office, which began providing testing in Southeastern San Diego last Saturday, will continue to be deployed for testing throughout the region, as well as the County Library’s bookmobiles and other County vehicles. A doctor’s referral and an appointment through 2-1-1 are required for testing at County sites.\nThe County also plans to hire an additional 200 public health nurses to help support the area’s testing efforts.\nThe number of local contact tracers is being expanded to about 450. The pool of tracers will be made up of current County employees and external applicants, who will be trained to do COVID-19 investigations.\nCurrently, the County has more than 160 case and contact investigators who have conducted nearly 5,000 COVID-19 investigations since monitoring for the novel virus began in the region.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n2,306 tests were reported to the County May 4 and 140 or 6% were positive.\n6.0% was yesterday’s 14-day, rolling average percentage of positive tests.\n\n Cases:\n\n140 new cases were reported for a San Diego County total of 4,160.\n864 or 20.8% of cases have required hospitalization.\n275 or 6.6% of all cases had to be placed in intensive care.\n\nDeaths:\n\nSix more COVID-19 deaths have been reported, bringing the region’s total to 150.\nThree women and three men between the ages of 62 and 95 years died April 30 and May 3. All had existing medical conditions.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n56 active outbreaks; 37 at congregate living facilities and 19 in community settings (No new outbreaks reported)\n72 deaths and 941 cases in congregate living facilities\n5 deaths and 166 cases in community settings\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200505.18.12.32", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "Business Safety Framework", "policyType": "business guidelines", "subject": ["mask usage", "stay home, if sick", "physical distance", "openings", "sanitation or safety protocol"], "policyStatus": "required"}, {"@type": "PhysicalAccessInfo", "name": "businesses allowed to reopen", "changeType": ["open", "take out option"], "locationAccessType": "public", "locationType": ["bookstores", "clothing retailers", "toy  retailers", "florists", "sporting goods retailers"], "hasVirtualReplacement": "unclear", "physicalAccessChangeType": ["take out/delivery service availability", "additional measures in place"], "effectiveDate": "2020-05-07"}]}