{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Dozens Housed Under Expanded Program Targeting Homelessness", "description": "Fifty-six additional unsheltered people in the unincorporated areas of the region now have a roof over their head and a bed to sleep in thanks to the expansion of the County Health and Human Services Agency’s Hotel/Motel Voucher Program.", "datePublished": "2020-02-25T12:58:48-08:00", "url": "https://www.countynewscenter.com/dozens-housed-under-expanded-program-targeting-homelessness/", "keywords": ["housing", "hart", "homelessness", "housing", "unincorporated areas"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-02-25T15:33:56-08:00", "articleType": "article", "articleContent": "\nFifty-six additional unsheltered people in the unincorporated areas of the region now have a roof over their head and a bed to sleep in thanks to the expansion of the County Health and Human Services Agency’s Hotel/Motel Voucher Program.\nThe 56 are the first wave of an additional 125 people to be supported through the program’s expansion last month. Besides providing vouchers, the program offers access to transportation, case management and helps individuals to find a stable place to live.\n“The County’s commitment to a comprehensive approach to the full spectrum of housing needs is essential and we are already seeing progress ,” HHSA Integrative Services Director Omar Passons told the Board today during an update on the measures adopted to help deal with homelessness in unincorporated communities.\nThe estimated cost of the expansion of the Hotel/Motel Voucher program is about $2.3 million in fiscal year 2019-20, depending on how many people use the program. The yearly costs are estimated to be $5.6 million. However, the need for this service is not expected to be ongoing once other recommendations are implemented. It is anticipated that a more robust care coordination effort will replace this one in the upcoming fiscal year.\nThe measures, brought forward by Supervisors Dianne Jacob and Jim Desmond, are helping to address homelessness in unincorporated areas that have seen a significant increase of people who don’t have a place to live.\nPassons also said the Sheriff’s Department Homeless Assistance Resource Team (HART) is in the process of being expanded to include eight dedicated deputies to help identify people experiencing homelessness, work with HHSA social service professionals, assess their needs and help them find a path to permanent housing. HART will now be providing services to all unincorporated communities simultaneously.\n\n“Outreach teams can now stay in the field longer and respond to areas which may require immediate response, while still maintaining scheduled outreach details to ensure continuum of care to those in need,” Passons said.\nThe unincorporated communities of San Diego County have experienced a significant increase in homelessness and its associated impacts in recent years.  The County has a current estimate based on available data that 200 emergency, 150 interim and 200 permanent homes are needed in the unincorporated portions of East County.\nA 2019 ruling out of the U.S. Court of Appeals for the Ninth Circuit determined that municipal ordinances prohibiting sleeping or camping on public property could not be enforced by law enforcement without the provision of access to an alternative shelter location.\nCounty staff from multiple departments recently screened more than 860 properties in Fallbrook, Lakeside and Spring Valley to lease, license or purchase for safe and temporary emergency relocation options or a shelter, and where health services may be provided. Emergency housing typically lasts less than 30 days and is the first step to interim housing, which could last up to two years and could lead to a person having a permanent place to live.\nStaff also searched for properties for temporary storage, which could provide people the ability to safeguard important documents and safely store their personal belongings.\nFifteen properties have been identified; six are in Spring Valley, two in Lakeside and seven in Fallbrook.\n“We will further evaluate the sites to determine suitability and to define the effort, cost and timing to provide for the range of solutions,” said Marko Medved, Director of County General Services, adding the Board will get another update in 60 days. “County staff will also explore alternative structure types for housing or storage.”\nCounty staff is also exploring the feasibility of expanding the Homeless Court program to include warrant removals for people who are homeless in exchange for participation in a transitional living program.\nThe enhanced measures are the result of the Board of Supervisors’ request that the County review and propose regulations to strengthen the way they address sleeping in public and commercial areas, environmentally sensitive lands with endangered habitats, areas near watersheds and areas that present extreme fire danger.\nThey are also the result of a recently piloted intensive outreach effort through HHSA, HART, County departments of Public Works and Parks and Recreation to connect people who are homeless in these communities with services and potential housing. Many have serious, chronic needs and County strategies aim to break the cycle of homelessness, addiction, medical emergencies and incarceration.\nThe County has multiple programs in place to connect people experiencing homelessness to services they need and to help them find a home. Over the past few years, the County has made significant investments in outreach, treatment, and housing services. The County has greatly expanded critical services since the beginning of the Affordable Care Act. During fiscal year 2019-20, the County will be spending $712.9 million on mental health and substance use treatment programs and services.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200225.12.58.48", "about": [{"@type": "ServiceChangeInfo", "name": "County Health and Human Services Agency’s Hotel/Motel Voucher Program", "changeType": "expansion", "serviceAccessType": "specific", "hasVirtualReplacement": "none", "serviceChangeType": "governmentBenefitsInfo"}]}