{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "New County Emergency Services Director to Focus on Partnerships, Technology", "description": "The San Diego County Office of Emergency Services has a new director at the helm who arrives with experience both in the field and in our region.", "datePublished": "2020-01-13T12:26:11-08:00", "url": "https://www.countynewscenter.com/new-county-emergency-services-director-to-focus-on-partnerships-technology/", "keywords": ["public safety", "caloes", "emergency", "jeff toney", "office of emergency services"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-01-13T12:30:29-08:00", "articleType": "article", "articleContent": "\nThe San Diego County Office of Emergency Services has a new director at the helm who arrives with experience both in the field and in our region.\nJeff Toney served with the state overseeing its response to the deadly Woolsey Fire in Los Angeles and Ventura counties and the Montecito mudslides in Santa Barbara County, both in 2018. He even helped with the recovery phase of San Diego County’s Lilac Fire in 2017.\nToney fills the role left open by Holly Porter, who was hired as the deputy chief administrative officer for the County’s Public Safety Group, replacing Ron Lane after his retirement.\nToney, who most recently worked as the Southern Regional Administrator for the California Governor’s Office of Emergency Services, helped lead the state’s disaster response for 11 counties that included San Diego. He said the overall mission of the agency to help with planning, response and recovery during disasters is what attracted him to this field, and he noted Cal OES has done “a lot of good work over the years.”\nCal OES Director Mark Ghilarducci said Toney was a dedicated leader who “greatly contributed to our success and efficiency during the many recent disasters.” Ghilarducci said he looked forward to continuing to work with Toney in his new position at San Diego County to further “enhance public safety in California.”\nIn his role with Cal OES, Toney was at the table when it discussed cutting-edge technology in the field, and he has plans to expand these services to San Diego and upping its capability in a disaster.\n“I’ve worked with the County (of San Diego) and County OES for many years, and I’ve always been extremely impressed with the office. They’ve already thought three steps ahead of some of the other jurisdictions that I’ve seen so I knew it was a strong office,” Toney said.  “The county level works for me. I’d like to get more local because I think that’s where you can make the most impact.”\nWith the state, Toney has worked alongside and observed other counties during disasters and has made mental notes of lessons learned and best practices, all of which he’ll apply to San Diego County.\nHe plans to help create a model for integrating the private sector and non-governmental organizations more in the response and recovery phase of disasters. Toney said the private sector has so many resources to bring to the table and sometimes they just don’t know how to engage government and what role they can play.\nHe puts an emphasis on communicating with the public, and said it’s important in a disaster to have a source of verified information. Toney hopes to look at enhancing the County’s emergency website information, including adding new mapping technology.\nToney said the biggest takeaway from assisting with other disasters is that it takes all agencies and the whole community together to respond and recover. He plans to meet with partner agencies in his first few months to help establish solid recovery plans.\nTo learn more about the County Office of Emergency Services, visit ReadySanDiego.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200113.12.26.11", "about": [{"@type": "PersonnelChangeInfo", "personnelType": "Person", "changeType": "Join", "relevantCategory": "Emergency Response","personnelInfo":{"@type":"Person","name":"Jeff Toney","givenName":"Jeff","familyName":"Toney","affiliation":{"name":"San Diego County Office of Emergency Services"}}}]}