{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "It’s Kitten Season: Adopt One or Two!", "description": "Sprinkle some joy into your life with a fun and frolicking kitten. The San Diego County Department of Animal Services is hoping to find forever homes for several litters who are now available – and if this week isn’t a good time, don’t worry, more kittens will be ready in the weeks ahead.", "datePublished": "2020-06-19T11:16:38-07:00", "url": "https://www.countynewscenter.com/its-kitten-season-adopt-one-or-two/", "keywords": ["animals", "adopt pets", "das", "kittens"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-06-29T10:25:42-07:00", "articleType": "article", "articleContent": "\n\nSprinkle some joy into your life with a fun and frolicking kitten. The San Diego County Department of Animal Services is hoping to find forever homes for several litters who are now available – and if this week isn’t a good time, don’t worry, more kittens will be ready in the weeks ahead.\nCurrently, Animal Services is only offering Touchless Adoptions to help prevent the spread of COVID-19 and protect both the public and shelter staff. Please do not come to either of the shelters without first calling 619-767-2675 to make an appointment. Potential adopters are asked to browse Animal Service’s website for available kittens, cats and more, then fill out an application for the animal(s) they want and email it to DASInfo@sdcounty.ca.gov. Animal Services staff will contact people in the order their application was received and conduct the adoption process over the phone.\nOnce the lucky person is approved to adopt a new furry family member, they will be scheduled for an appointment to come to one of the shelter locations to pick up the kitten, cat or other animal.\nFrom now through October every year, underage kittens pour through the shelter doors. Since it is kitten season, Animal Services would also like to remind people that if they see a litter of kittens out in the “wild” such as a community trail or residential area, please hold off on immediately scooping them up to try to rescue them – their mother will likely return to care for them.\nIf the kittens aren’t in immediate danger from such things as traffic or predators and aren’t visibly sick or injured, it’s best to observe them for a while to see if a mother cat will return – often she is just away from her kittens temporarily. Be sure to watch from a safe distance so the mother cat feels safe enough to return to her babies.\nIf you don’t see a mother cat return after six hours and feel the kittens need care, you can make an appointment to bring them to an animal shelter or try to care for them yourself. Many local pet stores carry kitten milk replacer and the proper bottles (please don’t use an eyedropper Bottle feeding kittens can be rewarding, but very time intensive, since round-the-clock feedings are needed until the kittens are old enough to eat solid food.\nKeep in mind, age is a critical factor in found kittens’ ability to thrive (you can learn more about estimating a kitten’s age here). Neonatal kittens are four weeks and under and are still nursing; they cannot survive on their own and need special care. Contact your veterinarian for details on caring for neonates.\nIf you decide to bring neonatal kittens to the shelter, staff will make every effort to find a partner shelter, foster caregiver, or rescue organization to properly care for these youngsters. If the kitten is not eating on its own and still nursing from the bottle, staff must find a rescue for it immediately as the shelter does not have overnight staff to care for neonatal kittens. Underage kittens also cannot be vaccinated yet and are susceptible to illnesses in a shelter environment. For these reasons, the kittens you may find are best off staying with their mother, if possible, until they are eight weeks of age.\nThat’s why it’s so important to help reduce the number of unwanted kittens by spaying and neutering your cats, the free-roaming cats you see in your neighborhood, and by encouraging your neighbors to alter their cats. County Animal Services sees hundreds upon hundreds of kittens come in every year and there are a very limited number of foster homes or rescues for them all, so any support you may be able to offer these little ones is always much appreciated!\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200619.11.16.38", "about": [{"@type": "ServiceChangeInfo", "name": "Animal Services offering Touchless Adoptions", "changeType": ["virtualization"], "serviceAccessType": "public", "hasVirtualReplacement": "partial", "serviceChangeType": "animalAdoptionsInfo"}]}