{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Bans Sale of Vaping Devices, Flavored Smoking Products", "description": "The County Board of Supervisors today voted to adopt new restrictions on the sale and distribution of flavored smoking products, electronic smoking devices and smoke-free outdoor dining in unincorporated areas of the region.", "datePublished": "2020-01-14T17:32:38-08:00", "url": "https://www.countynewscenter.com/county-bans-sale-of-vaping-devices-flavored-smoking-products/", "keywords": ["health", "e-cigarettes", "outdoor dining", "vaping", "vaping moratorium", "vaping restrictions"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-15T10:05:09-08:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors today voted to adopt new restrictions on the sale and distribution of flavored smoking products and electronic smoking devices, and also prohibited smoking in outdoor dining spaces, in San Diego’s unincorporated areas.\nThe new restrictions must still pass a second reading scheduled for Jan. 28. If approved, they will be in effect Feb. 28 and enforcement will begin July 1.\nThe restrictions were proposed as a response to a spate of vaping-related lung injuries in the nation and the county.\nThe ordinance passed on a 3-2 vote, with supervisors Kristin Gaspar and Jim Desmond voting against.\nTo date, 43 cases of vaping-associated lung injury have been reported among San Diego County residents, and an additional three cases are under investigation. While there have been no local deaths, all patients had to be hospitalized.\nLast June, doctors across the nation started reporting sudden and severe lung injuries associated with vaping. As of Jan. 7, a total of 2,602 hospitalized cases and 57 deaths have been reported nationwide to the Centers for Disease Control and Prevention.\nVaping Restrictions\nThe ban includes the sale of flavored smoking products, with flavors such as bubblegum, mango, creme brulee, vanilla, menthol and mint. The electronic smoking device moratorium will be in effect for one year, or until the Centers for Disease Control and Prevention presents a report on vaping illness that indicates the risks have been properly assessed. The ordinance changes do not apply to certified tobacco cessation products, which are any products approved by the U.S. Food and Drug Administration.\nMore than 60 California cities and counties, including San Francisco, San Jose, San Mateo County and Los Angeles County, have prohibited or restricted the sale of flavored tobacco products or are considering similar ordinances.\nThe smoke-free outdoor dining is expected to reduce secondhand smoke exposure for restaurant patrons, as well as the service industry employees. It will also restrict smoking near food trucks.\nThe County’s Health and Human Services Agency is developing a Tobacco Retail Licensing Program, which will be the mechanism that enforces compliance with these ordinance changes. The program will also ensure that shops are not selling to minors, and all retail entities are complying with other state and local laws.\nThe Tobacco Retail Licensing Program will be brought for Board consideration later this spring.\nReducing Vaping Among Teens\nThe CDC recommends that e-cigarette, or vaping, products should never be used by youths, young adults or pregnant women.  Adults who do not use tobacco products should not start using the products.\nThe CDC has determined that vitamin E acetate and tetrahydrocannabinol (THC) are closely linked with e-cigarette or vaping product use-associated lung injury (EVALI).  The CDC recommends that people not use THC-containing e-cigarettes or vaping products particularly from informal sources such as friends, family, in-person or online sellers.\nLast year, more than 27% of high school students in the nation reported using electronic cigarettes in the past 30 days. That figure is up from the nearly 21% who did so the previous year, according to the CDC’s annual National Youth Tobacco Survey.\nAccording to the California Department of Public Health, vaping devices are the most used tobacco product, and 86% of high school teens who consume tobacco use a vaping device.  Of the California teens who consume tobacco products, nearly 90 percent report using a flavored vaping product.\nFor more information about lung injury associated with e-cigarettes or vaping visit the County EVALI webpage, the CDPH Tobacco Free California webpage, or the CDC EVALI outbreak webpage.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200114.17.32.38", "about": [{"@type": "PoliciesAndGuidelines", "policyType": "sales ban", "subject": "flavored smoking products", "policyStatus": "approved", "effectiveDate": "2020-02-28", "location": "USA_US.CA_06073"}]}