{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "7 New COVID-19 Deaths Reported; Cases Increase to 2,158", "description": "The number of local COVID-19 deaths went up by seven, bringing the region’s total to 70, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-17T18:09:01-07:00", "url": "https://www.countynewscenter.com/7-new-covid-19-deaths-reported-cases-increase-2158/", "keywords": ["health", "7 covid deaths", "coronavirus", "covid-19 testing", "reponening covid-19 deaths"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-20T09:55:26-07:00", "articleType": "article", "articleContent": "\nThe number of local COVID-19 deaths went up by seven, bringing the region’s total to 70, the County Health and Human Services Agency announced today.\nThe ages of the seven people who died range from 58 to 95 years. Four are men and three are women and all had existing medical conditions.\n“Community spread continues to occur in San Diego County and, unfortunately, more COVID-19 deaths are being reported,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The best way to prevent contracting COVID-19 is to stay home and follow all the other public health recommendations.”\nThe great majority of the people who have died from COVID-19 are 70 and older. The youngest were two people in their 20s. Of those who have died, 39 were men and 31 were women. Age, gender and ethnic and race breakdowns for deaths and cases are posted at coronavirus-sd.com.\nCounty COVID-19 Cases Up by 71\nMore than 30,000 COVID-19 tests have been administered to San Diegans. Of those, 2,158 have been positive, including 71 new cases announced today.\nOf the local cases, 1,081 (50.1%) were men and 1,073 (49.7%) were women. The gender of four people is unknown. Of the reported cases, 524 (24.3%) have required hospitalization and 181 (8.4%) of the total number of people who tested positive had to be placed in intensive care. Seventy (3.2%) have died.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nCounty to Reopen in Phases\nPublic Health Officer Wooten indicated the County will lift portions of the local Health Order in phases and will follow federal and state guidelines, considering the local COVID-19 situation.\nOf the federal criteria, some of the metrics are to consider the number of San Diegans with COVID-19 symptoms, the number of cases being reported in the region and the capacity of hospitals to deal with patients needing medical attention.\n“We will have to make sure these criteria are satisfied before moving to a phased opening,” said Wooten.\nTesting Capacity \nThe County will lead a Laboratory Task Force of local hospitals, relevant clinics and commercial laboratory systems responsible for testing to look at increasing COVID-19 testing capacity in the region and, subsequently, expand testing to include additional groups.\nCurrently, the additional groups that will be a priority for COVID-19 testing include people who are homeless, people in long-term care facilities and other vulnerable populations.\n“Testing is very important. We know we can and must test more people,” Wooten said. “We are not there yet but are making tremendous efforts.”\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data is also broken down by ethnic group. A new interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200417.18.09.01", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "San Diego Laboratory Task Force created", "policyType": "task force creation", "subject": "task force", "policyStatus": "approved"}, {"@type": "PoliciesAndGuidelines", "name": "Phased opening", "policyType": "public guidelines", "subject": "openings", "policyStatus": "explained"}]}