{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Reports Record Number of COVID-19 Cases, Hits New Trigger", "description": "For the third day in a row, the County’s Health and Human Services Agency is reporting record-high numbers of new COVID-19 infections.", "datePublished": "2020-06-26T18:31:04-07:00", "url": "https://www.countynewscenter.com/county-reports-record-number-of-covid-19-cases-hits-new-trigger/", "keywords": ["health", "coronavirus", "covid-19", "rise in cases"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-06-26T18:31:04-07:00", "articleType": "article", "articleContent": "\nFor the third day in a row, the County’s Health and Human Services Agency is reporting record-high numbers of new COVID-19 infections. After four days of more than 300 new cases a day this week, the County is reporting 440 new cases today, bringing the total number to 12,401.\nIn addition to increasing case numbers, the County also met one of the 13 metrics officials are monitoring that could trigger new restrictions. The average number of hospitalized patients with confirmed COVID-19 infection has increased by 19% in the last three days compared to the three days prior. The measure states the increase should not be greater than 10%.\nDespite this metric being triggered, the local hospital systems still have capacity. The County will continue to monitor this and all other metrics closely to make sure the increases do not indicate a trend.\nHealth Officials Call for Vigilance\nGiven the increasing number of cases in the region and additional triggers being met, County health officials are urging San Diegans to remain vigilant.\n“The spike in cases in recent days shows that the pandemic is far from over and we must all continue to do our part to keep infection numbers down,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “This includes wearing a face covering when out in public, practicing good hand hygiene and staying home if you are sick.”\nIn addition, San Diegans should maintain social distancing and continue to keep six feet apart from those who are not members of the same household and avoid crowded places.\nYoung People More Impacted by COVID-19\nSan Diegans 20 to 29 years old are now 21% of cases, the highest of any 10-year age groups. More than half of the COVID-19 cases in the County are in people between 20 and 49 years old.\nWhile young people, especially those who do not have any pre-existing conditions, are at a lower risk of experiencing the most severe outcomes of COVID-19, they are at a higher risk of contracting the virus.\n“Younger individuals can infect older friends, relatives or colleagues even if they are not showing any symptoms of the virus,” Wooten said.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n6,824 tests were reported to the County June 25 and 6% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 3.4%.\n\nCases:\n\n440 new cases in San Diego County residents for a total of 12,401.\n1,706 or 13.8% of cases have required hospitalization.\n466 or 3.8% of all cases and 27.3% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSix more COVID-19 deaths were reported today, and the region’s total is now 358.\nFour men and two women died between June 13 and June 24 and their ages ranged from 57 to 95 years.\nAll had underlying medical conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200626.18.31.04", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult", "diseaseDemographics"]}, {"@type": "PoliciesAndGuidelines", "name": "Vigilance urged to avoid more restrictions", "policyType": "public guidelines", "subject": ["mask usage", "physical distance", "stay home, if sick", "sanitation or safety protocol"], "policyStatus": "recommended"}]}