{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Community Gives Input on County Budget", "description": "How does the County budget work? Where does the money come from and what does it pay for? The public had a chance to get answers to those questions and give their input on how they’d like to spend taxpayer dollars during a Community Budget Forum Wednesday in Kearny Mesa.  ", "datePublished": "2020-01-24T10:01:58-08:00", "url": "https://www.countynewscenter.com/community-gives-input-on-county-budget/", "keywords": ["government", "2020-21 budget", "community budget forum", "finance experts", "kearny mesa", "nathan fletcher"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-01-24T10:59:23-08:00", "articleType": "article", "articleContent": "\nHow does the County budget work? Where does the money come from and what does it pay for?\nThe public had a chance to get answers to those questions and give their input on how they’d like to spend taxpayer dollars during a Community Budget Forum Wednesday in Kearny Mesa.\nCounty Supervisor Nathan Fletcher kicked off the meeting and Chief Administrative Officer Helen Robbins-Meyer made some comments before a presentation took place on what goes into creating the budget. Afterward community members took part in a question and answer session with the County’s finance experts.\nThe County’s responsibilities cover three areas:\n\nAdministering state programs like social service assistance, health programs, foster care and adult protective services.\nRegional services such as adult and youth detention facilities, criminal prosecution, elections, tax assessment and collection, air quality and beach water monitoring, and food and restaurant inspections.\nMunicipal services in non-city communities like law enforcement, libraries, parks, roads and land use zoning.\n\nInformation on the current budget is available on the County’s budget portal.\nThe recommended County budget for fiscal year 2020-21 will be released to the public on May 4. There will be a period for the public to review it and comment, followed by hearings at Board of Supervisors meetings at the County Administration Center. Hearings begin at 9 a.m. on Monday, June 8. An evening hearing will be held at 5:30 p.m. on Wednesday, June 10. Budget deliberations and adoption are scheduled for June 23.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200124.10.01.58", "about": [{"@type": "EventInfo", "name": "County Budget Forum", "eventAccess": "public", "eventType": "public forum", "hasVirtualReplacement": "no", "effectiveDate": "2020-06-08"}]}