{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "VIDEO: 560 County Employees Volunteer for Point-In-Time Count", "description": "The annual Point-in-Time Count is spearheaded by the Regional Task Force on the Homeless and provides a one-day snapshot of people living on the streets or in short-term shelters.", "datePublished": "2020-01-23T13:29:16-08:00", "url": "https://www.countynewscenter.com/560-county-employees-volunteer-for-point-in-time-count/", "keywords": [], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-23T13:29:16-08:00", "articleType": "video.other", "articleContent": "\nThey typically start working at 8 a.m.\nBut today, it’s barely 3:30 a.m. and Rubi López, Rosanna Robledo, Veletia Kennedy and Bridget Nathan are already at the LGBTQ Center in Hillcrest ready for their first task of the day: counting people living on the streets.\nThe group, all office assistants for the County Health and Human Services Agency, is one of several who counted and talked with people experiencing homelessness in North Park, Hillcrest, University Heights and Mission Hills.\nThe HHSA employees were assigned to the North Park area and, for four hours, they counted people from University Ave. to Upas St. between Arizona Street and Grim Ave.\nThe annual Point-in-Time Count is spearheaded by the Regional Task Force on the Homeless and provides a one-day snapshot of people living on the streets or in short-term shelters. The results of the count are used to apply for federal and state funding to help people experiencing homelessness and find solutions on how to best serve this vulnerable population.\nThis year, more than 1,600 people – 560 of them County employees – volunteered for the count.\nWhile in previous years volunteers used paper surveys for the count, this year they used the Counting Us mobile app, which registers the data electronically and captures the exact location of each interaction.\nFor the 2020 Point-In-Time Count, volunteers used the Counting Us app for the surveys.\nThe first person they encountered was an older man carrying two garbage bags with recyclable cans and bottles. He declined to participate in an interview.\n“I am busy working,” he said while he continued hurriedly walking along Upas St. The counters clicked on the app’s Observation Tally which marked the location he was at.\nLess than a block away, they came across Anwar, a 32-year-old from Ethiopia. He said he does not remember how long he’s been homeless but said he is addicted to meth.\nPeople who agreed to answer the questions received a $10 gift cart to Starbucks or McDonald’s and a pair of socks in a bag that also had pamphlet to 2-1-1 San Diego, which can connect people to services.\nMost people they encountered agreed to answer all the questions. Some answered just a couple. Others did not wake up.\nCounty employees Rubi Lopez and Rosanna Robledo speak with an unidentified man. “Thank you for your smiles,” he said as he continued collecting cans and bottles.\nCounty employees have participated in the homeless count for the past seven years after Supervisor Greg Cox brought the issue to the County Board of Supervisors, which agreed to allow employees to participate in the count and get their regular pay.\nLopez, who’s been working for the County for two years and volunteered for the count two years in a row, said she decided to participate after Robledo encouraged her to do it.\n“This is a worthwhile cause,” said López, adding that on two occasions – as a child and as an adult – she found herself without a stable place to live. “I know what it feels like.”\nKennedy has also been at the County for two years and, this too, is the second year she’s volunteered.\n“It’s passion for me to help people who are homeless. So, any opportunity I have, I’ll do it,” Robledo said. “It’s important for us to get an accurate count.”\nLast year, the Point-In-Time Count showed that 8,102 men, women and children were living on the street or in shelters, compared to the 8,576 counted in 2018.\nOf the 8,102 people experiencing homeless in the region, 3,626 were living in a shelter during the count last year compared to 3,586 in 2018.\nAddressing Homelessness\nThe results of this year’s count won’t be available until this spring. However, the County has multiple programs in place to connect people experiencing homelessness to services they need and to help them find a home.\nOver the past few years, the County has made significant investments in outreach, treatment, and housing services. The County has greatly expanded critical services since the beginning of the Affordable Care Act. During fiscal year 2019-20, the County will be spending $712.9 million on mental health and substance use treatment programs and services.\nCounty employees speak with an unidentified man on University Ave.\nCounty efforts include:\nProject One for All—Aims to get persons experiencing homelessness that have a serious mental illness off the streets and into treatment. Since the program began, 1,243 people have been housed with treatment.\nWhole Person Wellness—People who are homeless and frequently use emergency rooms receive care coordination to help them find housing and engage in services to address their physical and behavioral health needs. Over 600 people have been enrolled with 203 permanently housed with supportive services.\nCommunity Care Coordination –County is working with frequently incarcerated persons with serious mental illness to provide housing and care coordination to improve their outcomes and decrease recidivism.\nSupportive Housing—The County has invested Mental Health Services Act housing funds to provide high-quality dedicated supportive housing for clients with serious mental illness and/or co-occurring disorders.\nAffordable Housing\nThe County is also working to address the affordable housing crisis in the region. Some projects include:\nInnovative Housing Trust Fund—The County is investing $50 million to build more affordable housing for a variety of special needs populations including persons experiencing homelessness in the region.\nNo Place Like Home Program—This state funded program will add hundreds of affordable permanent supportive housing units for persons experiencing homelessness that have a serious mental illness in the region.\nIdentifying Excess Properties for Affordable Housing—The County has also identified six County-owned excess properties that are suitable for development that will include about 800 affordable, multifamily residential units.\nVeterans Affairs Supportive Housing—Offers rental assistance to homeless veterans and ongoing VA case management and supportive services. About 1,000 homeless veterans have been housed in San Diego County since the program began in 2009. Additionally, the County spends more than $130 million in U.S. Department of Housing and Urban Development funds every year to provide local residents with housing subsidies. Each month, over 10,000 households, which equates to about 20,000 people, receive housing subsidies through the County’s Public Housing Authority.\nTogether with the Veterans Administration, the County also provides monthly rental assistance to more than 500 veterans and their families through the Veterans Affairs Supportive Housing.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200123.13.29.16", "about": [{"@type": "PoliciesAndGuidelines", "policyType": "population survey", "subject": "homeless", "policyStatus": "performed"}]}