{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Rangers’ Picks: Instagram-Worthy Park Spots", "description": "San Diego County park rangers have selected 12 picture perfect parks for you to visit. Each has a picturesque spot for you to find and document. Some of the photo spots are easy to get to, like a trailhead. Others require an eagle eye and a few miles of trekking on moderate to hard trails. However, all are scenic.", "datePublished": "2020-02-06T13:16:03-08:00", "url": "https://www.countynewscenter.com/rangers-picks-instagram-worthy-park-spots/", "keywords": ["parks and rec", "hiking", "instagram", "photography", "trails"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2020-02-06T13:18:16-08:00", "articleType": "article", "articleContent": "\nSan Diego County park rangers have selected 12 picture perfect parks for you to visit. Each has a picturesque spot for you to find and document.\nSome of the photo spots are easy to get to, like a trailhead. Others require an eagle eye and a few miles of trekking on moderate to hard trails. However, all are scenic.\nBefore hitting the trail, consider the difficulty of the hike, the weather and your own physical fitness level. No matter if you are a novice or looking for a new hiking challenge, bring plenty of water, dress properly, stay on marked trails and make sure you let someone know where you are hiking.\nIf you’re posting your pics to social media, be sure to tag us on Facebook, Twitter and Instagram.\nThese are the rangers’ picks for most Instagram-worthy parks to explore in 2020:\nWilderness Gardens\n\n\n\nAddress: 14209 Hwy 76, Pala, CA  92059\nPhone: 760-742-1631\nHours: 8 a.m. – 4 p.m., Thursday – Tuesday. Closed Wednesdays and August.\nTrails: 4 miles of non-motorized multi-use trails\nParking: Day-use parking is $3.\nFacilities: Staging area, restrooms, picnic tables\n\n\n\n\nLocated in the San Luis Rey River watershed, the 737-acre preserve was the first in the County system. It offers beautiful views and a variety of easy-to-moderate hiking trails without the chaos of large crowds.\nPhoto Spot: Take the Upper Meadow Trail 3.2 miles to a large grassy expanse with seasonal wildflowers. Also, look for the foundation of an old grist mill on the County Historic Resource Board’s list of historic places. The foundation is about 0.8 miles into the hike.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by County of San Diego (@countyofsandiego) on Aug 1, 2017 at 9:05am PDT\n\n\n\nAgua Caliente\n\n\n\nAddress: 39555 Great Southern Overland Stage Route of 1849, Julian*, CA 92036\n*Address is officially Julian, but it’s located at the base of the mountain, west of Anza-Borrego State Park\nPhone: 760-765-1188\nHours: 9:30 a.m. to sunset, daily\nTrails: 4 miles of trails\nParking: $3\nFacilities: Campgrounds, cabins, restrooms, three hot spring pools (additional fee for springs)\n\n\n\n\nAgua Caliente is nestled in Anza Borrego Desert State Park about 100 miles east of San Diego. This park is popular during the winter months for both hiking and camping. On a clear night, the darkness also makes for great stargazing opportunities.\nPhoto Spot: Keep your eyes open for bighorn sheep as you walk along the Marsh Trail, and snap a selfie about a half a mile in at a palm grove. The trees are sure to please.\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Sep 8, 2019 at 11:01am PDT\n\n\nEl Capitan\n\n\n\nAddress: 13775 Blue Sky Ranch Road, Lakeside, CA 92040\nPhone: 619-561-0580\nHours: 8 a.m. – sunset, daily; closed in August due to extreme summer heat.\nTrails: 10.6 miles of trails\nParking: Parking lot\nFacilities: Staging area\n\n\n\n\nThis hike up El Cajon Mountain at El Capitan County Preserve is considered one of the most strenuous hikes in the county. It can easily take up to 6 hours to complete. Come prepared with lots of water and proper attire.\nPhoto Spot: You’ll really need to work for this photo. Take the main trail up, up, up. Feel rugged and pose next to an abandoned Jeep located near mile 5.\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Feb 26, 2018 at 10:12am PST\n\n\nMt. Gower\n\n\n\nAddress: 17090 Gunn Stage Road, Ramona, CA 92065\nPhone: 760-788-3326\nHours: 8 a.m. – sunset, daily. Closed in August.\nTrails: 8.92 miles of multi-use trails\nParking: Parking lot\nFacilities: Staging area, restrooms\n\n\n\n\nAlthough hiking along the 8 miles of multi-use trails in this nearly 1,600-acre preserve is the most typical way to experience Mt. Gower, the preserve is also very popular with equestrians and has a staging area.\nPhoto Spot: Take the challenging Mt. Gower Ridge Trail to the summit, look for a granite boulder outcrop that mimic fangs. They are located around the 3-mile mark. Take a fangtastic photo!\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Jun 6, 2019 at 2:17pm PDT\n\n\nLake Morena\n\n\n\nAddress: 2550 Lake Morena Drive, Campo, CA 91906\nPhone: 619 579-4101\nHours: Sunrise – 1/2-hour before sunset\nTrails: 8 miles of non-motorized multi-use trails\nParking: $3 parking lot\nFacilities: Campground, cabins, restrooms, pavilion, playground, Track Trails, fishing and boating\n\n\n\n\nLake Morena is a welcome oasis in East County. It’s popular because it’s a hop, skip and jump away from the Pacific Crest Trail; the lake is regularly stocked with a variety of freshwater fish; and there is camping.\nPhoto Spot: Head out on the 3.4-mile out-and-back dam access trail. At the scenic turnaround point, there is a gate to a historic dam that was constructed at the turn of the 19th century.\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Sep 3, 2019 at 10:29am PDT\n\n\nSanta Ysabel East\n\n\n\nAddress: 500 Farmer Road, Julian, CA, 92036\nPhone: 760-765-4098, 760-814-0208\nHours: 8 a.m. – sunset, daily\nTrails: 20 miles of non-motorized multi-use trails across the East and West preserves\nParking: Parking lot\nFacilities: Staging area, portable restrooms, picnic tables, nearby nearby Nature Center\n\n\n\n\nHikers, cyclists and equestrians can enjoy an adventure within this combined 6,347-acre sanctuary. Go over the river and through the woods – there are miles of trails through both the east and west preserves including two loops that traverse through unique habitats.\nPhoto Spot: From the Farmer Road Staging Area, hike 2.3 miles to the Kanaka Loop junction and turn right. Following the Coast to Crest Trail 1.5 miles to a picnic table shaded by a stately oak. Enjoy the views of Palomar Mountain to the north and Cuyamaca Peak to the south. BYOB lunch and camera.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by County of San Diego (@countyofsandiego) on Sep 3, 2018 at 3:38pm PDT\n\n\nRamona Grasslands\n\n\n\nAddress: Trailhead and staging area are on Highland Valley Rd., just east of Archie Moore Rd. in Ramona\nPhone: 760-788-3326\nHours: 8 a.m. – sunset, daily\nTrails: 4 miles of non-motorized multi-use trails\nParking: Parking lot\nFacilities: Staging area, portable restrooms, picnic tables\n\n\n\n\nNature lovers, rejoice! This biologically diverse preserve supports 23 butterfly species, 21 reptile species, six types of amphibians, 37 mammals, over a hundred types of birds and 408 plant species.\nPhoto Spot: In addition to the usual animals you might expect to see at a County park, the Grasslands are home to cattle. If you see one, mooove to the side of the trail, keep your distance and snap a pic.\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Sep 22, 2017 at 8:50am PDT\n\n\nVolcan Mountain Wilderness\n\n\n\nAddress: 1209 Farmer Road at Wynola Road, Julian, CA 92036\nPhone: 760-765-4098, 760-814-0208\nHours: 8 a.m. – sunset, daily\nTrails: 5.4 miles, plus connections to numerous other trails\nParking: Street\nFacilities: Portable restrooms, picnic tables, benches\n\n\n\n\nVolcan Mountain Wilderness Preserve offers approximately 2,900 acres of mixed conifer forest. Hike to the summit for spectacular views from the desert to the coast. This roughly 5-mile round-trip hike is considered moderately difficult, with steep inclines.\nPhoto Spot: Stride through an art installation at the Volcan Mountain Preserve trailhead to start this pictorial hike. Then trek 2.5 miles up to a telescope, and continue on for about a quarter of a mile to the historic Lightway Beacon Tower – used in the 1920s by airmail carriers. Take all the pictures.\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Nov 12, 2019 at 3:08pm PST\n\n\nHeritage Park\n\n\n\nAddress: 2454 Heritage Park Row, San Diego, CA 92110\nPhone: 619-232-7275\nHours: Sunrise to sunset\nTrails: None\nParking: Parking lot\nFacilities: Grassy lawn, restrooms, historic structures\n\n\n\n\nThis charming County park in Old Town San Diego features several restored Victorian homes and the city’s first synagogue. The large lawn is a great place for a picnic or to bring takeout from a local restaurant.\nPhoto Spot: Capture the history of Temple Beth Israel and its well-preserved 1800s-era style architecture.\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Aug 24, 2017 at 9:37am PDT\n\n\nTijuana River Valley Regional Park\n\n\n\nAddress: 2721 Monument Road, San Diego, CA 92154\nPhone: 619-428-2946\nHours: 8 a.m. – sunset, daily\nTrails: 22.5 miles of multi-use, non-motorized trails\nParking: Parking lot\nFacilities: Community garden, restrooms, sports fields, Bird and Butterfly Garden\n\n\n\n\nTijuana River Valley Regional Park offers more than 1,800 acres of diverse habitats – from dense riparian forests along the Tijuana River to coastal maritime sage scrub on top of Spooner’s Mesa, which is along a 3.3 mile trail loop.\nPhoto Spot: Spooner’s Mesa offers panoramic, international views of the coast; look south into Mexico and north across miles of San Diego County coastline. The mesa sits above the river drainage – a little over 1.5 miles from the trailhead off Monument Road.\n\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Jul 9, 2017 at 3:04pm PDT\n\n\nLouis A. Stelzer\n\n\n\nAddress: 11470 Wildcat Canyon Road, Lakeside, CA 92040\nPhone: 619-561-0580\nHours: 9:30 a.m. – sunset, daily\nTrails: 2.5  miles of multi-use trails\nParking: $3 parking fee\nFacilities: Picnic areas, barbecues, playgrounds, restrooms, special event space, Track Trails, fitness equipment, horseshoe pit\n\n\n\n\nStelzer County Park is made up of 420 acres of oak woodland and coastal sage scrub. In the spring, you will encounter the vibrant colors of wildflowers in the meadows. The trails are short, but they pack a punch!\nPhoto Spot:  Pass the westernmost playground to climb the 0.6-mile Stelzer Ridge Trail, and veer right to the Kumeyaay Promontory – or continue on to Stelzer Summit to see the most spectacular landscape views.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by County of San Diego (@countyofsandiego) on Apr 29, 2016 at 9:06am PDT\n\n\nLos Peñasquitos Canyon\n\n\n\nAddress: 12020 Black Mountain Road, San Diego, CA 92129\nPhone: 858-484-7504\nHours: 8 a.m. – sunset, daily\nTrails: 12 miles of trails\nParking: Parking lot\nFacilities: Staging area, community garden, ADA accessible restroom, event space, historic adobe ranch house\n\n\n\n\nThere are approximately 12 miles of trails in this 3,700-acre preserve, which also connects to an historic adobe ranch house featuring a museum, community garden and small collection of farm animals.\nPhoto spot: Visitors may see a small waterfall at the west end of the preserve. Just follow the easy 6.8-mile Los Peñasquitos Canyon loop trail. Snap a pic at the falls. Also, stop by to meet to two goats with big personalities. Popcorn and Base, who have their own Instagram account, are in a pen near the adobe.\n\n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA post shared by County of San Diego (@countyofsandiego) on Dec 28, 2018 at 8:56am PST\n\n\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200206.13.16.03", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}