{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Two County Children Win Virtual Earth Day Art Contest", "description": "Samarth Joshi of San Diego and Yoshie Sannwald of El Cajon have been named winners of the County Land Use and Environment Group's Earth Day 2020 drawing and animation contests for their artistic expressions of how to save and love the Earth.", "datePublished": "2020-05-08T11:35:34-07:00", "url": "https://www.countynewscenter.com/two-children-win-virtual-earth-day-art-contest/", "keywords": ["environment", "earth day", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-05-08T16:47:02-07:00", "articleType": "article", "articleContent": "\nTwo San Diego County children have been named winners of the County Land Use and Environment Group’s Earth Day 2020 drawing and animation contests for their artistic expressions of how to save and love the Earth.\nSamarth Joshi, 4, of San Diego, and Yoshie Sannwald, 10, of El Cajon won the contests that were part of the Land Use and Environment Group’s first “virtual” Earth Day 2020 celebration.\nTheir winning artwork is displayed for the public to see on the Virtual Earth Day 2020’s contest page.\nSamarth, who turns 5 years old May 12, won for his cool drawing of a blue-and-green Earth with messages of “Save Trees,” “Save Water,” “Save Earth.”\nYoshie won the animation contest for her awesome, animated computer GIF that shows a smiling, spinning Earth against a backdrop of her hands flashing the sign language letters for “Love the Earth.”\nContestants in the drawing category, which was open to children aged 10 and younger, were asked to submit an original picture or drawing illustrating “what Earth Day means to you.” The animation contest was open to children and teens between the ages of 10 and 18 years old and contestants were challenged to animate their vision of Earth Day with a GIF.\nSamarth’s mother said he was excited about winning and hasn’t stopped talking about the seasons, the rains and the environment since. She said Samarth loves arts and crafts, reading, Legos and cooking as well.\nYoshie was also excited to hear she won. Her mother said Yoshie loves to participate in group and social activities, things that have been hard to do during the COVID 19 pandemic — the event that inspired the County’s “Virtual Earth Day 2020” website. She said Yoshie loves to do all kinds of art, anything that lets her be creative and to express herself, including painting, drawing, crafts and fashion.\nAsked about Yoshie’s creative use of sign language in her GIF, her mother said Yoshie only knows a few basic American Sign Language signs,  but was inspired to use them in her artwork because she loves languages (she’s been taking Spanish since kindergarten).\nThe Land Use and Environment Group created an entire virtual Earth Day Celebration to give children, teens, adults and families a fun way to enjoy Earth Day even though beaches, parks and trails had been closed by the COVID 19 pandemic.\nThe Virtual Earth Day 2020 website included links to with games, virtual travel to exotic places around the world, videos of San Diego County Supervisors talking about what Earth Day means to them, the County’s Earth Day Pledge, and information about the County’s Climate Action Plan and what people can do to protect our air and water.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200508.11.35.34", "about": [{"@type": "EventInfo", "name": "San Diego County Land Use and Environment Group’s Earth Day 2020 drawing and animation contests", "eventAccess": "public", "eventType": "festival", "hasVirtualReplacement": "full"}]}