{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Reach 19; San Diegans Encouraged to Stay Mentally Healthy", "description": "A new COVID-19 death was reported in San Diego, bringing the region’s total to 19, the County Health and Human Services Agency announced today. The latest death was a woman in her late 90s.", "datePublished": "2020-04-05T16:52:06-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-reach-19-san-diegans-encouraged-to-stay-mentally-healthy/", "keywords": ["health", "coronavirus", "covid-19", "face covering", "mask", "pledge"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2020-04-11T08:58:30-07:00", "articleType": "article", "articleContent": "\nA new COVID-19 death was reported in San Diego, bringing the region’s total to 19, the County Health and Human Services Agency announced today. The latest death was a woman in her late 90s.\nCounty health officials continue to strongly encourage San Diegans to stay at home and cover their nose and mouth when out in public conducting essential activities.\n“Thank you to everyone doing their part to help flatten the curve,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Your efforts are helping save lives. Please continue to practice social distancing, avoid groups and gatherings of any size, wash your hands often and stay at home unless you are an essential worker.”\nCoping and Mental Health\nOutbreaks of infectious diseases, such as COVID-19, can be a stressful time for individuals and communities. It is not uncommon to feel anxious or worried while listening, reading or watching the news.\nLuke Bergmann, director of County Behavioral Health Services, said it’s important to monitor your own physical and mental health, as well as safely stay connected to your community. Know the signs of stress and when and how to seek help for yourself, as well as loved ones.\n“In the face of social distancing, remember that we all need one another – maybe more than ever – to get through difficult times like these. Staying emotionally connected as a community even if we temporarily become more physically isolated is critical to all our mental health,” said Bergmann. “Reach out through technology or phone. Check on one another.”\nBehavioral Health Service is offering resources and self-care tools to help manage our mental health and wellbeing. Find tips to maintain mental health and wellness, resources for taking care of your family during coronavirus and other emerging infectious disease outbreaks and additional information on coronavirus-sd.com.\nIf you need support or are actively seeking services, please call the Access and Crisis Line at 1-888-724-7240, and an experienced counselor will provide you with a referral to meet your needs and help determine eligibility.\nTake The Online Pledge\nOn Saturday, the County launched a new campaign encouraging San Diegans to take an online pledge and commit to helping stop the spread of COVID-19. The Stay Home, Save Lives pledge asks San Diegans to stay home, use a face covering and physically distance when leaving the house for essential reasons, and pledge to help stop the spread of the virus.\nThose signing up for the pledge are encouraged to download one of the campaign’s graphics and share it on their social media accounts with the hashtag #stayhomesd.\nCOVID-19 Cases Jump to 1,326\nOn April 5, a total of 1,326 COVID-19 cases have been reported in San Diego County, including 117 new cases in the last day.\nOf San Diego County’s cases, 53.5% (710) were men and 45.9% (609) were women. The gender of seven people is unknown. Of the known cases, 249 (18.8%) have required hospitalization and 94 (7.1%) of the total number of cases had to be placed in intensive care. With the 19th death, 1.4% of the known cases have died.\nCounty officials also talked about other measures and resources to deal with COVID-19.\nTo date:\n\nA total of 17,663 San Diegans have been tested, including 807 tests reported April 4.\nThe County has distributed more than 1.5 million personal protective equipment items to local health care providers, including more than 663,000 N-95 respirators, more than 271,000 surgical face masks and nearly 616,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live. Of 1,585 rooms for County Public Health Services use, 153 are occupied by 159 guests. Of the 441 rooms assigned to the Regional Task Force on the Homeless, 179 are being occupied by 302 people who are at higher risk of developing complications from COVID-19.\n\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200405.16.52.06", "about": [{"@type": "DiseaseNotice", "medicalCondition": "http://purl.obolibrary.org/obo/MONDO_0002025", "noticeType": ["diseasePreventionInfo", "preparation"]},{"@type": "DiseaseNotice", "infectiousAgent": "http://purl.obolibrary.org/obo/NCBITaxon_11308", "infectiousDisease": "http://purl.obolibrary.org/obo/MONDO_0005812", "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "EventInfo", "name": "Stay Home, Save Lives pledge campaign", "eventAccess": "public", "eventType": "public awareness campaign", "hasVirtualReplacement": "full"}, {"@type": "PoliciesAndGuidelines", "name": "medical supply distribution statistics", "policyType": ["strategy","metrics/criteria"], "subject": "mask/medical supply conservation/distribution", "policyStatus": "performed"}, {"@type": "PhysicalAccessInfo", "name": "usage of hotel rooms secured for sick or vulnerable", "changeType": "open", "locationAccessType": "specific", "locationType": "human welfare facility", "hasVirtualReplacement": "none", "physicalAccessChangeType": "shelter/room availability", "location": "hotel rooms across San Diego County", "locationNumbers": "2026"}]}