{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Increase to 36; All Gatherings Now Prohibited", "description": "The County Wednesday expanded its Health Order to prohibit gatherings of any type, effective Thursday.", "datePublished": "2020-04-08T16:52:15-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-increase-to-36-all-gatherings-now-prohibited/", "keywords": ["health", "36 covid deaths", "coronavirus", "covid-19", "health order expanded"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-11T08:49:58-07:00", "articleType": "article", "articleContent": "\nThe County Wednesday expanded its Health Order to prohibit gatherings of any type, effective Thursday.\nThe new directive means that gatherings of 10 people or less are no longer allowed in San Diego County, unless they live in same household.\n“We decided to extend the gathering restrictions because people were getting together in parks, beaches and other open spaces,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should stay at home and only go in public when doing essential activities, such as grocery shopping or going to the pharmacy.”\nThe revised order also expands the requirement for employees of certain businesses to wear face coverings to banks, public transportation and child care providers that serve food.\nSan Diegans are strongly encouraged to wear a facial covering while in public.\nCOVID-19 Deaths Reach 36\nThe County is also reporting five more COVID-19 deaths, bringing the region’s total to 36. Most of the people who have died had underlying medical conditions.\n“COVID-19 deaths are very unfortunate, but more could occur as the number of positive cases increases,” Wooten said.\nThe County has released the age, gender and ethnic breakdown of COVID-19 deaths reported in the region. They were:\n\n15 White\n10 Hispanic\n2 Asian\n9 Unknown\n\nAge breakdown is as follows:\n\n80 and older: 18\n70 to 79: 9\n60 to 69: 3\n50 to 59: 4\n20 to 29: 2\n\nGender breakdown:\n\n22 Men\n14 Women\n\nCounty COVID-19 Cases Reach 1,530\nThrough April 8, a total of 1,530 COVID-19 cases have been reported in San Diego County, including 50 new cases in the last day.\nOf San Diego County’s cases, 785 (51.3%) were men and 735 (48.2%) were women. The gender of eight people is unknown. Of the known cases, 316 (20.7%) have required hospitalization and 122 (8%) of the total number of cases had to be placed in intensive care. Thirty-six (2.4%) have died.\nCounty officials also talked about other measures and resources to deal with COVID-19. To date:\n\nNearly 21,200 tests have been administered to San Diegans, including 842 tests reported April 6.\n\n\nThe County has distributed nearly 1.9 million personal protective equipment items to local health care providers, including over 782,000 N-95 respirators, more than 355,000 surgical face masks and nearly 697,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who have health vulnerabilities and have no place to live.\nOf the 1,585 rooms for County Public Health Services use, 174 are occupied by 182 guests.\nOf the 441 rooms assigned to the Regional Task Force on the Homeless, 190 are being occupied by 315 people who are at higher risk of developing complications from COVID-19.\n\nUse of Hydroxychloroquine\nThere are no drugs or therapy that the U.S. Food and Drug Administration has approved for the treatment or prevention of COVID-19. However, on March 30, 2020, the FDA did issue an emergency use authorization of hydroxychloroquine in certain hospitalized patients.\nWhile this is different than an FDA approval, it is a mechanism for medical providers to consider use of hydroxychloroquine in specific circumstances while they await the results of clinical trials using this drug. The decision to use the drug is up to the family of a patient in consultation with their medical provider.\nHydroxychloroquine is used to prevent or treat malaria, caused by mosquito bites. The medication is also used to treat certain auto-immune diseases, such as lupus and rheumatoid arthritis.\nMore Case Information\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. The data will also be broken down by ethnic group. For more information, visit www.coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200408.16.52.15", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult", "treatmentInfo", "misinformationClarification", "diseaseDemographics"]}, {"@type": "AuthorizationRequest", "name": " FDA issues emergency use authorization of hydroxychloroquine in certain hospitalized patients", "authorizationSubject": "emergencyUse", "requestApproval": "granted", "requestGrantorType": "federal", "requestGrantor": "FDA"}, {"@type": "PoliciesAndGuidelines", "name": "All Gatherings Now Prohibited", "policyType": "public measures", "subject": ["mask usage", "stay at home", "essential workers/businesses", "gathering size limitations", "gathering space limitations"], "policyStatus": "enforced"}, {"@type": "PoliciesAndGuidelines", "name": "medical supply distribution statistics", "policyType": ["strategy","metrics/criteria"], "subject": "mask/medical supply conservation/distribution", "policyStatus": "performed"}, {"@type": "PhysicalAccessInfo", "name": "usage of hotel rooms secured for sick or vulnerable", "changeType": "open", "locationAccessType": "specific", "locationType": "human welfare facility", "hasVirtualReplacement": "none", "physicalAccessChangeType": "shelter/room availability", "location": "hotel rooms across San Diego County", "locationNumbers": "2026"}]}