{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Celebrating Love with Valentine’s Day Weddings", "description": "Love was certainly in the air as dozens of couples said “I Do” during wedding ceremonies Friday at the County Administration Center.", "datePublished": "2020-02-14T14:15:43-08:00", "url": "https://www.countynewscenter.com/celebrating-love-with-valentines-day-weddings/", "keywords": ["government", "assessor/recorder/county clerk", "fgg", "marriage reservation", "online marriage reservation", "valentine s day", "weddings"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-14T16:44:03-08:00", "articleType": "article", "articleContent": "\nLove was certainly in the air as dozens of couples said “I Do” during wedding ceremonies Friday at the County Administration Center.\nValentine’s Day is typically one of the busiest days of the year for the Assessor/Recorder/County Clerk’s office and this one had the added bonus of leading into a three-day weekend. Unlike the rain last year, the weather was also wedding picture perfect.\nThe office issued nearly 24,000 marriage licenses last year. Annually, nearly half of all weddings in the county are performed at a County office.\nThe Assessor/Recorder/County Clerk offers five locations for wedding ceremonies. They’re located at their offices in San Marcos, Kearny Mesa, Chula Vista, Santee and the County Administration Center downtown.\nThe Santee location offers a brand new, expanded wedding site and the County Administration Center boasts a newly remodeled wedding guest lounge and two marriage rooms with views overlooking San Diego Bay. Couples can also tie the knot outdoors at the Waterfront Park surrounding the historic County Administration Center.\nCeremonies can be performed in either English or Spanish. Couples can make an appointment for a marriage license or wedding ceremony through an online wedding reservation system.\nWhile appointments are generally required to be married, walk-ins are welcomed only on Valentine’s Day at the downtown location until 5 p.m. Staff will stay and perform ceremonies for anyone still in line after that time.\nFor more information about the County’s marriage services, visit the Assessor/Recorder/County Clerk’s website.\n  Tristan and JesslynPaola Olguin Perez and Jose JimenezJanice and DariousRebecca Vanegas and Micahel FinnAmanda and LisaJohnathan and GeannaYancy and SalomonKeith and AutumnYanjun Chen and Menglei MaElizabeth and Salvador BecerraDulce Garcia and Jayro GarciaRaul Reyes and Sacnite Adrian  \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200214.14.15.43", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}