{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Local COVID-19 Cases Surpass 500", "description": "County officials re-emphasized the need for residents to stay at home and practice social distancing as the number of local cases surpassed 500 today.", "datePublished": "2020-03-29T19:52:43-07:00", "url": "https://www.countynewscenter.com/local-covid-19-cases-surpass-500/", "keywords": ["health", "coronavirus", "covid-19", "social distancing"], "author": [{"type": "@Person", "name": "Michelle Mowad", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Michelle", "familyName": "Mowad"}], "dateModified": "2020-03-29T20:05:56-07:00", "articleType": "article", "articleContent": "\nCounty officials re-emphasized the need for residents to stay at home and practice social distancing as the number of local cases surpassed 500 today.\nCounty health officials reported an additional 31 COVID-19 cases in San Diego County, bringing the total to 519.\nOf San Diego County’s cases, 298 (57.4%) were men and 219 (42.2%) were women. Of the known cases, 106 (20.4%) have required hospitalization, 47 (9.1%) had to be placed in intensive care and seven (1.3%) have died.\nDr. Eric McDonald, M.D., M.P.H., the medical director of the County’s Epidemiology and Immunization Branch, warned against drawing conclusions about the local outbreak based on day-to-day results.\n“It takes a trend of many days to know how the outbreak is going, so fewer cases today compared to the day before does not indicate much,” said McDonald.\nHe reemphasized following health orders to stay at home and only go out for essential needs, like grocery shopping or taking the dog for a walk.\nSocial distancing has been proven to slow the spread of pandemics so that sick people don’t overwhelm the local health care system. The goal is to “flatten the curve” of COVID-19 – meaning to spread the number of new cases out over time – and lessen the number of people who contract the virus and need hospitalization. Doing so will give the local health care system time to increase its capacity to care for more sick people.\nFood Safety\nIf a worker at a restaurant or food market tests positive for COVID-19, the business is required by state law to notify the County Department of Environmental Health. County public health officials work with the business to identify contacts of the employee and has persons at risk self-quarantine. A public notification is issued only if there are specific actions members of the public need to take.\nEnvironmental Health is working closely with the food industry during this outbreak. The department has developed materials on food safety practices, good food handler hygiene, and disinfection guidance, using current recommendations from the Centers for Disease Control and Prevention and the Environmental Protection Agency, and provided them to local restaurants and stores. In addition, this information for restaurant, food and beverage providers is posted online and has been translated into seven languages – English, Spanish, Mandarin, Vietnamese, Tagalog, Farsi and Arabic.\n“Since early March, the County’s Department of Environmental Health has been proactive and has worked with food facilities to educate them and help them adhere to the public health orders, such as modifying operations to take out or curbside pick-up,” said Supervisor Nathan Fletcher.\nFood facilities should contact the Department of Environmental Heath’s Epidemiology Liaison as soon as possible if they have a situation of an ill food handler (858) 505-6814 or fhdepi@sdcounty.ca.gov.\nAdditional Resources\nThe County’s COVID-19 webpage contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\nLive Well San Diego has launched Live Well at Home, a collection of free resources aimed at helping San Diegans in maintaining a healthy mind and body while staying indoors. These resources are categorized by age group and topic to match the needs of the community.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200329.19.52.43", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "diseasePreventionInfo"]}, {"@type": "PoliciesAndGuidelines", "name": "Food Safety", "policyType": "executive order", "subject": "food safety practices", "policyStatus": "required"}]}