{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Agriculture Blossoms Again in Annual Crop Report, Nears $1.8 Billion", "description": "Agriculture values blossomed for the third year out of the past four and grew close to $1.8 billion, a height they last reached in 2014, in the County of San Diego’s annual Crop Report.", "datePublished": "2020-08-25T15:07:59-07:00", "url": "https://www.countynewscenter.com/agriculture-blossoms-again-in-annual-crop-report-nears-1-8-billion/", "keywords": ["agriculture", "agriculture", "crop report", "crops", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-08-25T15:53:01-07:00", "articleType": "article", "articleContent": "\nAgriculture values blossomed for the third year out of the past four and grew close to $1.8 billion, a height they last reached in 2014, in the County of San Diego’s annual Crop Report.\nThe value of all agriculture crops and commodities rose about 1.5% in the new Crop Report that covers the 2019 growing season, from $1,769,815,715 in 2018 to $1,795,528,573.\nTotal agriculture values also increased in the 2016 and 2017 reports, before slipping by one-quarter of 1% in last year’s 2018 report.\nThis year’s increase was fueled in large part by a 5.8% increase, from $322.9 million in 2018 to $341.7 million in 2019, in the overall values of Fruits and Nuts, a category that includes three of the Top 10 crops: avocados, lemons and oranges.\nOrnamental Trees and Shrubs, which has been the top crop in San Diego County for the past 11 Crop Reports, since 2009, continued to increase in overall value, increasing by just .6%, but to $445,488,124, its highest total over that time.\nThe rest of the annual Top 10 crops remained similar to previous years, although some crop categories were changed slightly. For example, this year’s number two crop, Bedding Plants, Color & Herbaceous Perennials, like flowers and herbs, was combined with Cactuses & Succulents and had a total value of $399,028,516.\nThe third-ranked crop, Indoor Flowering & Foliage Plants earned a total value of $291,335,199. The fourth-ranked, and possibly San Diego’s most famous crop, Avocados, increased in value by nearly 16% and $19 million, from $121,038,020 in 2018 to $140,116,363.\nThe annual Crop Report is compiled by the County’s Department of Agriculture, Weights and Measures and can be seen online. The report provides a yearly snapshot of an industry that remains a staple of the region’s economy despite challenges like drought, rising water costs, fires, freezes and pests.\nSan Diego County’s Board of Supervisors has taken several actions in recent years to boost agriculture, including: creating a boutique winery ordinance to promote the creation of small wineries; approving a new beekeeping ordinance that allows more beekeeping while protecting the public; adopting an agricultural easement program that preserves agricultural space; streamlining regulations for things like cheese-making, agritourism and onsite horticultural sales.\nSupervisor Jim Desmond’s Fifth District, home to a lot of the county’s agricultural land, said agriculture is an important part of the economy.\n“Over the last year, we have seen how essential farming is in San Diego County,” Desmond said. “It is an honor to be the supervisor of District Five, which has a diverse variety of agricultural crops ranging from flowers to strawberries and avocados. I will continue to be a supporter of agriculture, which will always be essential to the region’s economy!”\nOther interesting highlights from the 2019 Crop Report include:\n\nThe agriculture industry continues to do more with less, increasing in total value while working fewer acres. In 2019 total agriculture values increased 1.5% while reporting 234,477 acres in production. That was 3.3% fewer acres reported in 2018 and the fewest number of acres reported in production in 17 years — since 2002.\nThe increase to $140.1 million for Avocados, was that crop’s largest value since 2014.\nOne of the largest percentage increases was for “Field, other,” which included a relatively new crop, industrial hemp. The category increased a whopping 373% from $794,625 in 2018 to $3,760,517.\nWine Grapes saw its third year of double-digit percent increases, rising 21.5% from $4,591,032 in 2018 to $5,580,300. Wine Grapes became a trendy crop and soared by over 500% in 2012, two years after the Board of Supervisors approved the Boutique Winery Ordinance to promote the creation of small wineries.\n\nHere’s a look at the 2019 Crop Report’s Top 10 Crops:\n\nFor more information, go to the 2019 Crop Report.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200825.15.07.59", "about": [{"@type": "Other", "description": "Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}