{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "15 New COVID-19 Deaths Reported Locally", "description": "Fifteen new COVID-19 deaths were reported, bringing the region’s total to 87, the County Health and Human Services Agency announced today.", "datePublished": "2020-04-21T18:57:15-07:00", "url": "https://www.countynewscenter.com/15-new-covid-19-deaths-reported-locally/", "keywords": ["health", "15 covid-19 deaths", "board update on covid-19", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-22T14:42:17-07:00", "articleType": "article", "articleContent": "\nFifteen new COVID-19 deaths were reported, bringing the region’s total to 87, the County Health and Human Services Agency announced today.\nThe 15 San Diegans died between April 16-20. Their ages ranged from 43 to 92 years. Nine were men and six were women. Fourteen had underlying medical conditions and one did not.\n“This is the most COVID-19 deaths we’ve announced in a single day and they are an indication of the tragic loss that is occurring in our residents and communities,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Our sincere condolences go out to the friends and family of the people who have died from this novel virus.”\nOf the 87 people who have died from COVID-19, 76 were 60 years and older. Forty-eight were men and 39 were women. Age, gender and ethnic/race breakdowns for cases and deaths are posted at coronavirus-sd.com.\nCounty COVID-19 Cases Increase to 2,434\nAn additional 109 COVID-19 cases were announced today, bringing the County’s total to 2,434.\nOf the local cases, 1,243 (51.1%) were men and 1,185 (48.7%) were women. Of the reported cases, 592 (24.3%) have required hospitalization and 199 (8.2%) of the total number of people who tested positive had to be placed in intensive care. Eighty-seven (3.6%) have died.\nHospitals report directly to the state the number of patients who are currently hospitalized and in intensive care. The totals can be found here.\nSupervisors Updated On Criteria to Ease Restrictions\nCounty officials gave the County Board of Supervisors an update on the current situation of COVID-19 in the region and shared the criteria that must be met before local restrictions are eased or lifted.\nThe County will use five federal criteria and state recommendations to determine when and how to ease some of the restrictions in the local Health Officer Order.\nThe County has met three of the five federal criteria that need to be met before proceeding to a phased opening.\nCriteria Met\n\nThe County has experienced a 14-day downward trajectory in the number of people with influenza-like illness (ILI) at local emergency departments. From March 16 to April 15, the percentage of ILI in the County dropped from 10% to 3%.\nThe number of positive COVID-19 cases or positive cases as a percent of the total tests administered had to experience a 14-day downward trajectory. Since April 6, the County has experienced a decreasing percentage in positive COVID-19 tests among San Diegans.\nThe local health care system has been able to handle the number of patients needing hospitalization for COVID-19 and other illnesses and diseases. Currently, local hospitals are operating at 68% of their capacity.\n\n“We will continue monitoring these data to see if this trend holds,” Wooten said.\nCriteria in Progress\n\nThe County has to register a downward trajectory of COVID-like syndromic cases reported within a 14-day period. Since April 4, this trend has varied and syndromic indicators for COVID-like cases is being monitored daily.\nThere also needs to be a robust testing program in place for at-risk health care workers, including emerging antibody testing. The County has organized a Laboratory Task Force of local hospitals, relevant clinics and commercial laboratory systems to expand testing and ensure the safety of testing personnel.\n\nCounty Microbiologist Jovan Shepherd prepares a specimen for testing of the novel coronavirus.\nRegional testing capacity recently has been expanded to about 3,400 tests per day, including rapid testing at the County Public Health Lab and some local hospitals. The list of priority groups for testing also has been expanded to include people who are homeless and people in long-term care facilities. Other groups to be added include people who are HIV positive, low-income individuals, as well as members of various racial groups and Native Americans. \nReopening in Phases\nPlanning also is underway for a phased opening of recreation activities that would include parks, trails, beaches, watersports/boating, golf courses, basketball and tennis courts and open spaces, all with certain restrictions in place.\nLarge gatherings and organized team activities would remain prohibited, other than those involving household units.\nThe guidance for the general public remains the same. You should:\n\nStay home unless you’re an essential worker.\nCover your face when in public.\nPractice physical distancing and stay six feet apart from other.\nContinue practicing good handwashing hygiene.\nStay home if you’re sick and isolate yourself from others. Call your health care provider if your symptoms get worse.\n\n“If you leave your place, cover your face,” Wooten reiterated.\nPublic Health Officer Wilma Wooten wears a face covering to remind residents one is still recommended when out in public.\nCOVID-19 Cost to County Government\nThe County is spending an average of $14 million each month to mitigate the impact of COVID-19 in the region. The funds are being spent on multiple mitigation activities, including:\n\nSurveillance, contact tracing and emergency response.\nVentilators, lab testing and personal protective equipment.\nCare and shelter needs for at-risk individuals, including people who are homeless.\n\nIt is estimated that the above activities will cost the County $60 million by the end of the current fiscal year, which ends June 30.\nThe County will be seeking reimbursement from federal and state resources, and will be looking for other funding sources at they become available.\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on COVID-19, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200421.18.57.15", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "Criteria to Ease Restrictions", "policyType": "public guidelines", "subject": "openings", "policyStatus": "explained"}, {"@type": "TestingInfo", "testType": "rapid testing"}, {"@type": "PoliciesAndGuidelines", "name": "guidance for the general public", "policyType": "public guidelines", "subject": ["mask usage", "stay at home", "essential workers/businesses", "physical distance", "gathering size limitations"], "policyStatus": "unclear"}, {"@type": "FundingRequest", "name": "funding to mitigate the impact of COVID-19 in the region", "fundingRequestType": "budget", "amount": "60000000", "requestApproval": "pending decision"}]}