{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Places of Worship, Hair Salons and Barbershops Can Open with Modifications", "description": "Houses of worship, hair salons and barbershops can all resume services, but they must implement a variety of safety measures to prevent the spread of COVID-19, the County Health and Human Services Agency announced today.", "datePublished": "2020-05-26T19:29:21-07:00", "url": "https://www.countynewscenter.com/places-of-worship-hair-salons-and-barbershops-can-open-with-modifications/", "keywords": ["health", "coronavirus", "covid-19", "reopening plan"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-27T08:30:29-07:00", "articleType": "article", "articleContent": "\nHouses of worship, hair salons and barbershops can all resume services, but they must implement a variety of safety measures to prevent the spread of COVID-19, the County Health and Human Services Agency announced today. All must complete and post the County’s Safe Reopening Plan before opening.\nPlaces of worship will have to limit attendance to 25% of capacity, or 100 people or fewer, whichever of the two is smaller.\nWorshippers not in the same household will have to sit or stand six feet apart. State guidance says houses of worship should consider discontinuing singing and other practices that increase the chance of virus transmission through exhaled droplets. They also should consider or modify practices that require sharing items.\nThe state also gave the green light for hair salons and barbershops to reopen. Employees will have to complete a health screening at the beginning and end of each shift and both stylists and customers must wear facial coverings for the duration of the hair appointment.\nWhile the businesses may open immediately, certain services frequently offered are not yet allowed. This includes eyelash and eyebrow services, facials and shaves.\n“As an increasing number of businesses reopen, San Diegans should continue to adhere to the safety guidelines we have implemented during the pandemic,” said Wilma J. Wooten, M.D., M.P.H, County public health officer. “Being in close proximity to non-household members increases the risk of being exposed to COVID-19 and people should wear a face covering and frequently wash their hands to prevent the spread of the virus.”\nThe state has not yet permitted nail salons to reopen. The county expects to receive further guidance about those businesses later.\nCustomers or employees should not enter any business if they have symptoms of COVID-19, which include fever, cough, shortness of breath or difficulty breathing, chills, muscle pain, sore throat, or a new loss of taste or smell.\nChanges to Health Order\nThe County also announced several additional changes to its public health order today. Going forward, all businesses will have to implement temperature and health screenings for employees. Businesses must also ensure that all employees wear facial coverings and maintain physical distancing.\nBeginning Wednesday, one-on-one sports lessons are also allowed, as long as both the instructor and student comply with physical distancing and face covering requirements. Students and instructors should not share equipment.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,908 tests were reported to the County May 25 and 85 or 2% were positive.\n3.1% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n85 new cases were reported for a San Diego County total of 6,882.\n1,255 or 18.2% of the total cases have required hospitalization.\n375 or 5.4% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nNo additional COVID-19 deaths were reported today, with the region’s total remaining at 249.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n77 active outbreaks, 53 at congregate living facilities and 24 in community settings.\n1,482 cases, including 122 deaths in congregate living facilities.\n316 cases, including five deaths in community settings.\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200526.19.29.21", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PhysicalAccessInfo", "name": "Places of Worship, Hair Salons and Barbershops Can Open with Modifications", "changeType": "open", "locationAccessType": "public", "locationType": ["religious facilities", "grooming facilities"], "hasVirtualReplacement": "unclear", "physicalAccessChangeType": "additional measures in place"}, {"@type": "PoliciesAndGuidelines", "name": "Places of worship, hair salon, and barbershop guidelines", "policyType": "public guidelines", "subject": ["mask usage", "physical distance", "gathering size limitations", "gathering space limitations", "openings", "sanitation or safety protocol", "temperature screening"], "policyStatus": "approved"}]}