{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "State Moves County’s Removal from Watch List to Tuesday", "description": "The state has reviewed its data and determined that the County’s three-day metric of fewer than 100 cases per every 100,00 residents started Aug. 15 and it’s anticipated to end today.", "datePublished": "2020-08-17T17:12:32-07:00", "url": "https://www.countynewscenter.com/state-moves-countys-removal-from-watch-list-to-tuesday/", "keywords": ["health", "coronavirus", "coronavirus case rate", "covid-19", "monitoring list"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-20T11:04:06-07:00", "articleType": "article", "articleContent": "\nThe state has reviewed its data and determined that the County’s three-day metric of fewer than 100 cases per every 100,00 residents started Aug. 15 and it’s anticipated to end today. That means the region could be off the Monitoring List on Tuesday, Aug. 18, and the 14-day period for schools to reopen could begin.\nThe state’s case rate for the past three days is:\n\nAug. 17: 89.8\nAug. 16: 91.8\nAug. 15: 94.7\n\nShould the County continue to hold its case rate below 100 in the days ahead, the 14-day wait period would end Aug. 31 and all schools could reopen for in-person teaching after that. No other businesses would be allowed to modify their operations until the state gives further guidance.\n“The state reassigned backlogged tests and recalculated their figures and, unfortunately, that has shifted the 17-day wait period for all local schools to reopen,” said Wilma Wooten, M.D., M.P.H., County public health officer. “People should be patient as we await further guidance from the state to determine what businesses could reopen.”\nLocal health officials continue to urge San Diegans to follow the recommended precautions so that the case rate remains below 100. That includes using a face covering when in public, maintaining physical distance, avoiding large gatherings, staying home if sick and regular hand-washing.\nWearing a face covering protects you and others from COVID-19.\nCommunity Setting Outbreaks:\n\nTwo new outbreaks were identified on Aug. 16: one in a grocery setting and one in a grocery/retail setting.\nIn the past seven days, 21 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n6,377 tests were reported to the County on Aug. 16 and the number of laboratory-confirmed cases was 4%.\nThe 14-day rolling average percentage of positive cases is 4.2%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,890.\n\nCases:\n\n282 new cases were reported in San Diego County for a total of 34,960.\n2,868 or 8.2% of cases have required hospitalization.\n716 or 2.0% of all cases and 25% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo new COVID-19 deaths were reported in San Diego County on Aug. 16 and the region’s total remains at 626.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200817.17.12.32", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "state watch list metrics", "policyType": "metrics/criteria", "subject": "case rate <100/100000", "policyStatus": "performed"}]}