{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Students 2020 Vision Celebrates Clean Air on APCD’s New Calendar", "description": "Call it their 2020 vision. Hundreds of San Diego County students have spoken — and drawn and painted and colored — to say that clean air and protecting the environment are important. Nearly 500 students submitted their personal art to the Air Pollution Control District's 2020 Calendar contest.", "datePublished": "2020-01-10T10:37:33-08:00", "url": "https://www.countynewscenter.com/students-2020-vision-celebrates-clean-air-on-apcds-new-calendar/", "keywords": ["environment", "air pollution control district", "clean air for all", "sustainability"], "author": [{"type": "@Person", "name": "Gig Conaughton", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Gig", "familyName": "Conaughton"}], "dateModified": "2020-01-10T10:50:54-08:00", "articleType": "article", "articleContent": "\nCall it their 2020 vision. Hundreds of San Diego County students have spoken — and drawn and painted and colored — to say that clean air and protecting the environment are important.\nNearly 500 kindergarten through high school students submitted their personal artwork to the County Air Pollution Control District’s 2020 Calendar contest in October and November to show the importance of clean air and how each of us can reduce pollution.\nThirteen of those works of art, one piece for the cover and one for each month, were selected by APCD judges and now illustrate the district’s official 2020 Calendar that it gives out free to the public.\nEach of the students who submitted their art will receive a free calendar and all of the art has been posted on APCD’s website for everyone to enjoy — students, their families and the public.\nAPCD Director Bob Kard said everyone at the district continues to be thrilled by the numbers of students who take part in the contest each year.\nThe calendar contest has become increasingly popular, with 476 students submitting personal, original artwork for the 2020 calendar, besting the previous high of 452 students the year before.\n“You know, it shows that protecting the environment and keeping our air clean means a lot to them,” Kard said.\nAPCD printed out roughly 1,500 calendars. People who are interested in getting a calendar can email: APCDoutreach.LUEG@sdcounty.ca.gov.\nFor more information about the Air Pollution Control District and its work to keep the county’s air clean, go to the APCD’s website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200110.10.37.33", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}