{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Stay Home and Stay Cool During Heat Warning", "description": "Residents are reminded to avoid activities that may cause overheating due to high temperatures this week in San Diego’s valleys and deserts.", "datePublished": "2020-05-06T16:10:09-07:00", "url": "https://www.countynewscenter.com/stay-home-and-stay-cool-during-heat-warning/", "keywords": ["health", "heat", "heat advisory", "heat warning"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-05-06T16:20:24-07:00", "articleType": "article", "articleContent": "\nResidents are reminded to avoid activities that may cause overheating due to high temperatures this week in San Diego’s valleys and deserts.\n“With hot weather comes huge risks for many San Diegans, especially our seniors and the disabled,” said Supervisor Dianne Jacob, who represents much of East County. “In light of the current stay-at-home orders, it’s critical that we are in contact with family, friends and neighbors and make sure they are doing all they can to stay cool.”\nThe National Weather Service issued the heat advisory for county valleys including the cities of Escondido, El Cajon, San Marcos, Santee, and Poway. Temperatures will be in the 90s with a peak of 95 to 100 on Wednesday and Thursday. Forecasters also issued an excessive heat warning for the San Diego County deserts where temperatures are expected to reach 103 to 108 degrees in the afternoons.\nDuring this hot weather, seniors can stay home and stay cool. Even with some Cool Zone sites opening at the end of May, not all seniors or persons with disabilities can leave home to escape the heat.  Homebound individuals, those lacking transportation, and those who decide to stay home due to the risk of COVID-19, may not be able to take advantage of traditional Cool Zone sites.\nTo help these community members beat the heat, the County of San Diego, in partnership with SDG&E, provides free electric fans to those who are living on limited incomes. To be eligible, a resident must not have access to an air-conditioned space at their home or apartment building. To learn more about the fan program or to request a fan, call Aging & Independence Services at (800) 339-4661.\n“We want to thank our SDG&E community partner for making this program available to give some relief from the heat to our more vulnerable residents,” said County Supervisor Jim Desmond, whose district covers parts of North County out to the desert.\nHealth officials recommend people do the following to avoid overheating\n\nIf available, stay in an air-conditioned area during the hottest hours of the day\nWear light, loose-fitting clothing\nDrink plenty of water (avoid alcohol and sugary drinks) and don’t wait until you are thirsty\nTake cool showers\nNever leave a child, elderly person, or pet unattended in a car\nKeep pets cool in hot weather\nAvoid unnecessary hard work or activities outside during the hottest part of the day\nAvoid unnecessary sun exposure and wear a wide-brim hat if you need to be in the sun\nAvoid using the oven to cook\n\nAn extremely high body temperature (103 or higher), dizziness, nausea, confusion, and headache are signs of heatstroke or exhaustion. If someone shows these signs, call 9-1-1 and begin cooling the individual by:\n\nMoving them to a shaded area\nSpraying with cool water and fanning them\nPlacing them in a cool shower if they are alert\nMonitoring the body temperature and continue cooling efforts\nDo not give the victim fluids to drink\n\nOlder adults (65 years and older), infants and children, and people with chronic medical conditions are more prone to heat stress. People with elderly neighbors should check in on their well-being. This can be done while adhering to social distancing recommendations in person or by phone or video conferencing if available.\nFor more information on extreme heat, visit the Centers for Disease Control and Prevention. For more information on the Cool Zones program as well as tips to stay cool at home, visit www.coolzones.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200506.16.10.09", "about": [{"@type": "DiseaseNotice", "medicalCondition": {"name": "heat illness", "url": "https://www.wikidata.org/wiki/Q1191065"}, "noticeType": ["diseasePreventionInfo", "preparation"]}, {"@type": "EventInfo", "name": "Heat Advisory and Cool Zone cancellation", "eventAccess": "public", "eventType": "public awareness campaign;public safety campaign", "hasVirtualReplacement": "none", "location": ["Escondido", "El Cajon", "San Marcos", "Santee", "Poway"]}]}