{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Convenient Drop-off Locations for Mail Ballot Voters", "description": "Has your mail ballot been sitting on the coffee table for weeks and you are just now getting around to marking it? You have options when it comes to turning in your mail ballot for the March 3 Presidential Primary Election.", "datePublished": "2020-02-24T09:53:15-08:00", "url": "https://www.countynewscenter.com/convenient-drop-off-locations-for-mail-ballot-voters-4/", "keywords": ["elections", "fgg", "mail ballot drop offs", "mail ballot voters", "march 3 2020 election", "presidential primary election"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-08-24T10:42:45-07:00", "articleType": "article", "articleContent": "\nNote this is for March 2020 Primary Election. When drop-off locations are available for Nov. 3 election, they will be posted on sdvote.com. \nHas your mail ballot been sitting on the coffee table for weeks and you are just now getting around to marking it? You have options when it comes to turning in your mail ballot for the March 3 Presidential Primary Election.\nYou can drop it in the mail, but if you wait past tomorrow, you may want to drop it off at any one of 61 sites throughout the county before Election Day. These drop-off sites will be open during each location’s regular business hours from Monday, Feb. 24 through Election Day.\nThe quicker ballots are returned to the Registrar’s Office, the quicker they can be prepared for counting on Election Night, saving time and taxpayer dollars.\n“More than 1.3 million San Diego County voters have chosen the convenience of mail ballots and that number continues to rise,” said Registrar Michael Vu. “The early drop-off sites provide a great service for voters. They help with the timely return of mail ballots and decrease the high volume of voters dropping off mail ballots at polling places on Election Day.”\nThe drop-off sites are located at 61 libraries across the county. The sites are not early voting locations, but for mail ballots only. Each mail ballot packet contains an insert with additional information about the drop-off locations.\nRegistrar of Voters employees will accept the mail ballots at the drop-off locations and follow specific protocols to maintain security.\nVoters can also drop off their mail ballot or vote in person at the Registrar of Voters located at 5600 Overland Ave., San Diego, 92123. The office will be open from 8 a.m. to 5 p.m. Monday through Friday until Election Day when the voting hours will change to 7 a.m. to 8 p.m. to reflect the hours at the polls, or between 8 a.m. and 5 p.m. Saturday, Feb. 29 and Sunday, March 1.\nFor additional election information visit, sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200224.09.53.15", "about": [{"@type": "PhysicalAccessInfo", "changeType": "open", "locationAccessType": "specific", "locationType": "polling facility / ballot drop-off", "hasVirtualReplacement": "partial", "physicalAccessChangeType": "polling station / ballot drop-off availability", "location": "multiple", "locationNumbers": "61", "effectiveDate": "2020-02-24"}]}