{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Prepared for New Coronavirus; One Patient Under Investigation", "description": "The County Health and Human Services Agency (HHSA) is closely monitoring a new coronavirus causing a global outbreak of respiratory illnesses reported in China.", "datePublished": "2020-01-27T21:06:17-08:00", "url": "https://www.countynewscenter.com/county-prepared-for-new-coronavirus-one-patient-under-investigation/", "keywords": ["coronavius"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-01-29T11:51:29-08:00", "articleType": "article", "articleContent": "\nThe County Health and Human Services Agency (HHSA) is closely monitoring a new coronavirus causing a global outbreak of respiratory illnesses reported in China.\nWorking with the Centers for Disease Control and Prevention (CDC), the California Department of Public Health and the local medical community, HHSA has a plan in place to identify, isolate, test and investigate a possible case of the respiratory illness.\n“We’re in constant communication with all the appropriate entities and have a protocol and plan to deal with any potential case,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We are prepared and are conducting surveillance for this new virus just like we do for any communicable disease, including previously identified coronaviruses.”\nCoronaviruses are a large family of viruses that are common in many different species of animals, including camels, cattle, cats and bats.\nRarely, animal coronaviruses can infect people and then spread between people such as with Middle East respiratory syndrome and severe acute respiratory syndrome. Many of the patients in the pneumonia outbreak caused by 2019-nCov in Wuhan, China had some link to a large seafood and live animal market, suggesting animal-to-person spread. However, a growing number of patients diagnosed with 2019-nCoV have not reported exposure to animal markets, indicating person-to-person spread is occurring.\nPotential Case Reported\nLast week, HHSA issued a health alert to the local medical community asking them to be on the lookout for and report potential cases in people who have traveled to the areas where cases of this new virus (2019-nCoV) have been reported.\nOn Sunday, a potential case was reported to HHSA in a person who travelled to 2019-nCoV impacted areas in China. After consulting with a local hospital, a specimen was collected, sent to the County Public Health Lab for packaging and then sent to the CDC for testing.\nThe patient is currently in isolation at home and results are expected back from the CDC tomorrow. Currently, the CDC is the only entity capable of testing for this novel coronavirus.\nIn the meantime, the County has been conducting its investigation to identify people who may have had close contact with the patient and quarantine them.\n“The risk of infection for the general public is minimal,” Wooten added. “If you have not traveled to an area where the virus has been detected or had close contact with a patient who tested positive for this type of coronavirus, the risk of infection is very low.”\nWhat to Do if You’ve Traveled to an Impacted Area?\nCurrently, five airports across the nation are monitoring returning travelers from areas impacted with this new strain of coronavirus.\nPatients with confirmed 2019-nCoV infection have reported mild to severe respiratory illness with symptoms of:\n\nfever\ncough\nshortness of breath/difficulty breathing\n\nAt this time, the CDC believes that symptoms of 2019-nCoV may appear in as few as 2 days or as long as 14 days after exposure.\nIf you’ve travelled to one of the impacted areas and start to develop symptoms, you should contact your medical provider before showing up at their office so that they can take the necessary precautions before your visit.\n“If you’ve travelled to an impacted area and start showing symptoms, call your doctor so that they can take the required steps to avoid infecting others,” Wooten said.\nWooten added that people should abstain from travelling to impacted areas unless “it’s absolutely necessary.”\nHow to Protect Yourself from Coronaviruses\nPractice everyday preventive actions to help prevent the spread of respiratory viruses, including:\n\nWash your hands often with soap and water for at least 20 seconds. If soap and water are not available, use an alcohol-based hand sanitizer.\nAvoid touching your eyes, nose, and mouth with unwashed hands.\nAvoid close contact with people who are sick.\nStay home when you are sick.\nCover your cough or sneeze with a tissue, then throw the tissue in the trash.\nClean and disinfect frequently touched objects and surfaces.\n\n“These everyday habits can help prevent the spread of several viruses,” Wooten said.\nFor more information about 2019-nCoV, visit the CDC’s website or HHSA’s Epidemiology Unit.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200127.21.06.17", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076", "identifier": "NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096", "identifier": "MONDO_0100096"}, "noticeType": "diseasePreventionInfo"}]}