{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Roundtable to Lend Foresight on 2020 Economy", "description": "What is in our future when it comes to San Diego County’s economy? No one has a crystal ball, but local leaders will make some educated guesses on what to expect this year at the 36th Annual Economic Roundtable.", "datePublished": "2020-02-03T14:22:33-08:00", "url": "https://www.countynewscenter.com/roundtable-to-lend-foresight-on-2020-economy/", "keywords": ["government", "36th economic roundtable", "chairman greg cox", "economy", "usd"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-03T16:37:59-08:00", "articleType": "article", "articleContent": "\nWhat is in our future when it comes to San Diego County’s economy? No one has a crystal ball, but local leaders will make some educated guesses on what to expect this year at the 36th Annual Economic Roundtable.\nThe event starts at 8:15 a.m. on Wednesday, Feb. 5 at the University of San Diego’s Joan B. Kroc Institute for Peace and Justice.\nCounty Board of Supervisors Chairman Greg Cox will kick off the event with some opening remarks.\n“The Economic Roundtable is the longest-running, free local economic forecasting event in this region, and it has grown into a forum for experts to share their thoughts on what the upcoming year will bring,” said Board of Supervisors Chairman Greg Cox. “Economists, industry experts, and business leaders from various sectors will provide their thoughts on what 2020 will hold for the national and regional economy.”\nChris Thornberg of Beacon Economics will give the keynote address. USD School of Business Associate Professor of Economics Ryan Ratcliff will act as the moderator for a panel discussion on our economic future. The local panelists are:\n\nEduardo Velasquez, Research Director, Economic Development, San Diego Regional Economic Development Corp\nRay Major, Chief Economist, SANDAG\nSarah Burns, Director of Research and Evaluation, San Diego Workforce Partnership\n\nAttendance is free but registration is required.\nParking at USD is metered. Four hours of parking may be purchased for $4.\nIf you plan to attend, use the west USD entrance at 5988 Alcala Park, turn left into the West Parking Lot and purchase parking from the pay stations located at the tram stop and next to the elevators in the structure. Trams, which arrive every few minutes, will then take you to the Joan B. Kroc Institute for Peace and Justice.\nThe parking pay stations use license plate numbers, and it may be helpful to take a photo of your plate when you park if you don’t have yours memorized. Once you have paid, there is no need to display the receipt on the dashboard. To speed up the parking payment process, you can also download the Parkmobile App in advance from the Apple or Google stores.\nVisit USD online for additional information on metered parking.\nFollow the event on Twitter #SDEconRound.\nIf you cannot make it to the roundtable, watch live online.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200203.14.22.33", "about": [{"@type": "EventInfo", "name": "36th Annual Economic Roundtable", "eventAccess": "public", "eventType": "public forum", "hasVirtualReplacement": "partial"}]}