{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "What San Diegans Need to Do for County to Get Off State Watchlist", "description": "What does San Diego County need to do to get off the state's watchlist? The answer is in San Diegans’ hands.", "datePublished": "2020-07-20T17:26:33-07:00", "url": "https://www.countynewscenter.com/what-san-diegans-need-to-do-for-county-to-get-off-state-watchlist/", "keywords": ["health", "community outbreaks", "coronavirus", "covid-19", "watchlist"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-07-21T08:29:31-07:00", "articleType": "article", "articleContent": "\nOn July 3, the County was placed on the state’s Monitoring List after the region’s case rate went above 100 positive cases per every 100,000 people three days in a row.\nThe County has not met that metric since then, and the case rate stands now at 145.3.\nWhat does San Diego County need to do to get off the watchlist? The answer is in San Diegans’ hands.\nLocal health officials continue to urge San Diegans to wear a face covering, avoid gatherings, maintain six feet distance from anyone outside their household, wash their hands thoroughly, and take other preventive measures to slow the spread of COVID-19 and prevent community outbreaks.\n\n“We hope that the actions we’ve taken in the past few weeks will help us flatten the curve and bring the number of cases down,” said Wilma Wooten, M.D., M.P.H., County public health officer. “With your help, we expect cases will decrease.”\n\nAfter the County lowers its case rate to the state’s metric for at least three days, it comes off the Monitoring List. If that does not occur, the County will be barred from opening more sectors of the economy, and schools will not be able to open for in-person instruction.\nThe County has its own set of indicators, or “triggers,” it is tracking that could prompt changes to the health order. On June 30, the County reached the Case Investigation trigger because the percentage of investigations initiated within 24 hours of notification over a seven-day period fell below 71%. The percentage has decreased dramatically since then. On July 19, the trigger was at 8%. However, the percentage of investigations increases to nearly 60 percent after 72 hours and is likely to improve with the addition of more case investigators.\nThis week, the County is adding nearly 100 new case investigators to contact San Diegans who have tested positive and identify who their close contacts were. The new hires will join the more than 520 case investigators and contact tracers currently working to slow the pandemic.\nGoing forward, the County will also be hiring approximately 200 case investigators from the more than 2,300 job applications that were submitted in the last few days. The position closes at midnight July 20.\nCommunity Outbreaks Increasing\nThe number of COVID-19 outbreaks in community settings continue to jump throughout the region. It has increased steadily in July.\nSo far this month, 47 outbreaks have been reported in community settings, already surpassing the 33 that were reported in June and the 27 that were confirmed during the first three months of the pandemic.\nRestaurants with bars account for the great majority of community outbreaks confirmed this month. The County Department of Environmental Health continues to work with restaurants to make sure they are following the public health guidelines. County strike teams are being deployed to businesses and other sites where outbreaks are confirmed and to make sure they are following state and local guidance.\nThrough July 19, a total of 107 COVID-19 community outbreaks have been confirmed in San Diego County.\nCommunity Setting Outbreaks:\n\nNo new outbreaks were identified on July 19.\nIn the past seven days, 16 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n7,884 tests were reported to the County on July 16 and 5.7% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 6.1%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 8,922.\n\nCases: \n\n453 new cases were reported in San Diego County for a total of 24,135.\n2,215 or 9.2% of cases have required hospitalization.\n575 or 2.4% of all cases and 26% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nNo COVID-19 deaths were reported in San Diego County on July 19. The region’s total remains at 478.\n\nMore COVID-19 Info:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200720.17.26.33", "about": [{"@type": "DiseaseNotice","infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "San Diego County On State Watchlist", "policyType": "public guidelines", "subject": ["mask usage", "physical distance"], "policyStatus": "recommended"}, {"@type": "PersonnelChangeInfo", "personnelType": "Person", "changeType": "recruiting", "relevantCategory": "Contact Tracers"}]}