{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Stands to Get Nearly $10 Million to Address Homelessness", "description": "The County of San Diego Board of Supervisors today voted to let the Health and Human Services Agency to apply for and receive nearly $10 million from state funds to address homelessness in the region.", "datePublished": "2020-02-11T12:11:33-08:00", "url": "https://www.countynewscenter.com/county-stands-to-get-nearly-10-million-to-address-homelessness/", "keywords": ["housing", "hhsa", "homelessness", "housing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-02-11T13:25:18-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego Board of Supervisors today voted to let the Health and Human Services Agency to apply for and receive nearly $10 million from state funds to address homelessness in the region.\nThe funding will come from the California Homeless Housing, Assistance and Prevention program grant. The County’s portion combined with funds going to other local agencies could bring the San Diego region a total $43.3 million to house people experiencing homelessness and who have complex health needs.\n“We’ve taken several steps over the last few years to address some of the root causes of homelessness, including increased funding for programs,” said Chairman Greg Cox.\nThe County has demonstrated its commitment to using an integrated approach to improve the health and housing options of people experiencing homelessness and who have severe physical or behavioral health issues.\nThe County has been addressing the needs of people who are chronically homeless, through Project One for All, Whole Person Wellness and the Innovative Housing Trust Fund, among other actions.\nHHAP funding may be used for a wide variety of activities including, but not limited to, rental assistance, workforce and other supports to retain housing and other innovative housing solutions and services.\nThe County Health and Human Services Agency will use these funds for Board-identified priorities to support homelessness prevention and intervention activities for vulnerable populations, such as foster youth and seniors.\nIf awarded and approved, HHSA will get about $2 million during Fiscal Year 2019-20 and another $2 million in Fiscal Year 2020-21. HHSA anticipates receiving $9,996,652 in total program funds through Fiscal Year 2024-25.\nToday’s vote also allows HHSA to apply for future funding opportunities related to addressing homelessness throughout the region. Securing homeless funds aligns with the County’s Live Well San Diego vision to improve the health and wellbeing of area residents by addressing the housing and service needs of people experiencing homelessness throughout the county.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200211.12.11.33", "about": [{"@type": "AuthorizationRequest", "authorizationSubject": "fundingRequest", "requestApproval": "granted", "requestGrantorType": "state", "requestGrantor": ["California Homeless Housing", " Assistance and Prevention program"]}]}