{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Board Creates Compliance Hotline, Allocates CARES Act Funds", "description": "The County Board of Supervisors today received an update on the County’s response to the COVID-19 pandemic and took a number of actions that will facilitate enforcement against businesses and individuals violating the local public health order.", "datePublished": "2020-08-05T09:16:29-07:00", "url": "https://www.countynewscenter.com/board-creates-compliance-hotline-allocates-cares-act-funds/", "keywords": ["health", "cares act", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-08-05T10:32:01-07:00", "articleType": "article", "articleContent": "\nThe County Board of Supervisors Tuesday received an update on the County’s response to the COVID-19 pandemic and took a number of actions to promote compliance with the local public health order, including an expanded team that will take enforcement actions when businesses and individuals don’t follow the order’s requirements. \nThe Healthy Compliance Call Center will allow the public to report violations to the order. The line will be staffed around the clock and can be reached at (858) 694-2900.\nThe Board also heard several proposals on how the County plans to spend $48.8 million of federal CARES Act money that has been allocated to the region.\nThe Board voted to devote $25 million to child care, $18.8 million to food services programs and $5 million to public health test, trace and treat (T3) strategies in K-12 schools.\nThe child care provider grant program will fund licensed and license-exempt child care providers experiencing financial hardships due to COVID-19. Child care providers can use funding to pay for a variety of expenses including rent and mortgage payments, personal protective equipment, staffing and supplies.\nGrants will be distributed equitably across the county and will be based on the size of the child care facility. All types of child care facilities from family-run to large organizations are eligible to apply.\nThe CARES Act funding for food programs will be directed to the Great Plates Delivered program for seniors and expand that program to more County residents. The County will also allocate $3.5 million each to support food banks and struggling restaurants in the region.\nThe Board also set aside $5 million which will fund T3 efforts in the region’s schools once they are permitted to resume in-person instruction.\nCOVID-19 Update\nPublic Health Officer Wilma Wooten updated the Board on the COVID-19 situation in the County. Dr. Wooten outlined some of the drivers of the recent high case rate, the factor that put the County on the state’s monitoring list.\nThe case rate metric has been elevated since the end of June, with many of the cases having been linked to the statewide reopening of businesses at the time. While case rates are still too high to get the County off the state watchlist, the numbers have been showing signs of improvement in recent days.\nDr. Wooten further explained that a majority of recent cases have been found in specific populations of County residents. Of the lab-confirmed COVID-19 cases in the past two weeks, 42.3% were in those 20-39 years of age.\nAdditional high case occurrences were confirmed in food service employees and individuals whose illness has been traced to community setting outbreaks. A community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200805.09.16.29", "about": [{"@type": "AuthorizationRequest", "name": "Healthy Compliance", "authorizationSubject": "policy enforcement", "requestApproval": "granted", "requestGrantorType": "county", "requestGrantor": "San Diego County Board of Supervisors"}, {"@type": "FundingRequest", "name": "CARES Act Funds allocation", "fundingRequestType": "budget", "amount": "48000000", "requestApproval": "granted"}, {"@type": "ServiceChangeInfo", "name": "Healthy Compliance Call Center", "changeType": "open", "serviceAccessType": "public", "hasVirtualReplacement": "full", "serviceChangeType": "complianceInfo"}]}