{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Social Distancing, Visiting Restrictions Established; Mass Gatherings Banned; 5 More Positive COVID-19 Cases Reported Locally", "description": "The County of San Diego today announced that social distancing and visiting restrictions have now been established countywide, and mass gatherings are being banned to slow the regional spread of novel coronavirus, which causes COVID-19.", "datePublished": "2020-03-12T16:50:17-07:00", "url": "https://www.countynewscenter.com/social-distancing-visiting-restrictions-established-mass-gatherings-banned-5-more-positive-covid-19-cases-reported-locally/", "keywords": ["health", "coronavirus", "covid-19", "novel coronavirus", "social distancing"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-03-13T18:24:26-07:00", "articleType": "article", "articleContent": "\nThe County of San Diego today announced that social distancing and visiting restrictions have now been established countywide, and mass gatherings are being banned to slow the regional spread of novel coronavirus, which causes COVID-19.\nThe new measures start at midnight and will last at least through the end of March. See the Health Officer order.\n“Protecting the public’s health is our number one priority and we’re using every tool at our disposal to slow the spread of COVID-19,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The swift action to ban mass gatherings is one of several social distancing strategies that can be used to slow the spread of the COVID-19 pandemic.”\nWhat are Social Distancing and Mass Gatherings?\nSocial distancing is an infection control action that public health officials take to stop or slow down the spread of a contagious disease. The goal is for people to avoid close contact with each other and stay six feet apart.\nTherefore, starting today, all gatherings of more than 250 people are directed to be postponed or canceled across the county. Those gatherings include concerts, conferences, and professional, college and school sporting events.\nSmaller events can proceed only if the organizers can implement social distancing of six feet between participants.\nGatherings of people who are at higher risk for severe illness from COVID-19 should be limited to no more than 10 people, while also following social distancing guidelines. This includes gatherings at retirement facilities, assisted living facilities, developmental homes and support groups for people with health conditions.\nVisitor Restrictions and Sick Leave Policy Due to COVID-19\nThe County has also issued a directive for health care settings serving people with high risk of complications from COVID-19. These facilities should implement aggressive visitor restrictions and enforce their sick leave policies, and include:\n\nHospitals providing acute, in-patient care\nLong-term care facilities\nSkilled-nursing facilities\nOther residential facilities\n\n5 Presumptive COVID-19 Cases Reported Locally\nFive more San Diegans have tested presumptive positive for COVID-19, the Health and Human Services Agency announced today.\nThey are:\n\nA woman in her 70s who travelled in the Diamond Princess cruise ship and is at home under isolation.\nA woman in her 70s who is an evacuee from the Grand Princess cruise ship and is in a local hospital in isolation.\nA man in his 40s who is under isolation at home and traveled to Colorado.\nA man in his 50s who is in isolation at a local hospital and also traveled to Colorado (no connection).\nA man in his 60s who is in a local hospital in isolation.\n\nPeople who have tested positive and are in isolation at home are being monitored by County public health nurses. To date, there have been six presumptive positive cases of COVID-19 in San Diego County.\nGiven what’s happening across the world, nation and state, the County is now preparing to deal with a possible outbreak of COVID-19 in the region.\nThat’s why it’s important for the public to be informed and prepared.\n“Stay home if you are sick. Avoid contact with people who are sick,” Wooten said. “Also, practice good hand washing hygiene and stay away from large crowds.”\nCOVID-19 Testing\nIn addition to the County Public Health Lab, local hospital and private labs now have the capability to test for COVID-19.\nPresumptive positive tests from hospital and private labs must still be confirmed by the County’s Public Health Lab, which in turn will send specimens to the Centers for Disease Control and Prevention for final confirmation.\nThe County has the capability to test 60 patients per day and results are typically known in 24 to 48 hours. The County is awaiting two additional instruments to be able to test more patients daily if necessary.\nThe County has two kits on hand, with each kit having the capability to test up to 600 patients.\nWhat to Do if You Get Sick\nPatients with confirmed COVID-19 infection have reported symptoms ranging from mild to severe respiratory illness. Symptoms generally include fever, cough and shortness of breath/difficulty breathing\nAt this time, the CDC believes that symptoms of COVID-19 may appear in as few as two days, or as long as 14 days, after exposure.\nIf you may have had contact with a person with COVID-19 or recently traveled to countries with apparent community spread and start to experience symptoms, call your medical provider so that they can take appropriate precautions.\nWhat Residents Can Do to Prepare for COVID-19\nIt’s important for the public to be prepared should a COVID-19 outbreak occur in San Diego County. To limit the spread of infection, you should:\n\nWash your hands often to help protect you from germs.\nUse an alcohol-based hand sanitizer, if soap and water are not available. It should contain at least 60% alcohol.\nAvoid touching your eyes, nose or mouth.\nClean and disinfect frequently touched objects and surfaces.\nAvoid close contact with people who are sick.\nIf you are sick, stay home and keep your distance from others to protect them from getting sick too.\nCover your mouth and nose with a tissue when coughing or sneezing, then wash your hands.\nPractice other good health habits. Get plenty of sleep, be physically active, manage your stress, drink plenty of fluids and eat nutritious food.\n\nResidents should also follow these important tips to help prepare to respond to this public health threat.\n\nStore a two-week supply of food, beverages and water, including food for family pets.\nEnsure an adequate supply of prescribed and routine medications are on hand.\nPlan ways to care for those who are at greater risk for serious complications and who will take care of sick family members.\nIf you have family members with increased risk of getting seriously sick, check with your medical providers about symptoms and treatment.\nCreate an emergency contact list of family and friends, teachers and employers.\nHave a plan in case your school, childcare, or employer closes temporarily.\nTalk with your children, family, and friends about what to do if an outbreak occurs and what each person would need.\n\nPlanning now helps you act more effectively to protect you and your family if COVID-19 reaches you.\nIf you have individual questions, please talk to your healthcare provider. For community resources, please call 2-1-1 San Diego or visit www.211sandiego.org or www.coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200312.16.50.17", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["testResult", "diseasePreventionInfo", "preparation"]}, {"@type": "PoliciesAndGuidelines", "name": "New countywide Social Distancing, Visiting Restrictions and Mass Gatherings measures", "policyType": "public measures", "subject": ["physical distance", "gathering size limitations", "visitation restrictions"], "policyStatus": "established", "location": "San Diego County"}]}