{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Student Interns Help County Promote Evacuation Program", "description": "Nine students at Kearny High School of Digital Media and Design worked together with the County Office of Emergency Services to help develop and create a promotional campaign for a new Neighborhood Evacuation Team program, which would help vulnerable groups in a disaster.", "datePublished": "2020-01-22T15:27:52-08:00", "url": "https://www.countynewscenter.com/student-interns-help-county-promote-evacuation-program/", "keywords": ["public safety", "cert", "emergency", "evacuation", "neighborhood evacuation team"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-01-22T16:28:30-08:00", "articleType": "article", "articleContent": "\nNine students at Kearny High School of Digital Media and Design worked together with the County Office of Emergency Services to help develop and create a promotional campaign for a new Neighborhood Evacuation Team program, which would help vulnerable groups in a disaster.\nThe senior students agreed to take part in an unpaid internship program with the County Office of Emergency Services and met with OES staff weekly to develop two videos, a poster and infographics to be used for social media, presentations or handouts.\nThe students, five focused on videos and four on graphics, were given two objectives. One was to recruit volunteers who would help people unable to evacuate without assistance. The other was to advertise to those people who need assistance evacuating to make them aware of the program.\nDigital media design teacher Joseph Brendan Walsh said the project “had a high priority because it is a serious need for the county.”\nStephanie Clay, English teacher and senior internship coordinator, said, “One of the reasons I think this particular project is so powerful is it was built from a community relationship and the program is about building community relationships.”\nEmergency Services provided direction on the messages, and the students gave their creative input.\n“I really enjoyed working on my product because that kind of professional straightforward, concise product is something I really want to hone and I’m pretty proud of my product.” said Carson Brumfield, 17, who worked on one of the videos selected.\nAnother student, Javier Martinez, 17, who worked on the infographic team, said he took the messaging personally.\n“My inspiration for the project was my grandparents. My grandpa needs a cane to walk and so I want to make sure he’s prepared,” said Martinez.\nClay said students were guided to research the message and audiences and work with the client directly as they would in any other internship.\nThe best part of the project was that it was truly student-driven as far as products, Walsh said. Students acted as independent producers while he acted in an executive producer role only to keep the production process on task.\nThe other students on the team are Angel Adrian, Mary Sutton, Chyna Angobung, Shaun Madott, Andres Perez, Iris Gomez and Ana Castaneda.\nBelow are the videos produced by the team.\n﻿\n﻿\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200122.15.27.52", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}