{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Recognizes People, Organizations for Achievements in Public Health", "description": "During one of the most challenging public health crises in the world, the County will be honoring several people and organizations for their achievements in improving the health and well-being of San Diego area residents.", "datePublished": "2020-04-10T09:26:34-07:00", "url": "https://www.countynewscenter.com/county-to-recognize-achievements-in-public-health/", "keywords": ["health", "air pollution", "arts", "awards", "challenged athletes foundation", "logan heaights cdc", "meredith riffel", "public health champion", "veterans village of san diego"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-17T16:55:55-07:00", "articleType": "article", "articleContent": "\nDuring one of the most challenging public health crises in the world, the County will be honoring several people and organizations for their achievements in improving the health and well-being of San Diego area residents.\nNational Public Health Week, sponsored by the American Public Health Association, takes place this year from April 6 to April 12 and typically coincides with the County Public Health and Human Services Agency’s Live Well San Diego Public Health Champions Award ceremony.\nHowever, in light of the COVID-19 pandemic, the ceremony is moving from being held at the Board of Supervisors meeting chamber downtown to a virtual awards presentation.\nStarting today and for the next two weeks, an award recipient will be recognized during the County’s daily media briefing on COVID-19. You can watch the briefings live on the the County’s Facebook and Twitter accounts. Once it’s over, you can watch it here.\nThis is the 19th year the County is presenting the annual awards, which embody the County’s Live Well San Diego vision to promote healthy, safe and thriving communities.\nAward Recipients:\nApril 17: North Inland Region Recipient\nFallbrook Regional Health District\nThe Fallbrook Regional Health District is a local special district that focuses on the health and wellbeing of the communities of Fallbrook, Bonsall, Rainbow and De Luz.\nCreated by residents for residents, HealthCare Districts provide vital services based on the needs in their district. Healthcare Districts are established, operated and controlled by local voters to meet their local health care needs. It is a single function, non-enterprise, independent government agency serving a defined geographic area.\n\nEach year, the Fallbrook Regional Health District provides grant funding to local nonprofits for a wide range of health and wellbeing services. The District’s grants program has been around since 1999 and has invested more than $10 million in the community.\nThe District’s newest venture is creating community access to a state of the art Community Health, Wellness and Education Center, a space where residents in the area can access health information, learn healthy lifestyle practices, and find solace in a peaceful campus designed for a holistic approach to a healthy life.\nApril 17: North Coastal Region Recipient\nNannette Stamm\nIn 2004, Nannette Stamm joined the Vista Community Clinic as its chief promotion officer where she has the responsibility for directing and supervising community and in-house health promotion and education programs, as well as staff supervision of the Health Promotion Center.\nShe oversees program contract monitoring, evaluation activities and directs grant development for the entire organization.\n\nStamm’s vision is for people to “Choose Health,” meaning making healthy options available, accessible and affordable. The vision aligns with Vista Community Clinic’s commitment to ensure that every patient is healthy, as well as the broader community.\nStamm’s program focus includes maternal and child health, youth development, alcohol, tobacco and other drug prevention, migrant services, HIV/AIDS services,and general outreach.\nApril 16: North Central Region Recipient\nVeterans Village of San Diego\nIn the early 80s, Jack Lyon and other Vietnam veterans were in a group counseling session, discussing their dissatisfaction and frustration with the lack of medical and psychological care for veterans.\nIn 1981, the group decided to make a difference and formed the Vietnam Veterans of San Diego, which in 2005 was renamed the Veterans Village of San Diego. That year, the organization begun providing services to all veterans and wanted their name to reflect it.\n\nToday, Veterans Village of San Diego continues to serve veterans with the same compassion and focus and is the only program of its kind in the United States that is nationally recognized as the leader in serving homeless military veterans.\nAnnually, Veterans Village of San Diego provides a continuum of services to more than 3,000 military veterans throughout San Diego County.\nApril 16: East Region Recipient\nMeredith Riffel\nAs the director of the Santee Community Collaborative, Meredith Riffel has coordinated and implemented programs that improve the lives of families in East County.\nThe Santee Collaborative was formed in 1997 to bring groups together by promoting healthier and proactive communities that build resilient children and families. Meredith’s involvement has helped to generate positive impact and has expanded the reach of the collaborative. Her effectiveness as a public health leader is the result of her strategic vision and her passion to improve the health of her community.\n\nShe has built relationships with Home Base Ranch and Santee Success Program to provide mentoring programs for students in the Santee School District. She’s also partnered with Kaboom to help build a playground near Rio Seco Elementary and with the San Diego Christian College to recruit volunteers for the annual homeless count.\nApril 15: Central Region Recipient\nLogan Heights Community Development Corporation\nCreated in 1995, the vision of the Logan Heights Community Development Corporation (CDC) is to strengthen residents and businesses in Greater Logan Heights neighborhoods through community empowerment, education, economic growth and housing development.\n\nThe Logan Heights CDC serves is an area that is home to 27,000 residents who are primarily Spanish speaking.  Some of its programs include the Future Achievers Preschool, Career Financial Advancement Center, Small Business Development, Community Health and Community Engagement. Through regular neighborhood cleanups, public art installations, and advocacy for infrastructure development, Logan Heights CDC provides opportunities for residents to reclaim and celebrate public spaces in their community.\nApril 15: South Region Recipient\nA Reason to Survive\nFounded in 2001, A Reason to Survive’s (ARTS) vision is that creativity is a powerful tool that can transform the lives of young people and set them up for success. ARTS encourages youth to use their creativity to overcome obstacles and gives them the skills needed to become compassionate catalysts for positive change in themselves, their communities, and the world.\nARTS offers a safe environment and productive spaces for young adults to access arts programming and support services throughout the year. They offer free after-school arts education in four artistic disciplines (visual, media, music, and maker) to youth and young adults ages 11-24.\n\nThrough these after-school programs, as well through community-based projects – done in partnership with community organizations, civic institutions, and local businesses – ARTS connects young people to meaningful opportunities in the regional creative economy, while also elevating civic engagement.\nApril 14: Aging and Independence Services Recipient\nSan Diego Oasis\nSan Diego Oasis is a non-profit educational organization that enhances the health of adults 50+ in the region by providing opportunities for lifelong learning, physical activity, volunteer service, and social engagement.\nFor more than 30 years, San Diego Oasis has been enhancing the lives of local older adults. Since 2012, under the leadership of Simona Valanciute, San Diego Oasis has grown and expanded.\n\nCurrently, San Diego Oasis has over 5,200 active members who participate in classes and activities at 50 sites across the county, including at the La Mesa and Escondido lifelong learning centers.\nApril 13: Organization Recipient\nMotherToBaby California\nMotherToBaby California is a leader across the globe, nation and state, and provides evidence-based information services for pregnant and breastfeeding women and healthcare providers.\nThe organization was established at UC San Diego by Dr. Kenneth Lyons Jones, one of the first physicians to first identify fetal alcohol syndrome.\n\nMotherToBaby California also has built a reputation for its Pregnancy Studies to evaluate the safety and risk of select exposures during pregnancy, contributing to more than half of all pregnancy studies required by the U.S. Food and Drug Administration.\nApril 11—Individual Recipient\nPenelope JE Quintana\nSan Diego State University environmental health professor Penelope JE Quintana, Ph.D., M.P.H has been instrumental in bringing attention to air pollution in underserved communities along the US-Mexico border, especially in the community of San Ysidro. With the help of her team of students, Quintana identified the San Ysidro port of entry as a source of the pollution.\nA study led by Quintana demonstrated that people waiting in the pedestrian line to cross at the port of entry absorbed carcinogens found in diesel exhaust into their bodies.\n\nQuintana continues to push for air quality measurement and action along the border. Since San Ysidro has no government-operated air quality monitor, Quintana has provided local academic support to the community organization Casa Familiar, to place and maintain a community-led air quality network for San Ysidro. The project uses low-cost air sensors and is recognized as a model for the state of California.\nApril 10—Theme Recipient\nChallenged Athletes Foundation\nThis year’s National Public Health Week theme – NPHW @: Looking Back. Moving Forward – award recipient is the Challenged Athletes Foundation.\nThe Foundation began more than 25 years ago when the three founders – Bob Babbitt, Jeffrey Essakow and Rick Kozlowski — organized the San Diego Triathlon Challenge, a fundraiser for their dear friend Jim MacLaren, an amputee who had suffered a second tragic accident that left him a quadriplegic. Their effort launched a global change in the way athletes with physical challenges are perceived and how they perceive themselves.\n\nFor 26 years, the Challenged Athletes Foundation has empowered life through sports for a population at-risk due to their chronic and permanent disability. It provides opportunities and support to people with physical challenges so they can pursue active lifestyles through physical fitness.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200410.09.26.34", "about": [{"@type": "EventInfo", "name": "San Diego County Public Health and Human Services Agency’s Live Well San Diego Public Health Champions Award ceremony", "eventAccess": "public", "eventType": "ceremony", "hasVirtualReplacement": "full"}]}