{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Awaits Additional Reopening Guidance from State", "description": "Gov. Gavin Newsom said Friday that the state will continue to provide guidance for reopening sectors of the economy, counties can determine their own timing for moving forward.", "datePublished": "2020-05-29T17:33:25-07:00", "url": "https://www.countynewscenter.com/governor-reaffirms-reopening-plan/", "keywords": ["health", "coronavirus", "covid-19", "reopening plan"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-29T18:41:34-07:00", "articleType": "article", "articleContent": "\nGov. Gavin Newsom said Friday that the state will first provide guidance for reopening sectors of the economy. Then counties can determine their own timing for moving forward.\nThe County of San Diego will review the guidance for each sector as it becomes available.\nSan Diego is among the counties that filed a variance attestation to move through Stage 2 of reopening. This week, as the state provided guidance for hair salons and places of worship, those activities have resumed locally.\nStage 3 includes businesses and activities such as youth sports, gyms, nail salons, community pools and sporting events with no spectators. As guidance for each is available, the County can determine when to open.\nNo counties are permitted to move into Stage 4, which includes large gatherings such as conventions, concerts, and sporting events with fans.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n4,624 tests were reported to the County on May 28 and 140 or 3% were positive.\n3.1% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n140 new cases were reported for a San Diego County total of 7,240.\n1,296 or 17.9% of the total cases have required hospitalization.\n378 or 5.2% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nSix COVID-19 deaths were reported today, bringing the region’s total to 266.\nTwo women and four men died between May 22 and 27, and their age ranged from 44 to 94 years.\nAll but one had underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases are:\n\n77 active outbreaks (no new outbreaks since yesterday), 53 at congregate living facilities and 24 in community settings.\n1,573 cases, including 129 deaths in congregate living facilities.\n335 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200529.17.33.25", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}]}