{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Public Defender Seeks Nominations for Remarkable Teens", "description": "Do you know of any teens in San Diego County who deserve recognition for something remarkable they do? The San Diego County Public Defender is seeking nominations through April 1 for teens ages 13 through 19 who are doing something extraordinary in 25 non-traditional categories, many of which showcase creativity or social activism.", "datePublished": "2020-03-06T10:38:38-08:00", "url": "https://www.countynewscenter.com/county-public-defender-seeks-nominations-for-remarkable-teens/", "keywords": ["government", "public defender s office", "remarkable teen", "teens", "youth council"], "author": [{"type": "@Person", "name": "Yvette Urrea Moe", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Yvette Urrea", "familyName": "Moe"}], "dateModified": "2020-03-06T11:00:33-08:00", "articleType": "article", "articleContent": "\nDo you know of any teens in San Diego County who deserve recognition for something remarkable they do? The San Diego County Public Defender is seeking nominations through April 1 for teens ages 13 through 19 who are doing something extraordinary in 25 non-traditional categories, many of which showcase creativity or social activism.\n“The 25 Most Remarkable Teens in San Diego program gives us an opportunity to recognize the many exceptional accomplishments of young people in our community,” said Public Defender Randy Mize. “Young people who are motivated, committed to their community, inspiring in their talents and skills, or who have shown the courage to confront and overcome adversity deserve to be recognized.  Kids doing remarkable things are often left in the shadows. I absolutely love this program.”\nThe nominations are reviewed by San Diego County Public Defender attorney advisors and the Public Defender Youth Council, a group of high school students working with the Public Defender’s Office to develop and implement youth civic engagement projects throughout San Diego.\nAll nominees will be given a personal interview and receive a certification of recognition for being nominated.\nSome of the categories this year include youth activism, art, campus leadership, community service, courage to overcome adversity, public speaking, fashion design, writing, technology, photography, innovation and personal determination. To review all the categories, please link to  the fillable nomination form and consider submitting a nomination for a teen you know.\nFor some examples of what the selection committee is look for, here are the Most Remarkable Teens who were selected last year.\nThe 25 teens selected will receive their awards at a special ceremony on May 8 in the Neil Morgan Auditorium at the San Diego Central Library.  Awards will be presented by elected officials in the presence of parents, nominators, teachers, school administrators and community leaders.\nNomination forms must be completed and submitted no later than April 1. You can send it electronically to connie.howard@sdcounty.ca.gov or by mail to Connie Howard, San Diego County Public Defender Youth Council, 450 B St., Suite 1210, San Diego, CA 92101.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200306.10.38.38", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}