{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Important Deadlines for March 3 Presidential Primary Election", "description": "You have only until Feb. 18 to meet the deadline to register to vote or change your voter registration status in the March 3 Presidential Primary Election.", "datePublished": "2020-02-10T12:53:47-08:00", "url": "https://www.countynewscenter.com/important-deadlines-for-march-3-presidential-primary-election/", "keywords": ["elections", "elections", "important deadlines", "mail ballot deadline", "march 3 2020 election", "presidential primary election", "register to vote"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-02-11T08:14:02-08:00", "articleType": "article", "articleContent": "\nYou have only until Feb. 18 to meet the deadline to register to vote or change your voter registration status in the March 3 Presidential Primary Election.\n“If you’ve recently moved, changed your political party or changed your name, you’ll need to fill out a new registration form,” said Registrar of Voters Michael Vu. “If you’ve visited the Department of Motor Vehicles in the last two years, confirm your registration to make sure we have your party status on record. You can go online to do so, the process is quick, easy and convenient.”\nIt is critical for you to check your registration status if you want to vote for president. If you are registered with a political party that is different from the presidential candidate you want to vote for, you will need to register to vote with that party and you are urged to do so before Feb. 18.\nIf you are registered as Nonpartisan (also known as independent, no party preference or decline to state), you won’t see any presidential candidates on your ballot. You have the option to request a ballot for the American Independent, Democratic or Libertarian parties if you want to vote for one of their presidential candidates. If you want to vote for a presidential candidate in the Green, Peace & Freedom or Republican parties, you must register to vote with that party, and you are again urged to do so before Feb. 18.\nIf you’re not sure about your registration, check your status online at sdvote.com. If you’re not registered or need to change your registration, you’ll find that information there, too.\nThere are two important deadlines that are approaching:\n\nTuesday, Feb. 18 – Deadline to register. You can register at sdvote.com, and if your signature is confirmed through Department of Motor Vehicles records, it will automatically be sent to the Registrar. If your signature is not confirmed, you can print the form, sign it and mail it to the Registrar.\nFor voters without access to a computer, the forms are available at the offices of the Registrar of Voters, U.S. Postal Service, City Clerk, public libraries and Department of Motor Vehicles. All forms must be postmarked or delivered to the Registrar of Voters no later than Feb. 18. You may register to vote online up until midnight and the Registrar’s office will be open until 8 p.m. on Feb. 18. If you miss the deadline you may still conditionally register and vote provisionally through Election Day. Learn more about Conditional Voter Registration at sdvote.com.\n\n\nTuesday, Feb. 25 – Deadline to apply for a mail ballot. You can apply at sdvote.com or use the application on the back of your sample ballot and voter information pamphlet. You can also request a mail ballot by sending a letter to the Registrar of Voters with your name, registered address, the name and date of the election, the address where the ballot is to be mailed and your signature. Send forms to Registrar of Voters, 5600 Overland Ave., San Diego, 92123, email rovmail@sdcounty.ca.gov or fax (858) 694-2955. You can also request a mail ballot by phone at (858) 565-5800. The request applies only to the March 3 election and you must personally make the call.\nAll applications must be at the Registrar’s office by 5 p.m. on Feb. 25. Postmarks by that date cannot be accepted. Voters who are already signed up to vote permanently by mail do not need to reapply.\n\nFor voters who need language assistance, election materials are also available in Spanish, Filipino, Vietnamese and Chinese.\nTo learn more about the March 3 election, call (858) 565-5800 or visit sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200210.12.53.47", "about": [{"@type": "EventInfo", "name": "Presidential Primary Election deadlines", "eventAccess": "public", "eventType": "registration", "hasVirtualReplacement": "partial"}]}