{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County to Release More COVID-19 Data by ZIP Code, Race, Ethnicity", "description": "The County is releasing additional race and ethnicity data that provides a more complete picture of how COVID-19 is impacting the region.", "datePublished": "2020-08-24T17:24:37-07:00", "url": "https://www.countynewscenter.com/county-to-release-more-covid-19-data-by-zip-code-race-ethnicity/", "keywords": ["health", "contact tracers", "coronavirus", "covid-19", "race and ethnicity data"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-08-24T17:29:00-07:00", "articleType": "article", "articleContent": "\nThe County is releasing additional race and ethnicity data that provides a more complete picture of how COVID-19 is impacting the region.\nStarting today, the data will now be available on coronavirus-sd.com for tests administered, case investigators, contact tracers, as well as geographic and other breakdowns. Updates will be uploaded on Wednesdays. The County has been releasing race and ethnicity for deaths, cases and hospitalizations.\nIn addition to race and ethnicity, all tests administered will be released by ZIP Code.\nThe case investigator and contract tracing data will show the degree to which the number of employees doing the work mirror the ethnic groups that make up the local population. Currently, the County has 435 case investigators contacting San Diegans who have tested positive for COVID-19 to give them information on what to do during isolation, finding out what places they visited and who their close contacts are. Also, there are 285 County contact tracers connecting with people who were close contacts with positive cases.\n“It’s important that we have the ability to connect with people,” said Wilma Wooten, M.D., M.P.H., County public health officer. “We need to make sure they know what to do so that they can recover safely.”\nThe County is also working with San Diego State University, South Bay Community Services and Project Concern International which are providing promotoras and promotores –community health workers – who are calling and doing in-home visits with people who have been close contacts of positive cases but have been difficult to reach.\nLocal community and faith organizations are and will be conducting community outreach to minority groups, particularly Latinos, African Americans, Asians and refugees to encourage them to get tested, pick up the phone when contacted by a case investigator or contact tracer and provide other COVID-19 resources.\nFurthermore, UC San Diego will be helping the County to do contact tracing among young people, especially those between the ages of 18 and 24 years of age.\n‘Great Plates’ to Continue, Expand Meal Delivery\nMore than 2,000 older adults in the “Great Plates Delivered” program will continue to receive three free and healthy meals a day.\nLaunched in mid-May, the program is a collaboration between the County and 31 local restaurants. It makes it possible for people over 65 years of age or over 60 who have a chronic health condition and are at a higher risk of developing complications from COVID-19, avoid going out to restaurants or the grocery store to get food.\n\nThe County is also launching “Great Plates Delivered 2.0,” which will be providing dinner to people 18 years and older who have a health condition or a disability.  More local restaurants have been recruited for the new program which now accepting participants.\nFor more details on criteria, call the County Aging and Independence Services at (800) 339-4661 or visit www.aging.sandiegocounty.gov/greatplates. You can also call 2-1-1 San Diego.\nCase Rate:\n\nThe region’s state-calculated case rate is 80.3 for Aug. 24.\nThe County will now need to report a case rate below 100 cases per 100,000 people for seven more days. Then all schools, grades K-12, can reopen.\nThe list of schools that have submitted waiver applications and received waivers to reopen can be found\nNo other businesses can reopen until the state provides further guidance.\n\nCommunity Setting Outbreaks:\n\nFive new outbreaks were identified on Aug. 23: two in businesses, one in a restaurant, one in a hotel/resort/spa and one in a grocery.\nIn the past seven days, 20 community outbreaks were identified.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\n\nTesting:\n\n7,351 tests were reported to the County on Aug. 23 and the number of laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 3.5%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,394.\n\nCases:\n\n187 new cases were reported in San Diego County for a total of 36,727.\n2,989 or 8.1 % of cases have required hospitalization.\n733 or 2.0% of all cases and 24.5% of hospitalized cases had to be admitted to an intensive care unit. \n\nDeaths:\n\nNo new COVID-19 deaths were reported in San Diego County on Aug. 23 and the region’s total remains at 660.\n\nMore Information:\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200824.17.24.37", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult", "diseaseDemographics", "preparation"]}, {"@type": "ServiceChangeInfo", "name": "Great Plates Delivered 2.0", "changeType": ["inventory", "extension/expansion"], "serviceAccessType": "public", "hasVirtualReplacement": "unclear", "serviceChangeType": "governmentBenefitsInfo"}]}