{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Edges Closer to Getting Off State Monitoring List", "description": "The County continues its recent downward trend in its COVID-19 case rate, meeting day two of three days required to get off the state’s monitoring list. Currently, the State’s case rate for the County is at 98.3 per 100,000 people. The State’s case rate for our region was 94.1 Wednesday.", "datePublished": "2020-08-13T16:38:50-07:00", "url": "https://www.countynewscenter.com/county-edges-closer-to-getting-off-state-monitoring-list/", "keywords": ["health", "coronavirus case rate", "coronavirus covid-19", "schools reopening"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-08-13T17:52:18-07:00", "articleType": "article", "articleContent": "\nThe County continues its recent downward trend in its COVID-19 case rate, meeting day two of three days required to get off the state’s monitoring list.\nCurrently, the State’s case rate for the County is at 98.3 per 100,000 people. The State’s case rate for our region was 94.1 Wednesday. Those numbers were the lowest since the County was placed on the State’s Monitoring List on July 3.\nThe state metric requires a rate below 100 cases per every 100,000 residents to get off its monitoring list. The normal rate must continue for an additional 14 days or until after Aug. 28 before K through 12 schools can reopen.\n“The schools may re-open at that time, but the State must provide guidance on other sectors re-opening such as businesses that cannot currently operate indoors,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The County does not have that authority.”\nElementary schools may request waivers from the State to operate but they must be reviewed by the County first. So far, 48 are under review.\nThe State’s 98.3 case rate for this region differs from the County’s 96.5 rate because it is calculated differently. The County’s numbers reflect the number of cases as of 11:59 p.m. the day before. The State may be one day behind. The State also excludes inmates in their report.\nCommunity Setting Outbreaks:\n\nTwo new outbreaks were confirmed on Aug. 12, one each in a business and food processing.\nIn the past seven days, 22 community outbreaks were confirmed.\nThe number of community outbreaks remains above the trigger of seven or more in seven days.\nA community setting outbreak is defined as three or more COVID-19 cases in a setting and in people of different households in the past 14 days.\n\nTesting:\n\n8,020 tests were reported to the County on Aug. 12. The number of laboratory-confirmed cases was 3%.\nThe 14-day rolling average percentage of positive cases is 4.6%. Target is less than 8.0%.\nThe 7-day, daily average of tests is 7,972.\n\nCases:\n\n266 new cases were reported in San Diego County for a total of 33,659.\n2,809 or 8.3% of cases have required hospitalization.\n699 or 2.1% of all cases and 24.8% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSeven new COVID-19 deaths were reported in San Diego County on Aug 12. The region’s total is now 615.\nFour women and three men man died between July 31 and Aug. 11, and their ages ranged from 44 to 90.\nAll had underlying medical conditions.\n\nMore Information:\nThe more detailed data summaries found on the County’s coronavirus-sd.com website will be updated after 5 p.m. today.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200813.16.38.50", "about": [{"@type": "DiseaseNotice", "infectiousAgent": "http://purl.obolibrary.org/obo/NCBITaxon_11308", "infectiousDisease": "http://purl.obolibrary.org/obo/MONDO_0005812", "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "state watch list metrics", "policyType": "metrics/criteria", "subject": "case rate <100/100000", "policyStatus": "performed"}]}