{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Watch for Your Sample Ballot Pamphlet for March 3 Election", "description": "The Registrar of Voters office is in the midst of sending out over 1.8 million Sample Ballot and Voter Information Pamphlets to San Diego County’s registered voters for the March 3 Presidential Primary Election.", "datePublished": "2020-01-27T14:58:23-08:00", "url": "https://www.countynewscenter.com/watch-for-your-sample-ballot-pamphlet-for-march-3-election/", "keywords": ["elections", "march 3 election", "presidential primary election", "registration", "sample ballot mailing"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-01-27T15:36:44-08:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters office is in the midst of sending out over 1.8 million Sample Ballot and Voter Information Pamphlets to San Diego County’s registered voters for the March 3 Presidential Primary Election. All the pamphlets should be in voters’ hands by Feb. 3.\nWhen you receive yours, check the back for your party registration. Your party status will affect which presidential primary candidate you can vote for. The Registrar urges voters to review each political party’s rules if you plan to vote for president. The back of your pamphlet will also list your assigned polling place.\nThe sample ballot pamphlet contains information to voters about candidates and measures as well as critical information related to the upcoming primary. Voters may also view their sample ballot pamphlet online with the View your Sample Ballot tool at sdvote.com.\nIf you signed up to get your sample ballot electronically, you should have already received an email giving you the same critical information, including a link to your pamphlet.\nVoters who want to be among the first to see their sample ballot for the November 2020 Presidential General Election can sign up to receive all future sample ballot pamphlets electronically. Those opting to receive the pamphlet electronically will no longer get a paper copy of the pamphlet in the mail but will be notified by email when the sample ballot becomes available online.\nMeantime, the Registrar is still looking for poll workers especially bilingual poll workers. For more information, call (858) 565-5800 or visit sdvote.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200127.14.58.23", "about": [{"@type": "EventInfo", "name": "Sample Ballot and Voter Information Pamphlets Distribution", "eventAccess": "general", "eventType": "election", "hasVirtualReplacement": "partial"}]}