{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County, Rady Children’s to Test 2,000 Daily for COVID-19", "description": "The County and Rady Children’s Hospital today launched a new initiative to test up to 2,000 children and their families daily for COVID-19 over the next six months.", "datePublished": "2020-05-27T17:29:09-07:00", "url": "https://www.countynewscenter.com/county-rady-childrens-to-test-2000-daily-for-covid-19/", "keywords": ["health", "coronavirus", "covid-19", "rady childrens hospital"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-28T08:36:57-07:00", "articleType": "article", "articleContent": "\nThe County and Rady Children’s Hospital today launched a new initiative to test up to 2,000 children and their families daily for COVID-19 over the next six months.\nDeveloped with the support of the County’s T3 Strategy of test, trace and treat, the COVID Collaborative for Children will include testing at Rady hospital, clinics, as well as at the locations of Rady’s health care partners.\nRady Children’s Hospital officials said children and their parents can get a test during wellness visits at the facility or its affiliated pediatric primary care offices. The hospital also will test its entire staff.\nThe goal is to start with about 400 tests daily and ramp up over the next six weeks to about 2,000 tests a day. The tests will be free to all participants. Children are automatically covered under state law. Costs for adults without insurance will be paid by the County.\n“COVID-19 is not a disease that only impacts older adults,” said Wilma Wooten, M.D., M.P.H., County public health officer. “Pediatric cases have been reported in San Diego County.”\nOf the nearly 7,000 COVID-19 cases in the region, 5.6% or 391 cases have been reported in children and teenagers. Also, about 52% of the cases were in people between 20 and 49 years of age.\nWooten added that it is important to offer testing to families because there have been reports of children who had COVID-19 but lacked symptoms, leaving them in a position where they could unknowingly spread the virus.\nMore Testing in Rural Communities\nCAL FIRE and the San Diego County Fire Authority announced six more dates when testing will be offered in rural communities.\nDrive-up testing sites will be available from 9 a.m. to 2 p.m. in five communities. An appointment is necessary, and you can make one by calling 2-1-1. The sites will be on:\nJune 1 & 2:   San Diego County Library, 1275 Main St., Ramona, CA 92065\nJune 3:         San Diego County Library: 31466 Hwy 94, Campo, CA 91906\nJune 4:         Pauma Valley School, 33158 Cole Grade Rd., Pauma Valley, CA 92061\nJune 5:         San Diego County Library, 3407 Hwy 78, Julian, CA 92036\nJune 6:         CAL FIRE Monte Vista HQ, 2249 Jamacha Rd., El Cajon, CA 92019\nCOVID-19 testing is now more widely available. Testing options include calling your doctor or medical provider to schedule an appointment, signing up on the state website, or calling 2-1-1.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n3,021 tests were reported to the County on May 26 and 85 or 3% were positive.\n3.1% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n101 new cases were reported for a San Diego County total of 6,983.\n1,271 or 18.2% of the total cases have required hospitalization.\n377 or 5.4% of all cases had to be admitted to the intensive care unit.\n\nDeaths:\n\nSix COVID-19 deaths were reported today, bringing the region’s total to 255.\nFour men and two women died between May 22 and 26, and their age ranged from 67 to 89 years.\nAll had underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n77 active outbreaks, 53 at congregate living facilities and 24 in community settings.\n1,502 cases, including 123 deaths in congregate living facilities.\n317 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200527.17.29.09", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "EventInfo", "name": "More Testing in Rural Communities", "eventAccess": "specific", "eventType": "testing/screening", "hasVirtualReplacement": "unclear", "effectiveDate": "2020-06-01", "location": ["Ramona", "Campo", "Pauma Valley", "Julian", "El Cajon"]}, {"@type": "TestingInfo", "testType": "unspecified", "otherCriteria": ["children", "parents", "Rady's facilities patients"]}]}