{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "COVID-19 Community Outbreaks Still High, Record Number of Cases Reported", "description": "Community outbreaks of COVID-19 continue to be a concern for the region since this “trigger” has remained in the red for the past seven days.", "datePublished": "2020-06-24T17:25:58-07:00", "url": "https://www.countynewscenter.com/covid-19-community-outbreaks-still-high-record-number-of-cases-reported/", "keywords": ["health", "business actions", "community outbreaks", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-06-25T09:11:21-07:00", "articleType": "article", "articleContent": "\nCommunity outbreaks of COVID-19 continue to be a concern for the region since this “trigger” has remained in the red for the past seven days.\nThe County today announced eight community outbreaks have occurred in the past seven days. The outbreaks were identified in businesses, a campground, a social club, a restaurant, private homes and a federal facility.\nCOVID-19 community outbreaks are one of 13 metrics the County is monitoring that could trigger new restrictions. The measure stipulates that no more than seven new outbreaks can be reported over a seven-day period.  A community outbreak is defined as three or more COVID-19 cases in a setting and in people of different households.\nAlso, 332 COVID-19 cases were reported June 23, a new record for the region and another indication that the virus continues to be widespread.\nGiven the number of COVID-19 community outbreaks being identified and the higher number of cases, the County has paused the reopening of additional sectors of the economy and won’t move forward, even if the state releases new guidance, until it is safe to do it.\nOutbreak response\nWhen a COVID-19 outbreak is connected to a business, such as a restaurant, it closes on its own to make sure all of its policies and procedures are being followed. Those include appropriate hygiene and sanitation, the use of face coverings, physical distancing and employee and customer health screenings.\n“Most businesses are very responsible because they want to protect their employees and their customers,” said Wilma Wooten, M.D., M.P.H., County public health officer.\nPublic vigilance remains essential.\n“It’s important for people to remember that the virus has not gone away,” Wooten said. “As more people interact with each other, the risk for exposure increases. People should stay home as much as possible.”\nAs more industries open up and San Diegans more frequently leave home, they must do the following to protect themselves and the public’s health:\n\nPractice good hand hygiene and sanitation\nKeep six feet apart\nWear a face covering\nAvoid crowded places\nStay home if they are sick\n\nSan Diegans are required to wear a facial covering while in public and close to other people.\nCOVID-19 Tests, Cases and Deaths\nTesting:\n\n6,981 tests reported to the County June 23 and 5% were positive new cases.\nThe 14-day rolling average percentage of positive tests is 3.1%.\n\nCases:\n\n332 new cases in San Diego County residents for a total of 11,626.\n1,661 or 14.3% of cases have required hospitalization.\n456 or 3.9% of all cases and 27.5% of hospitalized cases had to be admitted to an intensive care unit.\n\nDeaths:\n\nSix more COVID-19 deaths were reported today, and the region’s total is now 347.\nFour men and two women died between June 12 and June 22 and their ages ranged from 66 to 89 years.\nAll had underlying medical conditions.\n\nMore COVID-19 Information\nMore information on COVID-19 and detailed data summaries can be found at the County’s coronavirus-sd.com website.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200624.17.25.58", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "reopening paused, local guidelines still in place", "policyType": "public guidelines", "subject": ["mask usage", "stay home, if sick", "physical distance", "sanitation or safety protocol"], "policyStatus": "required"}]}