{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County COVID-19 Deaths Reach 9; Cases Reach 734", "description": "Two additional San Diegans have died from complications of COVID-19, bringing the region’s total to nine, the County Health and Human Services Agency announced today.", "datePublished": "2020-03-31T19:20:09-07:00", "url": "https://www.countynewscenter.com/county-covid-19-deaths-reach-9-cases-reach-734/", "keywords": ["health", "coronavirus", "covid-19", "cruise ship cases", "nine deaths"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-01T16:35:03-07:00", "articleType": "article", "articleContent": "\nTwo additional San Diegans have died from complications of COVID-19, bringing the region’s total to nine, the County Health and Human Services Agency announced today.\n“My most sincere condolences go out to the families of people who have lost their lives in this pandemic,” said Wilma Wooten, M.D., M.P.H., County public health officer. “These deaths are a reminder that the virus is still being spread in the community and people need to continue to physically distance themselves from others.”\nCruise Ship Cases\nCounty health officials also confirmed there were COVID-19 cases reported from cruise ships in San Diego:\n\nCelebrity Eclipse: One passenger, who is in isolation at a local hospital in serious condition, and three crew members have tested positive for the virus. They are not County residents.\nThere is no change in the plan of disembarking the remaining passengers who were all scheduled to have departed by midnight. They are screened prior to departure and only those who are asymptomatic and without fever are allowed to leave and proceed to transportation out of the county.  This is following current Centers for Disease Control and Prevention guidelines on disembarkation from cruise ships.\nDisney Wonder: One passenger – a San Diego County resident – and three crew members, who are not local residents, have tested positive.\n\nThe Celebrity Eclipse cruise ship (l) will be the last one allowed to disembark passengers until further notice.\nStarting April 1, 2020:\n\nNo passenger or employee may disembark a cruise ship in San Diego harbor without approval of the Health Officer, or designee, if any person on the cruise ship has tested positive for COVID-19.\nAny cruise ship that is permitted to dock in San Diego harbor shall notify the Health Officer, or designee, regarding any emergency medical treatment required for a passenger or employee, and shall follow all directives of the Health Officer, or designee.\n\n\nUpon approval of the Health Officer, a cruise ship may dock solely for the purpose of receiving fuel and provisions so long as no employee or passenger disembarks.\n\nVentilators Available at Local Hospitals\nCounty Health officials today announced 19 out of 23 hospitals reported having a total of 481 ventilators to use in people with severe respiratory illness due to COVID-19.\nIn addition, the County has:\n\n75 ready to be deployed\n69 being serviced\n600 additional ventilators have been requested from the State\n125 are being ordered elsewhere\n\nCounty COVID-19 Cases Reach 734\nThrough March 31, a total of 734 COVID-19 cases have been reported in San Diego County, including 131 new cases in the last couple of days.\nToday’s total includes cases reported over a two-day period, which is why the number is unusually higher. Going forward, the County will be reporting case updates during the daily media briefing and then publishing them on the County’s COVID-19 website later in the afternoon.\nOf San Diego County’s cases, 414 (56%) were men and 317 (43%) were women. The gender of three people is unknown. Of the known cases, 136 (19%) have required hospitalization, 56 (8%) had to be placed in intensive care and nine (1%) have died.\nCounty officials also talked about other measures and resources to deal with COVID-19. To date:\n\nMore than 10,350 San Diegans have been tested, including 1,538 tests reported on March 30.\nThe County has distributed more than 1.1 million personal protective equipment items to local healthcare providers, including nearly 482,000 N-95 respirators and over 530,000 gloves.\nA total of 2,026 hotel rooms have been secured to isolate people who have potential COVID-19 symptoms and people who are vulnerable and have no place to live.\nOf the 1,585 rooms for County Public Health Services use, 106 are occupied by 116 guests. Those rooms include three homeless individuals who have tested positive for COVID-19.\nOf the 441 rooms assigned to the Regional Task Force on the Homeless, 170 are being occupied by 294 people who are at higher risk of developing complications from COVID-19.\nNearly 43,000 calls have been received at 2-1-1, including 2,074 that were referred to the County’s nursing line.\nThe County’s Epidemiology line has received more than 4,700 calls from local health care providers.\nRegion-wide, 277 handwashing stations and 10 portable bathrooms now have been placed.\nCounty Homeless Outreach Teams have distributed 1,925 hygiene kits among people who are homeless.\n\nPersonal Protective Equipment distributed to local hospitals.\nThe County’s COVID-19 webpage now contains a graph showing new positive cases and total cases reported by date. For more information, visit www.coronavirus-sd.com.\n \n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200331.19.20.09", "about": [{"@type": "PoliciesAndGuidelines", "name": "No passenger or employee may disembark a cruise ship in San Diego harbor without approval of the Health Officer, or designee, if any person on the cruise ship has tested positive for COVID-19", "policyType": "public measures", "subject": "visitation restrictions", "policyStatus": "required", "effectiveDate": "2020-04-01", "location": "San Diego County"}, {"@type": "PoliciesAndGuidelines", "name": "Medical Supply distribution", "policyType": "public measures", "subject": "mask/medical supply conservation/distribution", "policyStatus": "performed", "location": "San Diego County Hospitals"}, {"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PhysicalAccessInfo", "name": "hotel rooms for sick or vulnerable", "changeType": "open", "locationAccessType": "specific", "locationType": "human welfare facility", "hasVirtualReplacement": "none", "physicalAccessChangeType": "shelter/room availability", "location": "hotel rooms across San Diego County", "locationNumbers": "2026"}]}