{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Poll Workers Needed for March 3 Election", "description": "Poll workers, especially those who are bilingual in any one of six specific languages, are needed for the March 3 Presidential Primary Election.", "datePublished": "2020-01-13T10:00:57-08:00", "url": "https://www.countynewscenter.com/poll-workers-needed-for-march-3-election/", "keywords": ["elections", "bilingual poll workers", "election", "fgg", "march 3", "march 3 2020 election", "poll workers", "presidential primary election", "registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-01-13T10:17:56-08:00", "articleType": "article", "articleContent": "\nPoll workers, especially those who are bilingual in any one of six specific languages, are needed for the March 3 Presidential Primary Election. The Registrar’s office is required by federal law to provide bilingual speakers and voting materials to voters who speak Spanish, Filipino, Vietnamese and Chinese. In addition, a survey conducted by the University of California, Berkeley showed a need for Arabic and Korean speakers at nearly 90 precincts across the county, so the Registrar’s office is also recruiting poll workers who are bilingual in those languages.\nTo become a poll worker, applicants must be a U.S citizen and registered to vote in California, or lawfully admitted for permanent residence in the United States. Poll workers must have transportation to their assigned polling location, access to the internet to take an online training and attend a two-hour class in person.\nPoll workers receive a stipend ranging from $100 to $175 depending on the assignment and those who are bilingual receive an additional $15 if they are assigned to provide language assistance to voters.\nProspective poll workers can apply online at sdvote.com. For more information, call (858) 565-5800 or email pollworker@sdcounty.ca.gov.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200113.10.00.57", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}