{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Mumps Outbreak Reported in San Diego State University Students", "description": "Six San Diego State University students were diagnosed with confirmed or probable mumps in the last week, the San Diego County Health and Human Services Agency (HHSA) reported today.", "datePublished": "2020-02-26T15:47:41-08:00", "url": "https://www.countynewscenter.com/mumps-outbreak-reported-in-san-diego-state-university-students/", "keywords": ["health", "mumps", "san diego state university"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-02-26T16:05:00-08:00", "articleType": "article", "articleContent": "\nSix San Diego State University students were diagnosed with confirmed or probable mumps in the last week, the San Diego County Health and Human Services Agency (HHSA) reported today. The six students live off campus at BLVD63, a large apartment community that is not affiliated with the university and is located at 6345 El Cajon Blvd. in San Diego.\n“These six mumps cases represent a small outbreak of this highly contagious viral disease,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The best way to prevent mumps is by getting the measles, mumps and rubella, or MMR vaccine.”\nHHSA will be conducting free vaccination clinics at BLVD63 from 3 to 6 p.m. on Feb. 27 and 28. The clinics will be held for BLVD63 residents and SDSU students who wish to be immunized and vaccines will be given on a first come, first served basis.\nTwo doses of the vaccine are routinely recommended – one at 12 to 15 months of age and another at 4 to 6 years of age. It is recommended that all SDSU students complete the two-dose series if they have not already done so, and a third dose is being recommended to anyone who lives or works at BLVD63.\n“Student Health Services (SHS) was able to quickly respond to this public health concern and worked to isolate these students, as well as provide initial information to our campus community,” said Libby Skiles, SDSU SHS Director. “In collaboration with the county, our team is supporting the impacted students and working to proactively protect the overall health and wellbeing of our community.”\nThe cases at BLVD63 come on the heels of an uptick in local cases in recent months. In addition to the cases at BLVD63, there have been four other cases in the county so far this year. In 2019, San Diego County recorded 66 mumps cases, compared to nine cases in 2018 and 15 the year before that. Last year’s increase marks a 25-year high in mumps cases in the county.\nIn addition to the local cases, a substantial number of infectious parotitis/mumps cases have recently been reported in Baja California, Mexico. In 2019, 900 cases were reported there, the largest number since 2001. In the first six weeks of 2020, a total of 138 cases have been reported in Baja California. It is not known at this time whether the SDSU cases have any connection to the cases in Mexico.\nMumps is spread by coughing, sneezing or close contact with an infected person. Mumps can cause fever, headache, earache, and inflammation of the salivary glands which results in swelling and tenderness of the jaw. Anyone who thinks they have mumps should contact their provider before seeking medical care so proper precautions can be taken to prevent exposure to others.\nSevere complications are rare, but can include meningitis, decreased fertility, permanent hearing loss, and, in extreme cases, fetal loss during first trimester of pregnancy. There is no treatment for mumps. Most people recover without problems.\nFor more information about mumps, other vaccine-preventable diseases, and the vaccines that protect against them, please contact the County HHSA Immunization Program at (866) 358-2966 or visit the website at www.sdiz.org.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200226.15.47.41", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "Mumps rubulavirus", "url": "http://purl.obolibrary.org/obo/NCBITaxon_1979165"}, "infectiousDisease": {"name": "mumps infectious disease","url": "http://purl.obolibrary.org/obo/MONDO_0000989"}, "noticeType": ["diseaseSpreadStatistics", "testResult", "diseasePreventionInfo"]}]}