{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Selects Contractor for Southeastern Live Well Center", "description": "The County of San Diego has selected PCL Construction and Steinberg Hart/RJC Architects to begin negotiations and contract finalization for the design and construction of the new Southeastern Live Well Center. The 80,000-square-foot facility will be built at the intersection of Market Street and Euclid Avenue.", "datePublished": "2020-02-25T12:21:33-08:00", "url": "https://www.countynewscenter.com/county-selects-contractor-for-southeastern-live-well-center/", "keywords": ["health", "live well center", "live well san diego", "southeastern live well center"], "author": [{"type": "@Person", "name": "County News Center", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "County News", "familyName": "Center"}], "dateModified": "2020-02-25T12:21:33-08:00", "articleType": "article", "articleContent": "\nThe County of San Diego has selected PCL Construction and Steinberg Hart/RJC Architects to begin negotiations and contract finalization for the design and construction of the new Southeastern Live Well Center. The 80,000-square-foot facility will be built at the intersection of Market Street and Euclid Avenue. The approximately $76 million project will be the County’s sixth regional community service hub providing a variety of health and community services to residents.\n“We began this project with the desire to provide first-class facilities to vulnerable populations who need and deserve adequate resources to live safely and thrive,” said Board of Supervisors Chairman Greg Cox. “The community spoke clearly about the need for better outreach and engagement to all who would be impacted. I am proud to say that we incorporated this feedback to create a project that benefits all residents and we look forward to engaging the community in the final design presentations.”\nCompetitive design proposals from three design-build entities were evaluated over a two-month period by a Source Selection Committee (SSC) that was formed in fall 2019. The committee included County experts and community members. The SSC also conducted several meetings with a larger group of community members in the form of a Community Technical Advisory Committee that reviewed the proposals in detail and provided significant feedback, which helped inform the SSC’s selection.\nThe three proposals and designs contained several features that came as a result of the discussions with the community. During last October and November, the three conceptual designs were shared with the community at over 30 community locations, events and meetings. As a result, more than 1,200 comments by residents were received. Those comments were compiled into a report that was reviewed by the SSC.\n“This is another important milestone for this project,” said Supervisor Nathan Fletcher. “Last year we opened up the process, made it more transparent, gathered vital community input and now the committee has selected a contractor it believes can build the Southeastern Live Well Center to reflect the vision put forward by the residents. We will continue to keep the community informed throughout the build process.”\nThe County and PCL will begin negotiations and upon contract signature, will schedule presentations in the community as the design is finalized and work begins. The contract will require significant local subcontracting, local workforce outreach and a hiring commitment by the contractor.\nInformation about the design and the presentation schedule will be available on the Live Well San Diego website.\nThe Southeastern Live Well Center is expected to break ground in early 2021 and open in late 2022. The center will serve as a hub for community meetings, educational opportunities and workforce training in addition to the County services that will be available.\nServices that will be available include medical insurance coverage, food and nutrition assistance, family strengthening services, financial and employment assistance, public health, behavioral health, child support, restorative justice, services for older adults and people with disabilities and services for veterans and members of the military. The Live Well Center will also include a 4,000-square-foot conference center that can be used for community meetings.\nLive Well Centers are already operating in National City, Chula Vista, Escondido and Lemon Grove. A new Live Well Center is  currently under construction in Oceanside.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200225.12.21.33", "about": [{"@type":"Other", "description":"Not Evaluated--Notice has no relation to COVID-19, not even an indirect or cursory relationship."}]}