{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "County Eases Park Restrictions, Allows Golf and Boating", "description": "The County Thursday revised its Health Officer Order to relax restrictions on parks, golf courses and recreational boating, effective May 1. Cities may have their own parks restrictions, and anyone should check the rules for the specific park before visiting.", "datePublished": "2020-04-30T18:03:37-07:00", "url": "https://www.countynewscenter.com/county-eases-park-restrictions-allows-golf-and-boating/", "keywords": ["health", "boating", "coronavirus", "covid-19", "golf", "parks"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-02T09:27:20-07:00", "articleType": "article", "articleContent": "\nThe County Thursday revised its Health Officer Order to relax restrictions on parks, golf courses and recreational boating, effective May 1. Cities may have their own parks restrictions, and anyone should check the rules for the specific park before visiting.\nAmong the revisions:\n\nParks and their parking lots can reopen with 50% parking capacity.\nMembers of the same household can sit, picnic, or participate in sports and other activities at parks. Group activities and gatherings are not allowed.\nGolf courses can open but must have a physical distancing and safety plan in place and conduct temperature screenings for employees and golfers. Golf carts are not allowed. Anyone with a 100-degree temperature or higher must not be allowed on the premises.\n\nThe County is also allowing recreational boating in local lakes, bays and the ocean. If more than one person is in the boat, they need to be members of the same household.\nBeaches were allowed to open April 27, but each city will decide whether its beach can open. However, all beach parking lots must remain closed, and no sitting or lying down is allowed at any local beaches.\nThe revised health order also requires everyone to wear a face covering when in public and within six feet of people not in the same household, or anytime when entering a business. See more details and exceptions.\nSan Diegans must continue to maintain physical distancing. Handwashing and other preventive measures are still recommended.\n“As San Diego County residents, you have done a great job over the past six weeks,” said Wilma Wooten, M.D., County public health officer, after explaining that the County is easing some of the restrictions because the region has met four of the five federal criteria and state recommendations for reopening.\n“If we see a trend going in the wrong direction because people are not following the recommended guidelines, we can dial back the Health Officer Order,” Wooten said, adding that her order has been extended until further notice and to align with the state.\n4 New COVID-19 Deaths and 132 Cases Reported\nFour more COVID-19 deaths have been reported bringing the region’s total to 124. Four men died – one on April 27 and three on April 28. Their ages range from 55 to 88 years. Three had underlying medical conditions and the 55-year-old did not.\nThe total COVID-19 cases in San Diego County increased to 3,564 after an additional 132 cases were reported yesterday.\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n47 active outbreaks; 31 at congregate living facilities and 16 in community settings\n64 deaths and 725 cases in congregate living facilities\n5 deaths and 140 cases in community settings\n\nMore COVID-19 Information\nThe Live Well Bus will be in Southeastern San Diego on Saturday to provide COVID-19 testing from 10 a.m. to 2 p.m. at the Euclid Medical Center, 292 Euclid Ave. Advance appointments through calling 2-1-1 are required, and will be filled on a first-come, first-serve basis. Individuals calling for an appointment should be prepared to provide their doctor’s office information. Those without a doctor will be connected to one.\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200430.18.03.37", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PhysicalAccessInfo", "name": "Parks and their parking lots reopen", "changeType": "open", "locationAccessType": "public", "locationType": "open space park", "hasVirtualReplacement": "unclear", "physicalAccessChangeType": "additional measures in place"}, {"@type": "PhysicalAccessInfo", "name": "Live Well Bus as mobile testing site", "changeType": "open", "locationAccessType": "specific", "locationType": "testing sites", "hasVirtualReplacement": "none", "physicalAccessChangeType": "appointment required"}]}