{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Election Results – When to Expect Them", "description": "On election night, we all want to know the results right away. But counting ballots takes time, and the March 3 Presidential Primary Election is more complicated than past elections.", "datePublished": "2020-03-03T12:27:05-08:00", "url": "https://www.countynewscenter.com/election-results-when-to-expect-them-5/", "keywords": ["elections", "election results", "fgg", "mail ballots", "march 3", "march 3 2020 election", "presidential primary election", "provisional ballots", "san diego county registrar of voters"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-03-03T12:27:05-08:00", "articleType": "article", "articleContent": "\nOn election night, we all want to know the results right away. But counting ballots takes time, and the March 3 Presidential Primary Election is more complicated than past elections. Here are some reasons why.\n\nA record high number of registered voters: San Diego County has more than 1.8 million registered voters.\nMore mail ballots than ever before were issued by the Registrar’s office: over 1.35 million, and many voters do not turn them in until Election Day. As of March 2, only 354,887 voters have returned their mail ballots.\nConditional voter registration at the Registrar of Voter’s office and, new this election, at the polls and four satellite voting locations on Election Day. That means voters who missed the traditional registration deadline can still register to vote and cast a provisional ballot.\n\nSo what can you expect on Election Night?\nThe first set of results comes in shortly after 8 p.m. Those are ballots that were mailed in, submitted at mail ballot drop-off points or cast during early voting at the Registrar’s office or a satellite voting location before Election Day.\nElection night, precinct ballots must be driven in from more than 1,548 polling places across the county.\nOnce at the Registrar’s office, ballots are scanned. As that’s done, the results will periodically be updated.\nHowever, it may be midnight before all polling place ballots arrive at the Registrar’s. The final unofficial election night results may not come in until after 3 a.m.\nBut that covers only the ballots that can be counted immediately – probably around half of the vote.\nThey may predict how some races will turn out, but tight races will be up in the air.\nHere’s what’s left.\nMail ballots. Hundreds of thousands dropped off at polls, drop-off locations, the Registrar’s office and satellite locations on Election Day. Plus, mail ballots sent right before or on Election Day. They have three days to arrive if postmarked by Election Day.\nThen there are provisional ballots, which voters cast for a variety of reasons. They went to a polling place other than the one assigned. They signed up to vote by mail, then decided to go to a poll anyway, but didn’t bring their mail ballot with them. And those who register on Election Day, which is now possible at every polling place. We don’t know how many people will do that. But it adds to the number of provisional ballots.\nFor each provisional ballot, election workers must make sure the voter was eligible to vote – and eligible to vote for the races they marked on the ballot.\nElection workers must process, review and inspect every provisional, mail-in and damaged ballot. It’s a labor-intensive, time-consuming process.\n“Between mail ballots and provisional ballots, a close race always comes to the very end,” said Vu. “We must do our due diligence to make sure everything is right.”\nSome races may not be decided for several weeks.\nHowever, the results must be certified 30 days after Election Day on April 2, and the Registrar expects to use every minute of the certification period to make sure the results are accurate.\nFor more information, visit sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200303.12.27.05", "about": [{"@type": "EventInfo", "name": "Election Night", "eventAccess": "public", "eventType": "Elections", "hasVirtualReplacement": "partial"}]}