{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "San Diegans Reminded of COVID-19 Prevention for Memorial Day Weekend", "description": "As San Diegans head into the Memorial Day holiday weekend, the County is reminding residents to practice social distancing, avoid crowded places and cover their face when they leave their home.", "datePublished": "2020-05-22T17:31:40-07:00", "url": "https://www.countynewscenter.com/san-diegans-reminded-of-covid-19-prevention-for-memorial-day-weekend/", "keywords": ["health", "coronavirus", "covid-19"], "author": [{"type": "@Person", "name": "Katie Cadiao", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Katie", "familyName": "Cadiao"}], "dateModified": "2020-05-22T17:31:40-07:00", "articleType": "article", "articleContent": "\nAs San Diegans head into the Memorial Day holiday weekend, the County is reminding residents to practice social distancing, avoid crowded places and cover their face when they leave their home.\n“We have made great progress in flattening the curve of COVID-19, but the local health emergency is not over yet,” said Wilma J. Wooten, M.D., M.P.H., County public health officer. “Local metrics are trending in the right direction and we urge San Diegans to continue to do their part so the County can proceed with its thoughtful and calculated process of reopening businesses and other activities.”\nThe state recently approved the County’s request to allow in-person dining at restaurants and in-store retail shopping. While restaurants can open for dine-in services, they must follow the guidance outlined in the public health order.\nRestrictions Remain in Place\nCustomers or employees should not enter any business if they have symptoms of COVID-19, which include cough, shortness of breath or difficulty breathing, fever, chills, muscle pain, sore throat, or a new loss of taste or smell.\nEven though beaches are open, beach parking lots remain closed. Beachgoers should only use the beach for active recreation. Sitting or lying down on the sand is not allowed.\nDespite some restrictions being lifted, the state has not cleared the following businesses or activities for reopening:\n\nHotels, Airbnb (except to serve essential workers)\nGyms, fitness centers\nHair, nail salons\nReligious services, except funerals performed with social distancing\n\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n4,056 tests, of which 3% were positive, were reported to the County May 21, with the rolling 7-day average of tests at 4,066.\n4% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n119 new cases were reported for a San Diego County total of 6,434.\n1,209 or 18.8% of the total cases have required hospitalization.\n361 or 5.6% of all cases had to be placed in intensive care.\n\nDeaths:\n\nOne additional COVID-19 death was reported today, bringing the region’s total to 242.\nThe person was a man in his 30s with underlying medical conditions.\n\nThe number of active outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n75 active outbreaks, 52 at congregate living facilities and 23 in community settings.\n1,454 cases, including 120 deaths in congregate living facilities.\n301 cases, including five deaths in community settings.\n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200522.17.31.40", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "practice social distancing", "policyType": "public guidelines", "subject": ["mask usage", "physical distance"], "policyStatus": "recommended"}, {"@type": "PhysicalAccessInfo", "name": "beaches open for active recreation", "changeType": "open", "locationAccessType": "public", "locationType": "open space park", "hasVirtualReplacement": "none", "physicalAccessChangeType": "additional measures in place"}]}