{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Postcards to Registered Voters – They Will Get Mail Ballots", "description": "The Registrar of Voters is sending postcards to over 1.8 million registered voters in San Diego County this week telling them to expect a mail ballot for the November 3, 2020 Presidential General Election. ", "datePublished": "2020-08-06T11:57:23-07:00", "url": "https://www.countynewscenter.com/postcards-to-registered-voters-they-will-get-mail-ballots/", "keywords": ["elections", "2020 presidential general election", "coronavirus", "covid-19", "executive orders", "mail ballots", "nov. 3 presidential general election", "november 3", "post cards", "registrar of voters", "where s my ballot"], "author": [{"type": "@Person", "name": "Tracy DeFore", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "Tracy", "familyName": "DeFore"}], "dateModified": "2020-08-06T12:24:39-07:00", "articleType": "article", "articleContent": "\nThe Registrar of Voters is sending postcards to over 1.8 million registered voters in San Diego County this week telling them to expect a mail ballot for the November 3, 2020 Presidential General Election.\nIn light of COVID-19, the Governor signed two executive orders to send mail ballots to every active registered voter in California so they can exercise their right to vote in a safe, secure and accessible manner. Those who need to vote in person will also have that option.\nWhat does this mean for you?\n\nNearly 75% of the county’s registered voters are already signed up to permanently receive their ballot by mail so the Registrar’s Office is well positioned to manage this increase.\nIf you need to vote in person, polling places will be open for four days, Oct. 31 through Election Day, Nov. 3. Be prepared. There will be fewer locations than in prior elections, so your location has most likely changed.\n\nWhat do you need to do? \nBe Vote Ready!\n\nCheck your registration information. Make sure your residence and, if different, your mailing address is up to date.\nHave you moved or changed your name? Whether you are new to San Diego County or just moved down the street you need to re-register to vote.\nAre you a first-time voter? Register to vote – it takes less than two minutes.\n\nIn response to the governor’s executive orders, the Registrar of Voters office has launched a Vote Safer San Diego campaign to encourage voters to vote from home.\nBallots will start going out in the mail the week of Oct. 5, giving voters nearly a month to mark their ballot and return it before Election Day.\nYou can now track your mail ballot every step of the way by signing up for “Where’s My Ballot?”. Sign up now to receive automatic notifications at sdvote.com.\nWhat if you need to vote in person?\nThe Registrar’s office encourages you to take advantage of early voting:\n\n8 a.m. to 5 p.m., Monday through Friday starting Oct. 5 at the Registrar’s office.\n8 a.m. to 5 p.m., Saturday, Oct. 31 through Monday, Nov. 2 at your assigned polling place or the Registrar’s office.\n\nThe Registrar’s Office and polling places will be open 7 a.m. to 8 p.m. on Election Day, Nov. 3.\nIf you decide to vote in person, be sure to bring your mail ballot with you and prepare for long lines. The Registrar especially encourages older adults and people with underlying medical conditions to avoid long lines and crowded polling places by voting early.\nLearn more about voting in the presidential general election at sdvote.com or call (858) 565-5800.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200806.11.57.23", "about": [{"@type": "PoliciesAndGuidelines", "name": "Governor's executive order on mail in ballots", "policyType": "executive order", "subject": "voting options", "policyStatus": "approved"}, {"@type": "EventInfo", "name": "2020 Presidential General Election", "eventAccess": "public", "eventType": "elections", "hasVirtualReplacement": "partial"}, {"@type": "PhysicalAccessInfo", "name": "polling places", "changeType": ["open", "mail/shipping option"], "locationAccessType": "public", "locationType": "polling facility / ballot drop-off", "hasVirtualReplacement": "none", "physicalAccessChangeType": "polling station / ballot drop-off availability"}]}