{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "How San Diego County Monitors Potential COVID-19 Cases", "description": "Here’s the process HHSA follows for patients who arrive at one of the 11 U.S. airports where CDC is conducting screening as people return from areas of mainland China other than Hubei province.", "datePublished": "2020-02-21T12:12:29-08:00", "url": "https://www.countynewscenter.com/how-san-diego-county-monitors-potential-covid-19-cases/", "keywords": ["health", "coronavirus", "covid-19", "novel coronavirus", "patients under investigation", "self-quarantine"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-04-11T15:00:00-07:00", "articleType": "article", "articleContent": "\nThe local medical community has been working with County health officials on monitoring potential cases of the new coronavirus or COVID-19 in people who have traveled to China or been in close contact with a confirmed case.\nThe County Health and Human Services Agency follows the Centers for Disease Control and Prevention guidelines for risk assessment and management of people with potential COVID-19 or patients under investigation (PUI).\nDue to patient privacy, HHSA will not release information on patients under investigation for COVID-19 or people under self-quarantine.\nHHSA is releasing the number of patients under investigation, as well as those who are under self-quarantine. Figures are updated Fridays.\nPatients Under Investigation\nHere’s the process HHSA follows for patients who arrive at one of the 11 U.S. airports where the CDC is conducting screening as people return from areas of mainland China other than Hubei province:\nIf patients have no symptoms, they are self-quarantined at home for self-monitoring with public health supervision. Self-quarantine lasts 14 days.\nIf patients develop symptoms — fever, cough or difficulty breathing —they should call the County health department; if they are determined to meet the CDC guidelines to be considered a PUI, then transport to local hospital is arranged, the PUI is placed in isolation and specimens are collected and sent to the CDC for confirmation of COVID-19.\nThe patient’s symptoms determine where the PUI is in isolation until test results are returned.\nSevere Symptoms\n\nIf patients have severe illness (e.g., difficulty breathing, high fever) they remain hospitalized and in isolation.\nIf patients are in isolation at a local hospital, the hospital treats and monitors the PUI and any hospital personnel with direct patient contact to the PUI.\n\nMild Symptoms\n\nIf symptoms are mild, the PUI is released to mandatory isolation at home, under public health supervision until results return.\nIf patients are negative, the patients will continue home quarantine and self-monitoring with public health supervision until the 14-days quarantine period is over.\n\nIf a PUI is under self-quarantine at home, the following takes place:\n\nPatients are under self-observation and remain alert for possible symptoms.\nPatients are asked to take their temperature twice daily and write it on their log. HHSA contacts them daily —by phone or text or both— to find out if they have developed symptoms. Contact will last for 14 days.\nPatients are asked to remain at home to the extent possible.\nPatients are asked to avoid public or group activities, such as going to the movies, parties, etc.\nPatients are asked to use good hand hygiene and to wash their hands thoroughly with water and soap.\n\nFor more information about COVID-19, visit the CDC’s website or HHSA’s Epidemiology Unit.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200221.12.12.29", "about": [{"@type": "DiseaseNotice", "infectiousAgent": "SARS-CoV-2", "infectiousDisease": "COVID-19", "noticeType": ["diseasePreventionInfo", "screening"], "location": "San Diego County"}]}