{"@type": "SpecialAnnouncement", "@context": {"schema": "http://schema.org/", "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "rdfs": "http://www.w3.org/2000/01/rdf-schema#", "bts": "http://schema.biothings.io/", "xsd": "http://www.w3.org/2001/XMLSchema#", "owl": "http://www.w3.org/2002/07/owl/", "niaid": "https://discovery.biothings.io/view/niaid/", "outbreak": "https://discovery.biothings.io/view/outbreak/"}, "name": "Some Offices, Malls, Other Businesses Can Reopen with Restrictions", "description": "Some offices and other businesses in San Diego County will be allowed to reopen after the state lifted more restrictions in the statewide stay-at-home order.", "datePublished": "2020-05-12T18:21:30-07:00", "url": "https://www.countynewscenter.com/some-offices-malls-other-businesses-can-reopen-with-restrictions/", "keywords": ["health", "coronavirus", "covid-19", "malls", "offices"], "author": [{"type": "@Person", "name": "José A. Álvarez", "affiliation": {"name": "County of San Diego Communications Office"}, "givenName": "José A.", "familyName": "Álvarez"}], "dateModified": "2020-05-13T10:58:07-07:00", "articleType": "article", "articleContent": "\nSome offices and other businesses in San Diego County will be allowed to reopen after the state lifted more restrictions in the statewide stay-at-home order.\nOffice-based businesses can open, though telework remains strongly encouraged. However, physical distancing is required to the maximum extent possible. Employees must also wear face coverings.\nShopping malls, including strip malls and outlet malls, can also reopen, but only for pick-up service. No customers are allowed inside the stores. There should also be clearly marked curbside and outside pick up points.\nAlso, on the list for reopening are car washes, pet grooming, landscaping and gardening businesses, as well as outdoor museums. All businesses must follow hygiene, physical distancing, and health screening guidelines. Locally the health officer’s order continues to require face coverings.\nBefore any of these businesses can reopen their doors, they must prepare and post a Safe Reopening Plan to ensure the safety of employees and the public.\n“Thank you to all San Diegans who have cooperated with the stay-at-home order. Because of that we have been able to move into Phase Two of the reopening along with the state,” said Wilma Wooten, M.D., M.P.H., County public health officer. “The metrics are trending in the right direction and we will continue to monitor them as we continue to protect the public’s health along with the reopening of the local economy.”\nSan Diegans are must wear a facial covering while in public and close to other people.\nCOVID-19 Testing \nCOVID-19 testing is available at local hospitals, medical groups, some community clinics and private labs.\nThe state’s three testing sites – currently in Escondido, El Cajon and Chula Vista –are offering free testing by appointment Tuesday through Saturday. You can schedule an appointment online or by calling (888) 634-1123.\nThe County’s Live Well Mobile Office has provided local testing in Southeastern San Diego. The County Library’s bookmobiles and other County vehicles will be deployed to offer testing throughout the region, especially where hot spots of the novel virus are detected.\nCOVID-19 Testing, Cases and Deaths\nTesting:\n\n2,440 tests were reported to the County May 11 and 96 or 4% were positive.\n5.1% was yesterday’s 14-day, rolling average percentage of positive tests.\n\nCases:\n\n96 new cases were reported for a San Diego County total of 5,161.\n996 or 19.3% of the total cases have required hospitalization.\n309 or 6% of all cases had to be placed in intensive care.\n\nDeaths:\n\n15 COVID-19 deaths were reported today, bringing the region’s total to 190.\nNine men and six women died between May 7-11. Their ages ranged between 56 and 92 years.\nAll the people who died had existing chronic conditions.\n\nThe number of outbreaks, deaths and cases at nursing homes and other congregate living facilities are:\n\n63 active outbreaks, 41 at congregate living facilities and 22 in community settings\n1,164 cases, including 89 deaths in congregate living facilities\n241 cases, including five deaths in community settings \n\nMore COVID-19 Information\nThe County’s COVID-19 webpage contains additional information on the disease, including a graph showing new positive cases and total cases reported by date. The data is also broken down by gender, race and ethnic/race group. An interactive dashboard with several COVID-19 indicators is being updated daily. For more information, visit coronavirus-sd.com.\n ", "location": {"name": "San Diego County", "_id": "USA_US-CA_06073"}, "_id": "USA_US.CA_06073_20200512.18.21.30", "about": [{"@type": "DiseaseNotice", "infectiousAgent": {"name": "SARS-CoV-2", "url": "http://purl.obolibrary.org/obo/NCIT_C169076"}, "infectiousDisease": {"name": "COVID-19", "url": "http://purl.obolibrary.org/obo/MONDO_0100096"}, "noticeType": ["diseaseSpreadStatistics", "testResult"]}, {"@type": "PoliciesAndGuidelines", "name": "face coverings", "policyType": "public measures", "subject": "mask usage", "policyStatus": "required"}, {"@type": "PhysicalAccessInfo", "name": "Businesses allowed to re-open", "changeType": ["open", "take out option"], "locationAccessType": "public", "locationType": ["shopping malls", "auto maintenance facilities", "animal care facilities", "landscaping businesses", "outdoor museums"], "hasVirtualReplacement": "unclear", "physicalAccessChangeType": ["take out/delivery service availability", "additional measures in place"]}, {"@type": "PhysicalAccessInfo", "name": "San Diego County Library’s bookmobile to serve as testing site", "changeType": "open", "locationAccessType": "specific", "locationType": "testing sites", "hasVirtualReplacement": "unclear", "physicalAccessChangeType": "additional measures in place"}]}